{
    "videooutput": "Micro HDMI type D (x1)",
    "framerates": "23.98p, 24p, 25p, 29.97p, 30p",
    "weight": "12.52 oz (355 g)",
    "battery": "Type: EN-EL20 compatible, rechargeable lithium ion battery Battery Life: approx. 1 hour of continuous recording time Charge Time: approx. 1 hour and 15 minutes when the camera is off and approximately 2 hours when in use",
    "powerinput": "0.7mm DC jack for power and battery charging (x1)",
    "displaytype": "Integrated LCD",
    "builtinspeaker": "Integrated mono speaker",
    "dynamicrange": "13 stops",
    "storagetemperature": "-4 ~ 113° F (-20 ~ 45° C)",
    "operatingsystem": "Mac OS X 10.8 Mountain Lion or later Windows 7 or later",
    "attr1star": "2 stars3 stars4 stars5 stars",
    "builtinmicrophone": "Integrated stereo microphone",
    "dimensions": "5.04 x 1.49 x 2.6 (128 x 38 x 66 mm)",
    "mounting": "1/4\"-20 UNC thread (x1, on top of camera) 1/4\"-20 UNC thread (x1, tripod mount on the bottom)",
    "sensorsize": "12.48 x 7.02 mm (effective)",
    "computerinterface": "USB 2.0 mini B port (for software updates and configuration)",
    "displayresolution": "800 x 480",
    "effectiveresolution": "1920 x 1080",
    "relativehumidity": "0 ~ 90% non-condensing",
    "category": "camera",
    "power": "12-20 VDC",
    "specifications": "Camera Sensor Size 12.48 x 7.02 mm (effective) Effective Resolution 1920 x 1080 Dynamic Range 13 stops Lens Mount Active MFT Recording Recording Media Removable SDXC and/or SDHC cards (exFAT or HFS+ format) Recording Formats Lossless CinemaDNG RAW Apple ProRes 422 (HQ) (QuickTime MOV) Recording Resolution 1920 x 1080 Frame Rates 23.98p, 24p, 25p, 29.97p, 30p Bit Rate 220 Mbps using Apple ProRes 422 (HQ) Interface Video Output Micro HDMI type D (x1) Digital Audio Output 2 channels, 48 kHz and 24 bit (embedded in HDMI output) Analog Audio Input 3.5mm stereo mini jack (x1) Analog Audio Output 3.5mm stereo mini jack (x1) Remote Control 2.5mm LANC (x1) for record START/STOP, iris control and focus Computer Interface USB 2.0 mini B port (for software updates and configuration) Power Input 0.7mm DC jack for power and battery charging (x1) Display Display Type Integrated LCD Display Size 3.5\" Display Resolution 800 x 480 General Built-In Microphone Integrated stereo microphone Built-in Speaker Integrated mono speaker Mounting 1/4\"-20 UNC thread (x1, on top of camera) 1/4\"-20 UNC thread (x1, tripod mount on the bottom) Supported Software Apple Final Cut Pro, Adobe After Effects, Nuke - The Foundry, Adobe Photoshop, DaVinci Resolve Operating System Mac OS X 10.8 Mountain Lion or later Windows 7 or later Power 12-20 VDC Battery Type: EN-EL20 compatible, rechargeable lithium ion battery Battery Life: approx. 1 hour of continuous recording time Charge Time: approx. 1 hour and 15 minutes when the camera is off and approximately 2 hours when in use Operating Temperature 32 ~ 104° F (0 ~ 40° C) Storage Temperature -4 ~ 113° F (-20 ~ 45° C) Relative Humidity 0 ~ 90% non-condensing Dimensions 5.04 x 1.49 x 2.6 (128 x 38 x 66 mm) Weight 12.52 oz (355 g)",
    "brand": "Blackmagic Design",
    "miscellaneous": "No",
    "includes": "Blackmagic Design     Blackmagic Pocket Cinema Camera Wrist strap Turret Dust Cap 12V AC Adapter Rechargeable Lithium Ion Battery (EN-EL20) DVD (DaVinci Resolve Lite) 1-Year Limited Warranty",
    "analogaudiooutput": "3.5mm stereo mini jack (x1)",
    "analogaudioinput": "3.5mm stereo mini jack (x1)",
    "recordingformats": "Lossless CinemaDNG RAW Apple ProRes 422 (HQ) (QuickTime MOV)",
    "recordingresolution": "1920 x 1080",
    "lensmount": "Active MFT",
    "bitrate": "220 Mbps using Apple ProRes 422 (HQ)",
    "name": "Blackmagic Design Pocket Cinema Camera",
    "remotecontrol": "2.5mm LANC (x1) for record START/STOP, iris control and focus",
    "operatingtemperature": "32 ~ 104° F (0 ~ 40° C)",
    "recordingmedia": "Removable SDXC and/or SDHC cards (exFAT or HFS+ format)",
    "displaysize": "3.5\""
}