{
    "isosensitivity": "Not Specified By Manufacturer",
    "noisereduction": "Yes",
    "focus": "Auto Manual Continuous Auto",
    "exposurecompensation": "-3 EV to +3 EV (in .3 EV steps)",
    "autofocuspoints": "19",
    "liveview": "Yes",
    "continuousshootingtime": "1920 x 1080 (with 8GB memory card) @ 30 fps IPB: 32 min. (235 MB / min.) / ALL-I: 11 min. (685 MB / min.) @ 25 fps IPB: 32 min. (235 MB / min.) / ALL-I: 11 min. (385 MB / min.) @ 24 fps IPB: 32 min. (235 MB / min.) / ALL-I: 11 min. (685 MB / min.) 1280 x 720 (with 8GB memory card) @ 60 fps IPB: 37 min. (205 MB / min.) / ALL-I: 12 min. (610 MB / min.) @ 50 fps IPB: 37 min. (205 MB / min.) / ALL-I: 12 min. (610 MB / min.) 640 x 480 (with 8GB memory card) @ 30 fps IPB: 97 min. (78 MB / min.) @ 25 fps IPB: 97 min. (78 MB / min.)",
    "focustype": "Auto & Manual",
    "otherresolutions": "11.2MP: 4104 x 2736 @ 3:2 8.9MP: 3648 x 2432 @ 3:2 5MP: 2736 x 1824 @ 3:2 2.5MP: 1920 x 1280 @ 3:2 0.35MP: 720 x 480 @ 3:2 17.7MP: 4864 x 3648 @ 4:3 10MP: 3648 x 2736 @ 4:3 7.9MP: 3248 x 2432 @ 4:3 4.4MP: 2432 x 1824 @ 4:3 2.2MP: 1696 x 1280 @ 4:3 0.31MP: 640 x 480 @ 4:3 16.8MP: 5472 x 3072 @ 16:9 9.5MP: 4104 x 2310 @ 16:9 7.5MP: 3648 x 2048 @ 16:9 4.2MP: 2736 x 1536 @ 16:9 2.1MP: 1920 x 1080 @ 16:9 0.29MP: 720 x 408 @ 16:9 13.3MP: 3648 x 3648 @ 1:1 7.5MP: 2736 x 2736 @ 1:1 5.9MP: 2432 x 2432 @ 1:1 3.3MP: 1824 x 1824 @ 1:1 1.6MP: 1280 x 1280 @ 1:1 0.23MP: 480 x 480 @ 1:1",
    "touchscreen": "Yes",
    "mpn": "8469B009",
    "angleofview": "74° 20' - 27° 50'",
    "height": "4.1 in.",
    "upc": "013803221619, 813789076124, 8714574610665",
    "shutter": "Type: Electronic & Mechanical Speed: 30 - 1/8000 sec",
    "exposurecontrol": "Auto: Shutter Speed Manual: Shutter Speed, Aperture, ISO",
    "weight": "7.23 oz (205 g)",
    "flashtype": "Built-In",
    "memorycardtype": "SD SDHC SDXC",
    "acpoweradapter": "ACK-E6 (Optional)",
    "category": "camera",
    "stillimageformat": "JPEG, RAW, RAW + JPEG",
    "lensaperture": "F/3.5-5.6",
    "selftimer": "10 sec, 2 sec",
    "audiorecording": "Optional External Mic: With Video, Stereo,",
    "lensconstruction": "13/11",
    "viewfindermagnification": "Approx. 0.95x",
    "focallength": "18 - 55 mm Comparable  35mm Focal Length: 28.8 - 88 mm",
    "filterthread": "Front: 58 mm",
    "bitdepth": "14-bit",
    "lensmount": "Canon EF Canon EF-S",
    "pixels": "Actual: 20.9 Megapixel Effective: 20.2 Megapixel",
    "storecategoriesstorehomeipadtabletipadsipadminiipodmp3playersdigitalslrcamerascanonnikonsonydigitalpscameraspanasonicdigitalcameralensescanonnikonsonydigitalcameraaccessoriescameracasesmemorycardmemorycardreadermemorycardholderbatterieschargerwarrantyserviceplanslensfiltertripodsmonopodslenshoodcapslearningdvdotherstarterkitipodmp3accessoriesspeakers": "Canon EOS 70D + 18-55mm STM + 3 Lens Kit + 32GB +Flash + Battery + Case NEW USA Click an Image to Enlarge This item is 100% brand new. USA product sealed in original box & includes full USA warranty. 58MM Professional HD 2x telephoto lens  With Free Carry Case 58mm 45x Wide-Angle Digital High Definition Lens w/ Macro 3 Piece Multi Coated Quailty Filter Kit 32 GB Secure Digital (SD) Memory Card High Speed External USB All in One Memory Card Reader & Writer SD SDHC CF MS XD Deluxe Soft Medium SLR Camera Case / Bag fit Canon EOS, Nikon, Sony Alpha Camera Multi Memory Card Wallet Extra Battery Extra Charger Digital Auto Slave Flash with Bracket Full Size 50-inch Tripod With Leveler 360 adjust & Carryng Case for SLR Cameras Mini Flexible Taple Top Travel Tripod  with Pocket clip Lens Cap Keeper Deluxe Screen Protector Pro Pack (Clear ) Deluxe Camera , Screen & Lens 5pc cleaning Kit The Canon EOS 70D DSLR Camera features a 20.2 megapixel APS-C CMOS sensor and DIGIC 5+ image processor to ensure high-resolution images and excellent low-light sensitivity. Both the sensor and processor work together to produce well-detailed, clear imagery that exhibits natural tonality and color gradations with minimal noise when working in difficult lighting conditions. The processor also provides notable speed throughout the camera system, including the ability to record up to 7 fps in full-resolution, quickened AF speeds, and full HD 1080p video recording in multiple frame rates with manual exposure and audio level control. Serving live view in both still and movie shooting modes, Dual Pixel CMOS AF is a powerful technology that revolves around the incorporation of two photodiodes within each pixel to provide an expansive phase-detection focusing system. This system affords focusing benefits that are similar to how a camcorder works and as such can focus on subjects in an incredibly fast and precise manner. The benefits of this system are three-fold: the ability to focus quickly and smoothly; the ability to truly utilize the vari-angle touchscreen LCD monitor to its full potential; and the ability to utilize a wide range of over 100 EF and EF-S lenses. Also benefiting from Dual Pixel CMOS AF is the Movie Servo AF mode, which enables continuous auto focusing when recording movies. This focusing mode is especially useful for maintaining critical focus on moving subjects and for realizing the near-silent performance of compatible STM lenses. The 3.0\" 1,040k-dot vari-angle Clear View II touchscreen LCD monitor profits greatly from the advent of the Dual Pixel CMOS AF system and its ability to utilize Touch AF focusing for finely controlled selection of the point of focus. The monitor's vari-angle design also enables more efficient shooting and viewing from both high and low angles and an anti-reflective, smudge-resistant coating allows for clear viewing in any lighting condition. In addition to the LCD monitor, the 70D also features an optical pentaprism finder that can be used for eye-level shooting of still images. This Intelligent Viewfinder incorporates a superimposed LCD to provide an intuitive means for monitoring exposure and camera settings during shooting. While working with the viewfinder, an expansive 19-point all cross-type AF system is visualized for acquiring focus; integral to this array is a high-precision dual-cross center AF point that is compatible with f/2.8 and faster lenses. Providing a wealth of additional functionality to the camera is integrated Wi-Fi connectivity, which allows for the instant and direct sharing of image files to an iOS or Android mobile device for sharing online. This functionality also allows for wireless remote control over camera settings, including exposure controls, focusing, and shutter release, from a mobile device when using the Canon EOS Remote app. The EF-S 18-55mm f/3.5-5.6 IS STM lens is included along with the camera body to serve as a versatile everyday lens that encompasses a 35mm-equivalent focal length range of 28.8-88mm. The STM stepping motor helps to achieve near-silent focusing when used in conjunction with the Movie Servo AF mode and the optical image stabilization system helps to minimize the appearance of camera shake. Dual Pixel CMOS AF Dual Pixel CMOS AF is a refined live view focusing technology     that works to provide incredibly quick and precise auto focusing     abilities that function in a similar manner to how a camcorder acquires     focus. This system integrates two separate photodiodes within each pixel     to provide a broad and dense network of phase-detection gathering     elements to help reduce focus hunting for faster, more direct control of     focus placement. Dual Pixel CMOS AF is utilized during live view     applications, for either still or video shooting, and enables an     enhanced method of working with the vari-angle touchscreen LCD monitor. When working with still imagery, this focusing system works to acquire     focus quickly and accurately, making it ideally suited to shooting and     tracking moving subjects and ensuring critical focus is attained with     each shot. When shooting video, focusing is smooth and natural when     changing from different subjects or different distances within the     scene. Benefited by the Touch AF system, rack focus is possible simply     by touching elements within the scene on the touchscreen in order to     change focus in an intuitive manner. Subject tracking in movies is also     heightened due to the Dual Pixel CMOS AF system's ability to recognize     subjects and maintain focus when working within changing or cluttered     scenery. This focusing system provides full and intuitive use of the vari-angle     touchscreen monitor through its keen integration of touch controls for     focusing and articulating design of the screen for viewing from any     shooting angle. Additionally, Dual Pixel CMOS AF is fully supported by     over 100 current and former EF and EF-S lenses to offer a wide spectrum     of compatibility for both still and video applications. 20.2MP CMOS Sensor and DIGIC 5+ Image Processor In regard to imaging capabilities, the EOS 70D features a 20.2     megapixel APS-C CMOS sensor and DIGIC 5+ image processor to produce     high-resolution, well-detailed still imagery and full HD 1080p video     with notable low-light sensitivity. These two technologies work together     to enable 14-bit A/D conversion, which helps to improve the quality and     gradation of imagery by producing smoother, more natural-looking     results with minimal image noise. A native ISO sensitivity of 100-12800     is well-suited to working in difficult lighting conditions and the     processing power of the DIGIC 5+ processor also affords a wealth of     speed to all aspects of the camera, including a full-resolution     continuous shooting rate of 7 fps. Built-In Wireless Connectivity Integrated Wi-Fi enables remote control over the camera's     exposure settings (aperture, shutter speed, and ISO) as well as focus     and the shutter release from an iOS or Android mobile device when using     the Canon EOS Remote app. With this app, you can wireless control the     70D from a distance and utilize live view monitoring from your mobile     device for easier shooting from difficult angles and locations. Images     from the 70D can be backed-up to other wireless-enabled Canon cameras as     well as networked PCs and mobile devices for instant sharing via email     or to social networking and image hosting sites. Full DNLA (Digital     Living Network Alliance) compatibility also enables transferring of     files to other DNLA-compatible products like HDTVs and other wireless     devices for remote viewing and playback. When working from the camera     alone, files can also be transferred directly to the CANON iMAGE GATEWAY     for expedited sharing to social networking sites without the need of a     PC. PictBridge compatibility is also available and offers support for     wirelessly printing photos from the camera on a PictBridge-compatible     printer. When used in combination with the optional GP-E2 GPS Receiver,     geotagging and embedding of locational data into images' metadata is     possible for plotting imagery to maps and for recording the elevation,     direction, and Universal Coordinated Time (UTC) of each photograph. Canon EF-S 18-55mm f/3.5-5.6 IS STM Lens Included with the 70D is the EF-S 18-55mm f/3.5-5.6 IS STM lens,     which provides a 35mm-equivalent focal length of 28.8-88mm. Covering a     range of perspectives from wide-angle to portrait-length, this lens is a     highly versatile tool for use in everyday situations for both still     image and movie recording. Its design integrates an STM stepping motor     that provides near-silent focusing abilities with smooth and precise     control. Additionally, the optical image stabilization system helps to     minimize the appearance of camera shake by up to four shutter speed     steps in order to benefit working in low-light conditions and with     greater zoom magnifications. One aspherical lens element is also     incorporated into the lens construction to help reduce chromatic     aberrations throughout the zoom range and an optimized lens coating has     been applied, too, in order to lessen lens flare and ghosting for higher     contrast, clearer imagery. EOS HD Video Full HD 1080p video recording is supported at 30, 24, and 25 fps     as well as HD and SD video recording in multiple frame rates. Video is     recorded using the high quality H.264/MPEG-4 AVC codec and manual     exposure control is supported for greater refinement over the look and     feel of recordings. Video clips are automatically partitioned after the     file size has reached 4GB and both IPB and All i-frame compressions are     available for use depending on editing and output preferences. Sound can     be recorded using the built-in stereo microphone, or with an optional     external microphone using the 3.5mm microphone terminal, and controlled     manually across 64 levels. An attenuator function is also employed to     prevent audio clipping for cleaner overall sound. Movie Servo AF mode is available to provide continuous auto focusing     when recording video and pairs especially well when using an STM lens to     realize near-silent focusing during filming. Focusing is also heavily     benefited by the incorporation of the Dual Pixel CMOS AF system to     provide smooth, controllable focusing in live view with the added     benefit of the Touch AF function. The Video Snapshot mode can also be used to record short video clips, in     2, 4, or 8-second segments, and in-camera editing and music can be     applied to these files for finalized results straight from the camera. 3.0\" Clear View II LCD Monitor and Intelligent Viewfinder A large, bright 3.0\" 1,040k-dot vari-angle Clear View II     touchscreen LCD monitor is integrated into the 70D to enable clear live     view monitoring, image playback, and intuitive menu navigation. It's     vari-angle design aids in viewing from high and low angles and the     touchscreen control gives way to efficient navigation of menus and     shooting controls, as well as precise control over focus points. The     screen's construction incorporates an anti-reflective, smudge-resistant     coating to provide clearer viewing, even in bright, sunlit conditions. When working with still imagery and shooting at eye-level, an optical     pentaprism Intelligent Viewfinder is available and provides 98% frame     coverage. A superimposed LCD screen within the viewfinder provides     pertinent exposure and camera information for more efficient eye-level     shooting and also has the ability to outline AF points, grid lines, and     an electronic level to aid in composition. 19-Point All Cross-Type AF System When shooting with the optical viewfinder, a 19-point all     cross-type autofocus system is used to provide a wide range of focusing     coverage for acquiring focus accurately and quickly. The center point of     this cluster is a high-precision dual cross-type sensor that supports     focusing with f/2.8 and faster lenses in order to benefit focusing in     low-light conditions. These focus points are configurable and allow     homing in on specific elements within the frame to focus on, or,     alternatively, all can be used to provide coverage across the frame. iFCL 63-Zone Dual Layer Metering Sensor An intelligent metering system works in conjunction with the     autofocus system and independently analyzes focus, color, and luminance     within the scene for the most precise exposure settings possible. The 63     zones cover the entire image area with great detail and the dual-layer     design permits a wider sensitivity to different wavelengths of light.     The dual layers are split into a red/green channel and a blue/green     channel; which counters the red light sensitivity bias electronic     sensors inherently have. A series of algorithms are employed to combine     data received from both layers, with the resulting exposure reading     being extremely accurate regardless of the shooting conditions. This metering system employs evaluative, center-weighted, and spot     metering methods to determine exposure, as well as allowing for a +/- 5     EV exposure compensation for greater manipulation of the determined     exposure setting. Built-In HDR and Multiple Exposure Modes A High Dynamic Range (HDR) mode is available and allows for the     creation of HDR images in-camera, reducing the time needed to manually     overlay images in post-production. When using this mode, a series of     bracketed exposures are made of the same image, then automatically     composited, resulting in a photograph with controlled highlights,     detailed shadows, and a long middle range of tones. This mode is     especially useful when photographing scenes with a great deal of     contrast. Multiple exposures are also possible in-camera and up to 9 exposures can     be recorded onto a single file using two distinct settings for control.     When in Additive mode, this closely resembles making multiple exposures     on film and layers each exposure; manual exposure compensation is     required. Average mode layers the images and automatically compensates     for the final exposure, eliminating the unintended possibility of gross     under or overexposure. Multiple exposures can be recorded in either JPEG     or RAW formats, and furthermore you can utilize an existing RAW image     as a starting point from which to layer subsequent images, which can     then be manipulated in real time on the LCD. Scene Intelligent Auto and Special Scene Modes Scene Intelligent Auto mode incorporates a number of Canon's     automatic exposure technology together in order to output a well-refined     exposure. Picture Style Auto, Automatic Lighting Optimizer, Automatic     White Balance, Autofocus, and Automatic Exposure are all employed to     intelligently analyze the scene at hand and produce the most effective     exposure settings to clearly render your subject matter. Special Scene modes also help to enhance your imagery by applying a     system of corrections for use in more difficult lighting situations.     Handheld Night Scene automatically captures four consecutive exposures,     at shutter speeds fast enough to handhold, and layers them into a single     frame. This allows you to effectively record images in darker     situations without the need of a tripod or stabilization device. HDR     Backlight Control works in the same manner and records a series of     exposures at different values to ensure highlight and shadow values are     not lost. These under and over-exposed images are blended to create a     final image with a wider dynamic range. Other Camera Features Multi Shot Noise Reduction automatically composites four     sequential exposures together in order to gain one exposure that     exhibits minimal apparent noise. Peripheral illumination, chromatic aberration, and distortion     corrections are available and programmable through a menu of different     available EF lenses. This lens data is used to automatically correct for     each individual lens' traits to produce the cleanest image possible. Seven Creative Filters are available to aesthetically modify the     appearance of imagery in-camera, with the results visible in real time     when working in live view. These filters include Grainy Black and White,     Soft Focus, Fisheye Effect, Toy Camera Effect, Miniature Effect, Art     Bold Effect, and Water Painting Effect. Compatible with SD, SDHC, and SDXC, including Ultra High Speed (UHS-I), memory cards. Compatible with eTTL II flash metering for use with compatible external flash units. A built-in pop-up flash is available to provide additional illumination to scenes. Silent shooting is a low-vibration shooting mode that slows and     mutes the shutter and mirror reflex, enabling a more discrete method of     capturing imagery. In-camera RAW processing allows for the converting of RAW image     files to JPEGs without the need for a computer. When using this     function, 10 process variables-brightness adjustment, white balance,     Picture Style, Auto Lighting Optimizer, noise reduction, JPEG     image-recording quality, color space, lens peripheral illumination     correction, distortion correction, and chromatic aberration     correction-are available for fine-tuning the appearance of photos. A Feature Guide can be employed to help explain and the specific     functions of each dedicated camera control to help for properly applying     a variety of settings while shooting. Imaging Camera Type Digital SLR with Interchangeable lenses Lens Mount Canon EF Canon EF-S Camera Format APS-C (1.6x Crop Factor) Pixels Actual: 20.9 Megapixel Effective: 20.2 Megapixel Max Resolution 20MP: 5472 x 3648 @ 3:2 Other Resolutions 11.2MP: 4104 x 2736 @ 3:2 8.9MP: 3648 x 2432 @ 3:2 5MP: 2736 x 1824 @ 3:2 2.5MP: 1920 x 1280 @ 3:2 0.35MP: 720 x 480 @ 3:2 17.7MP: 4864 x 3648 @ 4:3 10MP: 3648 x 2736 @ 4:3 7.9MP: 3248 x 2432 @ 4:3 4.4MP: 2432 x 1824 @ 4:3 2.2MP: 1696 x 1280 @ 4:3 0.31MP: 640 x 480 @ 4:3 16.8MP: 5472 x 3072 @ 16:9 9.5MP: 4104 x 2310 @ 16:9 7.5MP: 3648 x 2048 @ 16:9 4.2MP: 2736 x 1536 @ 16:9 2.1MP: 1920 x 1080 @ 16:9 0.29MP: 720 x 408 @ 16:9 13.3MP: 3648 x 3648 @ 1:1 7.5MP: 2736 x 2736 @ 1:1 5.9MP: 2432 x 2432 @ 1:1 3.3MP: 1824 x 1824 @ 1:1 1.6MP: 1280 x 1280 @ 1:1 0.23MP: 480 x 480 @ 1:1 Aspect Ratio 1:1, 3:2, 4:3, 16:9 Sensor Type / Size CMOS, 22.5 x 15 mm File Formats Still Images: JPEG, RAW Movies: MOV, MPEG-4 AVC/H.264 Audio: Linear PCM (Stereo) Bit Depth 14-bit Dust Reduction System Yes Noise Reduction Yes Memory Card Type SD SDHC SDXC Focus Control Focus Type Auto & Manual Focus Mode Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M) Autofocus Points 19 Viewfinder/Display Viewfinder Type Pentaprism Viewfinder Coverage 98% Viewfinder Magnification Approx. 0.95x Diopter Adjustment - 3.0 to +1.0 m Display Screen 3\" Rear Touchscreen Swivel  LCD (1,040,000) Screen Coverage 100% Live View Yes Exposure Control ISO Sensitivity Auto, 100-12800 (Extended Mode: 100-25600) Shutter Type: Electronic & Mechanical Speed: 30 - 1/8000 sec Remote Control Not Specified By Manufacturer Metering Method Average metering, Center-weighted average metering, Partial Metering, Spot metering Exposure Modes Modes: Aperture Priority, Auto, Bulb, Custom, Flash Off, Manual, Programmed Auto, Shutter Priority Metering Range: EV 1.0 - EV 20.0 Compensation: -5 EV to +5 EV (in 1/2 or 1/3 EV steps) White Balance Modes Auto, Cloudy, Color Temperature Filter, Custom, Daylight, Flash, Fluorescent (White), Shade, Sunset, Tungsten, Twilight Flash Flash Modes Modes: FE Lock TTL Auto Compensation: -3 EV to +3 EV (in 1/2 or 1/3 EV steps) Built-in Flash Yes Effective Flash Range Not Specified By Manufacturer Guide No. 39.4' (12.01 m) ISO100 Max Sync Speed 1 / 250 sec Flash Compensation -3 EV to +3 EV (in .1 or .5 EV steps) Dedicated Flash System eTTL External Flash Connection Hot Shoe AV Recording Video Recording Yes, NTSC/PAL File Size 1920 x 1080p (Full HD) 1280 x 720p (HD) 640 x 480p (SD) Frame Rate @ 1920 x 1080: 30 fps, 25 fps, 24 fps @ 1280 x 720: 60 fps, 50 fps @ 640 x 480: 30 fps, 25 fps Exposure Control Auto: Shutter Speed Manual: Shutter Speed, Aperture, ISO ISO Sensitivity Not Specified By Manufacturer Exposure Compensation -3 EV to +3 EV (in .3 EV steps) Focus Auto Manual Continuous Auto Continuous Shooting Time 1920 x 1080 (with 8GB memory card) @ 30 fps IPB: 32 min. (235 MB / min.) / ALL-I: 11 min. (685 MB / min.) @ 25 fps IPB: 32 min. (235 MB / min.) / ALL-I: 11 min. (385 MB / min.) @ 24 fps IPB: 32 min. (235 MB / min.) / ALL-I: 11 min. (685 MB / min.) 1280 x 720 (with 8GB memory card) @ 60 fps IPB: 37 min. (205 MB / min.) / ALL-I: 12 min. (610 MB / min.) @ 50 fps IPB: 37 min. (205 MB / min.) / ALL-I: 12 min. (610 MB / min.) 640 x 480 (with 8GB memory card) @ 30 fps IPB: 97 min. (78 MB / min.) @ 25 fps IPB: 97 min. (78 MB / min.) Audio Recording Optional External Mic: With Video, Stereo, Performance Continuous Shooting Up to 7 fps Start-up Time 0.15 Seconds Shutter Lag 0.065 Seconds Self Timer 10 sec, 2 sec Connectivity 1/8\" Microphone HDMI C (Mini) USB 2.0 Wi-Fi Capable Yes Power Battery 1x  LP-E6  Rechargeable Lithium-Ion Battery Pack, 7.2VDC, 1800mAh AC Power Adapter ACK-E6 (Optional) Operating/Storage Temperature Operating 32 to 104°F (0 to 40°C) Humidity: 0 - 85% Physical Dimensions (WxHxD) 5.5 x 4.1 x 3.1\" / 139.0 x 104.3 x 78.5 mm Weight 1.66 lb / 755  g with battery and memory card Kit Lens Focal Length 18 - 55 mm Comparable  35mm Focal Length: 28.8 - 88 mm Aperture Maximum: f/3.5 - 5.6 Angle of View 74° 20' - 27° 50' Minimum Focus Distance 9.84\" (25 cm) Groups/Elements 11/13 Diaphragm Blades 7 Autofocus Yes Image Stabilization Yes Filter Thread Front: 58 mm Dimensions (DxL) Approx. 2.72 x 2.96\" (69 x 75.2 mm) Weight 7.23 oz (205 g) Canon EOS 70D DSLR Camera Body EF-S 18-55mm f/3.5-5.6 IS STM Lens LP-E6 Rechargeable Lithium-Ion Battery Pack (7.2V, 1800mAh) LC-E6 Charger for LP-E6 Battery Pack IFC-400PCU USB Interface Cable R-F-3 Camera Cover Eyecup Eb Wide Strap EW-EOS 70D EOS Digital Solution Disk CD-ROM Professional HD 2x telephoto lens When your camera can't get you close enough to capture the action in detail, this 2x Telephoto lens will bring the action to you! Optically multiplying the focal length of your camera's lens by a factor of 2, it more than doubles your telephoto magnification and detail without any pixelization. This is dramatically better than the \"Digital Zoom\" feature of many cameras where the magnification is obtained by merely enlarging the existing image, resulting in a loss of sharpness. This 2x telephoto attachment is perfect for all your long-distance imaging including sports, candids, surveillance, nature and wildlife. You will also be able to utilize your camera's macro capability at over twice the usual distance, allowing for easier subject lighting with less shadows and intrusion.. 45x Wide-Angle Digital High Definition Lens with Maro When you've run out of room, and can't possibly fit anything else into the frame, this 0.45x Wide Angle adapter will allow you to capture it all! This attachment more than doubles your camera's wide angle field-of-view . Scenic shots will be more panoramic and you'll be able to take outstanding group photos, even in tight places. In addition, the detachable Macro Lens enables you to photograph small objects up close. Great for jewelry, coins, stamps, flowers, and more. Even if your camera already has macro capability, this macro lens will get you even closer for truly amazing close-up photos. Professional High Definition Special Element Frame Premium Rimmed Glass Infrared Compatible Include Protective Lens Case Digital Multi Coated 58mm Glass Filter Kit (UV-CPL-FLD) 3pc Filter kit The UV filter protects your camera's lens from scratches, dust,  dirt, moisture and fingerprints, while removing unwanted ultraviolet  light.The UV filter reduces blue haze caused by UV light by absorbing  71% of UV. The CPL filter deepens and  intensifies blue skies, achieves vibrant colors and reduces glare and  reflections from non-metallic objects & glass surfaces. Great for  video. The Fluorescent Light Correction Filter gives  you the prefect solution for shooting without a flash under a  fluorescent light.This filter gives true-to-life colors and pleasing  skin tones by removing the harsh yellow-green cast created by flouriest  lightning. Lens filter set is a must-have for photographers 58mm filters improve photographs by giving photographers control over light and allowing them to emphasize certain features Filter kit features UV, CPL, and FLD filters Set comes with hard carrying case and filters UV Protector Filter protected the lens from damage 32 GB Secure Digital (SD) Memory Card Get The Best SD Card for your product When getting an SD memory card there are hundreds of options for your item this can get confusing and costly  , When purchasing one of our handpicked memory cards for your item you receive a  Memory card at the highest quality. We go to every extent to handpick cards to provide  you as a bonus with your purchase that are not only guaranteed to work with your item but have the best performance with your item. This is a Onetime purchase that will help you capture a memory for a lifetime. Our memory card offers are High performance cards that are made reliable with long life spans  created to handle real life motions and real time transfers. There will be  no delay time in transferring information from your device to this card. Get Quality at the top of its class with  SD memory. High Speed USB  All  One Card Reader Access a multitude of memory cards with this USB 2.0 All-in-One card reader! This portable memory card reader supports the most popular memory cards such as Compact Flash I/II, Secure Digital, SD, Memory Stick, Micro Drive and Multimedia Card. Deluxe Medium Camera and Video Bag The Deluxe Medium Camera and Video Bag  is the perfect compliment to hold all of your equipment. It features a shock proof nylon material and is water resistant. It has 1 removable divider, rubber feet, shoulder strap and a handle grip. Easy access closure flap Mesh pockets for accessory storage compartment with interior   mesh pockets for spare batteries, flash-memory cards, diskettes,cords,   cables and more Shoulder strap/1 re moveable divider ,rubber feet, shoulder strap and a handle grip nylon material and is water resistant Dimensions: Size: 10.8 x 6.5 x 7.5 inches Multi Memory Card Wallet Donâ\u0080\u0099t lose your lifeâ\u0080\u0099s Memories Memory Cards are the Insert that holds your lifeâ\u0080\u0099s memoryâ\u0080\u0099s. A little card that easily lost but so important to you and your family. Always keep  your memory cards together at any cost. One lost card can lose decades of Memories. A memory card wallet is someplace for you to keep these memoryâ\u0080\u0099s together. Memory Card Wallet Keeps multiple memory cards protected and organized with this durable storage wallet. Sturdy memory card wallet case holds memory cards of any type securely, keeping them from contact with other accessories and makes them easily accessible in larger luggage bags. Features Memory Card Wallet Holds up to Multi  memory Cards (SD,CF,MS) 1 Year Limited Warranty Replacement For CANON LP-E6 Battery The LP-E6 Rechargeable Lithium-ion Battery Pack has a capacity of 1120mAh, making it possible to shoot many photographs with your Canon EOS 5D MARK II. 5D MARK III, 60D and 7D digital camera on a single battery charge. The battery is also compact and lightweight. There is no memory effect, so you can recharge partially drained batteries without reducing performance. Replacement for the original Canon LP-E6 battery pack Never run out of battery power when you're about to capture the perfect moment Output voltage: 7.2V Capacity: 1120mAh LP-E6 RECHARGEABLE BATTERY  CHARGER This LP-E6Battery Charger for Canon EOS Rebel  is used to recharge your digital camera battery, it is quick charge with automatic constant current control, prevents battery from overcharging, short circuit, and electronic shock. The Battery Charger can used both for home, office and car.  A/C power supply input voltage: AC100V~240V NOTE: For a success and safe charge to your battery, please make         sure to line up the correct polarity (positive / negative) before         inserting the battery onto the charger This compact battery charger set for Canon LP-E6 is the complete charging solution for digital video batteries High quality battery charger is a handy companion for digital shooting Charger is designed with a foldable A/C plug that charges your camera / camcorder battery anywhere in the world Quick charge with automatic constant current control prevents battery from overcharging, short circuit, and electronic shock Smart LED indicator shows charging status Pro Digital Auto Slave Flash with Bracket for All SLR/DSLR Digital Camera & Camcorders Every photographer knows that a quality flash unit is an essential component to taking great pictures. Built-in flashes simply don't have enough power to properly illuminate most subjects, and typically produce harsh shadows, red-eye, and other undesirable effects. An external flash offers far more power and versatility , resulting in consistently better pictures! The Flash is a high-power flash unit that works seamlessly with a wide variety of camera models and provides exceptional light coverage , at a price that doesn't break the bank! The Flash features automatic exposure control , which syncs with your camera to provide just the right amount of light. The zoom function allows you to light subjects as far away as 50 feet , and the bounce head tilts and swivels to give you full creative control. Full Size 50-inch Tripod With Leveler  360 adjust & Case Want to relax and take time shooting ?  Not worry about your shots being leveled ?  adjust shots with a swivel instead of an adjustment ? If the answer to all these Questions are YES this is the item for you!! The 50-Inch Photo and Video tripod features a special carrying handle as well as a professional grip. With its  self leveling rubber leg tips  it offers a great floor grip for positioning and  built in bubble leveler to give you a leveled shot. Capability  for a 360 degree spin with its 3 way pan head doesn’t hurt for convenience. There are bracing sections to adjust Tripod size and an additional Bonus of Tripod case. What else can you ask for as a free bonus with your purchase. Features Extends to 50 Inch  and under Non slip handle Mid level bracing system for adjustable sizes Bubble leveler Tripod fitted case Compact Carry Size Mini Flexible Taple Top Travel Tripod  with Pocket clip We realized to take a quick snap shot anywhere with your camera is a hassle to keep the camera sturdy with a table top tripod you can pull it out instantly or leave attached to your product for that Quick Snap and Go picture. A focused leveled cameraâ\u0080\u0099s shot and a wobbled shot is a big difference. This handy little tripod also can keep you in the picture. Place your camera on the Tripod and use the camera's self-timer, or a remote shutter release and you are in the picture for a great crisp-sharp shot. It easy to use and it is small enough to be ideal for carry in travel. Featuring an adjustable head and hard Flexible legs, this Tripod is an ideal accessory for photographers on the run. This lightweight, yet durable tripod stands at a height of up to 5\". Perfect for most digital, video and still cameras . Features Fits all 35mm Digital and Video camera with Tripod Socket Sturdy Ultra Compact Convenient Pocket Clip Travel Sized Lens Cap Keeper Keep Your lens safe its one of the Eyes of your purchase: Its always the little things that we lose that are a pain to replace . Why go through the hassle we found the perfect solution. Your cameras lens is a vital part of the pathway that captures an image from external reality and stores it onto a memory card film device or other  Keeping this lens free of dust smudges and contact with other items is imperative. A Lens Cap holder as simple as it sounds is the solution. The  perfect way to keep track of your lens caps. A small button tapes onto the front of your lens cap and the elastic loop goes around the barrel of your lens so that your lens cap always remains attached, hanging from the lens. Lens caps can be pricey and hard to find  with this you will  Never lose a lens cap again ! Deluxe Screen Protector Pro Pack (Clear ) Be safe scratches arenâ\u0080\u0099t appealing . Save your screen it takes a second to apply and  will give you longer usage with your product Purchasing any item everyone always knows the LCD screen or glass screen is an imperative part of the electronic device always the first to get damaged. Easy solution for you !! Deluxe screen protectors are perfect for digital camera screens, cell phone screens and game player screens. screen protectors are included with  a squeegee to smooth them out and remove air bubbles. They can be cut down to size to fit any screen from 1\" to 5\". The extra clear layer on your device will not only protect it from Sun damage but will also protect from  Nail Scratches, finger smudges and many other contact damage to the screen point of your device. The Clear Quality Kit touch safes  your device. Universal Screen Guard The Greatest  Guarder for LCD Screens Multi 3pcs 3x5â\u0080\u0099â\u0080\u0099 Deluxe Screen Guard 1 Squeegee Card Deluxe Camera , Screen & Lens 5pc cleaning Kit Be clean Be Safe use something Approved for your product : It's obvious that the cleaner the lens and camera sensor, the sharper your pictures will be. Dirt, dust, and fingerprints will degrade the image quality of even the finest optics. However, it's equally important to avoid using incorrect cleaning materials which can permanently damage your photo equipment. The 5 Piece Camera and lens Cleaning Kit. consists of soft-texture fiber cloth, 5 cotton swabs, a bottle of cleaning fluid, soft lens tissue paper, and top quality blower brush. It easily fits in your camera bag so you can take it anywhere with you easily. It is perfect for an on-the-spot camera or lens cleaning and is approved by the manufacture to use with your item Screen Camera and Lens Cleaning kit Soft Texture Fiber Cloth Five Quality Cotton Swabs Top Quality cleaning Fluid Quality Blower and Brush Full Pack Lens Cleaning Tissue CANON 70D/18-55SKIT12 We usually ship within 1-2 business days after receiving payment. Please be aware that weekends are not business days. At our discretion; large or expensive packages may receive a free upgrade to FedEx Ground with signature confirmation.  If this applies to you, please assure that your address is able to receive FedEx packages & that an adult is available to sign for & accept the shipment. All express methods of shipment as long as verified take 1 business day to ship We ship everything professionally in our state of the art warehouse boxed and shipped with perfection. \"Free Shipping\" applies to orders shipped within the USA (48 states) We do not ship to APO or FPO address Orders shipping to PR/HI/AK Will have an additional shipping charge and a longer process time to ship order Credit Cards: We can only ship to addresses that are noted with your credit card account. We may contact you for additional verification after you check out. PayPal: We prefer to ship to confirmed addresses. We may contact you for additional verification for payments made by unconfirmed PayPal addresses. We do not accept PayPal payments from accounts outside the USA and Canada. · When necessary, we may contact you via Direct Message or telephone to obtain additional verification. We offer our customer's a 14 day return for replacement policy if item is defective other then that all sales are final . A Return Merchandise Authorization (RMA) number must be obtained for any return. To obtain an RMA number, please call us toll free at 877-254-6155 Returned packages without proper RMA demarcations will be refused by our warehouse and returned to you. Customers who refuse a delivery, will be subject to charges for return shipping to us. If the item was advertised as Free Shipping, then we will charge the amount of shipping as determined by Our Shipping Station . Defective Item An item that was discovered to be defective upon receipt can be replaced with the same model only. Return Shipping Return shipping cost (the cost to send an item back to our store) is like or comparable to your cost of driving to any store for returning an item, which is not reimbursable. Therefore, we do not reimburse any return shipping cost. If an item you received is defective, we will certainly replace the item with a new one, however we do not cover or reimburse the shipping cost for returning defective merchandise back to our store. We will ship the replacement product to you at our cost, and use every good measure to ensure that the replacement order is processed quickly. Replacement We will send a product replacement after the authorized return has completed our receiving/inspection process. The replacement will ship within four business days following our receipt of your return. Please allow additional processing time after Holidays. Although it is our goal to ship a replacement as quickly as possible, we do not send replacements before we receive and inspect the returned merchandise. All items are sold with Manufacture Warranty so there is another avenue for assistance. All returns must be packed with all contents which came with the original package including, cables, software, plastic and cardboard packaging, and unregistered warranty card. This return policy excludes Televisions, Home Theater Projectors or any Home audio Product . For further questions please call us toll free at 877-254-6155 We encourage any questions or concerns you may have for us, but we request that all communication be done through eBay messages only or over the phone. Our dedicated customer support team is available Monday-Friday 10AM - 6PM (EST) TOLL FREE: +1-877-254-6155 LOCAL: +1-908-967-5155 Click here to send us your email inquiry now through eBay messages.",
    "remotecontrol": "Not Specified By Manufacturer",
    "flashmodes": "Modes: FE Lock TTL Auto Compensation: -3 EV to +3 EV (in 1/2 or 1/3 EV steps)",
    "builtinflash": "Yes",
    "displaysize": "3\"",
    "dedicatedflashsystem": "eTTL",
    "externalflashconnection": "Hot Shoe",
    "battery": "1x  LP-E6  Rechargeable Lithium-Ion Battery Pack, 7.2VDC, 1800mAh",
    "lensmanufacturer": "Canon",
    "displaytype": "TFT LCD",
    "diaphragmblades": "7",
    "videorecording": "Yes, NTSC/PAL",
    "operatingstoragetemperature": "Operating 32 to 104°F (0 to 40°C) Humidity: 0 - 85%",
    "lensfiltersize": "58 mm",
    "fileformats": "Still Images: JPEG, RAW Movies: MOV, MPEG-4 AVC/H.264 Audio: Linear PCM (Stereo)",
    "width": "5.5 in.",
    "filesize": "1920 x 1080p (Full HD) 1280 x 720p (HD) 640 x 480p (SD)",
    "aperture": "Maximum: f/3.5 - 5.6",
    "meteringmethod": "Average metering, Center-weighted average metering, Partial Metering, Spot metering",
    "dustreductionsystem": "Yes",
    "brand": "Canon",
    "screensize": "3\"",
    "digitalvideoformat": "H.264, MPEG-4",
    "diopteradjustment": "- 3.0 to +1.0 m",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "displayscreen": "3\" Rear Touchscreen Swivel  LCD (1,040,000)",
    "cameratype": "Digital SLR with Interchangeable lenses",
    "framerate": "@ 1920 x 1080: 30 fps, 25 fps, 24 fps @ 1280 x 720: 60 fps, 50 fps @ 640 x 480: 30 fps, 25 fps",
    "focusmode": "Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M)",
    "dimensionsdxl": "Approx. 2.72 x 2.96\" (69 x 75.2 mm)",
    "maxsyncspeed": "1 / 250 sec",
    "leftbardescstart": "Left Bar Desc //End !Right Bar Desc //Start !Canon EOS 70D + 18-55mm STM + 3 Lens Kit + 32GB +Flash + Battery + Case NEW USA Click an Image to Enlarge This item is 100% brand new. USA product sealed in original box & includes full USA warranty. 58MM Professional HD 2x telephoto lens  With Free Carry Case 58mm 45x Wide-Angle Digital High Definition Lens w/ Macro 3 Piece Multi Coated Quailty Filter Kit 32 GB Secure Digital (SD) Memory Card High Speed External USB All in One Memory Card Reader & Writer SD SDHC CF MS XD Deluxe Soft Medium SLR Camera Case / Bag fit Canon EOS, Nikon, Sony Alpha Camera Multi Memory Card Wallet Extra Battery Extra Charger Digital Auto Slave Flash with Bracket Full Size 50-inch Tripod With Leveler 360 adjust & Carryng Case for SLR Cameras Mini Flexible Taple Top Travel Tripod  with Pocket clip Lens Cap Keeper Deluxe Screen Protector Pro Pack (Clear ) Deluxe Camera , Screen & Lens 5pc cleaning Kit The Canon EOS 70D DSLR Camera features a 20.2 megapixel APS-C CMOS sensor and DIGIC 5+ image processor to ensure high-resolution images and excellent low-light sensitivity. Both the sensor and processor work together to produce well-detailed, clear imagery that exhibits natural tonality and color gradations with minimal noise when working in difficult lighting conditions. The processor also provides notable speed throughout the camera system, including the ability to record up to 7 fps in full-resolution, quickened AF speeds, and full HD 1080p video recording in multiple frame rates with manual exposure and audio level control. Serving live view in both still and movie shooting modes, Dual Pixel CMOS AF is a powerful technology that revolves around the incorporation of two photodiodes within each pixel to provide an expansive phase-detection focusing system. This system affords focusing benefits that are similar to how a camcorder works and as such can focus on subjects in an incredibly fast and precise manner. The benefits of this system are three-fold: the ability to focus quickly and smoothly; the ability to truly utilize the vari-angle touchscreen LCD monitor to its full potential; and the ability to utilize a wide range of over 100 EF and EF-S lenses. Also benefiting from Dual Pixel CMOS AF is the Movie Servo AF mode, which enables continuous auto focusing when recording movies. This focusing mode is especially useful for maintaining critical focus on moving subjects and for realizing the near-silent performance of compatible STM lenses. The 3.0\" 1,040k-dot vari-angle Clear View II touchscreen LCD monitor profits greatly from the advent of the Dual Pixel CMOS AF system and its ability to utilize Touch AF focusing for finely controlled selection of the point of focus. The monitor's vari-angle design also enables more efficient shooting and viewing from both high and low angles and an anti-reflective, smudge-resistant coating allows for clear viewing in any lighting condition. In addition to the LCD monitor, the 70D also features an optical pentaprism finder that can be used for eye-level shooting of still images. This Intelligent Viewfinder incorporates a superimposed LCD to provide an intuitive means for monitoring exposure and camera settings during shooting. While working with the viewfinder, an expansive 19-point all cross-type AF system is visualized for acquiring focus; integral to this array is a high-precision dual-cross center AF point that is compatible with f/2.8 and faster lenses. Providing a wealth of additional functionality to the camera is integrated Wi-Fi connectivity, which allows for the instant and direct sharing of image files to an iOS or Android mobile device for sharing online. This functionality also allows for wireless remote control over camera settings, including exposure controls, focusing, and shutter release, from a mobile device when using the Canon EOS Remote app. The EF-S 18-55mm f/3.5-5.6 IS STM lens is included along with the camera body to serve as a versatile everyday lens that encompasses a 35mm-equivalent focal length range of 28.8-88mm. The STM stepping motor helps to achieve near-silent focusing when used in conjunction with the Movie Servo AF mode and the optical image stabilization system helps to minimize the appearance of camera shake. Dual Pixel CMOS AF Dual Pixel CMOS AF is a refined live view focusing technology     that works to provide incredibly quick and precise auto focusing     abilities that function in a similar manner to how a camcorder acquires     focus. This system integrates two separate photodiodes within each pixel     to provide a broad and dense network of phase-detection gathering     elements to help reduce focus hunting for faster, more direct control of     focus placement. Dual Pixel CMOS AF is utilized during live view     applications, for either still or video shooting, and enables an     enhanced method of working with the vari-angle touchscreen LCD monitor. When working with still imagery, this focusing system works to acquire     focus quickly and accurately, making it ideally suited to shooting and     tracking moving subjects and ensuring critical focus is attained with     each shot. When shooting video, focusing is smooth and natural when     changing from different subjects or different distances within the     scene. Benefited by the Touch AF system, rack focus is possible simply     by touching elements within the scene on the touchscreen in order to     change focus in an intuitive manner. Subject tracking in movies is also     heightened due to the Dual Pixel CMOS AF system's ability to recognize     subjects and maintain focus when working within changing or cluttered     scenery. This focusing system provides full and intuitive use of the vari-angle     touchscreen monitor through its keen integration of touch controls for     focusing and articulating design of the screen for viewing from any     shooting angle. Additionally, Dual Pixel CMOS AF is fully supported by     over 100 current and former EF and EF-S lenses to offer a wide spectrum     of compatibility for both still and video applications. 20.2MP CMOS Sensor and DIGIC 5+ Image Processor In regard to imaging capabilities, the EOS 70D features a 20.2     megapixel APS-C CMOS sensor and DIGIC 5+ image processor to produce     high-resolution, well-detailed still imagery and full HD 1080p video     with notable low-light sensitivity. These two technologies work together     to enable 14-bit A/D conversion, which helps to improve the quality and     gradation of imagery by producing smoother, more natural-looking     results with minimal image noise. A native ISO sensitivity of 100-12800     is well-suited to working in difficult lighting conditions and the     processing power of the DIGIC 5+ processor also affords a wealth of     speed to all aspects of the camera, including a full-resolution     continuous shooting rate of 7 fps. Built-In Wireless Connectivity Integrated Wi-Fi enables remote control over the camera's     exposure settings (aperture, shutter speed, and ISO) as well as focus     and the shutter release from an iOS or Android mobile device when using     the Canon EOS Remote app. With this app, you can wireless control the     70D from a distance and utilize live view monitoring from your mobile     device for easier shooting from difficult angles and locations. Images     from the 70D can be backed-up to other wireless-enabled Canon cameras as     well as networked PCs and mobile devices for instant sharing via email     or to social networking and image hosting sites. Full DNLA (Digital     Living Network Alliance) compatibility also enables transferring of     files to other DNLA-compatible products like HDTVs and other wireless     devices for remote viewing and playback. When working from the camera     alone, files can also be transferred directly to the CANON iMAGE GATEWAY     for expedited sharing to social networking sites without the need of a     PC. PictBridge compatibility is also available and offers support for     wirelessly printing photos from the camera on a PictBridge-compatible     printer. When used in combination with the optional GP-E2 GPS Receiver,     geotagging and embedding of locational data into images' metadata is     possible for plotting imagery to maps and for recording the elevation,     direction, and Universal Coordinated Time (UTC) of each photograph. Canon EF-S 18-55mm f/3.5-5.6 IS STM Lens Included with the 70D is the EF-S 18-55mm f/3.5-5.6 IS STM lens,     which provides a 35mm-equivalent focal length of 28.8-88mm. Covering a     range of perspectives from wide-angle to portrait-length, this lens is a     highly versatile tool for use in everyday situations for both still     image and movie recording. Its design integrates an STM stepping motor     that provides near-silent focusing abilities with smooth and precise     control. Additionally, the optical image stabilization system helps to     minimize the appearance of camera shake by up to four shutter speed     steps in order to benefit working in low-light conditions and with     greater zoom magnifications. One aspherical lens element is also     incorporated into the lens construction to help reduce chromatic     aberrations throughout the zoom range and an optimized lens coating has     been applied, too, in order to lessen lens flare and ghosting for higher     contrast, clearer imagery. EOS HD Video Full HD 1080p video recording is supported at 30, 24, and 25 fps     as well as HD and SD video recording in multiple frame rates. Video is     recorded using the high quality H.264/MPEG-4 AVC codec and manual     exposure control is supported for greater refinement over the look and     feel of recordings. Video clips are automatically partitioned after the     file size has reached 4GB and both IPB and All i-frame compressions are     available for use depending on editing and output preferences. Sound can     be recorded using the built-in stereo microphone, or with an optional     external microphone using the 3.5mm microphone terminal, and controlled     manually across 64 levels. An attenuator function is also employed to     prevent audio clipping for cleaner overall sound. Movie Servo AF mode is available to provide continuous auto focusing     when recording video and pairs especially well when using an STM lens to     realize near-silent focusing during filming. Focusing is also heavily     benefited by the incorporation of the Dual Pixel CMOS AF system to     provide smooth, controllable focusing in live view with the added     benefit of the Touch AF function. The Video Snapshot mode can also be used to record short video clips, in     2, 4, or 8-second segments, and in-camera editing and music can be     applied to these files for finalized results straight from the camera. 3.0\" Clear View II LCD Monitor and Intelligent Viewfinder A large, bright 3.0\" 1,040k-dot vari-angle Clear View II     touchscreen LCD monitor is integrated into the 70D to enable clear live     view monitoring, image playback, and intuitive menu navigation. It's     vari-angle design aids in viewing from high and low angles and the     touchscreen control gives way to efficient navigation of menus and     shooting controls, as well as precise control over focus points. The     screen's construction incorporates an anti-reflective, smudge-resistant     coating to provide clearer viewing, even in bright, sunlit conditions. When working with still imagery and shooting at eye-level, an optical     pentaprism Intelligent Viewfinder is available and provides 98% frame     coverage. A superimposed LCD screen within the viewfinder provides     pertinent exposure and camera information for more efficient eye-level     shooting and also has the ability to outline AF points, grid lines, and     an electronic level to aid in composition. 19-Point All Cross-Type AF System When shooting with the optical viewfinder, a 19-point all     cross-type autofocus system is used to provide a wide range of focusing     coverage for acquiring focus accurately and quickly. The center point of     this cluster is a high-precision dual cross-type sensor that supports     focusing with f/2.8 and faster lenses in order to benefit focusing in     low-light conditions. These focus points are configurable and allow     homing in on specific elements within the frame to focus on, or,     alternatively, all can be used to provide coverage across the frame. iFCL 63-Zone Dual Layer Metering Sensor An intelligent metering system works in conjunction with the     autofocus system and independently analyzes focus, color, and luminance     within the scene for the most precise exposure settings possible. The 63     zones cover the entire image area with great detail and the dual-layer     design permits a wider sensitivity to different wavelengths of light.     The dual layers are split into a red/green channel and a blue/green     channel; which counters the red light sensitivity bias electronic     sensors inherently have. A series of algorithms are employed to combine     data received from both layers, with the resulting exposure reading     being extremely accurate regardless of the shooting conditions. This metering system employs evaluative, center-weighted, and spot     metering methods to determine exposure, as well as allowing for a +/- 5     EV exposure compensation for greater manipulation of the determined     exposure setting. Built-In HDR and Multiple Exposure Modes A High Dynamic Range (HDR) mode is available and allows for the     creation of HDR images in-camera, reducing the time needed to manually     overlay images in post-production. When using this mode, a series of     bracketed exposures are made of the same image, then automatically     composited, resulting in a photograph with controlled highlights,     detailed shadows, and a long middle range of tones. This mode is     especially useful when photographing scenes with a great deal of     contrast. Multiple exposures are also possible in-camera and up to 9 exposures can     be recorded onto a single file using two distinct settings for control.     When in Additive mode, this closely resembles making multiple exposures     on film and layers each exposure; manual exposure compensation is     required. Average mode layers the images and automatically compensates     for the final exposure, eliminating the unintended possibility of gross     under or overexposure. Multiple exposures can be recorded in either JPEG     or RAW formats, and furthermore you can utilize an existing RAW image     as a starting point from which to layer subsequent images, which can     then be manipulated in real time on the LCD. Scene Intelligent Auto and Special Scene Modes Scene Intelligent Auto mode incorporates a number of Canon's     automatic exposure technology together in order to output a well-refined     exposure. Picture Style Auto, Automatic Lighting Optimizer, Automatic     White Balance, Autofocus, and Automatic Exposure are all employed to     intelligently analyze the scene at hand and produce the most effective     exposure settings to clearly render your subject matter. Special Scene modes also help to enhance your imagery by applying a     system of corrections for use in more difficult lighting situations.     Handheld Night Scene automatically captures four consecutive exposures,     at shutter speeds fast enough to handhold, and layers them into a single     frame. This allows you to effectively record images in darker     situations without the need of a tripod or stabilization device. HDR     Backlight Control works in the same manner and records a series of     exposures at different values to ensure highlight and shadow values are     not lost. These under and over-exposed images are blended to create a     final image with a wider dynamic range. Other Camera Features Multi Shot Noise Reduction automatically composites four     sequential exposures together in order to gain one exposure that     exhibits minimal apparent noise. Peripheral illumination, chromatic aberration, and distortion     corrections are available and programmable through a menu of different     available EF lenses. This lens data is used to automatically correct for     each individual lens' traits to produce the cleanest image possible. Seven Creative Filters are available to aesthetically modify the     appearance of imagery in-camera, with the results visible in real time     when working in live view. These filters include Grainy Black and White,     Soft Focus, Fisheye Effect, Toy Camera Effect, Miniature Effect, Art     Bold Effect, and Water Painting Effect. Compatible with SD, SDHC, and SDXC, including Ultra High Speed (UHS-I), memory cards. Compatible with eTTL II flash metering for use with compatible external flash units. A built-in pop-up flash is available to provide additional illumination to scenes. Silent shooting is a low-vibration shooting mode that slows and     mutes the shutter and mirror reflex, enabling a more discrete method of     capturing imagery. In-camera RAW processing allows for the converting of RAW image     files to JPEGs without the need for a computer. When using this     function, 10 process variables-brightness adjustment, white balance,     Picture Style, Auto Lighting Optimizer, noise reduction, JPEG     image-recording quality, color space, lens peripheral illumination     correction, distortion correction, and chromatic aberration     correction-are available for fine-tuning the appearance of photos. A Feature Guide can be employed to help explain and the specific     functions of each dedicated camera control to help for properly applying     a variety of settings while shooting. Imaging Camera Type Digital SLR with Interchangeable lenses Lens Mount Canon EF Canon EF-S Camera Format APS-C (1.6x Crop Factor) Pixels Actual: 20.9 Megapixel Effective: 20.2 Megapixel Max Resolution 20MP: 5472 x 3648 @ 3:2 Other Resolutions 11.2MP: 4104 x 2736 @ 3:2 8.9MP: 3648 x 2432 @ 3:2 5MP: 2736 x 1824 @ 3:2 2.5MP: 1920 x 1280 @ 3:2 0.35MP: 720 x 480 @ 3:2 17.7MP: 4864 x 3648 @ 4:3 10MP: 3648 x 2736 @ 4:3 7.9MP: 3248 x 2432 @ 4:3 4.4MP: 2432 x 1824 @ 4:3 2.2MP: 1696 x 1280 @ 4:3 0.31MP: 640 x 480 @ 4:3 16.8MP: 5472 x 3072 @ 16:9 9.5MP: 4104 x 2310 @ 16:9 7.5MP: 3648 x 2048 @ 16:9 4.2MP: 2736 x 1536 @ 16:9 2.1MP: 1920 x 1080 @ 16:9 0.29MP: 720 x 408 @ 16:9 13.3MP: 3648 x 3648 @ 1:1 7.5MP: 2736 x 2736 @ 1:1 5.9MP: 2432 x 2432 @ 1:1 3.3MP: 1824 x 1824 @ 1:1 1.6MP: 1280 x 1280 @ 1:1 0.23MP: 480 x 480 @ 1:1 Aspect Ratio 1:1, 3:2, 4:3, 16:9 Sensor Type / Size CMOS, 22.5 x 15 mm File Formats Still Images: JPEG, RAW Movies: MOV, MPEG-4 AVC/H.264 Audio: Linear PCM (Stereo) Bit Depth 14-bit Dust Reduction System Yes Noise Reduction Yes Memory Card Type SD SDHC SDXC Focus Control Focus Type Auto & Manual Focus Mode Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M) Autofocus Points 19 Viewfinder/Display Viewfinder Type Pentaprism Viewfinder Coverage 98% Viewfinder Magnification Approx. 0.95x Diopter Adjustment - 3.0 to +1.0 m Display Screen 3\" Rear Touchscreen Swivel  LCD (1,040,000) Screen Coverage 100% Live View Yes Exposure Control ISO Sensitivity Auto, 100-12800 (Extended Mode: 100-25600) Shutter Type: Electronic & Mechanical Speed: 30 - 1/8000 sec Remote Control Not Specified By Manufacturer Metering Method Average metering, Center-weighted average metering, Partial Metering, Spot metering Exposure Modes Modes: Aperture Priority, Auto, Bulb, Custom, Flash Off, Manual, Programmed Auto, Shutter Priority Metering Range: EV 1.0 - EV 20.0 Compensation: -5 EV to +5 EV (in 1/2 or 1/3 EV steps) White Balance Modes Auto, Cloudy, Color Temperature Filter, Custom, Daylight, Flash, Fluorescent (White), Shade, Sunset, Tungsten, Twilight Flash Flash Modes Modes: FE Lock TTL Auto Compensation: -3 EV to +3 EV (in 1/2 or 1/3 EV steps) Built-in Flash Yes Effective Flash Range Not Specified By Manufacturer Guide No. 39.4' (12.01 m) ISO100 Max Sync Speed 1 / 250 sec Flash Compensation -3 EV to +3 EV (in .1 or .5 EV steps) Dedicated Flash System eTTL External Flash Connection Hot Shoe AV Recording Video Recording Yes, NTSC/PAL File Size 1920 x 1080p (Full HD) 1280 x 720p (HD) 640 x 480p (SD) Frame Rate @ 1920 x 1080: 30 fps, 25 fps, 24 fps @ 1280 x 720: 60 fps, 50 fps @ 640 x 480: 30 fps, 25 fps Exposure Control Auto: Shutter Speed Manual: Shutter Speed, Aperture, ISO ISO Sensitivity Not Specified By Manufacturer Exposure Compensation -3 EV to +3 EV (in .3 EV steps) Focus Auto Manual Continuous Auto Continuous Shooting Time 1920 x 1080 (with 8GB memory card) @ 30 fps IPB: 32 min. (235 MB / min.) / ALL-I: 11 min. (685 MB / min.) @ 25 fps IPB: 32 min. (235 MB / min.) / ALL-I: 11 min. (385 MB / min.) @ 24 fps IPB: 32 min. (235 MB / min.) / ALL-I: 11 min. (685 MB / min.) 1280 x 720 (with 8GB memory card) @ 60 fps IPB: 37 min. (205 MB / min.) / ALL-I: 12 min. (610 MB / min.) @ 50 fps IPB: 37 min. (205 MB / min.) / ALL-I: 12 min. (610 MB / min.) 640 x 480 (with 8GB memory card) @ 30 fps IPB: 97 min. (78 MB / min.) @ 25 fps IPB: 97 min. (78 MB / min.) Audio Recording Optional External Mic: With Video, Stereo, Performance Continuous Shooting Up to 7 fps Start-up Time 0.15 Seconds Shutter Lag 0.065 Seconds Self Timer 10 sec, 2 sec Connectivity 1/8\" Microphone HDMI C (Mini) USB 2.0 Wi-Fi Capable Yes Power Battery 1x  LP-E6  Rechargeable Lithium-Ion Battery Pack, 7.2VDC, 1800mAh AC Power Adapter ACK-E6 (Optional) Operating/Storage Temperature Operating 32 to 104°F (0 to 40°C) Humidity: 0 - 85% Physical Dimensions (WxHxD) 5.5 x 4.1 x 3.1\" / 139.0 x 104.3 x 78.5 mm Weight 1.66 lb / 755  g with battery and memory card Kit Lens Focal Length 18 - 55 mm Comparable  35mm Focal Length: 28.8 - 88 mm Aperture Maximum: f/3.5 - 5.6 Angle of View 74° 20' - 27° 50' Minimum Focus Distance 9.84\" (25 cm) Groups/Elements 11/13 Diaphragm Blades 7 Autofocus Yes Image Stabilization Yes Filter Thread Front: 58 mm Dimensions (DxL) Approx. 2.72 x 2.96\" (69 x 75.2 mm) Weight 7.23 oz (205 g) Canon EOS 70D DSLR Camera Body EF-S 18-55mm f/3.5-5.6 IS STM Lens LP-E6 Rechargeable Lithium-Ion Battery Pack (7.2V, 1800mAh) LC-E6 Charger for LP-E6 Battery Pack IFC-400PCU USB Interface Cable R-F-3 Camera Cover Eyecup Eb Wide Strap EW-EOS 70D EOS Digital Solution Disk CD-ROM Professional HD 2x telephoto lens When your camera can't get you close enough to capture the action in detail, this 2x Telephoto lens will bring the action to you! Optically multiplying the focal length of your camera's lens by a factor of 2, it more than doubles your telephoto magnification and detail without any pixelization. This is dramatically better than the \"Digital Zoom\" feature of many cameras where the magnification is obtained by merely enlarging the existing image, resulting in a loss of sharpness. This 2x telephoto attachment is perfect for all your long-distance imaging including sports, candids, surveillance, nature and wildlife. You will also be able to utilize your camera's macro capability at over twice the usual distance, allowing for easier subject lighting with less shadows and intrusion.. 45x Wide-Angle Digital High Definition Lens with Maro When you've run out of room, and can't possibly fit anything else into the frame, this 0.45x Wide Angle adapter will allow you to capture it all! This attachment more than doubles your camera's wide angle field-of-view . Scenic shots will be more panoramic and you'll be able to take outstanding group photos, even in tight places. In addition, the detachable Macro Lens enables you to photograph small objects up close. Great for jewelry, coins, stamps, flowers, and more. Even if your camera already has macro capability, this macro lens will get you even closer for truly amazing close-up photos. Professional High Definition Special Element Frame Premium Rimmed Glass Infrared Compatible Include Protective Lens Case Digital Multi Coated 58mm Glass Filter Kit (UV-CPL-FLD) 3pc Filter kit The UV filter protects your camera's lens from scratches, dust,  dirt, moisture and fingerprints, while removing unwanted ultraviolet  light.The UV filter reduces blue haze caused by UV light by absorbing  71% of UV. The CPL filter deepens and  intensifies blue skies, achieves vibrant colors and reduces glare and  reflections from non-metallic objects & glass surfaces. Great for  video. The Fluorescent Light Correction Filter gives  you the prefect solution for shooting without a flash under a  fluorescent light.This filter gives true-to-life colors and pleasing  skin tones by removing the harsh yellow-green cast created by flouriest  lightning. Lens filter set is a must-have for photographers 58mm filters improve photographs by giving photographers control over light and allowing them to emphasize certain features Filter kit features UV, CPL, and FLD filters Set comes with hard carrying case and filters UV Protector Filter protected the lens from damage 32 GB Secure Digital (SD) Memory Card Get The Best SD Card for your product When getting an SD memory card there are hundreds of options for your item this can get confusing and costly  , When purchasing one of our handpicked memory cards for your item you receive a  Memory card at the highest quality. We go to every extent to handpick cards to provide  you as a bonus with your purchase that are not only guaranteed to work with your item but have the best performance with your item. This is a Onetime purchase that will help you capture a memory for a lifetime. Our memory card offers are High performance cards that are made reliable with long life spans  created to handle real life motions and real time transfers. There will be  no delay time in transferring information from your device to this card. Get Quality at the top of its class with  SD memory. High Speed USB  All  One Card Reader Access a multitude of memory cards with this USB 2.0 All-in-One card reader! This portable memory card reader supports the most popular memory cards such as Compact Flash I/II, Secure Digital, SD, Memory Stick, Micro Drive and Multimedia Card. Deluxe Medium Camera and Video Bag The Deluxe Medium Camera and Video Bag  is the perfect compliment to hold all of your equipment. It features a shock proof nylon material and is water resistant. It has 1 removable divider, rubber feet, shoulder strap and a handle grip. Easy access closure flap Mesh pockets for accessory storage compartment with interior   mesh pockets for spare batteries, flash-memory cards, diskettes,cords,   cables and more Shoulder strap/1 re moveable divider ,rubber feet, shoulder strap and a handle grip nylon material and is water resistant Dimensions: Size: 10.8 x 6.5 x 7.5 inches Multi Memory Card Wallet Donâ\u0080\u0099t lose your lifeâ\u0080\u0099s Memories Memory Cards are the Insert that holds your lifeâ\u0080\u0099s memoryâ\u0080\u0099s. A little card that easily lost but so important to you and your family. Always keep  your memory cards together at any cost. One lost card can lose decades of Memories. A memory card wallet is someplace for you to keep these memoryâ\u0080\u0099s together. Memory Card Wallet Keeps multiple memory cards protected and organized with this durable storage wallet. Sturdy memory card wallet case holds memory cards of any type securely, keeping them from contact with other accessories and makes them easily accessible in larger luggage bags. Features Memory Card Wallet Holds up to Multi  memory Cards (SD,CF,MS) 1 Year Limited Warranty Replacement For CANON LP-E6 Battery The LP-E6 Rechargeable Lithium-ion Battery Pack has a capacity of 1120mAh, making it possible to shoot many photographs with your Canon EOS 5D MARK II. 5D MARK III, 60D and 7D digital camera on a single battery charge. The battery is also compact and lightweight. There is no memory effect, so you can recharge partially drained batteries without reducing performance. Replacement for the original Canon LP-E6 battery pack Never run out of battery power when you're about to capture the perfect moment Output voltage: 7.2V Capacity: 1120mAh LP-E6 RECHARGEABLE BATTERY  CHARGER This LP-E6Battery Charger for Canon EOS Rebel  is used to recharge your digital camera battery, it is quick charge with automatic constant current control, prevents battery from overcharging, short circuit, and electronic shock. The Battery Charger can used both for home, office and car.  A/C power supply input voltage: AC100V~240V NOTE: For a success and safe charge to your battery, please make         sure to line up the correct polarity (positive / negative) before         inserting the battery onto the charger This compact battery charger set for Canon LP-E6 is the complete charging solution for digital video batteries High quality battery charger is a handy companion for digital shooting Charger is designed with a foldable A/C plug that charges your camera / camcorder battery anywhere in the world Quick charge with automatic constant current control prevents battery from overcharging, short circuit, and electronic shock Smart LED indicator shows charging status Pro Digital Auto Slave Flash with Bracket for All SLR/DSLR Digital Camera & Camcorders Every photographer knows that a quality flash unit is an essential component to taking great pictures. Built-in flashes simply don't have enough power to properly illuminate most subjects, and typically produce harsh shadows, red-eye, and other undesirable effects. An external flash offers far more power and versatility , resulting in consistently better pictures! The Flash is a high-power flash unit that works seamlessly with a wide variety of camera models and provides exceptional light coverage , at a price that doesn't break the bank! The Flash features automatic exposure control , which syncs with your camera to provide just the right amount of light. The zoom function allows you to light subjects as far away as 50 feet , and the bounce head tilts and swivels to give you full creative control. Full Size 50-inch Tripod With Leveler  360 adjust & Case Want to relax and take time shooting ?  Not worry about your shots being leveled ?  adjust shots with a swivel instead of an adjustment ? If the answer to all these Questions are YES this is the item for you!! The 50-Inch Photo and Video tripod features a special carrying handle as well as a professional grip. With its  self leveling rubber leg tips  it offers a great floor grip for positioning and  built in bubble leveler to give you a leveled shot. Capability  for a 360 degree spin with its 3 way pan head doesn’t hurt for convenience. There are bracing sections to adjust Tripod size and an additional Bonus of Tripod case. What else can you ask for as a free bonus with your purchase. Features Extends to 50 Inch  and under Non slip handle Mid level bracing system for adjustable sizes Bubble leveler Tripod fitted case Compact Carry Size Mini Flexible Taple Top Travel Tripod  with Pocket clip We realized to take a quick snap shot anywhere with your camera is a hassle to keep the camera sturdy with a table top tripod you can pull it out instantly or leave attached to your product for that Quick Snap and Go picture. A focused leveled cameraâ\u0080\u0099s shot and a wobbled shot is a big difference. This handy little tripod also can keep you in the picture. Place your camera on the Tripod and use the camera's self-timer, or a remote shutter release and you are in the picture for a great crisp-sharp shot. It easy to use and it is small enough to be ideal for carry in travel. Featuring an adjustable head and hard Flexible legs, this Tripod is an ideal accessory for photographers on the run. This lightweight, yet durable tripod stands at a height of up to 5\". Perfect for most digital, video and still cameras . Features Fits all 35mm Digital and Video camera with Tripod Socket Sturdy Ultra Compact Convenient Pocket Clip Travel Sized Lens Cap Keeper Keep Your lens safe its one of the Eyes of your purchase: Its always the little things that we lose that are a pain to replace . Why go through the hassle we found the perfect solution. Your cameras lens is a vital part of the pathway that captures an image from external reality and stores it onto a memory card film device or other  Keeping this lens free of dust smudges and contact with other items is imperative. A Lens Cap holder as simple as it sounds is the solution. The  perfect way to keep track of your lens caps. A small button tapes onto the front of your lens cap and the elastic loop goes around the barrel of your lens so that your lens cap always remains attached, hanging from the lens. Lens caps can be pricey and hard to find  with this you will  Never lose a lens cap again ! Deluxe Screen Protector Pro Pack (Clear ) Be safe scratches arenâ\u0080\u0099t appealing . Save your screen it takes a second to apply and  will give you longer usage with your product Purchasing any item everyone always knows the LCD screen or glass screen is an imperative part of the electronic device always the first to get damaged. Easy solution for you !! Deluxe screen protectors are perfect for digital camera screens, cell phone screens and game player screens. screen protectors are included with  a squeegee to smooth them out and remove air bubbles. They can be cut down to size to fit any screen from 1\" to 5\". The extra clear layer on your device will not only protect it from Sun damage but will also protect from  Nail Scratches, finger smudges and many other contact damage to the screen point of your device. The Clear Quality Kit touch safes  your device. Universal Screen Guard The Greatest  Guarder for LCD Screens Multi 3pcs 3x5â\u0080\u0099â\u0080\u0099 Deluxe Screen Guard 1 Squeegee Card Deluxe Camera , Screen & Lens 5pc cleaning Kit Be clean Be Safe use something Approved for your product : It's obvious that the cleaner the lens and camera sensor, the sharper your pictures will be. Dirt, dust, and fingerprints will degrade the image quality of even the finest optics. However, it's equally important to avoid using incorrect cleaning materials which can permanently damage your photo equipment. The 5 Piece Camera and lens Cleaning Kit. consists of soft-texture fiber cloth, 5 cotton swabs, a bottle of cleaning fluid, soft lens tissue paper, and top quality blower brush. It easily fits in your camera bag so you can take it anywhere with you easily. It is perfect for an on-the-spot camera or lens cleaning and is approved by the manufacture to use with your item Screen Camera and Lens Cleaning kit Soft Texture Fiber Cloth Five Quality Cotton Swabs Top Quality cleaning Fluid Quality Blower and Brush Full Pack Lens Cleaning Tissue CANON 70D/18-55SKIT12 We usually ship within 1-2 business days after receiving payment. Please be aware that weekends are not business days. At our discretion; large or expensive packages may receive a free upgrade to FedEx Ground with signature confirmation.  If this applies to you, please assure that your address is able to receive FedEx packages & that an adult is available to sign for & accept the shipment. All express methods of shipment as long as verified take 1 business day to ship We ship everything professionally in our state of the art warehouse boxed and shipped with perfection. \"Free Shipping\" applies to orders shipped within the USA (48 states) We do not ship to APO or FPO address Orders shipping to PR/HI/AK Will have an additional shipping charge and a longer process time to ship order Credit Cards: We can only ship to addresses that are noted with your credit card account. We may contact you for additional verification after you check out. PayPal: We prefer to ship to confirmed addresses. We may contact you for additional verification for payments made by unconfirmed PayPal addresses. We do not accept PayPal payments from accounts outside the USA and Canada. · When necessary, we may contact you via Direct Message or telephone to obtain additional verification. We offer our customer's a 14 day return for replacement policy if item is defective other then that all sales are final . A Return Merchandise Authorization (RMA) number must be obtained for any return. To obtain an RMA number, please call us toll free at 877-254-6155 Returned packages without proper RMA demarcations will be refused by our warehouse and returned to you. Customers who refuse a delivery, will be subject to charges for return shipping to us. If the item was advertised as Free Shipping, then we will charge the amount of shipping as determined by Our Shipping Station . Defective Item An item that was discovered to be defective upon receipt can be replaced with the same model only. Return Shipping Return shipping cost (the cost to send an item back to our store) is like or comparable to your cost of driving to any store for returning an item, which is not reimbursable. Therefore, we do not reimburse any return shipping cost. If an item you received is defective, we will certainly replace the item with a new one, however we do not cover or reimburse the shipping cost for returning defective merchandise back to our store. We will ship the replacement product to you at our cost, and use every good measure to ensure that the replacement order is processed quickly. Replacement We will send a product replacement after the authorized return has completed our receiving/inspection process. The replacement will ship within four business days following our receipt of your return. Please allow additional processing time after Holidays. Although it is our goal to ship a replacement as quickly as possible, we do not send replacements before we receive and inspect the returned merchandise. All items are sold with Manufacture Warranty so there is another avenue for assistance. All returns must be packed with all contents which came with the original package including, cables, software, plastic and cardboard packaging, and unregistered warranty card. This return policy excludes Televisions, Home Theater Projectors or any Home audio Product . For further questions please call us toll free at 877-254-6155 We encourage any questions or concerns you may have for us, but we request that all communication be done through eBay messages only or over the phone. Our dedicated customer support team is available Monday-Friday 10AM - 6PM (EST) TOLL FREE: +1-877-254-6155 LOCAL: +1-908-967-5155 Click here to send us your email inquiry now through eBay messages.Right Bar Desc //End !",
    "wificapable": "Yes",
    "shutterlag": "0.065 Seconds",
    "imagestabilization": "Yes",
    "viewfindercoverage": "98%",
    "startuptime": "0.15 Seconds",
    "continuousshooting": "Up to 7 fps",
    "lensforsd": "EF-S IS STM 18-55mm",
    "dimensionswxhxd": "5.5 x 4.1 x 3.1\" / 139.0 x 104.3 x 78.5 mm",
    "autofocus": "Yes",
    "maxvideoresolution": "1920 x 1080",
    "whitebalancemodes": "Auto, Cloudy, Color Temperature Filter, Custom, Daylight, Flash, Fluorescent (White), Shade, Sunset, Tungsten, Twilight",
    "flashcompensation": "-3 EV to +3 EV (in .1 or .5 EV steps)",
    "sensortypesize": "CMOS, 22.5 x 15 mm",
    "connectivity": "1/8\" Microphone HDMI C (Mini) USB 2.0",
    "cameraformat": "APS-C (1.6x Crop Factor)",
    "groupselements": "11/13",
    "supportedflashmemory": "Eye-Fi card, SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "aspectratio": "1:1, 3:2, 4:3, 16:9",
    "guideno": "39.4' (12.01 m) ISO100",
    "batteryformfactor": "Manufacturer specific",
    "effectiveflashrange": "Not Specified By Manufacturer",
    "exposuremodes": "Modes: Aperture Priority, Auto, Bulb, Custom, Flash Off, Manual, Programmed Auto, Shutter Priority Metering Range: EV 1.0 - EV 20.0 Compensation: -5 EV to +5 EV (in 1/2 or 1/3 EV steps)",
    "minimumfocusdistance": "9.84\" (25 cm)",
    "depth": "3.1 in.",
    "sensorresolution": "20.2 MP",
    "viewfindertype": "Pentaprism",
    "maxresolution": "20MP: 5472 x 3648 @ 3:2",
    "model": "70D",
    "screencoverage": "100%"
}