{
    "videooutput": "NTSC PAL",
    "exposurecontrol": "Programmed auto exposure and exposure compensation ( 2.0 +2.0 EV in steps of 1/3 EV)",
    "weight": "5.7 oz (160g)",
    "interfacedatatransferprotocol": "MTP PTP",
    "batterylifeshotspercharge": "Still pictures: Approx. 170 shots",
    "isosensitivity": "100-1600",
    "lenszoom": "12x",
    "storagefileformats": "Still pictures: JPEG Sound files (Voice Memo): WAV Movies: Movies: MOV (Video: H.264/MPEG-4 AVC, Audio: LPCM stereo)",
    "storagefilesystem": "DCF EXIF 2.3 DPOF and MPF compliant",
    "lensfnumber": "f/3.3-6.3",
    "chargingtime": "Approx 1 hr 50 min (when using Charging AC Adapter EH 71P and when no charge remains) (Approx.)",
    "incameraimageediting": "D-Lighting - Quick Retouch - Small Picture - Filter effects - Glamour retouch - Red eye reduction - Crop",
    "ioterminal": "Audio/video (A/V) output; Digital I/O (USB) HDMI micro connector (Type D) (HDMI output)",
    "hdmioutput": "Auto 480p 720p 1080i",
    "category": "camera",
    "dimensionshxwxd": "3.9 x 2.3 x 1.0\" (99 x 58 x 25mm)",
    "internalmemory": "25MB",
    "movie": "Full HD: 1920x1080p / 30fps iFrame 540: 960x540 / 30fps HD: 1080x720/30p HS 640x480 / 120fps HS 1280x720 / 60fps HS 1920x1080 / 15fps Movie file format: MPEG-4 AVC H.264 VGA: 640x480",
    "powersources": "One Rechargeable Li-ion Battery EN-EL19 (included) AC Adapter EH-62G (available separately)",
    "monitorresolution": "460,000-dots",
    "sensorsize": "1/2.3\"",
    "selftimer": "Can be selected from 10 and 2 seconds duration",
    "autofocusaffocusareaselection": "Face priority, center, manual with 99 focus areas, subject tracking, target finding AF",
    "monitorframecoverageplaybackmode": "100% horizontal (Approx.)",
    "totalpixels": "16.76 million (approx.)",
    "aperture": "Electronically controlled ND filter (-2.0 AV) insertion",
    "monitortype": "TFT-LCD with 5-level brightness adjustment",
    "type": "Compact Digital Camera",
    "highestisosensitivity": "ISO 3200, 6400(available when using Auto mode)",
    "maximumautofocusareaspoints": "N/A",
    "battery": "Rechargeable Li-ion Battery EN-EL19",
    "autofocusaf": "Contrast-detect TTL AF",
    "monitorsize": "3.0 in. diagonal",
    "tripodsocket": "1/4\" - 20",
    "imagesizepixels": "4608 x 3464 (16.1M)",
    "lensconstruction": "9 elements in 7 groups",
    "focuslock": "Yes",
    "lens": "12x optical Zoom-NIKKOR lens",
    "wififunctionality": "Yes",
    "scenemodes": "Back Light Beach Black and White Copy Close Up Copy Dusk/Dawn Easy Panorama Fireworks Show Food Landscape Museum Night Landscape Night Portrait Party/Indoor Pet Portrait Portrait Scene Auto Selector Snow Sports Sunset",
    "focusrange": "[W]: Approx. 1 ft. 8 in. (50 cm.) to infinity [T]: Approx. 5 ft. (1.5 m.) to infinity Macro close-up mode: Approx. 3.2 in. (8 cm.) to infinity",
    "lowestisosensitivity": "100",
    "interface": "Hi-speed USB",
    "storagemedia": "SD memory card SDHC memory card SDXC memory card",
    "monitorframecoverageshootingmode": "97% horizontal (Approx.) 96% vertical (Approx.)",
    "shutterspeed": "1/2000-1 sec. 4 sec. (when scene mode is set to Fireworks show)",
    "supportedlanguages": "Arabic Bengali Chinese (Simplified and Traditional) Czech Danish Dutch English Finnish French German Greek Hindi Hungarian Indonesian Italian Japanese Korean Marathi Norwegian Persian Polish Portugese (European and Brazilian) Romanian Russian Spanish Swedish Telugu Thai Turkish Ukranian Vietnamese",
    "lensfocallength": "4.5-54.0mm (angle of view equivalent to that of 25-300 mm lens in 35mm [135] format)",
    "voicememofunction": "Yes",
    "storecategoriesstorehomeentertainmentcentertelevisions": "1.888.209.5772 About me Contact Us Shipping Payments FAQ Nikon Coolpix S6800 Digital Camera, 16MP, 12x Optical Zoom, Full HD 1080p Video, Built-in Wi-Fi, Black SKU: INKCPS6800B Mfr. Part: 26442 Item Includes Nikon Coolpix S6800 Camera - UC-E6 USB Cable - EN-EL19 Rechargeable Battery - EH-70P Charging AC Adapter - AN-CP19 Strap - Nikon 1 Year Warranty Description Zoom in and grab a great shot, then instantly share it with your friends and family. Pull out the stylish, ultra-slim COOLPIX S6800, zoom in and capture a beautiful photo or Full HD 1080p video, then watch it instantly appear on your compatible smartphone or tablet! Your friends won't believe the photos and videos you share dramatic low-light shots, extreme close-ups, flattering portraits, artistic creations and so much more. And when you need maximum zoom power, zoom in to a whopping 12x optical zoom and 24x Dynamic Fine Zoom. Zoom, capture and share it's that simple! Zoom in even farther with Dynamic Fine Zoom Every COOLPIX is designed around a genuine NIKKOR glass lens, the legendary optics that have helped make Nikon famous. The COOLPIX S6800's 12x optical zoom lens goes from wide-angle great for portraits and landscapes all the way up to telephoto great for closeups of sports, concerts, nature and more. When you need even more reach, zoom up to 12x with optical zoom and 24x with Dynamic Fine Zoom, an enhanced digital zoom function that effectively doubles your reach. Built-in Wi-Fi for instant photo sharing and remote camera control with a compatible smartphone or tablet Your smartphone or tablet will be your favorite accessory! Take beautiful photos with the COOLPIX S6800 and watch them instantly appear on your compatible smartphone or tablet. Then share them without missing a beat text them, email them, upload to your favorite social networking site it's your choice! You can even use your smartphone or tablet as a remote control for the COOLPIX S6800, perfect for self portraits and group shots that actually include you. Target Finding AF for accurate, intelligent autofocus It's frustrating when a smartphone camera focuses on the wrong thing. With the COOLPIX S6800, Target Finding AF instantly and accurately determines your intended subject and focuses on it not on just whatever is closest to the camera. Catch the shot you want on the first try. No more out of focus shots or the frustration of trying to get the camera to focus on the right thing. 18 Scene Modes and Scene Auto Selector for effortless photos and videos Experienced photographers optimize their camera settings to match the situation. The COOLPIX S6800 does that work for you. With 18 Scene Modes, including Beach, Snow, Night Portrait, Sunset and more, it's easy to match the moment to a Scene Mode. You can even get creative and use Scene Modes to alter ordinary shots. Or, select Scene Auto Selector and let the camera choose the best mode for your situation. High-performance CMOS image sensor lets you shoot without a flash Imagine being able to shoot without a flash at weddings, concerts, parties anywhere your flash normally fires. You won't have to interrupt a moment to capture it, and your photos will look more natural and true to your memory. The COOLPIX S6800 performs so well in low light situations that, in most cases, using the flash is optional. Of course, when the lighting is extremely poor and you need a flash, it'll be there. Features An effective pixel count of 16.0-million pixels and a backside illumination CMOSsensor A 12x (up to 24x with Dynamic Fine Zoom) optical zoom NIKKOR lens that covers the wide-angle 25mm to telephoto 300mm range of angles of view (equivalent focallengths in 35mm [135] format) A compact size and stylish design that can easily be taken anywhere Built-in Wi-Fi® that makes connecting with others enjoyable with simple connection to smart devices A function for recording 1920 x 1080/60i movies with superior picture quality with the press of a button 4-axis vibration reduction that effectively compensates for camera shake with movie recording Specifications Type Compact Digital Camera Effective Pixels 16 million Image Sensor CMOS Sensor Size 1/2.3\" Total Pixels 16.76 million (approx.) Lens 12x optical Zoom-NIKKOR lens Lens Focal Length 4.5-54.0mm (angle of view equivalent to that of 25-300 mm lens in 35mm [135] format) Lens f/-number f/3.3-6.3 Lens Construction 9 elements in 7 groups Lens Zoom 12x Digital Zoom Digital Zoom Up to 4x (angle of view equivalent to that of approx. 1200mm lens in 35mm [135] format) Vibration Reduction Lens shift (still pictures) Lens shift and electronic VR (movies) Autofocus (AF) Contrast-detect TTL AF Autofocus (AF) Focus-area Selection Face priority, center, manual with 99 focus areas, subject tracking, target finding AF Focus Range [W]: Approx. 1 ft. 8 in. (50 cm.) to infinity [T]: Approx. 5 ft. (1.5 m.) to infinity Macro close-up mode: Approx. 3.2 in. (8 cm.) to infinity Focus Lock Yes Maximum Autofocus Areas/Points N/A Monitor Size 3.0 in. diagonal Monitor Type TFT-LCD with 5-level brightness adjustment Monitor Resolution 460,000-dots Monitor Frame Coverage (shooting mode) 97% horizontal (Approx.) 96% vertical (Approx.) Monitor Frame Coverage (playback mode) 100% horizontal (Approx.) Storage Media SD memory card SDHC memory card SDXC memory card Internal Memory 25MB Storage File System DCF EXIF 2.3 DPOF and MPF compliant Storage File Formats Still pictures: JPEG Sound files (Voice Memo): WAV Movies: Movies: MOV (Video: H.264/MPEG-4 AVC, Audio: LPCM stereo) Movie Full HD: 1920x1080p / 30fps iFrame 540: 960x540 / 30fps HD: 1080x720/30p HS 640x480 / 120fps HS 1280x720 / 60fps HS 1920x1080 / 15fps Movie file format: MPEG-4 AVC H.264 VGA: 640x480 Voice Memo Function Yes Image Size (pixels) 4608 x 3464 (16.1M) ISO Sensitivity 100-1600 Lowest ISO Sensitivity 100 Highest ISO Sensitivity ISO 3200, 6400(available when using Auto mode) Exposure Metering Matrix, center-weighted (digital zoom less than 2×), spot (digital zoom 2× or more) Exposure Control Programmed auto exposure and exposure compensation ( 2.0 +2.0 EV in steps of 1/3 EV) Exposure Modes Scene auto selector, Scene, Special Effects, Smat Portrait, Auto Mode Scene Modes Back Light Beach Black and White Copy Close Up Copy Dusk/Dawn Easy Panorama Fireworks Show Food Landscape Museum Night Landscape Night Portrait Party/Indoor Pet Portrait Portrait Scene Auto Selector Snow Sports Sunset In-Camera Image Editing D-Lighting - Quick Retouch - Small Picture - Filter effects - Glamour retouch - Red eye reduction - Crop Exposure Compensation ± 2 EV in steps of 1/3 White Balance Auto - Daylight - Incandescent - Fluorescent - Cloudy - Flash - Preset WB - Shutter Mechanical and CMOS electronic shutter Shutter Speed 1/2000-1 sec. 4 sec. (when scene mode is set to Fireworks show) Continuous Shooting Options Single, Continuous H, Continuous L Best Shot Selector, Multi-shot 16, Pre-shooting cache, 120 Continuous H, 60 Continuous H Aperture Electronically controlled ND filter (-2.0 AV) insertion Self-timer Can be selected from 10 and 2 seconds duration Built-in flash Range [W]: 0.5 to 4.0m (1ft. 8in. to 13ft.) [T]: 1.2 to 2.0m (3ft. 8 in. to 6 ft. 6 in.) Built-in Flash Control TTL auto flash with monitor preflashes Built-in Flash Yes Interface Hi-speed USB Interface Data Transfer Protocol MTP PTP Video Output NTSC PAL HDMI Output Auto 480p 720p 1080i I/O Terminal Audio/video (A/V) output; Digital I/O (USB) HDMI micro connector (Type D) (HDMI output) Wi-Fi Functionality Yes Supported Languages Arabic Bengali Chinese (Simplified and Traditional) Czech Danish Dutch English Finnish French German Greek Hindi Hungarian Indonesian Italian Japanese Korean Marathi Norwegian Persian Polish Portugese (European and Brazilian) Romanian Russian Spanish Swedish Telugu Thai Turkish Ukranian Vietnamese Power Sources One Rechargeable Li-ion Battery EN-EL19 (included) AC Adapter EH-62G (available separately) Charging Time Approx 1 hr 50 min (when using Charging AC Adapter EH 71P and when no charge remains) (Approx.) Battery Rechargeable Li-ion Battery EN-EL19 Battery Life (shots per charge) Still pictures: Approx. 170 shots Tripod Socket 1/4\" - 20 Operating Environment Temperature: 0 to 40°C (32 to 104°F) Humidity: Less than 85% (no condensation) Dimensions (HxWxD) 3.9 x 2.3 x 1.0\" (99 x 58 x 25mm) Weight 5.7 oz (160g) WHO WE ARE Adorama is one of the nation's largest Photographic retail and mail order suppliers. For over 35 years we have been serving professionals as well as amateurs in the photographic, video, digital imaging and telescope fields. We offer the best combination of quality services, vast selection, knowledgeable staff, and competitive pricing. Adorama Camera is your #1 source for the best and newest products in the photographic industry, and the largest inventory of items such as Digital Cameras, Digital Camera Accessories, Memory Cards, 35mm Cameras, Medium Format Cameras, Lenses, Video Cameras, TV's, MP3 Players, Binoculars, Telescopes, Scanners, Inkjet, Dye-Sub & Laser Printers, Office Fax machines, Shredders, Projectors, Inkjet Paper, Photographic Accessories, Filters, Batteries, Cases, Tripods, Flashes, Lighting & Studio Equipment, Film, Darkroom Products and Audio Video Equipment. All new equipment comes with all of the factory included accessories, including a full manufacturer's warranty, unless otherwise noted. We only post items that are in-stock and ready to ship. PAYMENT Paypal is our only method of payment. Your Paypal account must be a Verified US Paypal account. Selecting \"Immediate Pay\" is the way to go. If you select eCheck, it may take 2-8 days to clear Paypal. In an effort to comply with our Authorized Dealer contracts with the manufacturers and to best control our inventory levels we reserve the right to limit quantities or cancel orders to Resellers and Exporters. Please note: Inventory is not reserved until the item is paid for. Please include a phone number as UPS and our Trucking Companies require it. We prefer to ship to a confirmed Paypal address and whether yes or no we may still contact you for additional verification. For shipments in New York and New Jersey, we are required to collect the appropriate sales tax. INTERNATIONAL International taxes and duties: International shipments may be subject to import fees, duties and taxes, which are levied once a shipment reaches the respective country, in addition to the brokerage fees/custom clearance charges which may be imposed by the carrier. These charges must be borne by the recipient. Adorama has no control over these charges and cannot predict what they might be. Orders shipped using eBays (GSP) \"Global Shipping Platform\" have already paid their taxes and must contact eBay directly for any issues. SHIPPING Most purchases are shipped with 24 Business Hours. Adorama's eBay store ships to the 48 Contiguous United States including Military APO & FPO and Puerto Rico. We now ship to Canada, parts of Europe and Australia. We do not ship to other International locations. Items with \"free shipping\" are only shipped free to the 48 contiguous United States. Combined shipping is available by placing all adoramacamera eBay orders BEFORE making the Payment. eBay's new checkout offers you to consolidate your orders to get better shipping rates. All orders must be shipped with a printed invoice included. We can not ship orders without the invoice or a lower value invoice. Gift Invoices can be sent if you call us immediately after payment is made (if during business hours). No guarantees for emails in this matter. Shipment errors due to a bad address entered by the buyer and will not be credited for shipping charges if returned or at all if lost or abandoned by the carrier. We supply tracking information directly to your eBay account as well as via email within 24 hours after the shipment leaves our warehouse. Please make sure that our email messages don't go into spam or junk. Change requests may not be updated on eBay, please check the emails. All TV's over 50 inches or other large items will ship via special Truck Delivery. An appointment will be made by the Trucking Company 24 hours before final delivery. Therefore, you must provide a phone number. Please read this carefully before purchasing any TV from us. All TV's 50 inches or larger will ship via special truck delivery only. An appointment will be made by the Trucking Company 24 hours before final delivery. LCD, LED and Plasma TVs as well as Monitors from 20\" and above can not be returned unless damaged in transit. At time of arrival If your TV arrives by UPS or FedEx: Please inspect the box from the outside for visible damage. If the box is not in perfect condition you should refuse it. Once you sign for it or open the box, you can not claim in-transit damage. If the box looks fine, you can then sign for it & open the box for further inspection after the carrier/driver leaves. You should check your TV ASAP to make sure that it works fine. If there are any problems, please let us know. If your TV arrives by special truck delivery: Please inspect the TV for both, external damage AND make sure that it powers up before you sign for it. If there's any external damage to the box, or it doesn't power on, do not accept it or sign for it. (According to the trucking company rules, you need to test the TV at the closest power outlet to the door. They are not required to wait until you put the TV in its intended place or till you test the cable connections). After the truck leaves, you should further test the TV to make sure everything works perfectly. If there are any problems, please let us know. Damage claims must be reported within 24 hours of receipt. Returns Please click here for our FULL RETURN POLICY For the first 30 days from date of receipt of your purchase you may return the merchandise for a full money back refund, excluding any shipping charges (for items which we offer free shipping, our standard shipping charges will be deducted from any refund or credit). Returned or exchanged products must be in brand-new, mint condition. Items must be in the original, undamaged manufacturer's packaging with all packaging materials, including instruction booklets, packing inserts, and the blank warranty cards. Memory cards and any other Blister Pack items are not returnable once opened. Any merchandise missing the original Universal Product Code (UPC) cannot be returned. The manufacturer's labeled packaging must be enclosed within an additional shipping carton. Please do not place stickers or shipping labels on the original manufacturer's package. Printers, Desktop Computers, Laptops, Tablets & Notebooks are not returnable once they are booted up or the toner is installed, as per the manufacturers contracts, all service to be done through them directly. Please ship your parcel back to Adorama freight prepaid and Insured. Sorry, Adorama cannot accept COD or freight-collect shipments. Return shipping cost (the cost to send an item back to our store) is not reimbursable. Please enclose a copy of your invoice with your return and tell us whether you would like the item to be replaced, exchanged, or refunded. Returns can take up to 8 days in-house from the date we receive it to process. When returning an item, please make sure you use a shipper which provides you with Insurance and a tracking number. Items returned without a tracking number might take much longer to be processed. We do not require a RMA. Returns should be shipped to: ACC Order processing 7 Slater Drive Elizabeth, NJ 07206 If you live in New York you may bring the return to our Manhattan store for exchange or refund. Warranty Information Most products have the warranty length listed in the description. To obtain a free copy of the manufacturers warranty details for any product we carry, please write to us and be sure to include the Brand Name and Model Number. Adorama Camera, Inc. Warranty Requests 42 West 18th Street New York, NY 10011 Contact Us Got a question? click here Product Information: 800-223-2500 Customer Service: 888-209-5772 HOURS OF OPERATION Mon-Thurs: 9:00am - 5:00pm Friday: 9:00am - 12:00pm On Sep-28-14 at 05:55:49 PDT, seller added the following information: Protect It Now with a Consumer Priority Service Extended Warranty",
    "exposurecompensation": "± 2 EV in steps of 1/3",
    "builtinflash": "Yes",
    "imagesensor": "CMOS",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "exposuremodes": "Scene auto selector, Scene, Special Effects, Smat Portrait, Auto Mode",
    "continuousshootingoptions": "Single, Continuous H, Continuous L Best Shot Selector, Multi-shot 16, Pre-shooting cache, 120 Continuous H, 60 Continuous H",
    "whitebalance": "Auto - Daylight - Incandescent - Fluorescent - Cloudy - Flash - Preset WB -",
    "shutter": "Mechanical and CMOS electronic shutter",
    "digitalzoom": "Digital Zoom Up to 4x (angle of view equivalent to that of approx. 1200mm lens in 35mm [135] format)",
    "builtinflashcontrol": "TTL auto flash with monitor preflashes",
    "operatingenvironment": "Temperature: 0 to 40°C (32 to 104°F) Humidity: Less than 85% (no condensation)",
    "effectivepixels": "16 million",
    "exposuremetering": "Matrix, center-weighted (digital zoom less than 2×), spot (digital zoom 2× or more)",
    "builtinflashrange": "[W]: 0.5 to 4.0m (1ft. 8in. to 13ft.) [T]: 1.2 to 2.0m (3ft. 8 in. to 6 ft. 6 in.)",
    "vibrationreduction": "Lens shift (still pictures) Lens shift and electronic VR (movies)"
}