{
    "exposurecontrolsystem": "P) Program AE (Program Shift is possible), (S) Shutter Speed Manual Priority AE, (A) Aperture Priority AE, (M) Manual",
    "warranty": "Sigma warranty",
    "autobracketing": "Appropriate, under, over; 1/3EV steps up to ±3EV for appropriate exposure",
    "weight": "395g/13.9oz (without battery and memory card)",
    "isosensitivity": "ISO100-ISO6400 (1/3 steps for appropriate sensitivity), AUTO: High limit, low limit setting is possible between ISO100~ISO6400. When using with flash, it changes depending on the low limit setting.",
    "afpointselection": "9 points select mode, Free move mode (It is possible to change the size of Focus Frame to Spot, Regular and Large.) Face Detection AF mode",
    "manualfocus": "Focus Ring Type",
    "category": "camera",
    "dimensions": "161.4mm/6.4\"(W), 67mm/2.6\"(H), 81.6mm/3.2\"(D)",
    "batterylife": "Approx. 250 shots (25 degree)",
    "shootingrange": "28cm~8, LIMIT Mode (It is possible to choose Macro, Portrait and Scenery.)",
    "power": "Li-ion Battery Pack BP-51, Battery Charger BC-51, AC Adapter SAC-6 (with DC Connector CN-21) (Optional)",
    "drivemodes": "Single, Continuous, Self Timer (2sec. /10sec.) Interval timer",
    "autofocustype": "Contrast Detection Type",
    "colormode": "11 types (Standard, Vivid, Neutral, Portrait, Landscape, Cinema, Sunset Red, Forest Green, FOV Classic Blue, FOV Classic Yellow, Monochrome)",
    "aelock": "AE lock button",
    "monitorsize": "3.0\"",
    "format": "Foveon X3 Direct Image Sensor (CMOS)",
    "focallength": "30mm F2.8 (35mm equivalent focal length:45mm)",
    "numberofpixels": "Effective Pixels: Approx.29MP Total Pixels: Approx.33MP",
    "interfaces": "USB, Cable Release Switch",
    "lensconstruction": "6 Groups 8 Elements",
    "focuslock": "Shutter release halfway-down position (AF lock can be done by AE lock button from menu setting)",
    "maximummagnificationshooting": "1:7.6",
    "imagesensorsize": "23.5×15.7mm",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "storagemedia": "SD Card, SDHC Card, SDXC Card",
    "aspectratio": "21:9, 16:9, 3:2, 4:3, 1:1",
    "lcdmonitorlanguage": "English/ Japanese/ German/ French/ Spanish/Italian/ Chinese (Simplified)/ Chinese (Traditional)/ Korean/ Russian/ Nederlands/ Polski/ Portugus/ Dansk/ Svenska/",
    "storecategoriesstorehomeentertainmentcentertelevisions": "1.888.209.5772 About me Contact Us Shipping Payments FAQ Sigma dp-2 Quattro Digital Point  Shoot Camera, 29MP Foveon X3 Quattro CMOS Image Sensor 19.6 Megapixel with FOVEON X3 Direct Image Sensor, Fixed 30mm f/2.8 Lens, RAW Image Capture SKU: SGDP2Q Mfr. Part: C81900 Item Includes Sigma DP-2 Quattro Digital Point & Shoot Camera - Li-ion Battery BP-51 - Battery Charger BC-51 - Lens Cap - Neck Strap - Soft Case - Hot Shoe Cover - USB Cable - Sigma Warranty Description Sigma dp-2 Quattro incorporates a newly developed Foveon X3 direct image sensor. Unique and without peer among image sensors, the Foveon direct image sensor is similar to traditional color film in that its multiple layers capture all of the information that visible light transmits. Along with Sigma's proprietary image processing technology, this sensor produces incredible resolution, precise gradation, gorgeous color, breathtaking realism with a 3D feel. In other words, full-bodied image quality. For the new dp series, we rethought and redesigned every aspect of the camera, including the sensor, engine, lens, and body. While retaining its famous textural expression, which seems to give form to the air itself, the updated Foveon direct image sensor produces images that are more colorful, rich, deep, and faithful than ever before. To a radical degree, the new-generation dp series embodies Sigma's philosophy of creating cameras that produce works of art. Featuring the highest level of fundamental performance, this series unites artistic expression and daily experience as no other cameras can. Thanks to its optimized design featuring a fixed focal length lens and integrated body, the dp series offers both sensor and lens performance at the highest level. The result is full-bodied image quality. In addition to superior holding performance, the camera body offers a balanced shape, layout, and weight distribution. With all of its elements designed for image quality, the dp offers highly intuitive operation. Its complete and robust specification allows the photographer to concentrate fully on photography itself and leverage the camera's potential to produce outstanding images. In everyday life, the dp series lets photographers find unexpected opportunities for experiencing emotion and enjoy photography and personal expression in exciting new ways. It is an outwardly simple yet extremely powerful embodiment of Sigma's philosophy of photography. The world's only image capture system to use vertical color separation technology Starting with our very first digital camera, we have featured the Foveon direct image sensor, which offers radically better image quality than any other sensor available. Leveraging the light absorption characteristics of silicon, the sensor comprises three layers of photodiodes, each at a different depth within the silicon and each corresponding to a different RGB color. Since it is the only sensor to use this superior vertical color separation technology, it is also the world's only direct image sensor. Almost all other image sensors are mosaic sensors, which use an array of RGB color filters in a single horizontal plane to capture color information. Each pixel is assigned only one of the three colors and cannot capture all three colors at once. In contrast, the Foveon direct image sensor captures color vertically, recording hue, value, and chroma accurately and completely for each pixel. In the Foveon direct image sensor, there are no color filters, which cause a loss of information transmitted by light. Moreover, there is no low-pass filter needed to correct the interference caused by a color filter array. Finally, unlike the data from other sensors, which requires artificial interpolation to \"fill in\" missing colors, the data from the Foveon direct image sensor is complete for every single pixel and requires no interpolation. The unique technological principle of this sensor produces consistently outstanding image quality. Newly developed Foveon X3 Quattro direct image sensor Now featuring 39 megapixel-equivalent ultrahigh resolution Capturing the information transmitted by light vertically instead of horizontally, the full-color image capture system of the Foveon direct image sensor is the only one of its kind in the world. This system makes possible the sensor's full-bodied image quality, which is characterized by rich tone and gradation and texture that one can almost touch. The newly developed Foveon X3 Quattro is the latest generation of this unique sensor. While retaining the distinctive characteristics of its predecessors, it offers an even higher level of image quality. In addition to 30% higher resolution, the volume of image data has become lighter, and it enables much faster image processing and lower current consumption. At the same time, Able to maintain the same exacting standard of image quality while increasing megapixels and enhancing noise characteristics, this 1:1:4 solution was the inspiration for the name of the current generation of Foveon sensor: \"Quattro.\" Newly developed TRUE III image processing engine Optimized for processing Foveon X3 Quattro direct image sensor data The new dp series cameras feature the newly developed TRUE (Three-layer Responsive Ultimate Engine) III. This image processing engine has evolved in pace with our Foveon direct image sensor and incorporates all of the image processing expertise we have developed over the years. Thanks to new refinements, it is the ideal engine for processing the rich and complex image data produced by the new-generation Foveon X3 Quattro direct image sensor. Our proprietary algorithm makes possible ultrafast processing of an immense volume of image data without any deterioration of the final images. The result is high-definition, 3D-like photographs with outstandingly rich color detail. Specifications Format Foveon X3 Direct Image Sensor (CMOS) Image Sensor Size 23.5×15.7mm Number of Pixels Effective Pixels: Approx.29MP Total Pixels: Approx.33MP Color Photo Detectors T (Top):5,424×3,616 / M (Middle):2,712×1,808 / B (Bottom):2,712×1,808 Focal Length 30mm F2.8 (35mm equivalent focal length:45mm) Lens Construction 6 Groups 8 Elements Shooting Range 28cm~8, LIMIT Mode (It is possible to choose Macro, Portrait and Scenery.) Maximum Magnification Shooting 1:7.6 Storage Media SD Card, SDHC Card, SDXC Card File Format Lossless compression RAW data (14-bit), JPEG (Exif2.3), RAW+JPEG JPEG Image Quality FINE, NORMAL, BASIC Aspect Ratio 21:9, 16:9, 3:2, 4:3, 1:1 White Balance 10 types (Auto, Auto (Lighting Source Priority), Daylight, Shade, Overcast, Incandescent, Fluorescent, Color Temperature, Flash, Custom) ISO Sensitivity ISO100-ISO6400 (1/3 steps for appropriate sensitivity), AUTO: High limit, low limit setting is possible between ISO100~ISO6400. When using with flash, it changes depending on the low limit setting. Color Mode 11 types (Standard, Vivid, Neutral, Portrait, Landscape, Cinema, Sunset Red, Forest Green, FOV Classic Blue, FOV Classic Yellow, Monochrome) Auto Focus Type Contrast Detection Type AF Point Selection 9 points select mode, Free move mode (It is possible to change the size of Focus Frame to Spot, Regular and Large.) Face Detection AF mode Focus Lock Shutter release halfway-down position (AF lock can be done by AE lock button from menu setting) Manual Focus Focus Ring Type Metering Systems Evaluative Metering, Center-Weighted Average Metering, Spot Metering Exposure Control System P) Program AE (Program Shift is possible), (S) Shutter Speed Manual Priority AE, (A) Aperture Priority AE, (M) Manual Exposure Compensation 1/3 EV Steps up to±3EV for Appropriate Exposure AE Lock AE lock button Auto Bracketing Appropriate, under, over; 1/3EV steps up to ±3EV for appropriate exposure Shutter Speedsh 1/2000* - 30sec. (*Depending on the aperture value, shutter speed changes) Drive Modes Single, Continuous, Self Timer (2sec. /10sec.) Interval timer LCD Monitor Type TFT color LCD monitor Monitor Size 3.0\" LCD Pixels Approx. 920,000 Pixels LCD Monitor Language English/ Japanese/ German/ French/ Spanish/Italian/ Chinese (Simplified)/ Chinese (Traditional)/ Korean/ Russian/ Nederlands/ Polski/ Portugus/ Dansk/ Svenska/ Interfaces USB, Cable Release Switch Power Li-ion Battery Pack BP-51, Battery Charger BC-51, AC Adapter SAC-6 (with DC Connector CN-21) (Optional) Battery Life Approx. 250 shots (25 degree) Dimensions 161.4mm/6.4\"(W), 67mm/2.6\"(H), 81.6mm/3.2\"(D) Weight 395g/13.9oz (without battery and memory card) Warranty Sigma warranty WHO WE ARE Adorama is one of the nation's largest Photographic retail and mail order suppliers. For over 35 years we have been serving professionals as well as amateurs in the photographic, video, digital imaging and telescope fields. We offer the best combination of quality services, vast selection, knowledgeable staff, and competitive pricing. Adorama Camera is your #1 source for the best and newest products in the photographic industry, and the largest inventory of items such as Digital Cameras, Digital Camera Accessories, Memory Cards, 35mm Cameras, Medium Format Cameras, Lenses, Video Cameras, TV's, MP3 Players, Binoculars, Telescopes, Scanners, Inkjet, Dye-Sub & Laser Printers, Office Fax machines, Shredders, Projectors, Inkjet Paper, Photographic Accessories, Filters, Batteries, Cases, Tripods, Flashes, Lighting & Studio Equipment, Film, Darkroom Products and Audio Video Equipment. All new equipment comes with all of the factory included accessories, including a full manufacturer's warranty, unless otherwise noted. We only post items that are in-stock and ready to ship. PAYMENT Paypal is our only method of payment. Your Paypal account must be a Verified US Paypal account. Selecting \"Immediate Pay\" is the way to go. If you select eCheck, it may take 2-8 days to clear Paypal. In an effort to comply with our Authorized Dealer contracts with the manufacturers and to best control our inventory levels we reserve the right to limit quantities or cancel orders to Resellers and Exporters. Please note: Inventory is not reserved until the item is paid for. Please include a phone number as UPS and our Trucking Companies require it. We prefer to ship to a confirmed Paypal address and whether yes or no we may still contact you for additional verification. For shipments in New York and New Jersey, we are required to collect the appropriate sales tax. INTERNATIONAL International taxes and duties: International shipments may be subject to import fees, duties and taxes, which are levied once a shipment reaches the respective country, in addition to the brokerage fees/custom clearance charges which may be imposed by the carrier. These charges must be borne by the recipient. Adorama has no control over these charges and cannot predict what they might be. Orders shipped using eBays (GSP) \"Global Shipping Platform\" have already paid their taxes and must contact eBay directly for any issues. SHIPPING Most purchases are shipped with 24 Business Hours. Adorama's eBay store ships to the 48 Contiguous United States including Military APO & FPO and Puerto Rico. We now ship to Canada, parts of Europe and Australia. We do not ship to other International locations. Items with \"free shipping\" are only shipped free to the 48 contiguous United States. Combined shipping is available by placing all adoramacamera eBay orders BEFORE making the Payment. eBay's new checkout offers you to consolidate your orders to get better shipping rates. All orders must be shipped with a printed invoice included. We can not ship orders without the invoice or a lower value invoice. Gift Invoices can be sent if you call us immediately after payment is made (if during business hours). No guarantees for emails in this matter. Shipment errors due to a bad address entered by the buyer and will not be credited for shipping charges if returned or at all if lost or abandoned by the carrier. We supply tracking information directly to your eBay account as well as via email within 24 hours after the shipment leaves our warehouse. Please make sure that our email messages don't go into spam or junk. Change requests may not be updated on eBay, please check the emails. All TV's over 50 inches or other large items will ship via special Truck Delivery. An appointment will be made by the Trucking Company 24 hours before final delivery. Therefore, you must provide a phone number. Please read this carefully before purchasing any TV from us. All TV's 50 inches or larger will ship via special truck delivery only. An appointment will be made by the Trucking Company 24 hours before final delivery. LCD, LED and Plasma TVs as well as Monitors from 20\" and above can not be returned unless damaged in transit. At time of arrival If your TV arrives by UPS or FedEx: Please inspect the box from the outside for visible damage. If the box is not in perfect condition you should refuse it. Once you sign for it or open the box, you can not claim in-transit damage. If the box looks fine, you can then sign for it & open the box for further inspection after the carrier/driver leaves. You should check your TV ASAP to make sure that it works fine. If there are any problems, please let us know. If your TV arrives by special truck delivery: Please inspect the TV for both, external damage AND make sure that it powers up before you sign for it. If there's any external damage to the box, or it doesn't power on, do not accept it or sign for it. (According to the trucking company rules, you need to test the TV at the closest power outlet to the door. They are not required to wait until you put the TV in its intended place or till you test the cable connections). After the truck leaves, you should further test the TV to make sure everything works perfectly. If there are any problems, please let us know. Damage claims must be reported within 24 hours of receipt. Returns Please click here for our FULL RETURN POLICY For the first 30 days from date of receipt of your purchase you may return the merchandise for a full money back refund, excluding any shipping charges (for items which we offer free shipping, our standard shipping charges will be deducted from any refund or credit). Returned or exchanged products must be in brand-new, mint condition. Items must be in the original, undamaged manufacturer's packaging with all packaging materials, including instruction booklets, packing inserts, and the blank warranty cards. Memory cards and any other Blister Pack items are not returnable once opened. Any merchandise missing the original Universal Product Code (UPC) cannot be returned. The manufacturer's labeled packaging must be enclosed within an additional shipping carton. Please do not place stickers or shipping labels on the original manufacturer's package. Printers, Desktop Computers, Laptops, Tablets & Notebooks are not returnable once they are booted up or the toner is installed, as per the manufacturers contracts, all service to be done through them directly. Please ship your parcel back to Adorama freight prepaid and Insured. Sorry, Adorama cannot accept COD or freight-collect shipments. Return shipping cost (the cost to send an item back to our store) is not reimbursable. Please enclose a copy of your invoice with your return and tell us whether you would like the item to be replaced, exchanged, or refunded. Returns can take up to 8 days in-house from the date we receive it to process. When returning an item, please make sure you use a shipper which provides you with Insurance and a tracking number. Items returned without a tracking number might take much longer to be processed. We do not require a RMA. Returns should be shipped to: ACC Order processing 7 Slater Drive Elizabeth, NJ 07206 If you live in New York you may bring the return to our Manhattan store for exchange or refund. Warranty Information Most products have the warranty length listed in the description. To obtain a free copy of the manufacturers warranty details for any product we carry, please write to us and be sure to include the Brand Name and Model Number. Adorama Camera, Inc. Warranty Requests 42 West 18th Street New York, NY 10011 Contact Us Got a question? click here Product Information: 800-223-2500 Customer Service: 888-209-5772 HOURS OF OPERATION Mon-Thurs: 9:00am - 5:00pm Friday: 9:00am - 12:00pm On Sep-29-14 at 00:43:02 PDT, seller added the following information: Protect It Now with a Consumer Priority Service Extended Warranty",
    "exposurecompensation": "1/3 EV Steps up to±3EV for Appropriate Exposure",
    "fileformat": "Lossless compression RAW data (14-bit), JPEG (Exif2.3), RAW+JPEG",
    "meteringsystems": "Evaluative Metering, Center-Weighted Average Metering, Spot Metering",
    "lcdmonitortype": "TFT color LCD monitor",
    "lcdpixels": "Approx. 920,000 Pixels",
    "whitebalance": "10 types (Auto, Auto (Lighting Source Priority), Daylight, Shade, Overcast, Incandescent, Fluorescent, Color Temperature, Flash, Custom)"
}