{
    "externalflashconnection": "Hot Shoe",
    "shutterlag": "0.075 Seconds",
    "exposurecontrol": "Auto: Shutter Speed, Aperture, ISO Manual: Shutter Speed, Aperture, ISO",
    "weight": "7.23 oz (205 g)",
    "battery": "1x  LP-E8  Rechargeable Lithium-Ion Battery Pack",
    "exposuremodes": "Modes: Aperture Priority, Auto, Flash Off, Manual, Programmed Auto, Shutter Priority Metering Range: EV 1.0 - EV 20.0 Compensation: -5 EV to +5 EV (in 1/3 or 1/2 EV steps)",
    "isosensitivity": "Auto, 100 - 6400, Expandable to 12800",
    "focus": "Auto Manual Continuous Auto",
    "memorycardtype": "SD SDHC SDXC",
    "leftbardescstart": "Left Bar Desc //End !Right Bar Desc //Start !Canon Rebel T5i 700D + 18-55 + 75-300 + 4 Lens Kit + 16GB + Flash +Battery +Case Click an Image to Enlarge This item is 100% brand new. USA product sealed in original box & includes full USA warranty. 2 Lens Kit - Canon EF-S 18-55mm IS STM Lens & Canon 75-300mm f/4.0-5.6 III Lens 58MM Professional HD 2x telephoto lens  With Free Carry Case 58mm 45x Wide-Angle Digital High Definition Lens w/ Macro 3 Piece Multi Coated Quailty Filter Kit 16 GB Secure Digital (SD) Memory Card High Speed External USB All in One Memory Card Reader & Writer SD SDHC CF MS XD Extra Battery Extra Charger Deluxe Soft Medium SLR Camera Case / Bag fit Canon EOS, Nikon, Sony Alpha Camera Multi Memory Card Wallet Digital Auto Slave Flash with Bracket Full Size 50-inch Tripod With Leveler 360 adjust & Carryng Case for SLR Cameras Mini Flexible Taple Top Travel Tripod  with Pocket clip Lens Cap Keeper Deluxe Screen Protector Pro Pack (Clear ) Deluxe Camera , Screen & Lens 5pc cleaning Kit 58mm Glass Multi Coated UV Filter The EOS Rebel T5i DSLR Camera with EF-S 18-55mm f/3.5-5.6 IS STM Lens from Canon is an APS-C format digital SLR camera with an 18MP CMOS sensor and the DIGIC 5 image processor. It is combined with the EF-S 18-55mm f/3.5-5.6 IS STM lens for an effective range of wide-angle to standard focal length. With 14-bit Analog/Digital conversion, an ISO range from 100-12800 (expandable to 25600) and Multi Shot Noise Reduction, the Rebel T5i offers sharp details, accurate colors and low-noise imaging in both bright and low-light shooting situations. Its 9-point all cross-type autofocus system provides fast focusing when shooting with the viewfinder, and Hybrid CMOS AF increases autofocus speeds when shooting in Live View. The Rebel T5i can continuously shoot up to 5 fps. A 3.0\" Clear View II Vari-angle Touchscreen LCD with 1,040k-dot resolution provides composition and playback viewing. Its tilt and swivel capability makes it easy to compose your shots at odd angles, and a smudge-resistant coating keeps the monitor clear. Intuitive touchscreen operation includes Touch Autofocus. Full HD 1080p at 30 fps and 24 fps is supported with Movie Servo for continuous autofocus during shooting. Manual exposure is provided in video mode and 60 fps is possible when shooting at 720p HD. A built-in stereo microphone with manual audio level adjustment is provided for quality audio recording with your videos. Scene Intelligent Auto Mode automatically makes the optimal camera adjustments based on scene recognition and improved scene detection is particularly helpful when shooting night scenes. Advanced imaging features such as Handheld Night Scene and HDR Backlight Control make capturing difficult shots easy, and seven Creative Filters add expressive touches to your images and can even be viewed in real time during Live View shooting. The EOS Rebel T5i is compatible with the full line of Canon EF and EF-S lenses. It is paired here with the EF-S 18-55mm f/3.5-5.6 IS STM lens, which offers wide-angle to standard focal length shooting specifically designed for APS-C cameras. It is equivalent to a 28.8-88mm focal length in the 35mm format, and its minimum focus distance is 9.8\". This lens features Canon's Optical Image Stabilization system, providing 4-stops of compensation for blur caused by slow shutter speeds when shooting hand-held in low light or at longer focal lengths. An internal focusing system provides fast autofocus, and with a Stepping Motor (STM) and six-group zoom system it supports the Rebel T5i's Movie Servo AF feature for smooth and quiet continuous autofocus during video recording. Manual focus override is possible. A high precision aspherical element reduces chromatic aberration throughout the zoom range for sharp imaging, and Canon lens coatings provide accurate color balance and minimal ghosting and flare. 18MP CMOS Sensor and DIGIC 5 Image Processor High resolution, low-noise imaging and fast performance speed,     including 5 fps continuous shooting, is provided by the combination of     the Canon DIGIC 5 Image Processor and 18MP CMOS sensor. 3.0\" Vari-angle Touchscreen LCD Monitor A 3.0\" Clear View II Vari-angle Touchscreen LCD monitor with     1,040k-dot resolution provides clear composition and playback viewing     even in bright light. Its tilt and swivel capability makes shooting at     odd angles easy, and a smudge-resistant coating keeps the monitor clear.     Seven-level brightness control is available. Intuitive touchscreen     control makes menu control simple, and even offers Touch Autofocus. Full HD 1080 Video Capture Full HD Movie mode supports Movie Servo for continuous focus     tracking of moving subjects during recording. Manual exposure control     and a built-in stereo microphone with manual audio level adjustment     provide high-quality control over your shooting, and multiple frame     rates and resolutions provide quality-level and stylistic shooting     options. The ISO range in Video mode is 100-6400, and is expandable to     12800. Stills can be recorded during video shooting simply by pressing     the camera's shutter button. 14-bit A/D Conversion With 14-bit analog-to-digital conversion, the EOS Rebel T5i     captures and records images with subtle tonal gradations and details     resulting in more realistic and color-accurate images. By recording up     to 16,384 colors per channel, the EOS Rebel T5i ensures that the fine     details are recorded with accuracy. ISO Range - Stills An ISO Range of 100-12800 (expandable to 25600) provides     low-noise capture in low light situations and saturated colors in bright     conditions. 9-point Autofocus System A 9-point all cross-type AF system (including a high-precision     dual-cross f/2.8 center point) provides fast and accurate autofocus     performance when shooting with the viewfinder. Hybrid CMOS AF The Hybrid CMOS AF System is utilized when shooting photos and     video in Live View. Combining two different kinds of AF-phase and     contrast detection-continuous focus tracking becomes faster and more     accurate than ever before in Live View. EF-S 18-55mm f/3.5-5.6 IS STM Lens The EF-S 18-55mm f/3.5-5.6 IS STM lens offers wide-angle to     standard length shooting capability specifically designed for APS-C     cameras. It is equivalent to a 28.8-88mm focal length in the 35mm format     and its minimum focus distance is 9.8\". This lens features Canon's     Optical Image Stabilization system, providing four stops of compensation     against the blur caused by slow shutter speeds when shooting hand-held     in low light or at longer focal lengths. An internal focusing system     provides fast autofocus and with a Stepping Motor (STM) and six-group     zoom system it supports the Rebel T5i's Movie Servo AF feature for     smooth and quiet continuous autofocus during video recording. Manual     focus override is possible. A high precision aspherical lens reduces     chromatic aberration throughout the zoom range for sharp imaging and     Canon lens coatings provide accurate color balance and minimal ghosting     and flare. Lens Compatibility The Canon Rebel T5i is compatible with all EF and EF-S lenses. Continuous Shooting The Rebel T5i offers continuous shooting rates up to 5 fps at full resolution. Multi Shot Noise Reduction Multi Shot Noise Reduction provides outstanding noise reduction while preserving exacting detail at high ISO speeds. Scene Intelligent Auto Scene Intelligent Auto mode incorporates a number of Canon     technologies to deliver the best possible exposure. Joining Picture     Style Auto, Automatic Lighting Optimizer, Automatic White Balance,     Autofocus, and Automatic Exposure, Scene Intelligent Auto mode analyzes     the image, accounting for faces, colors, brightness, moving objects,     contrast, even whether the camera is handheld or on a tripod, and then     chooses the exposure and enhancements that bring out the best in any     scene or situation. Advanced Image Features Handheld Night Scene mode makes it easy to shoot difficult night     scenes without blur. By shooting and combining four consecutive shots     at a shutter speed fast enough to avoid camera shake, Handheld Night     Scene mode makes dramatic nighttime photography simple. HDR Backlight     Control shoots three images of the same scene at differing exposures,     and combines them for one expertly balanced image. Scene Mode Position Newly featured on the EOS Rebel T5i, the SCN setting on the Mode     dial activates a choice of scenes on the menu screen for quick access     to features like Night Portrait, HDR Backlight Control, Handheld Night     Scene and more. Memory Compatible with SD/SDHC/SDXC memory cards, including Ultra High Speed (UHS-I) cards. Lens Aberration Correction The EOS Rebel T5i features lens correction tools that compensate     for lens characteristics that can affect overall image quality. The EOS     Rebel T5i's Peripheral Illumination Correction feature corrects light     falloff in the corner of the image according to the characteristics of     the lens being used. It even has correction data for a number of popular     lenses stored in its memory. With the EOS Rebel T5i's chromatic     aberration correction tool, distracting color fringing can be corrected     at the time of shooting. Creative Filters Seven Creative Filters add expressive touches to your images and     can be seen in real time when shooting in Live View. Creative Filters     include Grainy Black and White, Soft Focus, Fisheye Effect, Toy Camera     Effect, Miniature Effect, Art Bold Effect and Water Painting Effect.     Each effect can be applied in three different levels (low, standard and     strong). GPS Compatible With the optional GP-E2 GPS Receiver attached to the hot shoe or     the digital terminal, the EOS Rebel T5i can record location, including     latitude, longitude and altitude, and has the ability to track the     trajectory of movement with its logging function. An electronic compass     records the camera's orientation during each shot, and world time     information is recorded through GPS synching. Photobook Set-up Photographers can share their images in book form with the EOS     Rebel T5i's convenient Photobook Set-up feature. Users can easily choose     specific images, images in a folder and even all images, then specify     their sequence and layout. The results can be printed in book form with     ease. Languages Supported English, German, French, Dutch, Danish, Portuguese, Finnish,     Italian, Norwegian, Swedish, Spanish, Greek, Russian, Polish, Czech,     Hungarian, Romanian, Ukrainian, Turkish, Arabic, Thai,     Simplified/Traditional Chinese, Korean, Japanese Playback Display Single Image, Index Display (4, 9, 36, 100 images), Jump Display     (1/10/100 images, by date, by folder, movies only, stills only, by     rating) Imaging Lens Mount Canon EF-S Camera Format Canon APS-C (1.6x Crop Factor) Pixels Actual: 18.5 Megapixel Effective: 18 Megapixel Max Resolution 17.9MP: 5184 x 3456 Aspect Ratio 3:2 Sensor Type / Size CMOS, 22.3 x 14.9 mm File Formats Still Images: JPEG, RAW Movies: MOV, MPEG-4 AVC/H.264 Audio: Linear PCM Bit Depth 14-bit Dust Reduction System Yes Memory Card Type SD SDHC SDXC Focus Control Focus Type Auto & Manual Focus Mode Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M) Autofocus Points 9 Viewfinder/Display Viewfinder Type Pentamirror, Optical Viewfinder Coverage 95% Viewfinder Magnification Approx. 0.87x Diopter Adjustment - 3 to +1 m Display Screen 3\" Rear Touchscreen Tilting Live Preview LCD (1,040,000) Screen Coverage 100% Exposure Control ISO Sensitivity Auto, 100-12800 (Extended Mode: 25600-) Shutter Type: Electronic & Mechanical Speed: 30 - 1/4000 sec Metering Method Average metering, Center-weighted average metering, Multi-zone metering, Partial Metering, Spot metering Exposure Modes Modes: Aperture Priority, Auto, Flash Off, Manual, Programmed Auto, Shutter Priority Metering Range: EV 1.0 - EV 20.0 Compensation: -5 EV to +5 EV (in 1/3 or 1/2 EV steps) White Balance Modes Auto, Cloudy, Custom, Daylight, Flash, Fluorescent (White), Shade, Sunset, Tungsten, Twilight Flash Built-in Flash Yes Flash Compensation -2 EV to +2 EV (in 1/3 or 1/2 EV steps) Dedicated Flash System eTTL Remote Firing External Flash Connection Hot Shoe AV Recording Video Recording Yes, NTSC/PAL File Size 1920 x 1080p (Full HD) 1280 x 720p (HD) 640 x 480p (SD) Frame Rate @ 1920 x 1080: 30 fps, 25 fps, 24 fps @ 1280 x 720: 60 fps, 50 fps @ 640 x 480: 30 fps, 25 fps Exposure Control Auto: Shutter Speed, Aperture, ISO Manual: Shutter Speed, Aperture, ISO ISO Sensitivity Auto, 100 - 6400, Expandable to 12800 Exposure Compensation -3 EV to +3 EV (in 1/3 EV steps) Focus Auto Manual Continuous Auto Video Clip Length 1920 x 1080 29.9 min. 1280 x 720 29.9 min. 640 x 480 29.9 min. Audio Recording Optional External Mic: With Video, Stereo Performance Continuous Shooting Up to 5 fps Shutter Lag 0.075 Seconds Self Timer 2 sec, 10 sec Connectivity AV Output HDMI C (Mini) USB 2.0 Power Battery 1x  LP-E8  Rechargeable Lithium-Ion Battery Pack AC Power Adapter ACK-E8 (Optional) Operating/Storage Temperature Operating 32 to 104°F (0 to 40°C) Humidity: 0 - 85% Physical Dimensions (WxHxD) 5.2 x 3.9 x 3.1\" / 13.2 x 9.9 x 7.9 cm Weight 18.52 oz / 525 g Body Only without battery and card Kit Lens Focal Length 18 - 55mm Comparable  35mm Focal Length: 28.8 - 88 mm Aperture Maximum: f/3.5 - 5.6 Angle of View 74° 20' - 27° 50' Minimum Focus Distance .82' (.25 m) Magnification 0.28x Elements/Groups 13/11 Autofocus Yes Image Stabilization Yes Filter Thread Front:58 mm Dimensions (DxL) Approx. 2.7 x 3.0\" (68.58 x 76.20 mm) Weight 7.23 oz (205 g) Canon EOS Rebel T5i DSLR Camera Canon EF-S 18-55mm f/3.5-5.6 IS STM Lens LP-E8 Rechargeable Lithium-Ion Battery Pack (7.2V, 1120mAh) LC-E8E Battery Charger Eyecup Ef for Digital Rebel Cameras R-F-3 Camera Cover Wide Strap EW-100DD IV For All EOS E-58 II 58mm Lens Cap Lens Dust Cap E (Rear) Interface Cable EOS Digital Solution Disk Limited 1-year Warranty Canon Zoom Telephoto EF 75-300mm f/4.0-5.6 III Autofocus Lens USA Canon EF-S 18-55mm f/3.5-5.6 IS STM Lens Canon EF-S 18-55mm f/3.5-5.6 IS STM Lens The EF-S 18-55mm f/3.5-5.6 IS STM Lens from Canon is a standard zoom compatible with Canon APS-C format cameras. It features a focal length range of 18-55mm (35mm equivalent: 28.8-88mm) and an Optical Image Stabilizer providing the equivalent of up to four stops of shake correction. A high-precision aspherical element reduces chromatic aberration throughout the zoom range for high resolution and contrast. The lens supports Canon's EOS Movie Servo AF feature for smooth and quiet continuous autofocusing during movie recording. This feature is enabled by the use of a six-group zoom system plus a stepping motor focusing mechanism. Additionally, manual focus adjustment is possible while shooting in AF mode, and an internal focusing system maintains an overall compact lens form-factor, enables faster performance, and allows for a closer minimum focusing distance of 0.82'. The front element of the lens does not rotate during focusing, allowing you to use polarizing filters without a problem. Optimized lens coatings ensure precise color balance while minimizing ghosting and flare, and the 7-blade circular diaphragm produces pleasing background blur. Canon Zoom Telephoto EF 75-300mm f/4.0-5.6 III Autofocus Lens Canon Zoom Telephoto EF 75-300mm f/4.0-5.6 III Autofocus Lens The lightest 4x telephoto zoom lens in its class. Ideal for sports, portraiture, animals, etc. The telephoto effect can make the picture look compressed or have excellent background blur. At the 300mm focal length, you can fill the frame with a postcard from 4.9' away. Professional HD 2x telephoto lens When your camera can't get you close enough to capture the action in detail, this 2x Telephoto lens will bring the action to you! Optically multiplying the focal length of your camera's lens by a factor of 2, it more than doubles your telephoto magnification and detail without any pixelization. This is dramatically better than the \"Digital Zoom\" feature of many cameras where the magnification is obtained by merely enlarging the existing image, resulting in a loss of sharpness. This 2x telephoto attachment is perfect for all your long-distance imaging including sports, candids, surveillance, nature and wildlife. You will also be able to utilize your camera's macro capability at over twice the usual distance, allowing for easier subject lighting with less shadows and intrusion.. 45x Wide-Angle Digital High Definition Lens with Maro When you've run out of room, and can't possibly fit anything else into the frame, this 0.45x Wide Angle adapter will allow you to capture it all! This attachment more than doubles your camera's wide angle field-of-view . Scenic shots will be more panoramic and you'll be able to take outstanding group photos, even in tight places. In addition, the detachable Macro Lens enables you to photograph small objects up close. Great for jewelry, coins, stamps, flowers, and more. Even if your camera already has macro capability, this macro lens will get you even closer for truly amazing close-up photos. Professional High Definition Special Element Frame Premium Rimmed Glass Infrared Compatible Include Protective Lens Case Digital Multi Coated 58mm Glass Filter Kit (UV-CPL-FLD) 3pc Filter kit The UV filter protects your camera's lens from scratches, dust,  dirt, moisture and fingerprints, while removing unwanted ultraviolet  light.The UV filter reduces blue haze caused by UV light by absorbing  71% of UV. The CPL filter deepens and  intensifies blue skies, achieves vibrant colors and reduces glare and  reflections from non-metallic objects & glass surfaces. Great for  video. The Fluorescent Light Correction Filter gives  you the prefect solution for shooting without a flash under a  fluorescent light.This filter gives true-to-life colors and pleasing  skin tones by removing the harsh yellow-green cast created by flouriest  lightning. Lens filter set is a must-have for photographers 58mm filters improve photographs by giving photographers control over light and allowing them to emphasize certain features Filter kit features UV, CPL, and FLD filters Set comes with hard carrying case and filters UV Protector Filter protected the lens from damage 16 GB Secure Digital (SD) Memory Card Get The Best SD Card for your product When getting an SD memory card there are hundreds of options for your item this can get confusing and costly  , When purchasing one of our handpicked memory cards for your item you receive a  Memory card at the highest quality. We go to every extent to handpick cards to provide  you as a bonus with your purchase that are not only guaranteed to work with your item but have the best performance with your item. This is a Onetime purchase that will help you capture a memory for a lifetime. Our memory card offers are High performance cards that are made reliable with long life spans  created to handle real life motions and real time transfers. There will be  no delay time in transferring information from your device to this card. Get Quality at the top of its class with  SD memory. High Speed USB  All  One Card Reader Access a multitude of memory cards with this USB 2.0 All-in-One card reader! This portable memory card reader supports the most popular memory cards such as Compact Flash I/II, Secure Digital, SD, Memory Stick, Micro Drive and Multimedia Card. Replacement For CANON LP-E8 Battery The LP-E8 Rechargeable Lithium-ion Battery Pack has a capacity of 1120mAh, making it possible to shoot many photographs with your Canon EOS Rebel T2i, T3i or T4i digital camera on a single battery charge. The battery is also compact and lightweight. There is no memory effect, so you can recharge partially drained batteries without reducing performance. Replacement for the original Canon LP-E8 battery pack Never run out of battery power when you're about to capture the perfect moment Output voltage: 7.2V Capacity: 1120mAh LP-E8 RECHARGEABLE BATTERY  CHARGER This LP-E8 Battery Charger for Canon EOS Rebel  is used to recharge your digital camera battery, it is quick charge with automatic constant current control, prevents battery from overcharging, short circuit, and electronic shock. The Battery Charger can used both for home, office and car.  A/C power supply input voltage: AC100V~240V NOTE: For a success and safe charge to your battery, please make         sure to line up the correct polarity (positive / negative) before         inserting the battery onto the charger This compact battery charger set for Canon LP-E8 is the complete charging solution for digital video batteries High quality battery charger is a handy companion for digital shooting Charger is designed with a foldable A/C plug that charges your camera / camcorder battery anywhere in the world Quick charge with automatic constant current control prevents battery from overcharging, short circuit, and electronic shock Smart LED indicator shows charging status Deluxe Medium Camera and Video Bag The Deluxe Medium Camera and Video Bag  is the perfect compliment to hold all of your equipment. It features a shock proof nylon material and is water resistant. It has 1 removable divider, rubber feet, shoulder strap and a handle grip. Easy access closure flap Mesh pockets for accessory storage compartment with interior   mesh pockets for spare batteries, flash-memory cards, diskettes,cords,   cables and more Shoulder strap/1 re moveable divider ,rubber feet, shoulder strap and a handle grip nylon material and is water resistant Dimensions: Size: 10.8 x 6.5 x 7.5 inches Multi Memory Card Wallet Donâ\u0080\u0099t lose your lifeâ\u0080\u0099s Memories Memory Cards are the Insert that holds your lifeâ\u0080\u0099s memoryâ\u0080\u0099s. A little card that easily lost but so important to you and your family. Always keep  your memory cards together at any cost. One lost card can lose decades of Memories. A memory card wallet is someplace for you to keep these memoryâ\u0080\u0099s together. Memory Card Wallet Keeps multiple memory cards protected and organized with this durable storage wallet. Sturdy memory card wallet case holds memory cards of any type securely, keeping them from contact with other accessories and makes them easily accessible in larger luggage bags. Features Memory Card Wallet Holds up to Multi  memory Cards (SD,CF,MS) 1 Year Limited Warranty Pro Digital Auto Slave Flash with Bracket for All SLR/DSLR Digital Camera & Camcorders Every photographer knows that a quality flash unit is an essential component to taking great pictures. Built-in flashes simply don't have enough power to properly illuminate most subjects, and typically produce harsh shadows, red-eye, and other undesirable effects. An external flash offers far more power and versatility , resulting in consistently better pictures! The Flash is a high-power flash unit that works seamlessly with a wide variety of camera models and provides exceptional light coverage , at a price that doesn't break the bank! The Flash features automatic exposure control , which syncs with your camera to provide just the right amount of light. The zoom function allows you to light subjects as far away as 50 feet , and the bounce head tilts and swivels to give you full creative control. Full Size 50-inch Tripod With Leveler  360 adjust & Case Want to relax and take time shooting ?  Not worry about your shots being leveled ?  adjust shots with a swivel instead of an adjustment ? If the answer to all these Questions are YES this is the item for you!! The 50-Inch Photo and Video tripod features a special carrying handle as well as a professional grip. With its  self leveling rubber leg tips  it offers a great floor grip for positioning and  built in bubble leveler to give you a leveled shot. Capability  for a 360 degree spin with its 3 way pan head doesn’t hurt for convenience. There are bracing sections to adjust Tripod size and an additional Bonus of Tripod case. What else can you ask for as a free bonus with your purchase. Features Extends to 50 Inch  and under Non slip handle Mid level bracing system for adjustable sizes Bubble leveler Tripod fitted case Compact Carry Size Mini Flexible Taple Top Travel Tripod  with Pocket clip We realized to take a quick snap shot anywhere with your camera is a hassle to keep the camera sturdy with a table top tripod you can pull it out instantly or leave attached to your product for that Quick Snap and Go picture. A focused leveled cameraâ\u0080\u0099s shot and a wobbled shot is a big difference. This handy little tripod also can keep you in the picture. Place your camera on the Tripod and use the camera's self-timer, or a remote shutter release and you are in the picture for a great crisp-sharp shot. It easy to use and it is small enough to be ideal for carry in travel. Featuring an adjustable head and hard Flexible legs, this Tripod is an ideal accessory for photographers on the run. This lightweight, yet durable tripod stands at a height of up to 5\". Perfect for most digital, video and still cameras . Features Fits all 35mm Digital and Video camera with Tripod Socket Sturdy Ultra Compact Convenient Pocket Clip Travel Sized Lens Cap Keeper Keep Your lens safe its one of the Eyes of your purchase: Its always the little things that we lose that are a pain to replace . Why go through the hassle we found the perfect solution. Your cameras lens is a vital part of the pathway that captures an image from external reality and stores it onto a memory card film device or other  Keeping this lens free of dust smudges and contact with other items is imperative. A Lens Cap holder as simple as it sounds is the solution. The  perfect way to keep track of your lens caps. A small button tapes onto the front of your lens cap and the elastic loop goes around the barrel of your lens so that your lens cap always remains attached, hanging from the lens. Lens caps can be pricey and hard to find  with this you will  Never lose a lens cap again ! Deluxe Screen Protector Pro Pack (Clear ) Be safe scratches arenâ\u0080\u0099t appealing . Save your screen it takes a second to apply and  will give you longer usage with your product Purchasing any item everyone always knows the LCD screen or glass screen is an imperative part of the electronic device always the first to get damaged. Easy solution for you !! Deluxe screen protectors are perfect for digital camera screens, cell phone screens and game player screens. screen protectors are included with  a squeegee to smooth them out and remove air bubbles. They can be cut down to size to fit any screen from 1\" to 5\". The extra clear layer on your device will not only protect it from Sun damage but will also protect from  Nail Scratches, finger smudges and many other contact damage to the screen point of your device. The Clear Quality Kit touch safes  your device. Universal Screen Guard The Greatest  Guarder for LCD Screens Multi 3pcs 3x5â\u0080\u0099â\u0080\u0099 Deluxe Screen Guard 1 Squeegee Card Deluxe Camera , Screen & Lens 5pc cleaning Kit Be clean Be Safe use something Approved for your product : It's obvious that the cleaner the lens and camera sensor, the sharper your pictures will be. Dirt, dust, and fingerprints will degrade the image quality of even the finest optics. However, it's equally important to avoid using incorrect cleaning materials which can permanently damage your photo equipment. The 5 Piece Camera and lens Cleaning Kit. consists of soft-texture fiber cloth, 5 cotton swabs, a bottle of cleaning fluid, soft lens tissue paper, and top quality blower brush. It easily fits in your camera bag so you can take it anywhere with you easily. It is perfect for an on-the-spot camera or lens cleaning and is approved by the manufacture to use with your item Screen Camera and Lens Cleaning kit Soft Texture Fiber Cloth Five Quality Cotton Swabs Top Quality cleaning Fluid Quality Blower and Brush Full Pack Lens Cleaning Tissue 58mm UV Filter The 58mm UV Protector Filter is a general use, clear filter that helps to absorb ultraviolet light and reduce the bluish cast of daylight. This filter is especially useful when photographing at high altitudes or around bodies of water. No additional coloration or contrast is provided, allowing you to pair this filter with others. The UV filter is also useful as a general protective filter to leave on lenses at all times. Filters help to reduce dust and moisture from reaching your lens element and provide additional protection in case of drops or situations where scratching could occur. UV  filters are made using Color Core technology; a process that involves laminating the filter substrate between 2 pieces of optical glass, grinding flat to a tolerance of 1/10,000th of an inch, then mounting to precision metal rings. What is Multi Coating Coating enhances light transmission, protects the surface of the filter and helps remove glare, particularly between the rear of a filter and the surface of the lens. Light transmission is proportional to layers of coating applied. Don't miss this fantastic opportunity to increase your equipment performance with this high definition filter lens. Absorbs some ultraviolet light and reduces bluish cast of daylight. Clear filter provides no additional coloration or contrast, allowing you to pair this filter with others. General protection filter reduces dust, moisture, and scratches from reaching lens elements UV Protector Filter protected the lens from damage CANON REBELT5I/18-55SKIT15 We usually ship within 1-2 business days after receiving payment. Please be aware that weekends are not business days. At our discretion; large or expensive packages may receive a free upgrade to FedEx Ground with signature confirmation.  If this applies to you, please assure that your address is able to receive FedEx packages & that an adult is available to sign for & accept the shipment. All express methods of shipment as long as verified take 1 business day to ship We ship everything professionally in our state of the art warehouse boxed and shipped with perfection. \"Free Shipping\" applies to orders shipped within the USA (48 states) We do not ship to APO or FPO address Orders shipping to PR/HI/AK Will have an additional shipping charge and a longer process time to ship order Credit Cards: We can only ship to addresses that are noted with your credit card account. We may contact you for additional verification after you check out. PayPal: We prefer to ship to confirmed addresses. We may contact you for additional verification for payments made by unconfirmed PayPal addresses. We do not accept PayPal payments from accounts outside the USA and Canada. · When necessary, we may contact you via Direct Message or telephone to obtain additional verification. We offer our customer's a 14 day return for replacement policy if item is defective other then that all sales are final . A Return Merchandise Authorization (RMA) number must be obtained for any return. To obtain an RMA number, please call us toll free at 877-254-6155 Returned packages without proper RMA demarcations will be refused by our warehouse and returned to you. Customers who refuse a delivery, will be subject to charges for return shipping to us. If the item was advertised as Free Shipping, then we will charge the amount of shipping as determined by Our Shipping Station . Defective Item An item that was discovered to be defective upon receipt can be replaced with the same model only. Return Shipping Return shipping cost (the cost to send an item back to our store) is like or comparable to your cost of driving to any store for returning an item, which is not reimbursable. Therefore, we do not reimburse any return shipping cost. If an item you received is defective, we will certainly replace the item with a new one, however we do not cover or reimburse the shipping cost for returning defective merchandise back to our store. We will ship the replacement product to you at our cost, and use every good measure to ensure that the replacement order is processed quickly. Replacement We will send a product replacement after the authorized return has completed our receiving/inspection process. The replacement will ship within four business days following our receipt of your return. Please allow additional processing time after Holidays. Although it is our goal to ship a replacement as quickly as possible, we do not send replacements before we receive and inspect the returned merchandise. All items are sold with Manufacture Warranty so there is another avenue for assistance. All returns must be packed with all contents which came with the original package including, cables, software, plastic and cardboard packaging, and unregistered warranty card. This return policy excludes Televisions, Home Theater Projectors or any Home audio Product . For further questions please call us toll free at 877-254-6155 We encourage any questions or concerns you may have for us, but we request that all communication be done through eBay messages only or over the phone. Our dedicated customer support team is available Monday-Friday 10AM - 6PM (EST) TOLL FREE: +1-877-254-6155 LOCAL: +1-908-967-5155 Click here to send us your email inquiry now through eBay messages.Right Bar Desc //End !",
    "imagestabilization": "Yes",
    "lensmount": "Canon EF-S",
    "viewfindermagnification": "Approx. 0.87x",
    "maxvideoresolution": "1920 x 1080",
    "category": "camera",
    "shutter": "Type: Electronic & Mechanical Speed: 30 - 1/4000 sec",
    "minimumfocusdistance": ".82' (.25 m)",
    "videorecording": "Yes, NTSC/PAL",
    "bitdepth": "14-bit",
    "operatingstoragetemperature": "Operating 32 to 104°F (0 to 40°C) Humidity: 0 - 85%",
    "lensforsd": "IS STM 18-55mm",
    "fileformats": "Still Images: JPEG, RAW Movies: MOV, MPEG-4 AVC/H.264 Audio: Linear PCM",
    "selftimer": "2 sec, 10 sec",
    "mpn": "8595B003",
    "magnification": "0.28x",
    "filesize": "1920 x 1080p (Full HD) 1280 x 720p (HD) 640 x 480p (SD)",
    "aperture": "Maximum: f/3.5 - 5.6",
    "dimensionswxhxd": "5.2 x 3.9 x 3.1\" / 13.2 x 9.9 x 7.9 cm",
    "autofocus": "Yes",
    "viewfindercoverage": "95%",
    "meteringmethod": "Average metering, Center-weighted average metering, Multi-zone metering, Partial Metering, Spot metering",
    "audiorecording": "Optional External Mic: With Video, Stereo",
    "whitebalancemodes": "Auto, Cloudy, Custom, Daylight, Flash, Fluorescent (White), Shade, Sunset, Tungsten, Twilight",
    "dustreductionsystem": "Yes",
    "maxresolution": "17.9MP: 5184 x 3456",
    "flashcompensation": "-2 EV to +2 EV (in 1/3 or 1/2 EV steps)",
    "focallength": "18 - 55mm Comparable  35mm Focal Length: 28.8 - 88 mm",
    "brand": "Canon",
    "sensortypesize": "CMOS, 22.3 x 14.9 mm",
    "filterthread": "Front:58 mm",
    "connectivity": "AV Output HDMI C (Mini) USB 2.0",
    "cameraformat": "Canon APS-C (1.6x Crop Factor)",
    "screensize": "3\"",
    "angleofview": "74° 20' - 27° 50'",
    "focustype": "Auto & Manual",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "continuousshooting": "Up to 5 fps",
    "aspectratio": "3:2",
    "displayscreen": "3\" Rear Touchscreen Tilting Live Preview LCD (1,040,000)",
    "pixels": "Actual: 18.5 Megapixel Effective: 18 Megapixel",
    "acpoweradapter": "ACK-E8 (Optional)",
    "storecategoriesstorehomeipadtabletipadsipadminiipodmp3playersdigitalslrcamerascanonnikonsonydigitalpscameraspanasonicdigitalcameralensescanonnikonsonydigitalcameraaccessoriescameracasesmemorycardmemorycardreadermemorycardholderbatterieschargerwarrantyserviceplanslensfiltertripodsmonopodslenshoodcapslearningdvdotherstarterkitipodmp3accessoriesspeakers": "Canon Rebel T5i 700D + 18-55 + 75-300 + 4 Lens Kit + 16GB + Flash +Battery +Case Click an Image to Enlarge This item is 100% brand new. USA product sealed in original box & includes full USA warranty. 2 Lens Kit - Canon EF-S 18-55mm IS STM Lens & Canon 75-300mm f/4.0-5.6 III Lens 58MM Professional HD 2x telephoto lens  With Free Carry Case 58mm 45x Wide-Angle Digital High Definition Lens w/ Macro 3 Piece Multi Coated Quailty Filter Kit 16 GB Secure Digital (SD) Memory Card High Speed External USB All in One Memory Card Reader & Writer SD SDHC CF MS XD Extra Battery Extra Charger Deluxe Soft Medium SLR Camera Case / Bag fit Canon EOS, Nikon, Sony Alpha Camera Multi Memory Card Wallet Digital Auto Slave Flash with Bracket Full Size 50-inch Tripod With Leveler 360 adjust & Carryng Case for SLR Cameras Mini Flexible Taple Top Travel Tripod  with Pocket clip Lens Cap Keeper Deluxe Screen Protector Pro Pack (Clear ) Deluxe Camera , Screen & Lens 5pc cleaning Kit 58mm Glass Multi Coated UV Filter The EOS Rebel T5i DSLR Camera with EF-S 18-55mm f/3.5-5.6 IS STM Lens from Canon is an APS-C format digital SLR camera with an 18MP CMOS sensor and the DIGIC 5 image processor. It is combined with the EF-S 18-55mm f/3.5-5.6 IS STM lens for an effective range of wide-angle to standard focal length. With 14-bit Analog/Digital conversion, an ISO range from 100-12800 (expandable to 25600) and Multi Shot Noise Reduction, the Rebel T5i offers sharp details, accurate colors and low-noise imaging in both bright and low-light shooting situations. Its 9-point all cross-type autofocus system provides fast focusing when shooting with the viewfinder, and Hybrid CMOS AF increases autofocus speeds when shooting in Live View. The Rebel T5i can continuously shoot up to 5 fps. A 3.0\" Clear View II Vari-angle Touchscreen LCD with 1,040k-dot resolution provides composition and playback viewing. Its tilt and swivel capability makes it easy to compose your shots at odd angles, and a smudge-resistant coating keeps the monitor clear. Intuitive touchscreen operation includes Touch Autofocus. Full HD 1080p at 30 fps and 24 fps is supported with Movie Servo for continuous autofocus during shooting. Manual exposure is provided in video mode and 60 fps is possible when shooting at 720p HD. A built-in stereo microphone with manual audio level adjustment is provided for quality audio recording with your videos. Scene Intelligent Auto Mode automatically makes the optimal camera adjustments based on scene recognition and improved scene detection is particularly helpful when shooting night scenes. Advanced imaging features such as Handheld Night Scene and HDR Backlight Control make capturing difficult shots easy, and seven Creative Filters add expressive touches to your images and can even be viewed in real time during Live View shooting. The EOS Rebel T5i is compatible with the full line of Canon EF and EF-S lenses. It is paired here with the EF-S 18-55mm f/3.5-5.6 IS STM lens, which offers wide-angle to standard focal length shooting specifically designed for APS-C cameras. It is equivalent to a 28.8-88mm focal length in the 35mm format, and its minimum focus distance is 9.8\". This lens features Canon's Optical Image Stabilization system, providing 4-stops of compensation for blur caused by slow shutter speeds when shooting hand-held in low light or at longer focal lengths. An internal focusing system provides fast autofocus, and with a Stepping Motor (STM) and six-group zoom system it supports the Rebel T5i's Movie Servo AF feature for smooth and quiet continuous autofocus during video recording. Manual focus override is possible. A high precision aspherical element reduces chromatic aberration throughout the zoom range for sharp imaging, and Canon lens coatings provide accurate color balance and minimal ghosting and flare. 18MP CMOS Sensor and DIGIC 5 Image Processor High resolution, low-noise imaging and fast performance speed,     including 5 fps continuous shooting, is provided by the combination of     the Canon DIGIC 5 Image Processor and 18MP CMOS sensor. 3.0\" Vari-angle Touchscreen LCD Monitor A 3.0\" Clear View II Vari-angle Touchscreen LCD monitor with     1,040k-dot resolution provides clear composition and playback viewing     even in bright light. Its tilt and swivel capability makes shooting at     odd angles easy, and a smudge-resistant coating keeps the monitor clear.     Seven-level brightness control is available. Intuitive touchscreen     control makes menu control simple, and even offers Touch Autofocus. Full HD 1080 Video Capture Full HD Movie mode supports Movie Servo for continuous focus     tracking of moving subjects during recording. Manual exposure control     and a built-in stereo microphone with manual audio level adjustment     provide high-quality control over your shooting, and multiple frame     rates and resolutions provide quality-level and stylistic shooting     options. The ISO range in Video mode is 100-6400, and is expandable to     12800. Stills can be recorded during video shooting simply by pressing     the camera's shutter button. 14-bit A/D Conversion With 14-bit analog-to-digital conversion, the EOS Rebel T5i     captures and records images with subtle tonal gradations and details     resulting in more realistic and color-accurate images. By recording up     to 16,384 colors per channel, the EOS Rebel T5i ensures that the fine     details are recorded with accuracy. ISO Range - Stills An ISO Range of 100-12800 (expandable to 25600) provides     low-noise capture in low light situations and saturated colors in bright     conditions. 9-point Autofocus System A 9-point all cross-type AF system (including a high-precision     dual-cross f/2.8 center point) provides fast and accurate autofocus     performance when shooting with the viewfinder. Hybrid CMOS AF The Hybrid CMOS AF System is utilized when shooting photos and     video in Live View. Combining two different kinds of AF-phase and     contrast detection-continuous focus tracking becomes faster and more     accurate than ever before in Live View. EF-S 18-55mm f/3.5-5.6 IS STM Lens The EF-S 18-55mm f/3.5-5.6 IS STM lens offers wide-angle to     standard length shooting capability specifically designed for APS-C     cameras. It is equivalent to a 28.8-88mm focal length in the 35mm format     and its minimum focus distance is 9.8\". This lens features Canon's     Optical Image Stabilization system, providing four stops of compensation     against the blur caused by slow shutter speeds when shooting hand-held     in low light or at longer focal lengths. An internal focusing system     provides fast autofocus and with a Stepping Motor (STM) and six-group     zoom system it supports the Rebel T5i's Movie Servo AF feature for     smooth and quiet continuous autofocus during video recording. Manual     focus override is possible. A high precision aspherical lens reduces     chromatic aberration throughout the zoom range for sharp imaging and     Canon lens coatings provide accurate color balance and minimal ghosting     and flare. Lens Compatibility The Canon Rebel T5i is compatible with all EF and EF-S lenses. Continuous Shooting The Rebel T5i offers continuous shooting rates up to 5 fps at full resolution. Multi Shot Noise Reduction Multi Shot Noise Reduction provides outstanding noise reduction while preserving exacting detail at high ISO speeds. Scene Intelligent Auto Scene Intelligent Auto mode incorporates a number of Canon     technologies to deliver the best possible exposure. Joining Picture     Style Auto, Automatic Lighting Optimizer, Automatic White Balance,     Autofocus, and Automatic Exposure, Scene Intelligent Auto mode analyzes     the image, accounting for faces, colors, brightness, moving objects,     contrast, even whether the camera is handheld or on a tripod, and then     chooses the exposure and enhancements that bring out the best in any     scene or situation. Advanced Image Features Handheld Night Scene mode makes it easy to shoot difficult night     scenes without blur. By shooting and combining four consecutive shots     at a shutter speed fast enough to avoid camera shake, Handheld Night     Scene mode makes dramatic nighttime photography simple. HDR Backlight     Control shoots three images of the same scene at differing exposures,     and combines them for one expertly balanced image. Scene Mode Position Newly featured on the EOS Rebel T5i, the SCN setting on the Mode     dial activates a choice of scenes on the menu screen for quick access     to features like Night Portrait, HDR Backlight Control, Handheld Night     Scene and more. Memory Compatible with SD/SDHC/SDXC memory cards, including Ultra High Speed (UHS-I) cards. Lens Aberration Correction The EOS Rebel T5i features lens correction tools that compensate     for lens characteristics that can affect overall image quality. The EOS     Rebel T5i's Peripheral Illumination Correction feature corrects light     falloff in the corner of the image according to the characteristics of     the lens being used. It even has correction data for a number of popular     lenses stored in its memory. With the EOS Rebel T5i's chromatic     aberration correction tool, distracting color fringing can be corrected     at the time of shooting. Creative Filters Seven Creative Filters add expressive touches to your images and     can be seen in real time when shooting in Live View. Creative Filters     include Grainy Black and White, Soft Focus, Fisheye Effect, Toy Camera     Effect, Miniature Effect, Art Bold Effect and Water Painting Effect.     Each effect can be applied in three different levels (low, standard and     strong). GPS Compatible With the optional GP-E2 GPS Receiver attached to the hot shoe or     the digital terminal, the EOS Rebel T5i can record location, including     latitude, longitude and altitude, and has the ability to track the     trajectory of movement with its logging function. An electronic compass     records the camera's orientation during each shot, and world time     information is recorded through GPS synching. Photobook Set-up Photographers can share their images in book form with the EOS     Rebel T5i's convenient Photobook Set-up feature. Users can easily choose     specific images, images in a folder and even all images, then specify     their sequence and layout. The results can be printed in book form with     ease. Languages Supported English, German, French, Dutch, Danish, Portuguese, Finnish,     Italian, Norwegian, Swedish, Spanish, Greek, Russian, Polish, Czech,     Hungarian, Romanian, Ukrainian, Turkish, Arabic, Thai,     Simplified/Traditional Chinese, Korean, Japanese Playback Display Single Image, Index Display (4, 9, 36, 100 images), Jump Display     (1/10/100 images, by date, by folder, movies only, stills only, by     rating) Imaging Lens Mount Canon EF-S Camera Format Canon APS-C (1.6x Crop Factor) Pixels Actual: 18.5 Megapixel Effective: 18 Megapixel Max Resolution 17.9MP: 5184 x 3456 Aspect Ratio 3:2 Sensor Type / Size CMOS, 22.3 x 14.9 mm File Formats Still Images: JPEG, RAW Movies: MOV, MPEG-4 AVC/H.264 Audio: Linear PCM Bit Depth 14-bit Dust Reduction System Yes Memory Card Type SD SDHC SDXC Focus Control Focus Type Auto & Manual Focus Mode Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M) Autofocus Points 9 Viewfinder/Display Viewfinder Type Pentamirror, Optical Viewfinder Coverage 95% Viewfinder Magnification Approx. 0.87x Diopter Adjustment - 3 to +1 m Display Screen 3\" Rear Touchscreen Tilting Live Preview LCD (1,040,000) Screen Coverage 100% Exposure Control ISO Sensitivity Auto, 100-12800 (Extended Mode: 25600-) Shutter Type: Electronic & Mechanical Speed: 30 - 1/4000 sec Metering Method Average metering, Center-weighted average metering, Multi-zone metering, Partial Metering, Spot metering Exposure Modes Modes: Aperture Priority, Auto, Flash Off, Manual, Programmed Auto, Shutter Priority Metering Range: EV 1.0 - EV 20.0 Compensation: -5 EV to +5 EV (in 1/3 or 1/2 EV steps) White Balance Modes Auto, Cloudy, Custom, Daylight, Flash, Fluorescent (White), Shade, Sunset, Tungsten, Twilight Flash Built-in Flash Yes Flash Compensation -2 EV to +2 EV (in 1/3 or 1/2 EV steps) Dedicated Flash System eTTL Remote Firing External Flash Connection Hot Shoe AV Recording Video Recording Yes, NTSC/PAL File Size 1920 x 1080p (Full HD) 1280 x 720p (HD) 640 x 480p (SD) Frame Rate @ 1920 x 1080: 30 fps, 25 fps, 24 fps @ 1280 x 720: 60 fps, 50 fps @ 640 x 480: 30 fps, 25 fps Exposure Control Auto: Shutter Speed, Aperture, ISO Manual: Shutter Speed, Aperture, ISO ISO Sensitivity Auto, 100 - 6400, Expandable to 12800 Exposure Compensation -3 EV to +3 EV (in 1/3 EV steps) Focus Auto Manual Continuous Auto Video Clip Length 1920 x 1080 29.9 min. 1280 x 720 29.9 min. 640 x 480 29.9 min. Audio Recording Optional External Mic: With Video, Stereo Performance Continuous Shooting Up to 5 fps Shutter Lag 0.075 Seconds Self Timer 2 sec, 10 sec Connectivity AV Output HDMI C (Mini) USB 2.0 Power Battery 1x  LP-E8  Rechargeable Lithium-Ion Battery Pack AC Power Adapter ACK-E8 (Optional) Operating/Storage Temperature Operating 32 to 104°F (0 to 40°C) Humidity: 0 - 85% Physical Dimensions (WxHxD) 5.2 x 3.9 x 3.1\" / 13.2 x 9.9 x 7.9 cm Weight 18.52 oz / 525 g Body Only without battery and card Kit Lens Focal Length 18 - 55mm Comparable  35mm Focal Length: 28.8 - 88 mm Aperture Maximum: f/3.5 - 5.6 Angle of View 74° 20' - 27° 50' Minimum Focus Distance .82' (.25 m) Magnification 0.28x Elements/Groups 13/11 Autofocus Yes Image Stabilization Yes Filter Thread Front:58 mm Dimensions (DxL) Approx. 2.7 x 3.0\" (68.58 x 76.20 mm) Weight 7.23 oz (205 g) Canon EOS Rebel T5i DSLR Camera Canon EF-S 18-55mm f/3.5-5.6 IS STM Lens LP-E8 Rechargeable Lithium-Ion Battery Pack (7.2V, 1120mAh) LC-E8E Battery Charger Eyecup Ef for Digital Rebel Cameras R-F-3 Camera Cover Wide Strap EW-100DD IV For All EOS E-58 II 58mm Lens Cap Lens Dust Cap E (Rear) Interface Cable EOS Digital Solution Disk Limited 1-year Warranty Canon Zoom Telephoto EF 75-300mm f/4.0-5.6 III Autofocus Lens USA Canon EF-S 18-55mm f/3.5-5.6 IS STM Lens Canon EF-S 18-55mm f/3.5-5.6 IS STM Lens The EF-S 18-55mm f/3.5-5.6 IS STM Lens from Canon is a standard zoom compatible with Canon APS-C format cameras. It features a focal length range of 18-55mm (35mm equivalent: 28.8-88mm) and an Optical Image Stabilizer providing the equivalent of up to four stops of shake correction. A high-precision aspherical element reduces chromatic aberration throughout the zoom range for high resolution and contrast. The lens supports Canon's EOS Movie Servo AF feature for smooth and quiet continuous autofocusing during movie recording. This feature is enabled by the use of a six-group zoom system plus a stepping motor focusing mechanism. Additionally, manual focus adjustment is possible while shooting in AF mode, and an internal focusing system maintains an overall compact lens form-factor, enables faster performance, and allows for a closer minimum focusing distance of 0.82'. The front element of the lens does not rotate during focusing, allowing you to use polarizing filters without a problem. Optimized lens coatings ensure precise color balance while minimizing ghosting and flare, and the 7-blade circular diaphragm produces pleasing background blur. Canon Zoom Telephoto EF 75-300mm f/4.0-5.6 III Autofocus Lens Canon Zoom Telephoto EF 75-300mm f/4.0-5.6 III Autofocus Lens The lightest 4x telephoto zoom lens in its class. Ideal for sports, portraiture, animals, etc. The telephoto effect can make the picture look compressed or have excellent background blur. At the 300mm focal length, you can fill the frame with a postcard from 4.9' away. Professional HD 2x telephoto lens When your camera can't get you close enough to capture the action in detail, this 2x Telephoto lens will bring the action to you! Optically multiplying the focal length of your camera's lens by a factor of 2, it more than doubles your telephoto magnification and detail without any pixelization. This is dramatically better than the \"Digital Zoom\" feature of many cameras where the magnification is obtained by merely enlarging the existing image, resulting in a loss of sharpness. This 2x telephoto attachment is perfect for all your long-distance imaging including sports, candids, surveillance, nature and wildlife. You will also be able to utilize your camera's macro capability at over twice the usual distance, allowing for easier subject lighting with less shadows and intrusion.. 45x Wide-Angle Digital High Definition Lens with Maro When you've run out of room, and can't possibly fit anything else into the frame, this 0.45x Wide Angle adapter will allow you to capture it all! This attachment more than doubles your camera's wide angle field-of-view . Scenic shots will be more panoramic and you'll be able to take outstanding group photos, even in tight places. In addition, the detachable Macro Lens enables you to photograph small objects up close. Great for jewelry, coins, stamps, flowers, and more. Even if your camera already has macro capability, this macro lens will get you even closer for truly amazing close-up photos. Professional High Definition Special Element Frame Premium Rimmed Glass Infrared Compatible Include Protective Lens Case Digital Multi Coated 58mm Glass Filter Kit (UV-CPL-FLD) 3pc Filter kit The UV filter protects your camera's lens from scratches, dust,  dirt, moisture and fingerprints, while removing unwanted ultraviolet  light.The UV filter reduces blue haze caused by UV light by absorbing  71% of UV. The CPL filter deepens and  intensifies blue skies, achieves vibrant colors and reduces glare and  reflections from non-metallic objects & glass surfaces. Great for  video. The Fluorescent Light Correction Filter gives  you the prefect solution for shooting without a flash under a  fluorescent light.This filter gives true-to-life colors and pleasing  skin tones by removing the harsh yellow-green cast created by flouriest  lightning. Lens filter set is a must-have for photographers 58mm filters improve photographs by giving photographers control over light and allowing them to emphasize certain features Filter kit features UV, CPL, and FLD filters Set comes with hard carrying case and filters UV Protector Filter protected the lens from damage 16 GB Secure Digital (SD) Memory Card Get The Best SD Card for your product When getting an SD memory card there are hundreds of options for your item this can get confusing and costly  , When purchasing one of our handpicked memory cards for your item you receive a  Memory card at the highest quality. We go to every extent to handpick cards to provide  you as a bonus with your purchase that are not only guaranteed to work with your item but have the best performance with your item. This is a Onetime purchase that will help you capture a memory for a lifetime. Our memory card offers are High performance cards that are made reliable with long life spans  created to handle real life motions and real time transfers. There will be  no delay time in transferring information from your device to this card. Get Quality at the top of its class with  SD memory. High Speed USB  All  One Card Reader Access a multitude of memory cards with this USB 2.0 All-in-One card reader! This portable memory card reader supports the most popular memory cards such as Compact Flash I/II, Secure Digital, SD, Memory Stick, Micro Drive and Multimedia Card. Replacement For CANON LP-E8 Battery The LP-E8 Rechargeable Lithium-ion Battery Pack has a capacity of 1120mAh, making it possible to shoot many photographs with your Canon EOS Rebel T2i, T3i or T4i digital camera on a single battery charge. The battery is also compact and lightweight. There is no memory effect, so you can recharge partially drained batteries without reducing performance. Replacement for the original Canon LP-E8 battery pack Never run out of battery power when you're about to capture the perfect moment Output voltage: 7.2V Capacity: 1120mAh LP-E8 RECHARGEABLE BATTERY  CHARGER This LP-E8 Battery Charger for Canon EOS Rebel  is used to recharge your digital camera battery, it is quick charge with automatic constant current control, prevents battery from overcharging, short circuit, and electronic shock. The Battery Charger can used both for home, office and car.  A/C power supply input voltage: AC100V~240V NOTE: For a success and safe charge to your battery, please make         sure to line up the correct polarity (positive / negative) before         inserting the battery onto the charger This compact battery charger set for Canon LP-E8 is the complete charging solution for digital video batteries High quality battery charger is a handy companion for digital shooting Charger is designed with a foldable A/C plug that charges your camera / camcorder battery anywhere in the world Quick charge with automatic constant current control prevents battery from overcharging, short circuit, and electronic shock Smart LED indicator shows charging status Deluxe Medium Camera and Video Bag The Deluxe Medium Camera and Video Bag  is the perfect compliment to hold all of your equipment. It features a shock proof nylon material and is water resistant. It has 1 removable divider, rubber feet, shoulder strap and a handle grip. Easy access closure flap Mesh pockets for accessory storage compartment with interior   mesh pockets for spare batteries, flash-memory cards, diskettes,cords,   cables and more Shoulder strap/1 re moveable divider ,rubber feet, shoulder strap and a handle grip nylon material and is water resistant Dimensions: Size: 10.8 x 6.5 x 7.5 inches Multi Memory Card Wallet Donâ\u0080\u0099t lose your lifeâ\u0080\u0099s Memories Memory Cards are the Insert that holds your lifeâ\u0080\u0099s memoryâ\u0080\u0099s. A little card that easily lost but so important to you and your family. Always keep  your memory cards together at any cost. One lost card can lose decades of Memories. A memory card wallet is someplace for you to keep these memoryâ\u0080\u0099s together. Memory Card Wallet Keeps multiple memory cards protected and organized with this durable storage wallet. Sturdy memory card wallet case holds memory cards of any type securely, keeping them from contact with other accessories and makes them easily accessible in larger luggage bags. Features Memory Card Wallet Holds up to Multi  memory Cards (SD,CF,MS) 1 Year Limited Warranty Pro Digital Auto Slave Flash with Bracket for All SLR/DSLR Digital Camera & Camcorders Every photographer knows that a quality flash unit is an essential component to taking great pictures. Built-in flashes simply don't have enough power to properly illuminate most subjects, and typically produce harsh shadows, red-eye, and other undesirable effects. An external flash offers far more power and versatility , resulting in consistently better pictures! The Flash is a high-power flash unit that works seamlessly with a wide variety of camera models and provides exceptional light coverage , at a price that doesn't break the bank! The Flash features automatic exposure control , which syncs with your camera to provide just the right amount of light. The zoom function allows you to light subjects as far away as 50 feet , and the bounce head tilts and swivels to give you full creative control. Full Size 50-inch Tripod With Leveler  360 adjust & Case Want to relax and take time shooting ?  Not worry about your shots being leveled ?  adjust shots with a swivel instead of an adjustment ? If the answer to all these Questions are YES this is the item for you!! The 50-Inch Photo and Video tripod features a special carrying handle as well as a professional grip. With its  self leveling rubber leg tips  it offers a great floor grip for positioning and  built in bubble leveler to give you a leveled shot. Capability  for a 360 degree spin with its 3 way pan head doesn’t hurt for convenience. There are bracing sections to adjust Tripod size and an additional Bonus of Tripod case. What else can you ask for as a free bonus with your purchase. Features Extends to 50 Inch  and under Non slip handle Mid level bracing system for adjustable sizes Bubble leveler Tripod fitted case Compact Carry Size Mini Flexible Taple Top Travel Tripod  with Pocket clip We realized to take a quick snap shot anywhere with your camera is a hassle to keep the camera sturdy with a table top tripod you can pull it out instantly or leave attached to your product for that Quick Snap and Go picture. A focused leveled cameraâ\u0080\u0099s shot and a wobbled shot is a big difference. This handy little tripod also can keep you in the picture. Place your camera on the Tripod and use the camera's self-timer, or a remote shutter release and you are in the picture for a great crisp-sharp shot. It easy to use and it is small enough to be ideal for carry in travel. Featuring an adjustable head and hard Flexible legs, this Tripod is an ideal accessory for photographers on the run. This lightweight, yet durable tripod stands at a height of up to 5\". Perfect for most digital, video and still cameras . Features Fits all 35mm Digital and Video camera with Tripod Socket Sturdy Ultra Compact Convenient Pocket Clip Travel Sized Lens Cap Keeper Keep Your lens safe its one of the Eyes of your purchase: Its always the little things that we lose that are a pain to replace . Why go through the hassle we found the perfect solution. Your cameras lens is a vital part of the pathway that captures an image from external reality and stores it onto a memory card film device or other  Keeping this lens free of dust smudges and contact with other items is imperative. A Lens Cap holder as simple as it sounds is the solution. The  perfect way to keep track of your lens caps. A small button tapes onto the front of your lens cap and the elastic loop goes around the barrel of your lens so that your lens cap always remains attached, hanging from the lens. Lens caps can be pricey and hard to find  with this you will  Never lose a lens cap again ! Deluxe Screen Protector Pro Pack (Clear ) Be safe scratches arenâ\u0080\u0099t appealing . Save your screen it takes a second to apply and  will give you longer usage with your product Purchasing any item everyone always knows the LCD screen or glass screen is an imperative part of the electronic device always the first to get damaged. Easy solution for you !! Deluxe screen protectors are perfect for digital camera screens, cell phone screens and game player screens. screen protectors are included with  a squeegee to smooth them out and remove air bubbles. They can be cut down to size to fit any screen from 1\" to 5\". The extra clear layer on your device will not only protect it from Sun damage but will also protect from  Nail Scratches, finger smudges and many other contact damage to the screen point of your device. The Clear Quality Kit touch safes  your device. Universal Screen Guard The Greatest  Guarder for LCD Screens Multi 3pcs 3x5â\u0080\u0099â\u0080\u0099 Deluxe Screen Guard 1 Squeegee Card Deluxe Camera , Screen & Lens 5pc cleaning Kit Be clean Be Safe use something Approved for your product : It's obvious that the cleaner the lens and camera sensor, the sharper your pictures will be. Dirt, dust, and fingerprints will degrade the image quality of even the finest optics. However, it's equally important to avoid using incorrect cleaning materials which can permanently damage your photo equipment. The 5 Piece Camera and lens Cleaning Kit. consists of soft-texture fiber cloth, 5 cotton swabs, a bottle of cleaning fluid, soft lens tissue paper, and top quality blower brush. It easily fits in your camera bag so you can take it anywhere with you easily. It is perfect for an on-the-spot camera or lens cleaning and is approved by the manufacture to use with your item Screen Camera and Lens Cleaning kit Soft Texture Fiber Cloth Five Quality Cotton Swabs Top Quality cleaning Fluid Quality Blower and Brush Full Pack Lens Cleaning Tissue 58mm UV Filter The 58mm UV Protector Filter is a general use, clear filter that helps to absorb ultraviolet light and reduce the bluish cast of daylight. This filter is especially useful when photographing at high altitudes or around bodies of water. No additional coloration or contrast is provided, allowing you to pair this filter with others. The UV filter is also useful as a general protective filter to leave on lenses at all times. Filters help to reduce dust and moisture from reaching your lens element and provide additional protection in case of drops or situations where scratching could occur. UV  filters are made using Color Core technology; a process that involves laminating the filter substrate between 2 pieces of optical glass, grinding flat to a tolerance of 1/10,000th of an inch, then mounting to precision metal rings. What is Multi Coating Coating enhances light transmission, protects the surface of the filter and helps remove glare, particularly between the rear of a filter and the surface of the lens. Light transmission is proportional to layers of coating applied. Don't miss this fantastic opportunity to increase your equipment performance with this high definition filter lens. Absorbs some ultraviolet light and reduces bluish cast of daylight. Clear filter provides no additional coloration or contrast, allowing you to pair this filter with others. General protection filter reduces dust, moisture, and scratches from reaching lens elements UV Protector Filter protected the lens from damage CANON REBELT5I/18-55SKIT15 We usually ship within 1-2 business days after receiving payment. Please be aware that weekends are not business days. At our discretion; large or expensive packages may receive a free upgrade to FedEx Ground with signature confirmation.  If this applies to you, please assure that your address is able to receive FedEx packages & that an adult is available to sign for & accept the shipment. All express methods of shipment as long as verified take 1 business day to ship We ship everything professionally in our state of the art warehouse boxed and shipped with perfection. \"Free Shipping\" applies to orders shipped within the USA (48 states) We do not ship to APO or FPO address Orders shipping to PR/HI/AK Will have an additional shipping charge and a longer process time to ship order Credit Cards: We can only ship to addresses that are noted with your credit card account. We may contact you for additional verification after you check out. PayPal: We prefer to ship to confirmed addresses. We may contact you for additional verification for payments made by unconfirmed PayPal addresses. We do not accept PayPal payments from accounts outside the USA and Canada. · When necessary, we may contact you via Direct Message or telephone to obtain additional verification. We offer our customer's a 14 day return for replacement policy if item is defective other then that all sales are final . A Return Merchandise Authorization (RMA) number must be obtained for any return. To obtain an RMA number, please call us toll free at 877-254-6155 Returned packages without proper RMA demarcations will be refused by our warehouse and returned to you. Customers who refuse a delivery, will be subject to charges for return shipping to us. If the item was advertised as Free Shipping, then we will charge the amount of shipping as determined by Our Shipping Station . Defective Item An item that was discovered to be defective upon receipt can be replaced with the same model only. Return Shipping Return shipping cost (the cost to send an item back to our store) is like or comparable to your cost of driving to any store for returning an item, which is not reimbursable. Therefore, we do not reimburse any return shipping cost. If an item you received is defective, we will certainly replace the item with a new one, however we do not cover or reimburse the shipping cost for returning defective merchandise back to our store. We will ship the replacement product to you at our cost, and use every good measure to ensure that the replacement order is processed quickly. Replacement We will send a product replacement after the authorized return has completed our receiving/inspection process. The replacement will ship within four business days following our receipt of your return. Please allow additional processing time after Holidays. Although it is our goal to ship a replacement as quickly as possible, we do not send replacements before we receive and inspect the returned merchandise. All items are sold with Manufacture Warranty so there is another avenue for assistance. All returns must be packed with all contents which came with the original package including, cables, software, plastic and cardboard packaging, and unregistered warranty card. This return policy excludes Televisions, Home Theater Projectors or any Home audio Product . For further questions please call us toll free at 877-254-6155 We encourage any questions or concerns you may have for us, but we request that all communication be done through eBay messages only or over the phone. Our dedicated customer support team is available Monday-Friday 10AM - 6PM (EST) TOLL FREE: +1-877-254-6155 LOCAL: +1-908-967-5155 Click here to send us your email inquiry now through eBay messages.",
    "exposurecompensation": "-3 EV to +3 EV (in 1/3 EV steps)",
    "diopteradjustment": "- 3 to +1 m",
    "displaytype": "LCD",
    "dimensionsdxl": "Approx. 2.7 x 3.0\" (68.58 x 76.20 mm)",
    "builtinflash": "Yes",
    "cameratype": "Digital SLR",
    "framerate": "@ 1920 x 1080: 30 fps, 25 fps, 24 fps @ 1280 x 720: 60 fps, 50 fps @ 640 x 480: 30 fps, 25 fps",
    "displaysize": "3\"",
    "focusmode": "Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M)",
    "sensorresolution": "18.0 MP",
    "viewfindertype": "Pentamirror, Optical",
    "autofocuspoints": "9",
    "dedicatedflashsystem": "eTTL Remote Firing",
    "supportedflashmemory": "SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "model": "Rebel T5i / 700D",
    "screencoverage": "100%",
    "videocliplength": "1920 x 1080 29.9 min. 1280 x 720 29.9 min. 640 x 480 29.9 min.",
    "elementsgroups": "13/11"
}