{
    "meteringrange": "0 to 20 EV (Matrix or center-weighted metering at ISO 100 equivalent, f/1.4 lens, at 20 deg.C/68 deg.F) 2 to 20 EV (Spot metering at ISO 100 equivalent, f/1.4 lens at 20 deg.C/68 deg.F)",
    "accessoryshoe": "ISO 518 hot-shoe with sync and data contacts and safety lock",
    "moviemetering": "TTL exposure metering using main image sensor",
    "nikoncreativelightingsystemcls": "Yes Advanced Wireless Lighting supported with SB-900, BS-800, SU-800 as commander; Flash Color Information Communications supported with built-in flash and all CLS-compatible flash units",
    "playbackfunctions": "Full frame Calendar Thumbnail (4, 9 or 72 images) Zoom Movie Playback Slideshow Histogram display Highlights Auto image rotation Image Comment (up to 36 characters) Highlight point display",
    "weight": "16oz / 455g camera body only",
    "autoareaafmode": "Single Area AF Dynamic-area Auto-area AF 3D-tracking (11 points)",
    "moviefileformat": "MOV",
    "isosensitivity": "ISO 100 to 3200 in steps of 1 EV Can also be set to approx. 1 EV above ISO 3200 (ISO 6400 equivalent) or to approx. 2 EV above ISO 3200 (ISO 12800 equivalent Auto ISO sensitivity control available",
    "pictureangle": "Effective picture angle 1.5x (Approx.) conversion factor (Nikon DX format)",
    "liveviewshooting": "Yes",
    "exposurecompensation": "±5 EV in increments of 1/3EV",
    "flashmode": "Auto Auto with red-eye reduction Fill-flash Auto slow sync Auto slow sync with red-eye correction Rear curtain with slow sync",
    "effectivepixels": "14.2 million",
    "moviemeteringmethod": "Matrix",
    "reflexmirror": "Quick-return type",
    "acadapter": "EH-5a AC Adapter Power Connector EP-5a available separately",
    "flashcompensation": "-3 to +1 EV in increments of 1/3 EV",
    "category": "camera",
    "meteringmethod": "Matrix: 3D color matrix metering II (type G and D lenses); color matrix metering II (other CPU lenses) Center-weighted: Weight of 75% given to 8-mm circle in center of frame Spot: Meters 3.5-mm circle (about 2.5% of frame) centered on selected focus point",
    "exposuremetercoupling": "CPU",
    "liveviewlensservo": "Autofocus (AF): Single-servo AF (AF-S); full-time-servo AF (AF-F) Manual focus (MF)",
    "moviemaximumrecordingtime": "10 min",
    "viewfindereyepoint": "18mm (-1.0m-1)",
    "movieframesizepixelsandframerate": "1920 x 1080 (24p): 24 fps (23.976 fps) 1280 x 720 (30p): 30 fps (29.97 fps) 1280 x 720 (25p): 25 fps 1280 x 720 (24p): 24 fps (23.976 fps) 640 x 424 (24p): 24 fps (23.976 fps)",
    "expandedisosensitivityoptions": "1 EV above ISO 3200 (ISO 6400 equivalent) 2 EV above ISO 3200 (ISO 12800 equivalent) Approx. Auto ISO sensitivity control available",
    "monitorresolution": "230,000 Dots",
    "sensorsize": "23.1 x 15.4mm",
    "selftimer": "2 sec, 10 sec Timer duration electronically controlled",
    "activedlighting": "On Off",
    "focuspoint": "Can be selected from 11 focus points",
    "shutterreleasemodes": "Single-frame [S] mode Continuous Self-timer mode Quiet Shutter Release",
    "totalpixels": "14.8 million",
    "liveviewautofocus": "Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected",
    "dimensionswxhxd": "4.9 x 3.8 x 2.9in / 124.46 x 96.52 x 73.66mm",
    "viewfinderframecoverage": "95% horizontal 95% vertical Approx",
    "type": "Single-lens reflex digital camera",
    "flashsyncspeed": "Up to 1/200 sec, Synchronizes with shutter at 1/200s or slower",
    "lensservo": "Autofocus (AF): Single-servo AF (AF-S); Continuous-servo AF (AF-C); Auto AF-S/AF-C selection (AF-A); Predictive focus tracking activated automatically according to subject status",
    "gps": "GP-1 GPS unit",
    "movieaudiorecordingdevice": "Built-in monaural microphone",
    "monitortype": "TFT-LCD with brightness adjustment",
    "viewfindermagnification": "0.80x (50mm f/1.4 lens at infinity; -1.0m-1) Approx",
    "monitorsize": "3 in. diagonal",
    "autofocussystem": "Nikon Multi-CAM 1000 autofocus sensor module with TTL phase detection",
    "liveviewafareamode": "Face-priority AF Wide-area AF Normal-area AF Subject-tracking AF",
    "filesystem": "Compliant with DCF (Design Rule for Camera File System) 2.0 DPOF (Digital Print Order Format) EXIF 2.21 (Exchangeable Image File Format for Digital Still Cameras PictBridge",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (single-servo AF) Focus can be locked by pressing AE-L/AF-L button",
    "detectionrange": "-1 to 19 EV (ISO 100, 68 deg.F/20 deg.C)",
    "frameadvancerate": "Up to 3 fps (manual focus, mode M or S, shutter speed 1/250 sec or faster, and other settings at default values)",
    "focusingscreen": "Type B BriteView Clear Matte Mark VII screen",
    "liveviewsceneautoselector": "Auto mode Auto (flash off) mode",
    "flashcontrol": "TTL: i-TTL balanced fill-flash and standard i-TTL flash for digital SLR using 420-pixel RGB sensor are available with built-in flash and SB-900, SB-800, SB-600, or SB-400 (i-TTL balanced fill-flash available when matrix or center-weighted metering) Auto aperture: Available with SB-900/SB-800 and CPU lens Non-TTL auto: Supported flash units include BS-900, SB-800, SB-80DX, SB-28DX, SB-28, SB-27, and SB-22S Distance-priority manual: Available with SB-900 and SB-800",
    "interface": "Hi-speed USB Video output: NTSC, PAL HDMI output: Type C mini-pin HDMI connector Accessory terminal: Remote cord: MC-DC2 (available separately); GPS unit: GP-1 (available separately)",
    "storagemedia": "SD SDHC SDXC memory cards",
    "lensmount": "Nikon F bayonet mount",
    "shutterspeed": "1/4000 to 30 sec. in steps of 1/3 EV, Bulb",
    "batterybatteries": "EN-EL14 Rechargeable Li-ion Battery",
    "tripodsocket": "1/4in (ISO1222)",
    "supportedlanguages": "Chinese (Simplified and Traditional) Dutch English Spanish Finnish French Italian German Japanese Korean Polish Portuguese Russian Swedish Czech Norweigon Turkish",
    "storecategoriesstorehomeentertainmentcentertelevisions": "1.888.209.5772 About me Contact Us Shipping Payments FAQ Nikon D3100 Digital SLR Camera with 18-55mm NIKKOR DX VR Lens - Refurbished by Nikon U.S.A. SKU: INKD3100KR Mfr. Part: 25472 Item Includes Nikon D3100 14.2 Megapixels Digital SLR Camera - #2176 18-55mm f/3.5-5.6G VR AF-S DX Nikkor Lens - EN-EL14 Battery - MH-24 Quick Battery Charger - DK-5 Eyepiece Cap - DK-20 Rubber Eyecup - AN-DC3 Camera Strap - BS-1 Accessory Shoe Cover - BF-1B Body Cap - Front & Rear Lens Covers - ViewNX 2 CD-ROM - Nikon 90 Day Warranty - Note: (USB Cable is NOT included) Description The Nikon D3100 Digital SLR Camera is an affordable, compact and lightweight photographic power-house. It features the all-purpose 18-55mm VR lens, a high-resolution 14.2 MP CMOS sensor along with a feature set that's comprehensive yet easy to navigate - the intuitive onboard learn-as-you grow guide mode allows the photographer to understand what the 3100 can do quickly and easily. Capture beautiful pictures and amazing Full HD 1080p movies with sound and full-time autofocus. Easily capture the action other cameras miss with a fast start up time, split-second shutter release, 3 frames per second shooting and 11-point autofocus. Capture pictures and make movies in near darkness with an ISO range of 100 to 3200 (expandable to 12800-Hi2). EXPEED 2, Nikon's new image processing engine, assures breathtakingly rich image quality, managing color, contrast, exposure and noise. One-touch Live View and movie recording lets you see the action on the 3\" monitor and the Scene Recognition System automatically chooses the ideal settings. You can also select from 6 Automatic Exposure Scene Modes- Portrait, Landscape, Child, Sports, Close-up or Night Portrait for stunning results in otherwise challenging conditions. Active D-Lighting restores picture-enhancing detail in shadows and highlights. A built-in pop-up flash is ready for those times when there just isn't enough light and in-camera image editing allows creative freedom and effects, without the need for a computer. Features 14.2 Megapixel DX-format CMOS Image Sensor delivers beautiful photographs and prints well beyond 20 x 30 inches Full 1080p HD Cinematic Video with full-time autofocus and sound lets you record cinematic-quality movies in Full 1080p HD format (1920 x 1080 pixels) Easy-To-Use featuring Nikon's Guide Mode with intuitive controls and on-board assistance helping you take better pictures every step of the way Fast 11-point Autofocus System delivers razor-sharp pictures 3in monitor with One-Touch Live View shooting and movie capture Built-in HDMI port lets you connect directly to your HDTV using an optional HDMI cable Control Image and Movie Playback with most HDTV remote controls 6 Automatic Exposure Scene Modes Just set the Mode dial to Portrait, Landscape, Child, Sports, Close-up or Night Portrait for stunning results in otherwise challenging conditions Picture Control lets you choose from Standard, Neutral, Vivid, Monochrome, Portrait, or Landscape to apply a personal look and feel to your pictures Built-in pop-up flash for those times when there isn't enough light Includes 3x 18-55mm Zoom-NIKKOR VR Image Stabilization Lens with legendary NIKKOR optical quality and fast, accurate autofocus for vivid color, striking contrast and crisp detail and VR image stabilization to ensure the sharpest hand-held pictures and movies Compact and Lightweight Design Beautifully styled - Ready to go wherever life takes you Split-second Shutter Response eliminates the frustration of shutter delay, capturing moments that other cameras miss ISO sensitivity 100-3200, expandable to ISO 12800 equivalent delivers exceptional results, even in the most challenging low-light situations Scene Auto Selector lets the D3100 decide the best mode to match the shooting situation when using Live View EXPEED 2 Nikon's new image processing engine assures breathtakingly rich image quality, managing color, contrast, exposure, noise and speed Scene Recognition System in Live View automatically optimizes exposure, autofocus, and white balance, allowing you to obtain beautiful photos without the hassle of making complicated camera adjustments yourself Active D-Lighting restores picture-enhancing detail in shadows and highlights Automatic Image Sensor Cleaning uses an ultrasonic process and exclusive Airflow Control combats the accumulation of dust in front of the image sensor, safeguarding image quality shot after shot In-camera Image Editing allows creative freedom, without the need for a computer, offering easy editing functions Specifications Type Single-lens reflex digital camera Lens Mount Nikon F bayonet mount Picture Angle Effective picture angle 1.5x (Approx.) conversion factor (Nikon DX format) Effective Pixels 14.2 million Sensor Size 23.1 x 15.4mm Image Sensor Format DX Image Sensor Type CMOS Total Pixels 14.8 million Dust-reduction system Image sensor cleaning Airflow Control System Image Dust Off reference data (optional Capture NX 2 software required) Image Area (pixels) DX-format (L) 4608 x 3072 (M) 3456 x 2304 (S) 2304 x 1536 File Format NEF (RAW) JPEG: JPEG-Baseline compliant with fine (approx 1:4), normal (approx 1:8), or basic (approx 1:16) compression NEF (RAW) + JPEG: Single photograph recorded in both NEF (RAW) and JPEG formats Picture Control Standard Neutral Vivid Monochrome Portrait Landscape Storage Media SD SDHC SDXC memory cards File System Compliant with DCF (Design Rule for Camera File System) 2.0 DPOF (Digital Print Order Format) EXIF 2.21 (Exchangeable Image File Format for Digital Still Cameras PictBridge Viewfinder Eye-level pentamirror single-lens reflex viewfinder Viewfinder Frame Coverage 95% horizontal 95% vertical Approx Viewfinder Magnification 0.80x (50mm f/1.4 lens at infinity; -1.0m-1) Approx Viewfinder Eyepoint 18mm (-1.0m-1) Viewfinder Diopter Adjustment -1.7 to +0.5m-1 Focusing Screen Type B BriteView Clear Matte Mark VII screen Reflex Mirror Quick-return type Lens Aperture Instant-return type Electronically controlled Compatible Lenses 1 AI-P NIKKOR: All functions supported except autofocus and 3D Color Matrix Metering II AF-S, AF-I: All functions supported Non-CPU: Can be used in mode M, but exposure meter does not function; electronic range finder can be used if maximum aperture is f/5.6 or faster IX Nikkor lenses cannot be used Electronic Rangefinder usable with lens with maximum aperture of f/5.6 or faster Compatible Lenses 2 Type G or D AF NIKKOR not equipped with an autofocus motor: All functions supported except autofocus AF-NIKKOR for F3AF not supported Other AF NIKKOR: All functions supported except autofocus and 3D color matrix metering II Type D PC NIKKOR: All functions supported except autofocus and some shooting modes Shutter type Electronically controlled vertical-travel focal-plane Shutter Speed 1/4000 to 30 sec. in steps of 1/3 EV, Bulb Flash Sync Speed Up to 1/200 sec, Synchronizes with shutter at 1/200s or slower Shutter Release Modes Single-frame [S] mode Continuous Self-timer mode Quiet Shutter Release Frame Advance Rate Up to 3 fps (manual focus, mode M or S, shutter speed 1/250 sec or faster, and other settings at default values) Self-timer 2 sec, 10 sec Timer duration electronically controlled Exposure Metering System TTL exposure metering using 420-pixel RGB sensor Metering Method Matrix: 3D color matrix metering II (type G and D lenses); color matrix metering II (other CPU lenses) Center-weighted: Weight of 75% given to 8-mm circle in center of frame Spot: Meters 3.5-mm circle (about 2.5% of frame) centered on selected focus point Metering Range 0 to 20 EV (Matrix or center-weighted metering at ISO 100 equivalent, f/1.4 lens, at 20 deg.C/68 deg.F) 2 to 20 EV (Spot metering at ISO 100 equivalent, f/1.4 lens at 20 deg.C/68 deg.F) Exposure Meter Coupling CPU Exposure Modes Auto modes ( auto, auto [flash off]) Scene Modes Programmed Auto with flexible Program (P) Shutter-Priority Auto (S) Aperture-Priority Auto (A) Manual (M) Scene Modes Portrait Landscape Child Sports Close-up Night Portrait Exposure Compensation ±5 EV in increments of 1/3EV Exposure Lock Luminosity locked at detected value with AE-L/AF-L button ISO Sensitivity ISO 100 to 3200 in steps of 1 EV Can also be set to approx. 1 EV above ISO 3200 (ISO 6400 equivalent) or to approx. 2 EV above ISO 3200 (ISO 12800 equivalent Auto ISO sensitivity control available Expanded ISO Sensitivity Options 1 EV above ISO 3200 (ISO 6400 equivalent) 2 EV above ISO 3200 (ISO 12800 equivalent) Approx. Auto ISO sensitivity control available Active D-Lighting On Off Auto-area AF Mode Single Area AF Dynamic-area Auto-area AF 3D-tracking (11 points) Autofocus System Nikon Multi-CAM 1000 autofocus sensor module with TTL phase detection Detection Range -1 to 19 EV (ISO 100, 68 deg.F/20 deg.C) Lens Servo Autofocus (AF): Single-servo AF (AF-S); Continuous-servo AF (AF-C); Auto AF-S/AF-C selection (AF-A); Predictive focus tracking activated automatically according to subject status Focus Point Can be selected from 11 focus points Focus Lock Focus can be locked by pressing shutter-release button halfway (single-servo AF) Focus can be locked by pressing AE-L/AF-L button Built-in Flash Yes Auto Portrait Child Close-Up Night portrait Auto flash with auto pop-up [P], [S], [A], [M] Manual pop-up with button release Guide Number 39/12, 43/13 with manual flash (ft/m, ISO 100, 68 deg.F/20 deg.C) Approx. Flash Control TTL: i-TTL balanced fill-flash and standard i-TTL flash for digital SLR using 420-pixel RGB sensor are available with built-in flash and SB-900, SB-800, SB-600, or SB-400 (i-TTL balanced fill-flash available when matrix or center-weighted metering) Auto aperture: Available with SB-900/SB-800 and CPU lens Non-TTL auto: Supported flash units include BS-900, SB-800, SB-80DX, SB-28DX, SB-28, SB-27, and SB-22S Distance-priority manual: Available with SB-900 and SB-800 Flash Mode Auto Auto with red-eye reduction Fill-flash Auto slow sync Auto slow sync with red-eye correction Rear curtain with slow sync Flash Compensation -3 to +1 EV in increments of 1/3 EV Flash-ready indicator Lights when built-in flash or optional flash unit such as SB-900, SB-800, SB-600, SB-400, SB-80DX, SB-28DX or SB-50DX is fully charged Blinks for 3 sec. after flash is fired at full output Accessory Shoe ISO 518 hot-shoe with sync and data contacts and safety lock Nikon Creative Lighting System (CLS) Yes Advanced Wireless Lighting supported with SB-900, BS-800, SU-800 as commander; Flash Color Information Communications supported with built-in flash and all CLS-compatible flash units Flash Sync Terminal Sync Terminal Adapter AS-15 (available separately) White Balance Auto Incandescent Fluorescent (7 types) Direct Sunlight Flash Cloudy Shade Preset Manual All except preset manual with fine tuning Live View Shooting Yes Live View Lens servo Autofocus (AF): Single-servo AF (AF-S); full-time-servo AF (AF-F) Manual focus (MF) Live View AF-area mode Face-priority AF Wide-area AF Normal-area AF Subject-tracking AF Live View Autofocus Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected Live View Scene Auto Selector Auto mode Auto (flash off) mode Movie Metering TTL exposure metering using main image sensor Movie Metering method Matrix Movie Frame size (pixels) and frame rate 1920 x 1080 (24p): 24 fps (23.976 fps) 1280 x 720 (30p): 30 fps (29.97 fps) 1280 x 720 (25p): 25 fps 1280 x 720 (24p): 24 fps (23.976 fps) 640 x 424 (24p): 24 fps (23.976 fps) Movie Maximum recording time 10 min Movie File Format MOV Movie Audio recording format Linear PCM Movie Audio recording device Built-in monaural microphone Monitor Size 3 in. diagonal Monitor Resolution 230,000 Dots Monitor Type TFT-LCD with brightness adjustment Playback Functions Full frame Calendar Thumbnail (4, 9 or 72 images) Zoom Movie Playback Slideshow Histogram display Highlights Auto image rotation Image Comment (up to 36 characters) Highlight point display Interface Hi-speed USB Video output: NTSC, PAL HDMI output: Type C mini-pin HDMI connector Accessory terminal: Remote cord: MC-DC2 (available separately); GPS unit: GP-1 (available separately) GPS GP-1 GPS unit Supported Languages Chinese (Simplified and Traditional) Dutch English Spanish Finnish French Italian German Japanese Korean Polish Portuguese Russian Swedish Czech Norweigon Turkish Battery / Batteries EN-EL14 Rechargeable Li-ion Battery AC Adapter EH-5a AC Adapter Power Connector EP-5a available separately Tripod Socket 1/4in (ISO1222) Operating Environment 32 to 104 deg.F (0 to 40 deg.C) Less than 85% (no condensation) Dimensions (W x H x D) 4.9 x 3.8 x 2.9in / 124.46 x 96.52 x 73.66mm Weight 16oz / 455g camera body only WHO WE ARE Adorama is one of the nation's largest Photographic retail and mail order suppliers. For over 35 years we have been serving professionals as well as amateurs in the photographic, video, digital imaging and telescope fields. We offer the best combination of quality services, vast selection, knowledgeable staff, and competitive pricing. Adorama Camera is your #1 source for the best and newest products in the photographic industry, and the largest inventory of items such as Digital Cameras, Digital Camera Accessories, Memory Cards, 35mm Cameras, Medium Format Cameras, Lenses, Video Cameras, TV's, MP3 Players, Binoculars, Telescopes, Scanners, Inkjet, Dye-Sub & Laser Printers, Office Fax machines, Shredders, Projectors, Inkjet Paper, Photographic Accessories, Filters, Batteries, Cases, Tripods, Flashes, Lighting & Studio Equipment, Film, Darkroom Products and Audio Video Equipment. All new equipment comes with all of the factory included accessories, including a full manufacturer's warranty, unless otherwise noted. We only post items that are in-stock and ready to ship. PAYMENT Paypal is our only method of payment. Your Paypal account must be a Verified US Paypal account. Selecting \"Immediate Pay\" is the way to go. If you select eCheck, it may take 2-8 days to clear Paypal. In an effort to comply with our Authorized Dealer contracts with the manufacturers and to best control our inventory levels we reserve the right to limit quantities or cancel orders to Resellers and Exporters. Please note: Inventory is not reserved until the item is paid for. Please include a phone number as UPS and our Trucking Companies require it. We prefer to ship to a confirmed Paypal address and whether yes or no we may still contact you for additional verification. For shipments in New York and New Jersey, we are required to collect the appropriate sales tax. INTERNATIONAL International taxes and duties: International shipments may be subject to import fees, duties and taxes, which are levied once a shipment reaches the respective country, in addition to the brokerage fees/custom clearance charges which may be imposed by the carrier. These charges must be borne by the recipient. Adorama has no control over these charges and cannot predict what they might be. Orders shipped using eBays (GSP) \"Global Shipping Platform\" have already paid their taxes and must contact eBay directly for any issues. SHIPPING Most purchases are shipped with 24 Business Hours. Adorama's eBay store ships to the 48 Contiguous United States including Military APO & FPO and Puerto Rico. We now ship to Canada, parts of Europe and Australia. We do not ship to other International locations. Items with \"free shipping\" are only shipped free to the 48 contiguous United States. Combined shipping is available by placing all adoramacamera eBay orders BEFORE making the Payment. eBay's new checkout offers you to consolidate your orders to get better shipping rates. All orders must be shipped with a printed invoice included. We can not ship orders without the invoice or a lower value invoice. Gift Invoices can be sent if you call us immediately after payment is made (if during business hours). No guarantees for emails in this matter. Shipment errors due to a bad address entered by the buyer and will not be credited for shipping charges if returned or at all if lost or abandoned by the carrier. We supply tracking information directly to your eBay account as well as via email within 24 hours after the shipment leaves our warehouse. Please make sure that our email messages don't go into spam or junk. Change requests may not be updated on eBay, please check the emails. All TV's over 50 inches or other large items will ship via special Truck Delivery. An appointment will be made by the Trucking Company 24 hours before final delivery. Therefore, you must provide a phone number. Please read this carefully before purchasing any TV from us. All TV's 50 inches or larger will ship via special truck delivery only. An appointment will be made by the Trucking Company 24 hours before final delivery. LCD, LED and Plasma TVs as well as Monitors from 20\" and above can not be returned unless damaged in transit. At time of arrival If your TV arrives by UPS or FedEx: Please inspect the box from the outside for visible damage. If the box is not in perfect condition you should refuse it. Once you sign for it or open the box, you can not claim in-transit damage. If the box looks fine, you can then sign for it & open the box for further inspection after the carrier/driver leaves. You should check your TV ASAP to make sure that it works fine. If there are any problems, please let us know. If your TV arrives by special truck delivery: Please inspect the TV for both, external damage AND make sure that it powers up before you sign for it. If there's any external damage to the box, or it doesn't power on, do not accept it or sign for it. (According to the trucking company rules, you need to test the TV at the closest power outlet to the door. They are not required to wait until you put the TV in its intended place or till you test the cable connections). After the truck leaves, you should further test the TV to make sure everything works perfectly. If there are any problems, please let us know. Damage claims must be reported within 24 hours of receipt. Returns Please click here for our FULL RETURN POLICY For the first 30 days from date of receipt of your purchase you may return the merchandise for a full money back refund, excluding any shipping charges (for items which we offer free shipping, our standard shipping charges will be deducted from any refund or credit). Returned or exchanged products must be in brand-new, mint condition. Items must be in the original, undamaged manufacturer's packaging with all packaging materials, including instruction booklets, packing inserts, and the blank warranty cards. Memory cards and any other Blister Pack items are not returnable once opened. Any merchandise missing the original Universal Product Code (UPC) cannot be returned. The manufacturer's labeled packaging must be enclosed within an additional shipping carton. Please do not place stickers or shipping labels on the original manufacturer's package. Printers, Desktop Computers, Laptops, Tablets & Notebooks are not returnable once they are booted up or the toner is installed, as per the manufacturers contracts, all service to be done through them directly. Please ship your parcel back to Adorama freight prepaid and Insured. Sorry, Adorama cannot accept COD or freight-collect shipments. Return shipping cost (the cost to send an item back to our store) is not reimbursable. Please enclose a copy of your invoice with your return and tell us whether you would like the item to be replaced, exchanged, or refunded. Returns can take up to 8 days in-house from the date we receive it to process. When returning an item, please make sure you use a shipper which provides you with Insurance and a tracking number. Items returned without a tracking number might take much longer to be processed. We do not require a RMA. Returns should be shipped to: ACC Order processing 7 Slater Drive Elizabeth, NJ 07206 If you live in New York you may bring the return to our Manhattan store for exchange or refund. Warranty Information Most products have the warranty length listed in the description. To obtain a free copy of the manufacturers warranty details for any product we carry, please write to us and be sure to include the Brand Name and Model Number. Adorama Camera, Inc. Warranty Requests 42 West 18th Street New York, NY 10011 Contact Us Got a question? click here Product Information: 800-223-2500 Customer Service: 888-209-5772 HOURS OF OPERATION Mon-Thurs: 9:00am - 5:00pm Friday: 9:00am - 12:00pm On Oct-11-14 at 17:55:43 PDT, seller added the following information: Protect It Now with a Consumer Priority Service Extended Warranty",
    "viewfinderdiopteradjustment": "-1.7 to +0.5m-1",
    "exposuremeteringsystem": "TTL exposure metering using 420-pixel RGB sensor",
    "shuttertype": "Electronically controlled vertical-travel focal-plane",
    "flashreadyindicator": "Lights when built-in flash or optional flash unit such as SB-900, SB-800, SB-600, SB-400, SB-80DX, SB-28DX or SB-50DX is fully charged Blinks for 3 sec. after flash is fired at full output",
    "imagesensortype": "CMOS",
    "builtinflash": "Yes Auto Portrait Child Close-Up Night portrait Auto flash with auto pop-up [P], [S], [A], [M] Manual pop-up with button release",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "exposuremodes": "Auto modes ( auto, auto [flash off]) Scene Modes Programmed Auto with flexible Program (P) Shutter-Priority Auto (S) Aperture-Priority Auto (A) Manual (M)",
    "scenemodes": "Portrait Landscape Child Sports Close-up Night Portrait",
    "whitebalance": "Auto Incandescent Fluorescent (7 types) Direct Sunlight Flash Cloudy Shade Preset Manual All except preset manual with fine tuning",
    "imageareapixels": "DX-format (L) 4608 x 3072 (M) 3456 x 2304 (S) 2304 x 1536",
    "guidenumber": "39/12, 43/13 with manual flash (ft/m, ISO 100, 68 deg.F/20 deg.C) Approx.",
    "picturecontrol": "Standard Neutral Vivid Monochrome Portrait Landscape",
    "operatingenvironment": "32 to 104 deg.F (0 to 40 deg.C) Less than 85% (no condensation)",
    "imagesensorformat": "DX",
    "flashsyncterminal": "Sync Terminal Adapter AS-15 (available separately)",
    "movieaudiorecordingformat": "Linear PCM",
    "lensaperture": "Instant-return type Electronically controlled",
    "viewfinder": "Eye-level pentamirror single-lens reflex viewfinder",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "dustreductionsystem": "Image sensor cleaning Airflow Control System Image Dust Off reference data (optional Capture NX 2 software required)",
    "fileformat": "NEF (RAW) JPEG: JPEG-Baseline compliant with fine (approx 1:4), normal (approx 1:8), or basic (approx 1:16) compression NEF (RAW) + JPEG: Single photograph recorded in both NEF (RAW) and JPEG formats"
}