{
    "sensorsizeheight": "24mm",
    "weight": "850g",
    "isosensitivity": "50 - 25600",
    "metering": "Centre-weighted - Average Spot Multi Pattern",
    "height": "113mm",
    "exposurecomp": "+/-5",
    "videofps": "60, 30p, 25p and 24p",
    "shopcategoriesshophomelaptopscamerasgraphicscardtabletsapplemacnetworkingsmartphonescanonlenses": "Nikon D610 3.2\" LCD 24.3MP DSLR Camera, HD 1080p, Body Only Nikon D610 3.2\" LCD 24.3MP DSLR Camera, HD 1080p, Body Only Experience photography at a whole new level and enter   the exciting world of full-frame power with the Nikon D610.   Equipped   with all the advanced Nikon technology required by enthusiasts   and   professional photographers alike, the full-frame FX format sensor     delivers unrivalled image quality, capturing every detail with lifelike     sharpness. With high dynamic range, fast, powerful processing, and an     impressive set of innovative in-camera features, including Nikon’s   Quiet   Release burst mode, this D-SLR is ready to take you on an   inspiring   photographic journey. Robust yet lightweight the D610 will     capture all those defining moments come rain or shine, night or day,     leaving you with dazzling shots to define your portfolio. Specification Manufacturer Nikon Lens Effective Magnification 1x Image Sensor CCD pixels 24.3Mp (Megapixels) Pixels (W) 6016 Pixels (H) 4016 Sensor Type CMOS Sensor Size Full Frame Sensor Size (width) 35.9mm Sensor Size (height) 24mm Aspect Ratio 3:2 LCD Monitor LCD Monitor 3.2in Screen resolution 921,000 dots Focusing Focusing modes Autofocus Manual Face Detection AF Tracking Multi AF Fine Tuning Exposure Control Shutter speeds shortest 1/4000sec Shutter speeds longest 30sec Exp modes Program Aperture-Priority Shutter-Priority Manual Scene modes Metering Centre-weighted - Average Spot Multi Pattern ISO sensitivity 50 - 25600 White balance Auto Manual Outdoors/Daylight Cloudy Incandescent Fluorescent Shade Flash Bracket Exposure Comp +/-5 Shooting Options Continuous shooting 6fps Video Movie mode Yes Video Resolution 1920x1080 1280x720 720p Video FPS 60, 30p, 25p and 24p Stereo Sound No Optical Zoom with Video Yes Other Features Interface HDMI Yes USB USB 2 Storage Card Type SD SDHC SDXC File Type RAW JPG RAW + JPG Power Source Battery Type EN-EL15 CIPA Rating 900 Dimensions Dimensions Weight 850g Width 141mm Height 113mm Depth 82mm",
    "batterytype": "EN-EL15",
    "aspectratio": "3:2",
    "category": "camera",
    "pixelsw": "6016",
    "continuousshooting": "6fps",
    "usb": "USB 2",
    "depth": "82mm",
    "sensorsize": "Full Frame",
    "width": "141mm",
    "stereosound": "No",
    "manufacturer": "Nikon",
    "filetype": "RAW JPG RAW + JPG",
    "pixelsh": "4016",
    "ccdpixels": "24.3Mp (Megapixels)",
    "opticalzoomwithvideo": "Yes",
    "sensorsizewidth": "35.9mm",
    "hdmi": "Yes",
    "shutterspeedsshortest": "1/4000sec",
    "sensortype": "CMOS",
    "ciparating": "900",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "screenresolution": "921,000 dots",
    "lcdmonitor": "3.2in",
    "shutterspeedslongest": "30sec",
    "expmodes": "Program Aperture-Priority Shutter-Priority Manual Scene modes",
    "moviemode": "Yes",
    "whitebalance": "Auto Manual Outdoors/Daylight Cloudy Incandescent Fluorescent Shade Flash Bracket",
    "cardtype": "SD SDHC SDXC",
    "videoresolution": "1920x1080 1280x720 720p",
    "focusingmodes": "Autofocus Manual Face Detection AF Tracking Multi AF Fine Tuning"
}