{
    "externalflashconnection": "Hot Shoe",
    "exposurecontrol": "Auto Manual",
    "weight": "6.88 oz (195 g)",
    "mirrorlockup": "Yes",
    "battery": "1x EN-EL14a  Rechargeable Lithium-Ion Battery Pack, 7.2VDC, 1230mAh",
    "exposuremodes": "Modes: Aperture Priority, Auto, Manual, Programmed Auto, Scene Modes, Shutter Priority Metering Range: EV 0.0 - EV 20.0 Compensation: -5 EV to +5 EV (in 1/3 or 1/2 EV steps)",
    "isosensitivity": "Auto, 100-12800 (Extended Mode: 100-25600)",
    "focus": "Auto Manual Continuous Auto",
    "memorycardtype": "SD SDHC SDXC",
    "diaphragmblades": "7, Rounded",
    "shopcategoriesshophomecameracameralensaccessoiresother": "TECHNESE_Mobile Phones．Digital Cameras．Accessories As Nikon's 'advanced beginner' DSLR, the D5300 takes the D5200's place between the entry-level D3200 and the enthusiast-targeted D7100 in the company's APS-C lineup. The D5300 offers 24MP resolution (like its APS-C stablemates), an articulated rear LCD and more physical controls than the D3200, but without the twin-dial interface and professional grade AF system of the decidedly higher market (and much more customizable) D7100.The D5300 also offers a beefed-up video mode, which is now capable of true 1080/60p HD video. This, plus the slightly enlarged (3.2in compared to 3in) fully-articulated 1.04 million-dot LCD screen should mean that the D5300 is attractive to videographers as well as stills photographers. Easy to miss, but useful features include built-in Wi-Fi and GPS - both firsts for Nikon's DSLR lineup. Battery life gets a boost too - according to CIPA figures the D5300 offers an endurance of 600 shots, compared to 500 from the D5200. Remember though that this figure does not take features like Wi-Fi or GPS into account, and we'd expect both to have an impact on battery life. Imaging Lens Mount Nikon F Camera Format DX / (1.5x Crop Factor) Pixels Actual: 24.78 Megapixel Effective: 24.2 Megapixel Max Resolution 24MP: 6000 x 4000 Aspect Ratio 3:2 Sensor Type / Size CMOS, 23.5 x 15.6 mm File Formats Still Images: JPEG, RAW Movies: MOV, MPEG-4 AVC/H.264 Audio: Linear PCM Bit Depth 14-bit Dust Reduction System Yes Memory Card Type SD SDHC SDXC Focus Control Focus Type Auto & Manual Focus Mode Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M) Autofocus Points Phase Detection: 39 Viewfinder/Display Viewfinder Type Pentamirror Viewfinder Coverage 95% Viewfinder Magnification Approx. 0.82x Diopter Adjustment - 1.7 to +1 m Display Screen 3.2\" Rear Screen Swivel  LCD (1,037,000) Screen Coverage 100% Diagonal Angle of View 170.0° Exposure Control ISO Sensitivity Auto, 100-12800 (Extended Mode: 100-25600) Shutter Type: Electronic & Mechanical Speed: 30 - 1/4000 sec, Bulb Mode Remote Control MC-DC2 (Optional) Mirror Lock-Up Yes Metering Method 3D Color Matrix Metering, Center-weighted average metering, Spot metering Exposure Modes Modes: Aperture Priority, Auto, Manual, Programmed Auto, Scene Modes, Shutter Priority Metering Range: EV 0.0 - EV 20.0 Compensation: -5 EV to +5 EV (in 1/3 or 1/2 EV steps) White Balance Modes Auto, Cloudy, Direct Sunlight, Flash, Fluorescent, Incandescent, Preset Manual, Shade Flash Flash Modes Auto Auto/Red-eye Reduction Fill-in Off Rear Curtain/Slow Sync Rear Sync Red-eye Reduction Slow Sync Slow Sync/Red-eye Reduction Built-in Flash Yes Guide No. 42.65' (13 m) ISO100 Max Sync Speed 1 / 200 sec Flash Compensation -3 EV to +1 EV (in 1/3 or 1/2 EV steps) Dedicated Flash System iTTL External Flash Connection Hot Shoe AV Recording Video Recording Yes File Size 1920 x 1080p (Full HD) 1280 x 720p (HD) 640 x 424p (SD) Aspect Ratio 16:9 Frame Rate @ 1920 x 1080: 60 fps, 50 fps, 30 fps, 25 fps, 24 fps @ 1280 x 720: 60 fps, 50 fps @ 640 x 424: 30 fps, 25 fps Exposure Control Auto Manual Focus Auto Manual Continuous Auto Video Clip Length 1920 x 1080 @ 60 fps: 20 min. @ 30 fps: 29 min. Audio Recording Built-in Mic: With Video, Stereo Optional External Mic: With Video Performance Continuous Shooting Up to 5 fps Self Timer 2 sec, 5 sec, 10 sec, 20 sec Number of Shots: 1-9 Interval Recording Yes Connectivity 1/8\" Microphone, AV Output, HDMI C (Mini), USB 2.0 Wi-Fi Capable Yes Power Battery 1x EN-EL14a  Rechargeable Lithium-Ion Battery Pack, 7.2VDC, 1230mAh AC Power Adapter EH-5b (Optional) Operating/Storage Temperature Operating 32 to 104°F (0 to 40°C) Physical Dimensions (WxHxD) 4.9 x 3.9 x 3.0\" / 125.0 x 98.0 x 76.0 mm Weight 1.06 lb / 480 g body only Kit Lens Focal Length 18 - 55mm Comparable 35mm Focal Length: 27 - 82.5 mm Aperture Maximum: f/3.5 - 5.6 Minimum: f/22 - 36 Angle of View 76° - 28° 50' Minimum Focus Distance 11.02\" (28 cm) Magnification 0.31x Elements/Groups 11/8 Diaphragm Blades 7, Rounded Autofocus Yes Image Stabilization Yes Filter Thread Front:52 mm Dimensions (DxL) Approx. 2.34 x 2.60\" (59.5 x 66 mm) Weight 6.88 oz (195 g) Nikon D5300 DSLR Camera Body AF-S NIKKOR 18-55mm f/3.5-5.6G VR II DX Lens EN-EL14A Rechargeable Li-Ion Battery for D5300 and Df Cameras MH-24 Quick Charger for EN-EL14 Battery EG-CP16 Nikon Audio/Video Cable UC-E17 USB Cable DK-25 Rubber Eyecup AN-DC3 Camera Strap (Black) DK-5 Eyepiece Shield (Replacement) BF-1B Body Cap BS-1 Hot-Shoe Cover Nikon View NX2 Software CD-ROM 8GB Memory Card 52mm UV Filter Cleaning Kit Set ( Air Blower , Lens Pen ,Cleaing Cloths) Technese Enterprises Limited 1 Year Warranty Power cord may not fit your country , we will provide FREE charger adaptor if necessary Items are brand new and are not refurbished items. All specifications noted are manufacturer specifications and are subject to change without notice. PLEASE EMAIL US with any questions before bid to avoid receiving items that buyers will not be satisfied with. If buyers would like to cancel an order, a 10% charge (counting total ending price/handling fee) will be administered. Non paying buyers will be reported to eBay and as a result, negative feedback will be left. Images used are for reference only. We will not be held responsible for the injuries or damages of the packaging during delivery. Buying an item from us constitutes that buyers understand and agree with our terms & conditions. Before bidding or purchasing, please read our Warranty / Returns and other regulations. The language on the system interface will be changed into English as the default language by us except some mobile accessories. (The language of these products may be compactible to the user’s mobile device.) If customer has any special requests on the language of the system interface, please contact Technese before dispatched. We reserve the right to vary the Terms of Sales form time to time without notice. ONLY ship to Paypal confirmed address and NO PO Box , FPO or APO Address. Items will be dispatched from Hong Kong. The transaction does not include any Import Tax / Duty / VAT / Brokerage Fees / Handling Fees . It is the sole responsibility of buyers. For more information about the tax rate, please check with local custom department before purchase. FREE SHIPPING is offered to certain countries only. Please open the parcel and check all the items included before signing on the acknowledge receipt for the courier. We accept PayPal only (with verified and confirmed address). The Paypal must be paid within 7 days. Buyers who fail to pay will be reported to eBay. Payment must be received, in full, prior to the item being sent out. No sending money and cheques overseas. We do not accept any other forms of payment. All items will come with our store warranty against manufacture defects (excluding wear and tear). Buyers can return the items for service in case of warranty issues. We offer a 7-day No Question Asked Exchange Policy from the day buyers receive the items and only if buyers could follow the below return guidelines: Items must be returned in Original Condition with the product packaging, booklets / manuals, swing tags, labels and all other accessories included. All returns must be boxed and packed securely for shipping, and are in re-saleable condition when we receive them. Buyers are required to contact us before sending anything back to us. Buyers must ship the items back under insured delivery and label as defective return. Buyers are responsible for the cost of shipping the item back to us and returning of the item and these costs are non-refundable. If buyers do not pay this cost, we shall not send the product back and shall keep the products for solely 60 days. If this cost is still not received from buyers within after 60 days, we will dispose the product without prior notice. 12-month Warranty This products are covered by 12 months warranty. The period of the warranty shall be 12 months starting from the purchase date. Buyers are required to contact us before sending anything back to us. Buyers are responsible for the cost of shipping the item back to us and returning of the item and these costs are non-refundable. If buyers do not pay this cost, we shall not send the product back and shall keep the products for solely 60 days. If this cost is still not received from buyers within after 60 days, we will dispose the product without prior notice. Buyers are responsible for the cost of shipping the item back to us and for the returning of the item. Defective item must be returned within the 7 working days upon receiving the item. International warranty can be arranged for extra fees, please contact us for more details. The Warranty shall be valid only when we receive the faulty product within the period of warranty. Any previous notifications from buyers will become invalid if we cannot receive the product within the warranty period. For non-repairable products, we shall not compensate buyer with 100% value of the original purchase unit price. Please consider with the rate of depreciation. Both the 7-day No Question Asked Exchange Policy and 12-month Warranty does NOT apply to the followings: Buyer makes any further use, alters, or repairs to the malfunctioning product without the agreement of us. The serial number of the item does not match our record or the serial number has been scratched, peeled off, or disappeared. Periodic checkup, maintenance, repair, or replacement of parts due to normal wear and tears. Costs relating to transport, removal, or installation of the product. Misuse, including the failure to use this product for its normal purposes or incorrect installation. Damages caused by shock or fall, sand, dirt, dust, dampness or corrosion, leaky batteries, lightning, liquid, fire, acts of god, war, public ventilation or any other causes beyond the control of us. Damage on any other items used in conjunction with the product. ©TECHNESE ENTERPRISES LIMITED",
    "acpoweradapter": "EH-5b (Optional)",
    "aspectratio": "16:9",
    "elementsgroups": "11/8",
    "viewfindercoverage": "95%",
    "category": "camera",
    "shutter": "Type: Electronic & Mechanical Speed: 30 - 1/4000 sec, Bulb Mode",
    "videorecording": "Yes",
    "minimumfocusdistance": "11.02\" (28 cm)",
    "operatingstoragetemperature": "Operating 32 to 104°F (0 to 40°C)",
    "dimensionsdxl": "Approx. 2.34 x 2.60\" (59.5 x 66 mm)",
    "fileformats": "Still Images: JPEG, RAW Movies: MOV, MPEG-4 AVC/H.264 Audio: Linear PCM",
    "selftimer": "2 sec, 5 sec, 10 sec, 20 sec Number of Shots: 1-9",
    "magnification": "0.31x",
    "filesize": "1920 x 1080p (Full HD) 1280 x 720p (HD) 640 x 424p (SD)",
    "aperture": "Maximum: f/3.5 - 5.6 Minimum: f/22 - 36",
    "dimensionswxhxd": "4.9 x 3.9 x 3.0\" / 125.0 x 98.0 x 76.0 mm",
    "autofocus": "Yes",
    "continuousshooting": "Up to 5 fps",
    "meteringmethod": "3D Color Matrix Metering, Center-weighted average metering, Spot metering",
    "audiorecording": "Built-in Mic: With Video, Stereo Optional External Mic: With Video",
    "whitebalancemodes": "Auto, Cloudy, Direct Sunlight, Flash, Fluorescent, Incandescent, Preset Manual, Shade",
    "dustreductionsystem": "Yes",
    "viewfindermagnification": "Approx. 0.82x",
    "focallength": "18 - 55mm Comparable 35mm Focal Length: 27 - 82.5 mm",
    "flashcompensation": "-3 EV to +1 EV (in 1/3 or 1/2 EV steps)",
    "sensortypesize": "CMOS, 23.5 x 15.6 mm",
    "imagestabilization": "Yes",
    "connectivity": "1/8\" Microphone, AV Output, HDMI C (Mini), USB 2.0",
    "cameraformat": "DX / (1.5x Crop Factor)",
    "filterthread": "Front:52 mm",
    "angleofview": "76° - 28° 50'",
    "focustype": "Auto & Manual",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "bitdepth": "14-bit",
    "lensmount": "Nikon F",
    "displayscreen": "3.2\" Rear Screen Swivel  LCD (1,037,000)",
    "pixels": "Actual: 24.78 Megapixel Effective: 24.2 Megapixel",
    "intervalrecording": "Yes",
    "remotecontrol": "MC-DC2 (Optional)",
    "diopteradjustment": "- 1.7 to +1 m",
    "builtinflash": "Yes",
    "framerate": "@ 1920 x 1080: 60 fps, 50 fps, 30 fps, 25 fps, 24 fps @ 1280 x 720: 60 fps, 50 fps @ 640 x 424: 30 fps, 25 fps",
    "focusmode": "Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M)",
    "flashmodes": "Auto Auto/Red-eye Reduction Fill-in Off Rear Curtain/Slow Sync Rear Sync Red-eye Reduction Slow Sync Slow Sync/Red-eye Reduction",
    "videocliplength": "1920 x 1080 @ 60 fps: 20 min. @ 30 fps: 29 min.",
    "viewfindertype": "Pentamirror",
    "maxsyncspeed": "1 / 200 sec",
    "autofocuspoints": "Phase Detection: 39",
    "dedicatedflashsystem": "iTTL",
    "maxresolution": "24MP: 6000 x 4000",
    "guideno": "42.65' (13 m) ISO100",
    "screencoverage": "100%",
    "wificapable": "Yes",
    "diagonalangleofview": "170.0°"
}