{
    "pictbridge": "Yes",
    "megapixels": "18.1",
    "hdmioutput": "Yes",
    "exposurecontrol": "+/- 2 EV",
    "flashtype": "Built-in",
    "facedetectiontechnology": "Yes",
    "displaytype": "OLED",
    "shutterspeedmax": "1/4000 sec",
    "opticalzoomx": "22",
    "size": "110.1 x 60.3 x 30.7mm",
    "category": "camera",
    "shutterspeedmin": "4 sec",
    "focallengthtele": "550",
    "sensorsize": "1/2.3 inch",
    "maxvideoresolution": "1920 x 1080",
    "screensize": "3\"",
    "batterymodel": "EN-EL12",
    "isomin": "125",
    "manufacturerslink": "Click here",
    "shopcategoriesshophomecanoncashbackitemscrumplerexdemofujifilmlowepromanfrottonikonolympuspentaxsonytamractamronusedusedvelbonother": "Nikon Coolpix S9500 RED Digital Camera The Nikon Coolpix S9500 RED Digital Camera joins the Nikon stylish range and is a Wi-Fi enabled, super-zoom compact with a wide-angle 22x optical zoom lens (equivalent to 25-550mm on a 35m format), featuring a back illuminated 18.0 megapixel CMOS image sensor to improve sensitivity, thus reducing noise for stunning image quality and high performance in any lighting conditions. Extremely portable, the Coolpix S9500 packs several advanced features such as the Anti-blur reduction to reduce the risk of blurred images and a fast Expeed C2 image processing system to enhance the performance of full HD video recording and stills. With 19 different scene modes, built-in Wi-Fi, a large 3.0-inch LCD display, Easy Panorama and a selection of special effects, the S9500 is able to create unforgettable photos and movies in a pocket able, fun sized form making it the perfect companion for all your adventures. Nikon Coolpix S9500Digital Camera Built-in Wi-Fi: transfer your high-quality images and movies directly to your smart device* ready for uploading on to your favorite social media. Super zoom: the 22x NIKKOR wide-angle optical zoom lens (25â\u0080\u0093550 mm) with ED glass will make you a sharp shooter from virtually any distance. Back-illuminated 18-MP CMOS sensor: with each pixel receiving more light, this highly sensitive image sensor works with the EXPEED C2 processor to deliver clear shots in any light. 7.5-cm (3.0-in.) 614k-dot OLED screen: OLED technology means this large screen offers excellent visibility and sharp contrast in all light conditions, including direct sunlight. Lens-shift VR (vibration reduction): Nikonâ\u0080\u0099s automatic vibration reduction technology counters the effects of camera shake in real time, producing steady photos and movies. Full HD (1080p) movie recording: easily record life in motion and in stereo sound. A dedicated video-record button makes it easy to begin filming. Built-in Global Positioning System (GPS): record the exact location (latitude and longitude) of images as a â\u0080\u0098geotagâ\u0080\u0099, review point-of-interest (POI) information in playback, or retrace your route via computer. Advanced movie functions: pause and continue filming to create a single movie. Optical zoom and autofocus are available while filming, and the built-in HDMI connector provides a direct link to an HDTV. Auto HDR mode: the camera combines two shots taken at different exposures during a single shutter release to create an image with wide dynamic range and rich colour gradation. Smart portrait system: Smile timer takes the shot when your subject smiles, Blink proof alerts you when someoneâ\u0080\u0099s eyes were closed, and Glamour retouch options make portraits look more flattering. Easy Panorama 360Â°/180Â°: pan vertically or horizontally to create dynamic panoramas. 3D shooting mode: create 3D images that can be displayed on 3D-capable TVs and computers. Retouch menu: enhance your photos on the spot with a wide range of in-camera filter effects, including quick effect mode in playback. Selective Colour converts your image to monochrome and then adds a splash of colour to the area of your choice, while Cross Screen adds a starry effect to bright objects. High-speed continuous shooting: capture sharp shots of the action with ease. The camera can shoot up to 5 frames at a fast 7.5 fps. Mode dial: access the most important shooting modes quickly and easily via the conveniently placed mode dial. 19 scene modes: scene modes automatically optimize the camera settings for popular photographic styles, effects and locations. Achieve great shots just by selecting the mode that matches your situation. Subject Tracking AF: capture sharp shots of subjects on the move. Subject Tracking AF keeps the camera focused on a selected subject even if it refuses to stay still. Slimline body: measuring just 30.7 mm at its widest and 23 mm at its thinnest, the COOLPIX S9500 proves itâ\u0080\u0099s possible to be packed with features and slim all at once. EXPEED C2: Nikonâ\u0080\u0099s fast and powerful image processing system provides high-speed operation, enhanced movie recording, high-sensitivity performance and maximum image quality. * Requires installation of the Nikon â\u0080\u0098Wireless Mobile Adaptor Utilityâ\u0080\u0099 application (iOS and Androidâ\u0084¢ compatible) on your smart device. SPECIFICATIONS Megapixels 18.1 Sensor type CMOS Sensor size 1/2.3 inch Resolution 4896 x 3672 Optical zoom (x) 22 Focal length (tele) 550 Focal length (wide) 25 Image stabilisation Yes Max aperture (tele) 6.3 Max aperture (wide) 3.4 Minimum focus distance 1cm Shutter speed max 1/4000 sec Shutter speed min 4 sec Exposure modes 19 Scene Modes ISO min 125 ISO max 3200 Viewfinder type OLED Screen size (inches) 3.0 Screen resolution (pixels) 614000 Flash type Built-in Movie mode 1080p Full HD Face detection Technology Yes PictBridge Yes Card format SD, SDHC, SDXC File formats JPEG, MPO, WAV, MOV, H.264/MPEG-4 AVC, AAC stereo Connectivity Hi-Speed USB, HDMI micro connector (Type D) Battery model EN-EL12 Colour Black Size 110.1 x 60.3 x 30.7mm Weight (g) 205 Manufacturers link Click here Exposure Control +/- 2 EV BRAND NEW NIKON UK STOCK A WARRANTY CARD IS INCLUDED AND THE WARRANTY IS VALID ANYWHERE IN EURO PE IF YOU WOULD LIKE ANY MORE INFORMATION ABOUT THIS ITEM, OR ANY OF OUR OTHER ITEMS ON OUR EBAY STORE OR IF YOU WOULD LIKE TO PAY WITH CREDIT/DEBIT CARD THEN PLEASE FEEL FREE TO CALL ONE OF OUR STORES ON: CARDIFF : 02920 394182 NEWPORT : 01633 262738 **RETURNS** UNDER THE DISTANCE SELLERS ACT YOU ARE ENTITLED TO CANCEL AND RETURN YOUR ORDER LESS THE COST OF POSTAGE THAT IT HAS COST US TO POST THE ITEM TO YOU. THIS ONLY COVERS YOU FOR BUY IT NOW ITEMS NOT AUCTION STYLE PURCHASES. IF FOR ANY REASON YOU WISH TO RETURN ANY ITEM THAT YOU BUY FROM CAMERA CENTRE UK THEN PLEASE INCLUDE A COPY OF YOUR ORIGINAL RECEIPT AND A COVER NOTE EXPLAINING THE REASON FOR THE RETURN. THIS WILL INSURE THAT YOUR REQUEST IS PROCESSED QUICKLY AND EFFICIENTLY WITHOUT DELAY. RETURNS MUST BE WITHIN 7 DAYS OF RECEIVING YOUR ITEM. THE MAXIMUM RETURNS POSTAGE WE WILL PAY IS Â£7.90 FOR UK .PLEASE DO NOT SEND THE ITEM BACK SPECIAL DELIVERY AS WE WILL ONLY COVER UP TO THIS MUCH. WE ENDEVOUR TO SORT ANY ISSUES OUT AS SOON AS THEY ARISE, BUT IN SOME CASES THERE MAY BE A SMALL DELAY. THIS IS NOT A HUGE PROBLEM IF YOU BID AND CHANGE YOUR MIND, OR JUST BID BY MISTAKE, BUT PLEASE - IF YOU WISH TO CANCEL YOUR BID - LET US KNOW ATLEAST 24 HOURS PRIOR TO THE LISTING ENDING, THIS WILL INSURE THAT NO EBAY CASES ARE OPENED AND THAT OTHERS CAN HAVE THE CHANCE TO PURCHASE THE ITEM WITHOUT HAVING TO WAIT WHILE THE ITEM IS RELISTED. **POSTAGE** IN SOME CASES POSTAGE MAY BE A LITTLE MORE TO SOME AREAS OF THE WORLD. IF YOU ARE UNSURE OF THE COST TO YOUR AREA PLEASE FEEL FREE TO EMAIL AND ASK AND WE WILL GET BACK TO YOU AS SOON AS POSSIBLE. THIS WILL INSURE THAT YOUR ORDER IS PROCESSED THANK YOU FOR LOOKING Russian Customers We are only able to ship to business addresses in Russia. If you do not supply us with a business address then we will not be able to send your items to you. Further note Minimum delivery charge to Russia is Â£29.99 FINANCE AVAILABLE ON ALL NEW PRODUCTS OVER Â£300 PLEASE CALL US ON 01633 262738 OR 02920 394182 FOR DETAILS",
    "brand": "Nikon",
    "maxaperturewide": "3.4",
    "maxaperturetele": "6.3",
    "sensortype": "CMOS",
    "connectivity": "Hi-Speed USB, HDMI micro connector (Type D)",
    "cardformat": "SD, SDHC, SDXC",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "fileformats": "JPEG, MPO, WAV, MOV, H.264/MPEG-4 AVC, AAC stereo",
    "weightg": "205",
    "integratedmemorysize": "23 MB",
    "screensizeinches": "3.0",
    "moviemode": "1080p Full HD",
    "imagestabilisation": "Yes",
    "opticalzoom": "22x",
    "colour": "Black",
    "cameratype": "Compact",
    "exposuremodes": "19 Scene Modes",
    "displaysize": "3\"",
    "screenresolutionpixels": "614000",
    "minimumfocusdistance": "1cm",
    "digitalzoom": "4x",
    "sensorresolution": "18.1 MP",
    "viewfindertype": "OLED",
    "supportedflashmemory": "SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "model": "S9500",
    "resolution": "4896 x 3672",
    "focallengthwide": "25",
    "isomax": "3200"
}