{
    "compressiontype": "DCF, DCF 2.0, DPOF, DPOF 1.1, EXIF 2.2, EXIF 2.21, JPEG, Raw Image",
    "weight": "0.83 Kg",
    "flashtype": "Built-In & External",
    "ai": "â\u0080\u009cAs-Isâ\u0080\u009d Usually to be used for   parts only. All equipment sold in As-Is category carries no warranty or   return privileges. The equipment most likely has one or more functions that   are inoperable and may have missing pieces. Defects will include, but are not   limited to the problems listed in the notes section.",
    "demo": "Never owned by a consumer but   possibly used for demonstration. Item may or may not carry a manufacturerâ\u0080\u0099s   warranty as detailed in the notes section of the listing.",
    "isospeeds": "100, 1000, 125, 1250, 140, 160, 1600, 200, 250, 320, 400, 500, 640, 800",
    "height": "11.3 cm",
    "builtinspeaker": "Without Built-in Speaker",
    "ex": "â\u0080\u009cExcellent Plusâ\u0080\u009d 90-96% of   original condition. Exceptionally nice. May have slight wear on finish but   visible only under close inspection. Glass* / LCDs / Body very clean, any   imperfections listed in notes section.",
    "filesizehighres": "20.7MB (6 images on 128MB card)",
    "batterytype": "6 x AA Batteries, Proprietary Lithium, Rechargeable Li-Ion Battery",
    "category": "camera",
    "builtinmicrophone": "Without Built-in Microphone",
    "batterylife": "1800 Images",
    "ln": "â\u0080\u009cLike New Minusâ\u0080\u009d 97-99% of   original condition. Extremely slight wear only seen upon very close   inspection. Glass* / LCDs / Body perfect.",
    "depth": "7.39 cm",
    "selftimer": "10 Sec., 12 Sec., 13 Sec., 15 Sec., 2 Sec., 20 Sec., 3 Sec., 5 Sec., 8 Sec.",
    "width": "14.71 cm",
    "filesizelowres": "0.33MB (about 388 images on 128MB card)",
    "framespersecond": "5 Frames",
    "new": "As packaged by the   manufacturer. Item may or may not carry a manufacturerâ\u0080\u0099s warranty as detailed   in the notes section of the listing. Not previously owned or used by a   consumer.",
    "tripodmount": "With Tripod Mount",
    "cameraresolution": "10.2 MP",
    "touchscreen": "No",
    "good": "â\u0080\u009cGoodâ\u0080\u009d 75-79% of original   condition. Shows more than average wear for the age of the item. May have   dents, dings and/or brassing and finish loss. Glass* / LCDs / Body may have   marks, anomalies and/or blemishes that will not affect picture quality.   Details listed in notes section.",
    "imageresolutions": "1936 x 1296, 2896 x 1944, 3872 x 2592",
    "waterproof": "No",
    "mpn": "25235",
    "brand": "Nikon",
    "whitebalance": "Auto, Cloudy (Preset), Colour Temperature Adjust, Daylight / Sunny (Preset), Flash (Preset), Fluorescent (Preset), Incandescent (Preset), Manual, Shade (Preset)",
    "lcdscreen": "With LCD Screen",
    "memorytype": "CompactFlash Card Type I, CompactFlash Card Type II, CompactFlash I, CompactFlash II, IBM Microdrive",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "shutterspeed": "1/8000 - 1/30Sec.",
    "model": "D200",
    "imagesensortype": "CCD",
    "cameratype": "Digital SLR",
    "resolution": "10.2 MP",
    "aperturerange": "f3.5/f4.5(w/t)",
    "lcdscreenresolution": "230 pixels",
    "upc": "18208910656",
    "bgn": "â\u0080\u009cBargainâ\u0080\u009d 70-74% of original   condition. Shows more than average wear for the age of the item. May have   dents, dings and/or brassing and finish loss. Glass* / LCDs / Body may have marks,   anomalies and/or blemishes that should not affect picture quality. Details   listed in notes section.",
    "lcdscreensize": "2.5\"",
    "compressionmodes": "Basic, Fine, Normal, Uncompressed",
    "flashfunctions": "Auto Flash, Fill-in Flash, Front Sync Flash, Manual, Rear Sync Flash, Red-eye Reduction Flash, Slow Sync",
    "interfacetype": "USB 2.0",
    "videointerface": "Video Out",
    "viewfinder": "Optical (Through-the-lens)",
    "ug": "â\u0080\u009cUglyâ\u0080\u009d Very rough looking.   Multiple impressions in metal, excessive finish loss and brassing. Glass / LCDs   / Body will have marks, fungus and/or haze which will affect picture   quality.* Details listed in notes section.",
    "lcdprotectedposition": "Without LCD Protected Position",
    "colour": "Black"
}