{
    "wifi": "Yes",
    "weight": "840 g",
    "isosensitivity": "AUTO, 100 - 12800 (expandable to 52 - 51200 equivalent)",
    "audiofileformats": "Linear PCM",
    "memorycard": "- SD - SDHC (UHS-I compliant) - SDXC (UHS-I compliant)",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "shopcategoriesshophomelaptopscamerasgraphicscardtabletsapplemacnetworkingsmartphonescanonlenses": "Nikon D750 24.3MP DSLR CMOS 3.2\" TCT Touch Screen Camera Body Only Nikon D750 24.3MP DSLR CMOS 3.2\" TCT Touch Screen Camera Black Body Only Free your photography skills with the Nikon D750 DSLR Camera .     This impressive 24.3 megapixel full frame camera lets you stay closer     to the action, delivering sharp and rich images that are truly   stunning.   This camera body is compatible with Nikon F mount lenses. Sensitive photography The 24.3 MP sensor of the D750 lets you capture shots   you've always dreamed of taking. The wide   dynamic range performs   across all sensitivities, so you can enjoy images   with rich tone and   detail. With a full frame sensor, what you see is   what you get, so you   can take the maximum image with the best quality. The EXPEED 4 image processing engine helps to render images to keep     them at their best, whether you're taking a carefully planned still or     capturing Full HD video. The broad ISO range that reaches from 100     to12800 can be further extended to an impressive 51200 equivalent,     putting creative power in your hands. Making movies The Nikon D-750 includes D-Movie, which provides you   with broadcast-quality video to   get the best out of any situation. You   can record in multiple frame   formats, including Full HD 1080p at up   to 60p frame rates, with reduced   noise and less false colour. Specification Camera type Digital SLR camera Processor EXPEED 4 Resolution 24.3 megapixels Type CMOS Size 35.9 x 24.0 mm Cleaning Image sensor cleaning ISO sensitivity AUTO, 100 - 12800 (expandable to 52 - 51200 equivalent) Lens mount Nikon F mount Focus area points 51-point autofocus Type - Live View - Eye-level pentaprism single-lens reflex viewfinder Screen 3.2\" TCT touchscreen Screen features - Resolution: 1229,000 dots - 170° wide-angle viewing - Approx. 100% frame coverage Shutter speed - 30 secs - 1/4000th - Bulb Self-timer - 2 seconds - 5 seconds - 10 seconds - 20 seconds Exposure modes Auto modes (auto; auto [flash off]), scene   modes (portrait;   landscape;  child;  sports; close up;  night   portrait;  night   landscape;  party/indoor;  beach/snow;  sunset;   dusk/dawn;  pet   portrait;  candlelight;  blossom;  autumn colors;    food), special   effects modes (night vision;  colour sketch;  miniature   effect;    selective colour; silhouette;  high key;  low key),   programmed auto with   flexible program(P), shutter-priority auto (S),   aperture-priority auto   (A), manual (M), U1(user settings 1), U2(user   settings 2) Time lapse Yes White balance Auto (2 types), incandescent, fluorescent (7   types), direct   sunlight, flash, cloudy, shade, preset manual (up to 6   values can be   stored, spot white balance measurement available during   live view),   choose color temperature (2500 K to 10000 K), all with   fine-tuning Maximum photo resolution 6016 × 4016p Photo file formats - NEF (RAW) - JPEG - NEF RAW & JPEG Video mode Yes, with sound Maximum video resolution 1920 x 1080p Video file formats MOV Audio file formats Linear PCM Memory card - SD - SDHC (UHS-I compliant) - SDXC (UHS-I compliant) Guide number 12 m at ISO 100 Interface - USB - Type C HDMI Pictbridge / direct printing Yes WiFi Yes Power options Battery Battery type Lithium-ion EN-EL15 Colour Black Dimensions 140.5 x 113 x 78 mm (H x W x D) Weight 840 g",
    "batterytype": "Lithium-ion EN-EL15",
    "videomode": "Yes, with sound",
    "size": "35.9 x 24.0 mm",
    "category": "camera",
    "focusareapoints": "51-point autofocus",
    "dimensions": "140.5 x 113 x 78 mm (H x W x D)",
    "screenfeatures": "- Resolution: 1229,000 dots - 170° wide-angle viewing - Approx. 100% frame coverage",
    "selftimer": "- 2 seconds - 5 seconds - 10 seconds - 20 seconds",
    "photofileformats": "- NEF (RAW) - JPEG - NEF RAW & JPEG",
    "pictbridgedirectprinting": "Yes",
    "poweroptions": "Battery",
    "maximumvideoresolution": "1920 x 1080p",
    "type": "- Live View - Eye-level pentaprism single-lens reflex viewfinder",
    "maximumphotoresolution": "6016 × 4016p",
    "screen": "3.2\" TCT touchscreen",
    "cleaning": "Image sensor cleaning",
    "interface": "- USB - Type C HDMI",
    "videofileformats": "MOV",
    "lensmount": "Nikon F mount",
    "shutterspeed": "- 30 secs - 1/4000th - Bulb",
    "cameratype": "Digital SLR camera",
    "guidenumber": "12 m at ISO 100",
    "colour": "Black",
    "timelapse": "Yes",
    "exposuremodes": "Auto modes (auto; auto [flash off]), scene   modes (portrait;   landscape;  child;  sports; close up;  night   portrait;  night   landscape;  party/indoor;  beach/snow;  sunset;   dusk/dawn;  pet   portrait;  candlelight;  blossom;  autumn colors;    food), special   effects modes (night vision;  colour sketch;  miniature   effect;    selective colour; silhouette;  high key;  low key),   programmed auto with   flexible program(P), shutter-priority auto (S),   aperture-priority auto   (A), manual (M), U1(user settings 1), U2(user   settings 2)",
    "processor": "EXPEED 4",
    "resolution": "24.3 megapixels",
    "whitebalance": "Auto (2 types), incandescent, fluorescent (7   types), direct   sunlight, flash, cloudy, shade, preset manual (up to 6   values can be   stored, spot white balance measurement available during   live view),   choose color temperature (2500 K to 10000 K), all with   fine-tuning"
}