{
    "features": "Dustproof, HDMI, Interchangeable Lenses, USB 2.0",
    "weight": "900 gr",
    "displaytype": "LCD",
    "label13": "Durable Magnesium alloy body - moisture and dust resistant. Many important parts of the D800 have been designed to achieve better durability and lighter weight. The result is the D800 is as reliable on the road as it is in the studio.",
    "label14": "Wireless LAN and Ethernet support via optional Wireless Transmitter WT-4, enabling you to transfer image files using either WiFi or an Ethernet connection.",
    "maxvideoresolution": "1920 x 1080",
    "category": "camera",
    "lightsensitivitymax": "1006400",
    "lensforsd": "Body Only",
    "mpn": "VBA301AE",
    "hdmioutput": "Yes",
    "ean": "018208254989",
    "label0": "36.3 megapixel FX-format (full-frame) CMOS sensor with high signal-to-noise ratio, wide dynamic range and 12-channel readout",
    "label1": "ISO 100â\u0080\u00936400 extendable up to 25,600 (equivalent) and down to 50 (equivalent)",
    "brand": "Nikon",
    "label3": "Multi-area D-Movie records FX- and DX-format Full HD (1080p) movies in 30p, 25p and 24p. Max recording time approx. 29 minutes 59 seconds. Offers uncompressed HDMI output to external devices and high-fidelity audio control",
    "label5": "EXPEED 3 image processing engine with 14-bit A/D conversion and 16-bit image processing for superb tonal gradation",
    "label6": "8 cm (3.2-in.), 921k-dot LCD monitor with auto brightness control anti-reflective, with wide color reproduction",
    "sensortype": "CMOS",
    "screensize": "3.2\"Features:Interchangeable Lenses, Dustproof",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "storagemedia": "High-speed CF and SD dual card slots, compatible with the latest, fastest cards. You can also use two cards simultaneously for a number of functions such as recording JPEG and RAW data on separate cards, recording the same data simultaneously for backup and more.",
    "cameratype": "Digital SLR",
    "megapixels": "36.3 MPConnectivity:HDMI, USB",
    "displaysize": "3.2\"",
    "sensorresolution": "36.3 MP",
    "attr3dcolormatrixmeteringiii": "91k pixel AE AF sensor with full-time face recognition",
    "supportedflashmemory": "CompactFlash Card Type I, CompactFlash I, SD Card, SD Memory Card, SDHC Card, SDHC Memory Card, SDXC Card, SDXC Memory Card",
    "model": "D800EBattery Type:Lithium-Ion"
}