{
    "exposurebracketing": "2 to 5 frames in steps of 1/3, 1/2, 2/3, 1, 2 or 3 EV",
    "dioptriccorrectionrange": "-3 to +1",
    "sdmemorycards": "SDHC memory cards* 2SDXC memory cards* 3",
    "exposurecompensation": "Can be adjusted by -5 to +5 EV in increments of 1/3 or 1/2 EV in , , and modes",
    "opticalviewfindertype": "Fixed eye-level pentaprism",
    "reflexmirror": "Quick return",
    "lexarmedia": "4 GB, 8 GB, 16 GB-",
    "speed": "1/8000 to 30 s in steps of 1/3 or 1/2 EV, bulb, time, X250",
    "displayrotation": "Built-in",
    "facedetection": "Yes",
    "screendetails": "LCD display - 3.2\"",
    "lightsensitivity": "ISO 100-6400, ISO 50-100, ISO 6400-25600, ISO auto",
    "sensorsize": "24 x 35.9mm",
    "totalpixels": "24.71 million",
    "diopteradjustment": "-2 to +1 m -1",
    "accessoryterminal": "Wireless remote controller: WR-1 and WR-R10 (available separately), Remote cord: MC-DC2 (available separately), GPS unit: GP-1/GP-1A (available separately)",
    "afareamodes": "Face-priority AF, wide-area AF, normal-area AF, subject-tracking AF",
    "mpn": "VBA340AE",
    "compatiblelenses": "Compatible with AF NIKKOR lenses, including type G and D lenses (some restrictions apply to PC lenses) and DX lenses, AI-P NIKKOR lenses, and non-CPU AI lenses ( and modes only); IX-NIKKOR lenses, lenses for the F3AF, and non-AI lenses cannot be used The electronic rangefinder can be used with lenses that have a maximum aperture of f/5.6 or faster (the electronic rangefinder supports the center focus point with lenses that have a maximum aperture of f/8 or faster)",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (single-servo AF) or by pressing AE-L/AF-L button",
    "detectionrange": "-2 to +19 EV (ISO 100, 20Â°C/68Â°F)",
    "sensortype": "CMOS",
    "minoperatingtemperature": "0 Â°C",
    "adlbracketing": "2 frames using selected value for one frame or 3 frames using preset values for all frames",
    "flashcontrol": "TTL: i-TTL flash control using 2016-pixel RGB sensor is available with built-in flash and SB-910, SB-900, SB-800, SB-700, SB-600 or SB-400; i-TTL balanced fill-flash for digital SLR is used with matrix and center-weighted metering, standard i-TTL flash for digital SLR with spot metering",
    "flashreadyindicator": "Lights when built-in flash or optional flash unit is fully charged; flashes after flash is fired at full output",
    "focusadjustment": "Automatic",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "audioinput": "Stereo mini-pin jack (3.5-mm diameter; plug-in power supported)",
    "accessoryshoe": "ISO 518 hot-shoe with sync and data contacts and safety lock",
    "weight": "Approx. 765 g/1 lb 11.0 oz with battery and memory card but without body cap; approx. 675 g/1 lb 7.8 oz (camera body only)",
    "flashtype": "Pop-up Flash",
    "cameraflashfeatures": "AF illuminator, Flash +/- compensation, flash exposure bracketing",
    "meteringmode": "TTL exposure metering using 2016-pixel RGB sensor",
    "remotecontrolmodesmll3": "Delayed remote, quick-response remote, remote mirror-up",
    "category": "camera",
    "batterypack": "Optional MB-D15 Multi-Power Battery Pack with one EN-EL15 Rechargeable Li-ion Battery or six AA-size alkaline, Ni-MH or lithium batteries",
    "stillimageformat": "JPEG, NEF (RAW), RAW + JPEG",
    "selftimer": "2 s, 5 s, 10 s, 20 s; 1 to 9 exposures at intervals of 0.5, 1, 2 or 3 s",
    "doubleslot": "Slot 2 can be used for overflow or backup storage or for separate storage of copies created using NEF+JPEG; pictures can be copied between cards",
    "viewfindermagnification": "0.70x",
    "tripodsocket": "1/4 in. (ISO 1222)",
    "effectiveangleofview": "Nikon DX format; focal length in 35mm [135] format equivalent to approx. 1.5x that of lenses with FX-format angle of view",
    "lensmount": "Nikon F mount (with AF coupling and AF contacts)",
    "microphoneoperationmode": "Mono",
    "rangeiso100f14lens20c68f": "Matrix or center-weighted metering: 0 to 20 EV Spot metering: 2 to 20 EV",
    "monitor": "8-cm/3.2-in., approx. 1229k-dot (VGA; 640 x 480 x 4 = 1,228,800 dots), TFT monitor with approx. 170Â° viewing angle, approx. 100% frame coverage and brightness adjustment",
    "flashbracketing": "2 to 5 frames in steps of 1/3, 1/2, 2/3, 1, 2 or 3 EV",
    "flashmodes": "Auto, auto with red-eye reduction, auto slow sync, auto slow sync with red-eye reduction, fill-flash, red-eye reduction, slow sync, slow sync with red-eye reduction, rear-curtain with slow sync, rear-curtain sync, off; Auto FP High-Speed Sync supported",
    "builtinflash": ", , , , , , , : Auto flash with auto pop-up , , , , : Manual pop-up with button release",
    "imagesensor": "23.5 x 15.6 mm CMOS sensor",
    "displaysize": "3.2\"",
    "suppliedaccessoriesmaydifferbycountryorarea": "EN-EL15 Rechargeable Li-ion Battery, MH-25 Battery Charger, DK-5 Eyepiece Cap, DK-23 Rubber Eyecup, UC-E6 USB Cable, AN-DC1 BK Camera Strap, BF-1B Body Cap, BS-1 Accessory Shoe Cover, ViewNX 2 CD-ROM",
    "operatingenvironment": "Temperature: 0 to 40Â°C/32 to 104Â°F; humidity: 85% or less (no condensation)",
    "lensaperture": "Instant return, electronically controlled",
    "typeofcamera": "Single-lens reflex digital camera",
    "fileformat": "MOV",
    "approximateframeadvancerate": "JPEG and 12-bit NEF (RAW) images recorded with DX (24x16) selected for image area: CL 1 to 6 fps, CH 6 fps JPEG and 12-bit NEF (RAW) images recorded with 1.3x (18x12) selected for image area: CL 1 to 6 fps, CH 7 fps 14-bit NEF (RAW) images recorded with DX (24x16) selected for image area: CL 1 to 5 fps, CH 5 fps 14-bit NEF (RAW) images recorded with 1.3x (18x12) selected for image area: CL 1 to 6 fps, CH 6 fps",
    "features": "AE lock, AF Lock, Active D-Lighting technology, DPOF Support, Direct Print, Exif Print support, GPS Ready, HDMI, Histogram Display, Interchangeable Lenses, PictBridge Support, USB 2.0, automatic display brightness adjustment, depth-of-field preview button, digital image rotation, display brightness control, highlight point display, in-camera film editing, mirror lock, red-eye reduction",
    "battery": "One EN-EL15 Rechargeable Li-ion Battery",
    "maxoperatingtemperature": "40 Â°C",
    "metering": "TTL exposure metering using main image sensor",
    "height": "11.3 cm",
    "platinumii": "4 GB, 8 GB, 16 GB, 32 GB",
    "depthoffieldpreview": "Pressing depth-of-field preview button stops lens aperture down to value selected by user ( and modes) or by camera (other modes)",
    "releasemodes": "S (single frame), CL (continuous low speed), CH (continuous high speed), Q (quiet shutter release), (self-timer), MUP (mirror up); interval timer photography supported",
    "sandisk": "2GB* 14 GB, 8 GB, 16 GB, 32 GB64 GB",
    "usb": "Hi-Speed USB",
    "audiorecordingformat": "Linear PCM",
    "viewfinderfieldcoverage": "100%",
    "width": "14.1 cm",
    "magnification": "Approx. 0.94x (50 mm f/1.4 lens at infinity, -1.0 m -1 )",
    "type": "Electronically controlled vertical-travel focal-plane shutter",
    "dustreductionsystem": "Image Sensor Cleaning, Image Dust Off reference data (optional Capture NX 2 software required)",
    "ean": "18208924936",
    "brand": "Nikon",
    "videocompression": "H.264/MPEG-4 Advanced Video Coding",
    "focusingscreen": "Type B BriteView Clear Matte Mark II screen with AF area brackets (framing grid can be displayed)",
    "screensize": "3.2\"",
    "digitalvideoformat": "H.264",
    "whitebalancebracketing": "2 to 5 frames in steps of 1, 2 or 3",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "supportedlanguages": "Arabic, Bengali, Chinese (Simplified and Traditional), Czech, Danish, Dutch, English, Finnish, French, German, Greek, Hindi, Hungarian, Indonesian, Italian, Japanese, Korean, Norwegian, Persian, Polish, Portuguese (European and Brazilian), Romanian, Russian, Spanish, Swedish, Tamil, Thai, Turkish, Ukrainian, Vietnamese",
    "audiooutput": "Stereo mini-pin jack (3.5-mm diameter)",
    "imagequality": "Image sizeFile size* 1No. of images* 1Buffer capacity* 2",
    "cameratype": "Digital SLR",
    "meteringmethod": "Matrix",
    "connectortypes": "1 x Hi-Speed USB Â¦ 1 x HDMI output Â¦ 1 x remote control Â¦ 1 x microphone Â¦ 1 x audio output ( mini-phone stereo 3.5 mm ), USB to computer",
    "guidenumber": "Approx. 12/39, 12/39 with manual flash (m/ft, ISO 100, 20Â°C/68Â°F)",
    "effectivepixels": "24.1 million",
    "framesizepixelsandframerate": "1920 x 1080; 60i (59.94 fields/s)/50i (50 fields/s)* 1920 x 1080; 30p (progressive), 25p, 24p 1280 x 720; 60p, 50p Actual frame rates for 60p, 50p, 30p, 25p and 24p are 59.94, 50, 29.97, 25 and 23.976 fps respectively; options support both â\u0098\u0085high and normal image quality *Available only when 1.3x (18x12) is selected for image area; sensor output is about 60 or 50 fps",
    "viewfinder": "Eye-level pentaprism single-lens reflex viewfinder",
    "shootingprograms": "Autumn colour, Beach/snow, Blossom, Candle, Children, Close-up, Dawn/dusk, Food, High key, Landscape, Low key, Night landscape, Night portrait, Party/indoor, Pet portrait, Portrait mode, Silhouette, Sports mode, Sunset",
    "exposuremetercoupling": "Combined CPU and AI",
    "flashsyncspeed": "X=1/250 s; synchronizes with shutter at 1/320 s or slower (flash range drops at speeds between 1/250 and 1/320 s)",
    "maximumlength": "29 min. 59 s",
    "hdmioutput": "HDMI mini connector (Type C)",
    "lightsensitivitymax": "25600",
    "nikoncreativelightingsystemcls": "Advanced Wireless Lighting supported with: SB-910, SB-900, SB-800 or SB-700 as a master flash and SB-600 or SB-R200 as remotes or SU-800 as commander; built-in flash can serve as master flash in commander mode Auto FP High-Speed Sync and modeling illumination supported with all CLS-compatible flash units except SB-400; Flash Color Information Communication and FV lock supported with all CLS-compatible flash units",
    "media": "SD (Secure Digital) and UHS-I compliant SDHC and SDXC memory cards",
    "redeyereduction": "Yes",
    "lensforsd": "Body only",
    "syncterminal": "AS-15 Sync Terminal Adapter (available separately)",
    "playback": "Full-frame and thumbnail (4, 9, or 72 images or calendar) playback with playback zoom, movie playback, photo and/or movie slide shows, histogram display, highlights, photo information, GPS data display and auto image rotation",
    "dimensionswxhxd": "Approx. 135.5 x 106.5 x 76 mm/5.3 x 4.2 x 3.0 in.",
    "autofocus": "Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected)",
    "panasonic": "4 GB, 6 GB, 8 GB, 12 GB, 16 GB, 24 GB, 32 GB48 GB, 64 GB",
    "lensservo": "Autofocus (AF): Single-servo AF (AF-S); full-time servo AF (AF-F) Manual focus (M)",
    "focuspoint": "Can be selected from 51 or 11 focus points",
    "flashcompensation": "-3 to +1 EV in increments of 1/3 or 1/2 EV",
    "picturecontrolsystem": "Standard, Neutral, Vivid, Monochrome, Portrait, Landscape; selected Picture Control can be modified; storage for custom Picture Controls",
    "imagesizepixels": "DX (24x16) image area: 6000 x 4000 [L], 4496 x 3000 [M], 2992 x 2000 [S] 1.3x (18x12) image area: 4800 x 3200 [L], 3600 x 2400 [M], 2400 x 1600 [S] Photographs with image area of DX (24x16) taken in movie live view: 6000 x 3368 [L], 4496 x 2528 [M], 2992 x 1680 [S] Photographs with image area of 1.3x (18x12) taken in movie live view: 4800 x 2696 [L], 3600 x 2024 [M], 2400 x 1344 [S]",
    "audiorecordingdevice": "Built-in or external stereo microphone; sensitivity adjustable",
    "activedlighting": "Auto, extra high, high, normal, low, off",
    "batteryformfactor": "Manufacturer specific",
    "eyepoint": "19.5 mm (-1.0 m -1 ; from center surface of viewfinder eyepiece lens)",
    "acadapter": "EH-5b AC Adapter; requires EP-5B Power Connector (available separately)",
    "modes": "Live view photography (still images), movie live view (movies)",
    "exposuremodes": "Auto modes ( auto; auto [flash off]); programmed auto with flexible program ( ); shutter-priority auto ( ); aperture-priority auto ( ); manual ( ); scene modes ( portrait; landscape; child; sports; close up; night portrait; night landscape; party/indoor; beach/snow; sunset; dusk/dawn; pet portrait; candlelight; blossom; autumn colors; food); special effects modes ( night vision; color sketch; miniature effect; selective color; silhouette; high key; low key); user settings 1); user settings 2)",
    "shopcategoriesshophomecanoncashbackitemscrumplerexdemofujifilmlowepromanfrottonikonolympuspentaxsonytamractamronusedusedvelbonother": "NIKON D7100 24.1MP BODY ONLY -UNDER 1000 SHOTS- THIS IS A USED ITEM IN EXCELLENT CONDITION IT HAS HARDLY BEEN USE WITH UNDER 1000 SHOTS NO CLEAR SIGNS OF USE BOXED COMPLETE FULL 12 MONTH WARRANTY Nikon Digital SLR Camera D7100 Specifications Type Type of camera Single-lens reflex digital camera Lens mount Nikon F mount (with AF coupling and AF contacts) Effective angle of view Nikon DX format; focal length in 35mm [135] format equivalent to approx. 1.5x that of lenses with FX-format angle of view Effective pixels Effective pixels 24.1 million Image sensor Image sensor 23.5 x 15.6 mm CMOS sensor Total pixels 24.71 million Dust-reduction system Image Sensor Cleaning, Image Dust Off reference data (optional Capture NX 2 software required) Storage Image size (pixels) DX (24x16) image area: 6000 x 4000 [L], 4496 x 3000 [M], 2992 x 2000 [S] 1.3x (18x12) image area: 4800 x 3200 [L], 3600 x 2400 [M], 2400 x 1600 [S] Photographs with image area of DX (24x16) taken in movie live view: 6000 x 3368 [L], 4496 x 2528 [M], 2992 x 1680 [S] Photographs with image area of 1.3x (18x12) taken in movie live view: 4800 x 2696 [L], 3600 x 2024 [M], 2400 x 1344 [S] File format NEF (RAW): 12 or 14 bit, lossless compressed or compressed JPEG: JPEG-Baseline compliant with fine (approx. 1:4), normal (approx. 1:8) or basic (approx. 1:16) compression (Size priority); Optimal quality compression available NEF (RAW)+JPEG: Single photograph recorded in both NEF (RAW) and JPEG formats Picture Control System Standard, Neutral, Vivid, Monochrome, Portrait, Landscape; selected Picture Control can be modified; storage for custom Picture Controls Media SD (Secure Digital) and UHS-I compliant SDHC and SDXC memory cards Double slot Slot 2 can be used for overflow or backup storage or for separate storage of copies created using NEF+JPEG; pictures can be copied between cards File system DCF (Design Rule for Camera File System) 2.0, DPOF (Digital Print Order Format), Exif (Exchangeable Image File Format for Digital Still Cameras) 2.3, PictBridge Viewfinder Viewfinder Eye-level pentaprism single-lens reflex viewfinder Frame coverage Approx. 100% horizontal and 100% vertical Magnification Approx. 0.94x (50 mm f/1.4 lens at infinity, -1.0 m -1 ) Eyepoint 19.5 mm (-1.0 m -1 ; from center surface of viewfinder eyepiece lens) Diopter adjustment -2 to +1 m -1 Focusing screen Type B BriteView Clear Matte Mark II screen with AF area brackets (framing grid can be displayed) Reflex mirror Quick return Depth-of-field preview Pressing depth-of-field preview button stops lens aperture down to value selected by user ( and modes) or by camera (other modes) Lens aperture Instant return, electronically controlled Lens Compatible lenses Compatible with AF NIKKOR lenses, including type G and D lenses (some restrictions apply to PC lenses) and DX lenses, AI-P NIKKOR lenses, and non-CPU AI lenses ( and modes only); IX-NIKKOR lenses, lenses for the F3AF, and non-AI lenses cannot be used The electronic rangefinder can be used with lenses that have a maximum aperture of f/5.6 or faster (the electronic rangefinder supports the center focus point with lenses that have a maximum aperture of f/8 or faster) Shutter Type Electronically controlled vertical-travel focal-plane shutter Speed 1/8000 to 30 s in steps of 1/3 or 1/2 EV, bulb, time, X250 Flash sync speed X=1/250 s; synchronizes with shutter at 1/320 s or slower (flash range drops at speeds between 1/250 and 1/320 s) Release Release modes S (single frame), CL (continuous low speed), CH (continuous high speed), Q (quiet shutter release), (self-timer), MUP (mirror up); interval timer photography supported Approximate frame advance rate JPEG and 12-bit NEF (RAW) images recorded with DX (24x16) selected for image area: CL 1 to 6 fps, CH 6 fps JPEG and 12-bit NEF (RAW) images recorded with 1.3x (18x12) selected for image area: CL 1 to 6 fps, CH 7 fps 14-bit NEF (RAW) images recorded with DX (24x16) selected for image area: CL 1 to 5 fps, CH 5 fps 14-bit NEF (RAW) images recorded with 1.3x (18x12) selected for image area: CL 1 to 6 fps, CH 6 fps Self-timer 2 s, 5 s, 10 s, 20 s; 1 to 9 exposures at intervals of 0.5, 1, 2 or 3 s Remote control modes (ML-L3) Delayed remote, quick-response remote, remote mirror-up Exposure Metering mode TTL exposure metering using 2016-pixel RGB sensor Metering method Matrix: 3D color matrix metering II (type G and D lenses); color matrix metering II (other CPU lenses); color matrix metering available with non-CPU lenses if user provides lens data Center-weighted: Weight of 75% given to 8-mm circle in center of frame; diameter of circle can be changed to 6, 10, or 13 mm, or weighting can be based on average of entire frame (non-CPU lenses use 8-mm circle) Spot: Meters 3.5-mm circle (about 2.5% of frame) centered on selected focus point (on center focus point when non-CPU lens is used) Range (ISO 100, f/1.4 lens, 20Â°C/68Â°F) Matrix or center-weighted metering: 0 to 20 EV Spot metering: 2 to 20 EV Exposure meter coupling Combined CPU and AI Exposure modes Auto modes ( auto; auto [flash off]); programmed auto with flexible program ( ); shutter-priority auto ( ); aperture-priority auto ( ); manual ( ); scene modes ( portrait; landscape; child; sports; close up; night portrait; night landscape; party/indoor; beach/snow; sunset; dusk/dawn; pet portrait; candlelight; blossom; autumn colors; food); special effects modes ( night vision; color sketch; miniature effect; selective color; silhouette; high key; low key); user settings 1); user settings 2) Exposure compensation Can be adjusted by -5 to +5 EV in increments of 1/3 or 1/2 EV in , , and modes Exposure bracketing 2 to 5 frames in steps of 1/3, 1/2, 2/3, 1, 2 or 3 EV Exposure lock Luminosity locked at detected value with AE-L/AF-L button ISO sensitivity (Recommended Exposure Index) ISO 100 to 6400 in steps of 1/3 EV; can also be set to approx. 0.3, 0.5, 0.7, 1 or 2 EV (ISO 25600 equivalent) above ISO 6400; auto ISO sensitivity control available Active D-Lighting Auto, extra high, high, normal, low, off ADL bracketing 2 frames using selected value for one frame or 3 frames using preset values for all frames Focus Autofocus Nikon Advanced Multi-CAM 3500DX autofocus sensor module with TTL phase detection, fine-tuning, 51 focus points (including 15 cross-type sensors; the center point is available at apertures slower than f/5.6 and faster than f/8 or at f/8), and AF-assist illuminator (range approx. 0.5 to 3 m/1 ft 8 in. to 9 ft 10 in.) Detection range -2 to +19 EV (ISO 100, 20Â°C/68Â°F) Lens servo Autofocus (AF): Single-servo AF (AF-S); continuous-servo AF (AF-C); auto AF-S/AF-C selection (AF-A); predictive focus tracking activated automatically according to subject status Manual focus (M): Electronic rangefinder can be used Focus point Can be selected from 51 or 11 focus points AF-area modes Single-point AF, 9-, 21- or 51-point dynamic-area AF, 3D-tracking, auto-area AF Focus lock Focus can be locked by pressing shutter-release button halfway (single-servo AF) or by pressing AE-L/AF-L button Flash Built-in flash , , , , , , , : Auto flash with auto pop-up , , , , : Manual pop-up with button release Guide number Approx. 12/39, 12/39 with manual flash (m/ft, ISO 100, 20Â°C/68Â°F) Flash control TTL: i-TTL flash control using 2016-pixel RGB sensor is available with built-in flash and SB-910, SB-900, SB-800, SB-700, SB-600 or SB-400; i-TTL balanced fill-flash for digital SLR is used with matrix and center-weighted metering, standard i-TTL flash for digital SLR with spot metering Flash modes Auto, auto with red-eye reduction, auto slow sync, auto slow sync with red-eye reduction, fill-flash, red-eye reduction, slow sync, slow sync with red-eye reduction, rear-curtain with slow sync, rear-curtain sync, off; Auto FP High-Speed Sync supported Flash compensation -3 to +1 EV in increments of 1/3 or 1/2 EV Flash bracketing 2 to 5 frames in steps of 1/3, 1/2, 2/3, 1, 2 or 3 EV Flash-ready indicator Lights when built-in flash or optional flash unit is fully charged; flashes after flash is fired at full output Accessory shoe ISO 518 hot-shoe with sync and data contacts and safety lock Nikon Creative Lighting System (CLS) Advanced Wireless Lighting supported with: SB-910, SB-900, SB-800 or SB-700 as a master flash and SB-600 or SB-R200 as remotes or SU-800 as commander; built-in flash can serve as master flash in commander mode Auto FP High-Speed Sync and modeling illumination supported with all CLS-compatible flash units except SB-400; Flash Color Information Communication and FV lock supported with all CLS-compatible flash units Sync terminal AS-15 Sync Terminal Adapter (available separately) White balance White balance Auto (2 types), incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual (up to 6 values can be stored, Spot White Balance measurement available during live view), choose color temperature (2500 K to 10000 K), all with fine-tuning White balance bracketing 2 to 5 frames in steps of 1, 2 or 3 Live View Modes Live view photography (still images), movie live view (movies) Lens servo Autofocus (AF): Single-servo AF (AF-S); full-time servo AF (AF-F) Manual focus (M) AF-area modes Face-priority AF, wide-area AF, normal-area AF, subject-tracking AF Autofocus Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected) Movie Metering TTL exposure metering using main image sensor Metering method Matrix Frame size (pixels) and frame rate 1920 x 1080; 60i (59.94 fields/s)/50i (50 fields/s)* 1920 x 1080; 30p (progressive), 25p, 24p 1280 x 720; 60p, 50p Actual frame rates for 60p, 50p, 30p, 25p and 24p are 59.94, 50, 29.97, 25 and 23.976 fps respectively; options support both â\u0098\u0085high and normal image quality *Available only when 1.3x (18x12) is selected for image area; sensor output is about 60 or 50 fps File format MOV Video compression H.264/MPEG-4 Advanced Video Coding Audio recording format Linear PCM Audio recording device Built-in or external stereo microphone; sensitivity adjustable Maximum length 29 min. 59 s Monitor Monitor 8-cm/3.2-in., approx. 1229k-dot (VGA; 640 x 480 x 4 = 1,228,800 dots), TFT monitor with approx. 170Â° viewing angle, approx. 100% frame coverage and brightness adjustment Playback Playback Full-frame and thumbnail (4, 9, or 72 images or calendar) playback with playback zoom, movie playback, photo and/or movie slide shows, histogram display, highlights, photo information, GPS data display and auto image rotation Interface USB Hi-Speed USB HDMI output HDMI mini connector (Type C) Accessory terminal Wireless remote controller: WR-1 and WR-R10 (available separately), Remote cord: MC-DC2 (available separately), GPS unit: GP-1/GP-1A (available separately) Audio input Stereo mini-pin jack (3.5-mm diameter; plug-in power supported) Audio output Stereo mini-pin jack (3.5-mm diameter) Supported languages Supported languages Arabic, Bengali, Chinese (Simplified and Traditional), Czech, Danish, Dutch, English, Finnish, French, German, Greek, Hindi, Hungarian, Indonesian, Italian, Japanese, Korean, Norwegian, Persian, Polish, Portuguese (European and Brazilian), Romanian, Russian, Spanish, Swedish, Tamil, Thai, Turkish, Ukrainian, Vietnamese Power source Battery One EN-EL15 Rechargeable Li-ion Battery Battery pack Optional MB-D15 Multi-Power Battery Pack with one EN-EL15 Rechargeable Li-ion Battery or six AA-size alkaline, Ni-MH or lithium batteries AC adapter EH-5b AC Adapter; requires EP-5B Power Connector (available separately) Tripod socket Tripod socket 1/4 in. (ISO 1222) Dimensions / weight Dimensions (W x H x D) Approx. 135.5 x 106.5 x 76 mm/5.3 x 4.2 x 3.0 in. Weight Approx. 765 g/1 lb 11.0 oz with battery and memory card but without body cap; approx. 675 g/1 lb 7.8 oz (camera body only) Operating environment Operating environment Temperature: 0 to 40Â°C/32 to 104Â°F; humidity: 85% or less (no condensation) Accessories Supplied accessories (may differ by country or area) EN-EL15 Rechargeable Li-ion Battery, MH-25 Battery Charger, DK-5 Eyepiece Cap, DK-23 Rubber Eyecup, UC-E6 USB Cable, AN-DC1 BK Camera Strap, BF-1B Body Cap, BS-1 Accessory Shoe Cover, ViewNX 2 CD-ROM The SD, SDHC and SDXC logos are trademark of the SD Card Association. PictBridge is a trademark. HDMI, the HDMI logo and High-Definition Multimedia Interface are trademarks or registered trademarks of HDMI Licensing, LLC. Google and Androidâ\u0084¢ are trademarks or registered trademarks of Google Inc. Products and brand names are trademarks or registered trademarks of their respective companies. Images in viewfinders, on LCDs and monitors shown in this site are simulated. Memory card capacity The following table shows the approximate number of pictures that can be stored on an 8 GB SanDisk Extreme Pro SDHC UHS-I card at different image quality, image size and image area settings. DX (24x16) image area Image quality Image size File size* 1 No. of images* 1 Buffer capacity* 2 NEF (RAW), Lossless compressed, 12-bit - 22.7 MB 191 7 NEF (RAW), Lossless compressed, 14-bit - 28.5 MB 148 6 NEF (RAW), Compressed, 12-bit - 20.2 MB 260 9 NEF (RAW), Compressed, 14-bit - 24.9 MB 217 8 JPEG fine* 3 Large Medium Small 12.0 MB 7.4 MB 3.8 MB 507 853 1600 33 100 100 JPEG normal* 3 Large Medium Small 6.2 MB 3.7 MB 1.9 MB 1000 1600 3200 100 100 100 JPEG basic* 3 Large Medium Small 2.9 MB 1.9 MB 1.0 MB 1900 3200 6000 100 100 100 1.3x (18x12) image area Image quality Image size File size* 1 No. of images* 1 Buffer capacity* 2 NEF (RAW), Lossless compressed, 12-bit - 15.1 MB 295 12 NEF (RAW), Lossless compressed, 14-bit - 18.8 MB 229 8 NEF (RAW), Compressed, 12-bit - 13.4 MB 399 14 NEF (RAW), Compressed, 14-bit - 16.3 MB 334 11 JPEG fine* 3 Large Medium Small 8.2 MB 5.0 MB 2.7 MB 764 1200 2200 73 100 100 JPEG normal* 3 Large Medium Small 4.1 MB 2.5 MB 1.4 MB 1500 2400 4400 100 100 100 JPEG basic* 3 Large Medium Small 2.0 MB 1.3 MB 0.7 MB 2900 4600 8000 100 100 100 *1 All figures are approximate. File size varies with scene recorded. *2 Maximum number of exposures that can be stored in memory buffer at ISO 100. Drops if optimal quality is selected for JPEG compression, ISO sensitivity is set to Hi 0.3 or higher, or long exposure noise reduction or auto distortion control is on. *3 Figures assume JPEG compression is set to Size priority. Selecting optimal quality increases the file size of JPEG images; number of images and buffer capacity drop accordingly. Approved memory cards The following SD memory cards have been tested and approved for use in the camera. Cards with class 6 or faster write speeds are recommended for movie recording. Recording may end unexpectedly when cards with slower write speeds are used. SD memory cards SDHC memory cards* 2 SDXC memory cards* 3 SanDisk 2GB* 1 4 GB, 8 GB, 16 GB, 32 GB 64 GB Toshiba Panasonic 4 GB, 6 GB, 8 GB, 12 GB, 16 GB, 24 GB, 32 GB 48 GB, 64 GB Lexar Media 4 GB, 8 GB, 16 GB - Platinum II 4 GB, 8 GB, 16 GB, 32 GB Professional Full-HD Video - 4 GB, 8 GB, 16 GB *1 Check that any card readers or other devices with which the card will be used support 2 GB cards. *2 Check that any card readers or other devices with which the card will be used are SDHC-compliant. The camera supports UHS-I. *3 Check that any card readers or other devices with which the card will be used are SDXC-compliant. The camera supports UHS-I. FOR ANYMORE INFORMATION OR FOR CREDIT/DEBIT CARD PAYMENTS CALL US ON 02920 394182 Powered by eBay Turbo Lister IF YOU WOULD LIKE ANY MORE INFORMATION ABOUT THIS ITEM, OR ANY OF OUR OTHER ITEMS IN OUR EBAY STORE, OF IF YOU WOULD LIKE TO PAY WITH CREDIT/DEBIT CARD THEN PLEASE FEEL FREE TO RING THE OUR NEWPORT STORE ON 01633 262738 CARDIFF STORE ON 02920 394182 **RETURNS** UNDER THE DISTANCE SELLERS ACT YOU ARE ENTITLED TO CANCEL AND RETURN YOUR ORDER LESS THE COST OF POSTAGE THAT IT HAS COST US TO POST THE ITEM TO YOU. THIS ONLY COVERS YOU FOR BUY IT NOW ITEMS NOT AUCTION STYLE PURCHASES. IF FOR ANY REASON YOU WISH TO RETURN ANY ITEM THAT YOU BUY FROM CAMERA CENTRE UK THEN PLEASE INCLUDE A COPY OF YOUR ORIGINAL RECEIPT AND A COVER NOTE EXPLAINING THE REASON FOR THE RETURN. THIS WILL INSURE THAT YOUR REQUEST IS PROCESSED QUICKLY AND EFFICIENTLY WITHOUT DELAY. RETURNS MUST BE WITHIN 7 DAYS OF RECEIVING YOUR ITEM. THE MAXIMUM RETURNS POSTAGE WE WILL PAY IS Â£7.90 FOR UK .PLEASE DO NOT SEND THE ITEM BACK SPECIAL DELIVERY AS WE WILL ONLY COVER UP TO THIS MUCH. WE ENDEVOUR TO SORT ANY ISSUES OUT AS SOON AS THEY ARISE, BUT IN SOME CASES THERE MAY BE A SMALL DELAY. THIS IS NOT A HUGE PROBLEM IF YOU BID AND CHANGE YOUR MIND, OR JUST BID BY MISTAKE, BUT PLEASE - IF YOU WISH TO CANCEL YOUR BID - LET US KNOW ATLEAST 24 HOURS PRIOR TO THE LISTING ENDING, THIS WILL INSURE THAT NO EBAY CASES ARE OPENED AND THAT OTHERS CAN HAVE THE CHANCE TO PURCHASE THE ITEM WITHOUT HAVING TO WAIT WHILE THE ITEM IS RELISTED. **POSTAGE** IN SOME CASES POSTAGE MAY BE A LITTLE MORE TO SOME AREAS OF THE WORLD. IF YOU ARE UNSURE OF THE COST TO YOUR AREA PLEASE FEEL FREE TO EMAIL AND ASK AND WE WILL GET BACK TO YOU AS SOON AS POSSIBLE. THIS WILL INSURE THAT YOUR ORDER IS PROCESSED THANK YOU FOR LOOKING FINANCE AVAILABLE ON ALL NEW PRODUCTS OVER Â£300 PLEASE CALL US ON 01633 262738 OR 02920 394182 FOR DETAILS",
    "isosensitivityrecommendedexposureindex": "ISO 100 to 6400 in steps of 1/3 EV; can also be set to approx. 0.3, 0.5, 0.7, 1 or 2 EV (ISO 25600 equivalent) above ISO 6400; auto ISO sensitivity control available",
    "depth": "8.2 cm",
    "fullhdvideo": "-4 GB, 8 GB, 16 GB",
    "sensorresolution": "24.3 MP",
    "viewfindertype": "Optical",
    "filesystem": "DCF (Design Rule for Camera File System) 2.0, DPOF (Digital Print Order Format), Exif (Exchangeable Image File Format for Digital Still Cameras) 2.3, PictBridge",
    "supportedflashmemory": "SD Card, SD Memory Card, SDHC Card, SDHC Memory Card, SDXC Card, SDXC Memory Card",
    "model": "D600",
    "framecoverage": "Approx. 100% horizontal and 100% vertical",
    "whitebalance": "Auto (2 types), incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual (up to 6 values can be stored, Spot White Balance measurement available during live view), choose color temperature (2500 K to 10000 K), all with fine-tuning"
}