{
    "isosensitivity": "ISO 100-12800; can also be set to approx. 0.3, 0.7, or 1 EV (ISO 25600 equivalent) above ISO 12800",
    "exposurecompensation": "Can be adjusted by -5 - +5 EV in increments of 1/3 or 1/2 EV in P, S, A, and M modes",
    "reflexmirror": "Quick return",
    "speed": "1/4000 - 30 s in steps of 1/3 or 1/2 EV; Bulb; Time",
    "monitor": "8.1 cm/3.2-in. (3 : 2), approx. 1037k-dot (720 x 480 x 3 = 1,036,800 dots), vari-angle TFT monitor with 170 ° viewing angle, approx. 100% frame coverage, and brightness adjustment",
    "shopcategoriesshophomecameracameralensaccessoiresother": "TECHNESE_Mobile Phones．Digital Cameras．Accessories As Nikon's 'advanced beginner' DSLR, the D5300 takes the D5200's place between the entry-level D3200 and the enthusiast-targeted D7100 in the company's APS-C lineup. The D5300 offers 24MP resolution (like its APS-C stablemates), an articulated rear LCD and more physical controls than the D3200, but without the twin-dial interface and professional grade AF system of the decidedly higher market (and much more customizable) D7100.The D5300 also offers a beefed-up video mode, which is now capable of true 1080/60p HD video. This, plus the slightly enlarged (3.2in compared to 3in) fully-articulated 1.04 million-dot LCD screen should mean that the D5300 is attractive to videographers as well as stills photographers. Easy to miss, but useful features include built-in Wi-Fi and GPS - both firsts for Nikon's DSLR lineup. Battery life gets a boost too - according to CIPA figures the D5300 offers an endurance of 600 shots, compared to 500 from the D5200. Remember though that this figure does not take features like Wi-Fi or GPS into account, and we'd expect both to have an impact on battery life. Type Single-lens reflex digital camera Lens mount Nikon F mount (with AF contacts) Effective angle of view Nikon DX format; focal length equivalent to approx. 1.5x that of lenses with FX format angle of view Effective pixels 24.2 million Image sensor 23.5 x 15.6 mm CMOS sensor Total pixels 24.78 million Dust-reduction System Image sensor cleaning, Image Dust Off reference data (optional Capture NX 2 software required) Image size (pixels) 6000 x 4000 (Large) 4496 x 3000 (Medium) 2992 x 2000 (Small) File format NEF (RAW): 12- or 14 bit, compressed JPEG: JPEG-Baseline compliant with fine (approx. 1 : 4), normal (approx. 1 : 8), or basic (approx. 1 : 16) compression NEF (RAW)+JPEG: Single photograph recorded in both NEF (RAW) and JPEG formats Picture Control System Standard, Neutral, Vivid, Monochrome, Portrait, Landscape; selected Picture Control can be modified; storage for custom Picture Controls Media SD (Secure Digital) and UHS-I compliant SDHC and SDXC memory cards File system DCF (Design Rule for Camera File System) 2.0, DPOF (Digital Print Order Format), Exif (Exchangeable Image File Format for Digital Still Cameras) 2.3, PictBridge Viewfinder Eye-level pentamirror single-lens reflex viewfinder Frame coverage Approx. 95% horizontal and 95% vertical Magnification Approx. 0.82 x (50 mm f/1.4 lens at infinity, -1.0 m-1) Eyepoint 18 mm (-1.0 m-1; from center surface of viewfinder eyepiece lens) Diopter adjustment -1.7 - +1.0 m-1 Focusing screen Type B BriteView Clear Matte Mark VII screen Reflex mirror Quick return Lens aperture Instant return, electronically controlled Compatible lenses Autofocus is available with AF-S and AF-I lenses. Autofocus is not available with other type G and D lenses, AF lenses (IX NIKKOR and lenses for the F3AF are not supported), and AI-P lenses. Non-CPU lenses can be used in mode M, but the camera exposure meter will not function. The electronic rangefinder can be used with lenses that have a maximum aperture of f/5.6 or faster. Type Electronically-controlled vertical-travel focal-plane shutter Speed 1/4000 - 30 s in steps of 1/3 or 1/2 EV; Bulb; Time Flash sync speed X=1/200 s; synchronizes with shutter at 1/200 s or slower Release mode Single frame, continuous L, continuous H, quiet shutter release, self-timer, delayed remote; ML-L3, quick-response remote; ML-L3; interval timer photography supported Frame advance rate Continuous L : Up to 3 fps Continuous H : Up to 5 fps (JPEG and 12-bit NEF/RAW) or 4 fps (14-bit NEF/RAW) Note: Frame rates assume continuous-servo AF, manual or shutterpriority auto exposure, a shutter speed of 1/250 s or faster, Release selected for Custom Setting a1 (AF-C priority selection), and other settings at default values. Self-timer 2 s, 5 s, 10 s, 20 s; 1-9 exposures Metering mode TTL exposure metering using 2016-pixel RGB sensor Metering method Matrix metering: 3D color matrix metering II (type G, E, and D lenses); color matrix metering II (other CPU lenses) Center-weighted metering: Weight of 75% given to 8-mm circle in center of frame Spot metering: Meters 3.5-mm circle (about 2.5% of frame) centered on selected focus point Range (ISO 100, f/1.4 lens, 20 °C/68 °F) Matrix or center-weighted metering: 0-20 EV Spot metering: 2-20 EV Exposure meter coupling CPU Mode Auto modes (auto; auto (flash off)); programmed auto with flexible program (P); shutter-priority auto (S); aperture-priority auto (A); manual (M); scene modes (portrait; landscape; child; sports; close up; night portrait; night landscape; party/indoor; beach/snow; sunset; dusk/dawn; pet portrait; candlelight; blossom; autumn colors; food); special effects modes (night vision; color sketch; toy camera effect; miniature effect; selective color; silhouette; high key; low key; HDR painting) Exposure compensation Can be adjusted by -5 - +5 EV in increments of 1/3 or 1/2 EV in P, S, A, and M modes Bracketing Exposure bracketing: 3 shots in steps of 1/3 or 1/2 EV White balance bracketing: 3 shots in steps of 1 Active D-Lighting bracketing: 2 shots Exposure lock Luminosity locked at detected value with AE-L/AF-L button ISO sensitivity (Recommended Exposure Index) ISO 100-12800 in steps of 1/3 EV. Can also be set to approx. 0.3, 0.7, or 1 EV (ISO 25600 equivalent) above ISO 12800; auto ISO sensitivity control available Active D-Lighting Auto, Extra high, High, Normal, Low, Off Autofocus Nikon Multi-CAM 4800DX autofocus sensor module with TTL phase detection, 39 focus points (including 9 cross-type sensor), and AF-assist illuminator (range approx. 0.5-3 m/1 ft 8 in.-9 ft 10 in.) Detection range -1 - +19 EV (ISO 100, 20 °C/68 °F) Lens servo Autofocus (AF): Single-servo AF (AF-S); continuous-servo AF (AF-C); auto AF-S/AF-C selection (AF-A); predictive focus tracking activated automatically according to subject status Manual focus (MF): Electronic rangefinder can be used Focus point Can be selected from 39 or 11 focus points AF-area mode Single-point AF, 9-, 21-, or 39- point dynamic-area AF, 3D-tracking, auto-area AF Focus lock Focus can be locked by pressing shutter-release button halfway (single-servo AF) or by pressing AE-L/AF-L button Built-in flash Auto, portrait, child, close up, night portrait, party/indoor, pet portrait, color sketch, toy camera effect: Auto flash with auto pop-up P, S, A, M, food: Manual pop-up with button release Guide Number Approx. 12/39, 13/43 with manual flash (m/ft, ISO 100, 20 °C/68 °F) Flash control TTL: i-TTL flash control using 2016-pixel RGB sensor is available with built-in flash and SB-910, SB-900, SB-800, SB-700, SB-600, SB-400 or SB-300; i-TTL balanced fill-flash for digital SLR is used with matrix and center-weighted metering, standard i-TTL flash for digital SLR with spot metering Flash mode Auto, auto with red-eye reduction, auto slow sync, auto slow sync with red-eye reduction, fill-flash, red-eye reduction, slow sync, slow sync with red-eye reduction, rear-curtain with slow sync, rear-curtain sync, off Flash compensation -3 - +1 EV in increments of 1/3 or 1/2 EV Flash-ready indicator Lights when built-in flash or optional flash unit is fully charged; flashes after flash is fired at full output Accessory shoe ISO 518 hot-shoe with sync and data contacts and safety lock Nikon Creative Lighting System (CLS) Advanced Wireless Lighting supported with SB-910, SB-900, SB-800, or SB-700 as a master flash or SU-800 as commander; Flash Color Information Communication supported with all CLS-compatible flash units Sync terminal AS-15 sync terminal adapter (available separately) White balance Auto, incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual, all except preset manual with fine-tuning. Lens servo Autofocus (AF): Single-servo AF (AF-S); full-time-servo AF (AF-F) Manual focus (MF) AF-area mode Face-priority AF, wide-area AF, normal-area AF, subject-tracking AF Autofocus Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected) Automatic scene selection Available in auto and auto (flash off) modes Metering TTL exposure metering using main image sensor Metering method Matrix Frame size (pixels) and frame rate 1920 x 1080, 60p (progressive)/50p/30p/25p/24p, high/normal 1280 x 720, 60p/50p, high/normal 640 x 424, 30p/25p, high/normal Frame rates of 30p (actual frame rate 29.97 fps) and 60p (actual frame rate 59.94 fps) are available when NTSC is selected for video mode. 25p and 50p are available when PAL is selected for video mode. Actual frame rate when 24p is selected is 23.976 fps. File format MOV Video compression H.264/MPEG-4 Advanced Video Coding Audio recording format Linear PCM Audio recording device Built-in or external stereo microphone; sensitivity adjustable ISO sensitivity ISO 100-12800; can also be set to approx. 0.3, 0.7, or 1 EV (ISO 25600 equivalent) above ISO 12800 Monitor 8.1 cm/3.2-in. (3 : 2), approx. 1037k-dot (720 x 480 x 3 = 1,036,800 dots), vari-angle TFT monitor with 170 ° viewing angle, approx. 100% frame coverage, and brightness adjustment Playback Full-frame and thumbnail (4, 12, or 80 images or calendar) playback with playback zoom, movie playback, photo and/or movie slide shows, histogram display, highlights, auto image rotation, picture rating, and image comment (up to 36 characters) USB Hi-Speed USB Video output NTSC, PAL HDMI output Type C mini-pin HDMI connector Accessory terminal Wireless remote controllers: WR-1, WR-R10 (available separately) Remote cords: MC-DC2 (available separately) GPS units: GP-1/GP-1A (available separately) Audio input Stereo mini-pin jack (3.5mm diameter); supports optional ME-1 stereo microphones Standards IEEE 802.11b, IEEE 802.11g Communications protocols IEEE 802.11b: DSSS/CCK IEEE 802.11g: OFDM Operating frequency 2412-2462 MHz (channels 1-11) Range (line of sight) Approximately 30 m/98 ft (assumes no interference; range may vary with signal strength and presence or absence of obstacles) Data rate 54 Mbps Maximum logical data rates according to IEEE standard. Actual rates may differ. Security Authentication: Open system, WPA2-PSK Encryption: AES Wireless setup Supports WPS Access protocols Infrastructure Receiving frequency 1575.42 MHz (C/A code) Geodesics WGS84 Supported languages Arabic, Bengali, Chinese (Simplified and Traditional), Czech, Danish, Dutch, English, Finnish, French, German, Greek, Hindi, Hungarian, Indonesian, Italian, Japanese, Korean, Norwegian, Persian, Polish, Portuguese (Portugal and Brazil), Romanian, Russian, Spanish, Swedish, Tamil, Thai, Turkish, Ukrainian, Vietnamese Battery One rechargeable Li-ion EN-EL14a battery AC adapter EH-5b AC adapter; requires EP-5A power connector (available separately) Tripod socket 1/4 in. (ISO 1222) Dimensions (W x H x D) Approx. 125 x 98 x 76 mm (49.2 x 3.9 x 3 in.) Weight Approx. 530 g (1 lb 2.7 oz) with battery and memory card but without body cap; approx. 480 g/1 lb 0.9 oz (camera body only) Temperature 0 °C - 40 °C (+32 °F - 104 °F) Humidity 85% or less (no condensation) Nikon D5300 DSLR Body Nikon AF-S DX Nikkor 18-140mm f/3.5-5.6G ED VR BS-1 accessory shoe cover DK-25 rubber eyecup BF-1B body cap EN-EL14a rechargeable Li-ion battery (with terminal cover) MH-24 battery charger AN-DC3 strap UC-E17 USB cable EG-CP16 audio/video cable DK-5 eyepiece cap ViewNX 2 CD Reference CD (contains the Reference Manual) Technese Enterprises Limited 1 Year Warranty 8GB Memory Card 67mm UV Filter Cleaning Kit Set ( Air Blower , Lens Pen ,Cleaing Cloths) Power cord may not fit your country , we will provide FREE charger adaptor if necessary Technese Enterprises Limited 1 Year Warranty Items are brand new and are not refurbished items. All specifications noted are manufacturer specifications and are subject to change without notice. PLEASE EMAIL US with any questions before bid to avoid receiving items that buyers will not be satisfied with. If buyers would like to cancel an order, a 10% charge (counting total ending price/handling fee) will be administered. Non paying buyers will be reported to eBay and as a result, negative feedback will be left. Images used are for reference only. We will not be held responsible for the injuries or damages of the packaging during delivery. Buying an item from us constitutes that buyers understand and agree with our terms & conditions. Before bidding or purchasing, please read our Warranty / Returns and other regulations. The language on the system interface will be changed into English as the default language by us except some mobile accessories. (The language of these products may be compactible to the user’s mobile device.) If customer has any special requests on the language of the system interface, please contact Technese before dispatched. We reserve the right to vary the Terms of Sales form time to time without notice. ONLY ship to Paypal confirmed address and NO PO Box , FPO or APO Address. Items will be dispatched from Hong Kong. The transaction does not include any Import Tax / Duty / VAT / Brokerage Fees / Handling Fees . It is the sole responsibility of buyers. For more information about the tax rate, please check with local custom department before purchase. FREE SHIPPING is offered to certain countries only. Please open the parcel and check all the items included before signing on the acknowledge receipt for the courier. We accept PayPal only (with verified and confirmed address). The Paypal must be paid within 7 days. Buyers who fail to pay will be reported to eBay. Payment must be received, in full, prior to the item being sent out. No sending money and cheques overseas. We do not accept any other forms of payment. All items will come with our store warranty against manufacture defects (excluding wear and tear). Buyers can return the items for service in case of warranty issues. We offer a 7-day No Question Asked Exchange Policy from the day buyers receive the items and only if buyers could follow the below return guidelines: Items must be returned in Original Condition with the product packaging, booklets / manuals, swing tags, labels and all other accessories included. All returns must be boxed and packed securely for shipping, and are in re-saleable condition when we receive them. Buyers are required to contact us before sending anything back to us. Buyers must ship the items back under insured delivery and label as defective return. Buyers are responsible for the cost of shipping the item back to us and returning of the item and these costs are non-refundable. If buyers do not pay this cost, we shall not send the product back and shall keep the products for solely 60 days. If this cost is still not received from buyers within after 60 days, we will dispose the product without prior notice. 12-month Warranty This products are covered by 12 months warranty. The period of the warranty shall be 12 months starting from the purchase date. Buyers are required to contact us before sending anything back to us. Buyers are responsible for the cost of shipping the item back to us and returning of the item and these costs are non-refundable. If buyers do not pay this cost, we shall not send the product back and shall keep the products for solely 60 days. If this cost is still not received from buyers within after 60 days, we will dispose the product without prior notice. Buyers are responsible for the cost of shipping the item back to us and for the returning of the item. Defective item must be returned within the 7 working days upon receiving the item. International warranty can be arranged for extra fees, please contact us for more details. The Warranty shall be valid only when we receive the faulty product within the period of warranty. Any previous notifications from buyers will become invalid if we cannot receive the product within the warranty period. For non-repairable products, we shall not compensate buyer with 100% value of the original purchase unit price. Please consider with the rate of depreciation. Both the 7-day No Question Asked Exchange Policy and 12-month Warranty does NOT apply to the followings: Buyer makes any further use, alters, or repairs to the malfunctioning product without the agreement of us. The serial number of the item does not match our record or the serial number has been scratched, peeled off, or disappeared. Periodic checkup, maintenance, repair, or replacement of parts due to normal wear and tears. Costs relating to transport, removal, or installation of the product. Misuse, including the failure to use this product for its normal purposes or incorrect installation. Damages caused by shock or fall, sand, dirt, dust, dampness or corrosion, leaky batteries, lightning, liquid, fire, acts of god, war, public ventilation or any other causes beyond the control of us. Damage on any other items used in conjunction with the product. ©TECHNESE ENTERPRISES LIMITED",
    "geodesics": "WGS84",
    "totalpixels": "24.78 million",
    "diopteradjustment": "-1.7 - +1.0 m-1",
    "accessoryterminal": "Wireless remote controllers: WR-1, WR-R10 (available separately) Remote cords: MC-DC2 (available separately) GPS units: GP-1/GP-1A (available separately)",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (single-servo AF) or by pressing AE-L/AF-L button",
    "detectionrange": "-1 - +19 EV (ISO 100, 20 °C/68 °F)",
    "communicationsprotocols": "IEEE 802.11b: DSSS/CCK IEEE 802.11g: OFDM",
    "flashreadyindicator": "Lights when built-in flash or optional flash unit is fully charged; flashes after flash is fired at full output",
    "compatiblelenses": "Autofocus is available with AF-S and AF-I lenses. Autofocus is not available with other type G and D lenses, AF lenses (IX NIKKOR and lenses for the F3AF are not supported), and AI-P lenses. Non-CPU lenses can be used in mode M, but the camera exposure meter will not function. The electronic rangefinder can be used with lenses that have a maximum aperture of f/5.6 or faster.",
    "standards": "IEEE 802.11b, IEEE 802.11g",
    "audioinput": "Stereo mini-pin jack (3.5mm diameter); supports optional ME-1 stereo microphones",
    "lensservo": "Autofocus (AF): Single-servo AF (AF-S); full-time-servo AF (AF-F) Manual focus (MF)",
    "security": "Authentication: Open system, WPA2-PSK Encryption: AES",
    "videooutput": "NTSC, PAL",
    "accessoryshoe": "ISO 518 hot-shoe with sync and data contacts and safety lock",
    "weight": "Approx. 530 g (1 lb 2.7 oz) with battery and memory card but without body cap; approx. 480 g/1 lb 0.9 oz (camera body only)",
    "receivingfrequency": "1575.42 MHz (C/A code)",
    "flashmode": "Auto, auto with red-eye reduction, auto slow sync, auto slow sync with red-eye reduction, fill-flash, red-eye reduction, slow sync, slow sync with red-eye reduction, rear-curtain with slow sync, rear-curtain sync, off",
    "effectivepixels": "24.2 million",
    "meteringmode": "TTL exposure metering using 2016-pixel RGB sensor",
    "humidity": "85% or less (no condensation)",
    "category": "camera",
    "isosensitivityrecommendedexposureindex": "ISO 100-12800 in steps of 1/3 EV. Can also be set to approx. 0.3, 0.7, or 1 EV (ISO 25600 equivalent) above ISO 12800; auto ISO sensitivity control available",
    "selftimer": "2 s, 5 s, 10 s, 20 s; 1-9 exposures",
    "flashcontrol": "TTL: i-TTL flash control using 2016-pixel RGB sensor is available with built-in flash and SB-910, SB-900, SB-800, SB-700, SB-600, SB-400 or SB-300; i-TTL balanced fill-flash for digital SLR is used with matrix and center-weighted metering, standard i-TTL flash for digital SLR with spot metering",
    "mode": "Auto modes (auto; auto (flash off)); programmed auto with flexible program (P); shutter-priority auto (S); aperture-priority auto (A); manual (M); scene modes (portrait; landscape; child; sports; close up; night portrait; night landscape; party/indoor; beach/snow; sunset; dusk/dawn; pet portrait; candlelight; blossom; autumn colors; food); special effects modes (night vision; color sketch; toy camera effect; miniature effect; selective color; silhouette; high key; low key; HDR painting)",
    "tripodsocket": "1/4 in. (ISO 1222)",
    "effectiveangleofview": "Nikon DX format; focal length equivalent to approx. 1.5x that of lenses with FX format angle of view",
    "guidenumber": "Approx. 12/39, 13/43 with manual flash (m/ft, ISO 100, 20 °C/68 °F)",
    "lensmount": "Nikon F mount (with AF contacts)",
    "wirelesssetup": "Supports WPS",
    "temperature": "0 °C - 40 °C (+32 °F - 104 °F)",
    "supportedlanguages": "Arabic, Bengali, Chinese (Simplified and Traditional), Czech, Danish, Dutch, English, Finnish, French, German, Greek, Hindi, Hungarian, Indonesian, Italian, Japanese, Korean, Norwegian, Persian, Polish, Portuguese (Portugal and Brazil), Romanian, Russian, Spanish, Swedish, Tamil, Thai, Turkish, Ukrainian, Vietnamese",
    "builtinflash": "Auto, portrait, child, close up, night portrait, party/indoor, pet portrait, color sketch, toy camera effect: Auto flash with auto pop-up P, S, A, M, food: Manual pop-up with button release",
    "imagesensor": "23.5 x 15.6 mm CMOS sensor",
    "lensaperture": "Instant return, electronically controlled",
    "fileformat": "MOV",
    "battery": "One rechargeable Li-ion EN-EL14a battery",
    "metering": "TTL exposure metering using main image sensor",
    "rangelineofsight": "Approximately 30 m/98 ft (assumes no interference; range may vary with signal strength and presence or absence of obstacles)",
    "operatingfrequency": "2412-2462 MHz (channels 1-11)",
    "usb": "Hi-Speed USB",
    "audiorecordingformat": "Linear PCM",
    "magnification": "Approx. 0.82 x (50 mm f/1.4 lens at infinity, -1.0 m-1)",
    "type": "Electronically-controlled vertical-travel focal-plane shutter",
    "dustreductionsystem": "Image sensor cleaning, Image Dust Off reference data (optional Capture NX 2 software required)",
    "releasemode": "Single frame, continuous L, continuous H, quiet shutter release, self-timer, delayed remote; ML-L3, quick-response remote; ML-L3; interval timer photography supported",
    "videocompression": "H.264/MPEG-4 Advanced Video Coding",
    "focusingscreen": "Type B BriteView Clear Matte Mark VII screen",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "datarate": "54 Mbps Maximum logical data rates according to IEEE standard. Actual rates may differ.",
    "meteringmethod": "Matrix",
    "framesizepixelsandframerate": "1920 x 1080, 60p (progressive)/50p/30p/25p/24p, high/normal 1280 x 720, 60p/50p, high/normal 640 x 424, 30p/25p, high/normal Frame rates of 30p (actual frame rate 29.97 fps) and 60p (actual frame rate 59.94 fps) are available when NTSC is selected for video mode. 25p and 50p are available when PAL is selected for video mode. Actual frame rate when 24p is selected is 23.976 fps.",
    "viewfinder": "Eye-level pentamirror single-lens reflex viewfinder",
    "afareamode": "Face-priority AF, wide-area AF, normal-area AF, subject-tracking AF",
    "exposuremetercoupling": "CPU",
    "flashsyncspeed": "X=1/200 s; synchronizes with shutter at 1/200 s or slower",
    "frameadvancerate": "Continuous L : Up to 3 fps Continuous H : Up to 5 fps (JPEG and 12-bit NEF/RAW) or 4 fps (14-bit NEF/RAW) Note: Frame rates assume continuous-servo AF, manual or shutterpriority auto exposure, a shutter speed of 1/250 s or faster, Release selected for Custom Setting a1 (AF-C priority selection), and other settings at default values.",
    "hdmioutput": "Type C mini-pin HDMI connector",
    "nikoncreativelightingsystemcls": "Advanced Wireless Lighting supported with SB-910, SB-900, SB-800, or SB-700 as a master flash or SU-800 as commander; Flash Color Information Communication supported with all CLS-compatible flash units",
    "media": "SD (Secure Digital) and UHS-I compliant SDHC and SDXC memory cards",
    "accessprotocols": "Infrastructure",
    "syncterminal": "AS-15 sync terminal adapter (available separately)",
    "playback": "Full-frame and thumbnail (4, 12, or 80 images or calendar) playback with playback zoom, movie playback, photo and/or movie slide shows, histogram display, highlights, auto image rotation, picture rating, and image comment (up to 36 characters)",
    "dimensionswxhxd": "Approx. 125 x 98 x 76 mm (49.2 x 3.9 x 3 in.)",
    "autofocus": "Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected)",
    "bracketing": "Exposure bracketing: 3 shots in steps of 1/3 or 1/2 EV White balance bracketing: 3 shots in steps of 1 Active D-Lighting bracketing: 2 shots",
    "focuspoint": "Can be selected from 39 or 11 focus points",
    "flashcompensation": "-3 - +1 EV in increments of 1/3 or 1/2 EV",
    "picturecontrolsystem": "Standard, Neutral, Vivid, Monochrome, Portrait, Landscape; selected Picture Control can be modified; storage for custom Picture Controls",
    "imagesizepixels": "6000 x 4000 (Large) 4496 x 3000 (Medium) 2992 x 2000 (Small)",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "activedlighting": "Auto, Extra high, High, Normal, Low, Off",
    "eyepoint": "18 mm (-1.0 m-1; from center surface of viewfinder eyepiece lens)",
    "acadapter": "EH-5b AC adapter; requires EP-5A power connector (available separately)",
    "automaticsceneselection": "Available in auto and auto (flash off) modes",
    "rangeiso100f14lens20c68f": "Matrix or center-weighted metering: 0-20 EV Spot metering: 2-20 EV",
    "filesystem": "DCF (Design Rule for Camera File System) 2.0, DPOF (Digital Print Order Format), Exif (Exchangeable Image File Format for Digital Still Cameras) 2.3, PictBridge",
    "audiorecordingdevice": "Built-in or external stereo microphone; sensitivity adjustable",
    "framecoverage": "Approx. 95% horizontal and 95% vertical",
    "whitebalance": "Auto, incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual, all except preset manual with fine-tuning."
}