{
    "externalflashconnection": "Hot Shoe, PC Terminal",
    "exposurecontrol": "Manual: Shutter Speed, Aperture, ISO Auto: ISO",
    "weight": "2.65 lb / 1.20 kg",
    "mirrorlockup": "Yes",
    "battery": "1x EN-EL18a  Rechargeable Lithium-Ion Battery Pack, 10.8VDC, 2500mAh",
    "framerate": "@ 1920 x 1080: 60 fps, 50 fps, 30 fps, 25 fps, 24 fps @ 1280 x 720: 60 fps, 50 fps @ 640 x 424: 30 fps, 25 fps",
    "isosensitivity": "Auto/Manual, 200 - 25600, Expandable to 409600",
    "focus": "Auto Manual Continuous Auto",
    "memorycardtype": "CompactFlash XQD",
    "shopcategoriesshophomecameracameralensaccessoiresother": "TECHNESE_Mobile Phones．Digital Cameras．Accessories The Nikon D4S DSLR Camera features a full-frame, FX-format 16.2MP CMOS sensor and EXPEED 4 image processor to produce high-resolution still imagery and full HD 1080p movies with notable image detail, quality, and sensitivity. The combination of these two technologies affords exceptional image quality, marked by smooth tonal gradations and vivid, yet accurate, color reproduction as well as an expansive dynamic range. Championing working in a wide variety of lighting conditions, the D4S also features a broad native sensitivity range, from ISO 100-25600, that is further expandable to an equivalent ISO 409600 to benefit working in difficult lighting conditions. Furthermore, the processing power of the EXPEED 4 also affords a full-resolution continuous shooting rate of 11 fps for up to 200 frames with maintained auto-exposure and autofocus. Imaging Lens Mount Nikon F Camera Format Full-Frame (1.0x Crop Factor) Pixels Actual: 16.6 Megapixel Effective: 16.2 Megapixel Max Resolution 16.2MP: 4928 x 3280 Aspect Ratio 3:2, 4:5, 16:9 Sensor Type / Size CMOS, 36.0 x 23.9 mm File Formats Still Images: JPEG, RAW, TIFF Movies: MOV, MPEG-4 AVC/H.264 Audio: Linear PCM Bit Depth 14-bit Dust Reduction System Yes Memory Card Type CompactFlash XQD Focus Control Focus Type Auto & Manual Focus Mode Automatic (A), Continuous-servo AF (C), Full-time Servo (F), Manual Focus (M), Single-servo AF (S) Autofocus Points Phase Detection: 51 Viewfinder/Display Viewfinder Type Pentaprism Viewfinder Eye Point 18.00 mm Viewfinder Coverage 100% Viewfinder Magnification Approx. 0.70x Diopter Adjustment - 3 to +1 m Display Screen 3.2\" Rear Screen   LCD (921,000) Screen Coverage 100% Diagonal Angle of View 170.0° Exposure Control ISO Sensitivity 100-25600 (Extended Mode: 50-409600) Shutter Type: Electronic & Mechanical Speed: 30 - 1/8000 sec, Bulb Mode Remote Control MC-37, 36A, 30A, 25A, 23A, 22A, 21A, DC2, ML-3, WR-T10, 10, A10, 1, (Optional) Mirror Lock-Up Yes Metering Method 3D Color Matrix Metering, Center-weighted average metering, Spot metering Exposure Modes Modes: Aperture Priority, Manual, Programmed Auto, Shutter Priority Metering Range: EV -1.0 - EV 20.0 Compensation: -5 EV to +5 EV (in 1/3, 1/2 or 1 EV steps) White Balance Modes Auto, Cloudy, Color Temperature, Direct Sunlight, Flash, Fluorescent, Incandescent, Preset Manual, Shade Flash Flash Modes 1st Curtain Sync Hi-Speed Sync Off Rear Curtain/Slow Sync Rear Sync Red-eye Reduction Slow Sync Slow Sync/Red-eye Reduction Max Sync Speed 1 / 250 sec Flash Compensation -3 EV to +1 EV (in 1/3, 1/2 or 1 EV steps) Dedicated Flash System iTTL External Flash Connection Hot Shoe, PC Terminal AV Recording Video Recording Yes, NTSC/PAL File Size 1920 x 1080p (Full HD) Aspect Ratio 16:9 Frame Rate @ 1920 x 1080: 60 fps, 50 fps, 30 fps, 25 fps, 24 fps @ 1280 x 720: 60 fps, 50 fps @ 640 x 424: 30 fps, 25 fps Exposure Control Manual: Shutter Speed, Aperture, ISO Auto: ISO ISO Sensitivity Auto/Manual, 200 - 25600, Expandable to 409600 Focus Auto Manual Continuous Auto Video Clip Length 1920 x 1080 29 min. 59 sec. Audio Recording Built-in Mic: With Video + Voice Memo, Mono Optional External Mic: With Video + Voice Memo, Stereo Performance Continuous Shooting Up to 11 fps Self Timer 2 sec, 5 sec, 10 sec, 20 sec Interval Recording Yes Connectivity 1/8\" Headphone, 1/8\" Microphone, HDMI C (Mini), NIkon 10-Pin, USB 2.0, X-Sync Socket Wi-Fi Capable Yes (with Optional Transmitter) Power Battery 1x EN-EL18a  Rechargeable Lithium-Ion Battery Pack, 10.8VDC, 2500mAh AC Power Adapter EH-6b (Optional) Operating/Storage Temperature Operating 32 to 104°F (0 to 40°C) Humidity: 0 - 85% Physical Dimensions (WxHxD) 6.3 x 6.2 x 3.6\" / 160.0 x 156.5 x 90.5 mm Weight 2.65 lb / 1.20 kg Nikon D4S DSLR Camera (Body Only) EN-EL18a Rechargeable Lithium-Ion Battery MH-26a Battery Charger UF-2 Connector Cover for Stereo Mini Plug Cable UC-E15 USB Cable AN-DC11 Strap BF-1B Body Cap BS-2 Accessory Shoe Cover BL-6 Battery Chamber Cover ViewNX 2 Software Technese Enterprises Limited 1 Year Warranty Power cord may not fit your country , we will provide FREE charger adaptor if necessary Items are brand new and are not refurbished items. All specifications noted are manufacturer specifications and are subject to change without notice. PLEASE EMAIL US with any questions before bid to avoid receiving items that buyers will not be satisfied with. If buyers would like to cancel an order, a 10% charge (counting total ending price/handling fee) will be administered. Non paying buyers will be reported to eBay and as a result, negative feedback will be left. Images used are for reference only. We will not be held responsible for the injuries or damages of the packaging during delivery. Buying an item from us constitutes that buyers understand and agree with our terms & conditions. Before bidding or purchasing, please read our Warranty / Returns and other regulations. We reserve the right to vary the Terms of Sales form time to time without notice. ONLY ship to Paypal confirmed address and NO PO Box , FPO or APO Address. Items will be dispatched from Hong Kong. The transaction does not include any Import Tax / Duty / VAT / Brokerage Fees / Handling Fees . It is the sole responsibility of buyers. For more information about the tax rate, please check with local custom department before purchase. FREE SHIPPING is offered to certain countries only. Please open the parcel and check all the items included before signing on the acknowledge receipt for the courier. We accept PayPal only (with verified and confirmed address). The Paypal must be paid within 7 days. Buyers who fail to pay will be reported to eBay. Payment must be received, in full, prior to the item being sent out. No sending money and cheques overseas. We do not accept any other forms of payment. All items will come with our store warranty against manufacture defects (excluding wear and tear). Buyers can return the items for service in case of warranty issues. We offer a 7-day No Question Asked Exchange Policy from the day buyers receive the items and only if buyers could follow the below return guidelines: Items must be returned in Original Condition with the product packaging, booklets / manuals, swing tags, labels and all other accessories included. All returns must be boxed and packed securely for shipping, and are in re-saleable condition when we receive them. Buyers are required to contact us before sending anything back to us. Buyers must ship the items back under insured delivery and label as defective return. Buyers are responsible for the cost of shipping the item back to us and returning of the item and these costs are non-refundable. If buyers do not pay this cost, we shall not send the product back and shall keep the products for solely 60 days. If this cost is still not received from buyers within after 60 days, we will dispose the product without prior notice. 12-month Warranty This products are covered by 12 months warranty. The period of the warranty shall be 12 months starting from the purchase date. Buyers are required to contact us before sending anything back to us. Buyers are responsible for the cost of shipping the item back to us and returning of the item and these costs are non-refundable. If buyers do not pay this cost, we shall not send the product back and shall keep the products for solely 60 days. If this cost is still not received from buyers within after 60 days, we will dispose the product without prior notice. Buyers are responsible for the cost of shipping the item back to us and for the returning of the item. Defective item must be returned within the 7 working days upon receiving the item. International warranty can be arranged for extra fees, please contact us for more details. The Warranty shall be valid only when we receive the faulty product within the period of warranty. Any previous notifications from buyers will become invalid if we cannot receive the product within the warranty period. For non-repairable products, we shall not compensate buyer with 100% value of the original purchase unit price. Please consider with the rate of depreciation. Both the 7-day No Question Asked Exchange Policy and 12-month Warranty does NOT apply to the followings: Buyer makes any further use, alters, or repairs to the malfunctioning product without the agreement of us. The serial number of the item does not match our record or the serial number has been scratched, peeled off, or disappeared. Periodic checkup, maintenance, repair, or replacement of parts due to normal wear and tears. Costs relating to transport, removal, or installation of the product. Misuse, including the failure to use this product for its normal purposes or incorrect installation. Damages caused by shock or fall, sand, dirt, dust, dampness or corrosion, leaky batteries, lightning, liquid, fire, acts of god, war, public ventilation or any other causes beyond the control of us. Damage on any other items used in conjunction with the product. ©TECHNESE ENTERPRISES LIMITED",
    "acpoweradapter": "EH-6b (Optional)",
    "lensmount": "Nikon F",
    "features": "HDMI, USB, autofocus, self timer",
    "category": "camera",
    "shutter": "Type: Electronic & Mechanical Speed: 30 - 1/8000 sec, Bulb Mode",
    "videorecording": "Yes, NTSC/PAL",
    "continuousshooting": "Up to 11 fps",
    "operatingstoragetemperature": "Operating 32 to 104°F (0 to 40°C) Humidity: 0 - 85%",
    "viewfindereyepoint": "18.00 mm",
    "pixels": "Actual: 16.6 Megapixel Effective: 16.2 Megapixel",
    "selftimer": "2 sec, 5 sec, 10 sec, 20 sec",
    "viewfindermagnification": "Approx. 0.70x",
    "filesize": "1920 x 1080p (Full HD)",
    "dimensionswxhxd": "6.3 x 6.2 x 3.6\" / 160.0 x 156.5 x 90.5 mm",
    "viewfindercoverage": "100%",
    "meteringmethod": "3D Color Matrix Metering, Center-weighted average metering, Spot metering",
    "audiorecording": "Built-in Mic: With Video + Voice Memo, Mono Optional External Mic: With Video + Voice Memo, Stereo",
    "whitebalancemodes": "Auto, Cloudy, Color Temperature, Direct Sunlight, Flash, Fluorescent, Incandescent, Preset Manual, Shade",
    "dustreductionsystem": "Yes",
    "flashcompensation": "-3 EV to +1 EV (in 1/3, 1/2 or 1 EV steps)",
    "brand": "Nikon",
    "sensortypesize": "CMOS, 36.0 x 23.9 mm",
    "connectivity": "1/8\" Headphone, 1/8\" Microphone, HDMI C (Mini), NIkon 10-Pin, USB 2.0, X-Sync Socket",
    "cameraformat": "Full-Frame (1.0x Crop Factor)",
    "diagonalangleofview": "170.0°",
    "focustype": "Auto & Manual",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "bitdepth": "14-bit",
    "aspectratio": "16:9",
    "displayscreen": "3.2\" Rear Screen   LCD (921,000)",
    "fileformats": "Still Images: JPEG, RAW, TIFF Movies: MOV, MPEG-4 AVC/H.264 Audio: Linear PCM",
    "intervalrecording": "Yes",
    "remotecontrol": "MC-37, 36A, 30A, 25A, 23A, 22A, 21A, DC2, ML-3, WR-T10, 10, A10, 1, (Optional)",
    "diopteradjustment": "- 3 to +1 m",
    "cameratype": "Digital SLR",
    "flashmodes": "1st Curtain Sync Hi-Speed Sync Off Rear Curtain/Slow Sync Rear Sync Red-eye Reduction Slow Sync Slow Sync/Red-eye Reduction",
    "exposuremodes": "Modes: Aperture Priority, Manual, Programmed Auto, Shutter Priority Metering Range: EV -1.0 - EV 20.0 Compensation: -5 EV to +5 EV (in 1/3, 1/2 or 1 EV steps)",
    "displaysize": "3.2\"",
    "focusmode": "Automatic (A), Continuous-servo AF (C), Full-time Servo (F), Manual Focus (M), Single-servo AF (S)",
    "sensorresolution": "16.2 MP",
    "viewfindertype": "Pentaprism",
    "maxsyncspeed": "1 / 250 sec",
    "autofocuspoints": "Phase Detection: 51",
    "dedicatedflashsystem": "iTTL",
    "maxresolution": "16.2MP: 4928 x 3280",
    "model": "D4S",
    "screencoverage": "100%",
    "videocliplength": "1920 x 1080 29 min. 59 sec.",
    "wificapable": "Yes (with Optional Transmitter)",
    "screensize": "3.2\""
}