{
    "megapixels": "18.0",
    "hdmioutput": "Yes",
    "exposurecontrol": "+/- 2.0EV, 1/3EV step",
    "facedetectiontechnology": "Yes",
    "displaytype": "OLED",
    "shutterspeedmax": "1/4000 sec",
    "opticalzoomx": "18.0",
    "size": "110.1 x 60.3 x 30.7mm",
    "category": "camera",
    "shutterspeedmin": "4 sec",
    "focallengthtele": "450",
    "sensorsize": "1 / 2.3 inch",
    "maxvideoresolution": "1920 x 1080",
    "screensize": "3\"",
    "batterymodel": "Rechargeable Li-ion Battery EN-EL12",
    "isomin": "125",
    "flashmetering": "TTL auto flash with monitor pre-flashes",
    "manufacturerslink": "Click here",
    "shopcategoriesshophomecanoncashbackitemscrumplerexdemofujifilmlowepromanfrottonikonolympuspentaxsonytamractamronusedusedvelbonother": "Nikon Coolpix S9400 RED Digital Camera The Nikon Coolpix S9400 Black Digital Camera lets you close in on your subject in style wherever you go. Packing a 18x zoom lens into an incredibly slim body, the versatile Coolpix S9400 offers wide-angle to super-telephoto coverage (25-450mm 35mm equivalent), while the cameraâ\u0080\u0099s compact dimensions make it ideal for carrying around. No matter what kind of light you shoot under, the highly sensitive 18MP back illuminated CMOS image sensor captures scenes just as you see them. Lens-Shift Vibration Reduction ensures sharp photos and movies, even when shooting at the telephoto end of the zoom, making the Nikon Coolpix S9400 a slim super-zoom camera for superior images in any situation. The Coolpix S9400 offers full HD 1080p recording, Auto HDR mode, 3D shooting mode, Easy Panorama, 19 scene modes and a large 3.0â\u0080\u009d OLED screen that offers excellent visibility, even in direct sunlight. Nikon Coolpix Digital Camera Super zoom: the 18x NIKKOR wide-angle optical zoom lens (25â\u0080\u0093450 mm) with ED glass will make you a sharp shooter from virtually any distance. Back-illuminated 18 MP CMOS sensor: with each pixel receiving more light, this highly sensitive image sensor works with the EXPEED C2 processor to deliver clear shots in any light. 7.5-cm (3.0-in.) 614k-dot OLED screen: with superior brightness and impressive colour rendering, thanks to OLED technology, this large screen offers excellent visibility and sharp contrast in all light conditions, including direct sunlight. Lens-shift VR (vibration reduction): capture steady photos and movies thanks to Nikonâ\u0080\u0099s automatic vibration reduction technology, which counters the effects of camera shake in real time. Full HD (1080p) movie recording: easily record life in motion and in stereo sound. A dedicated video-record button makes it easy to begin filming. Advanced movie functions: if you pause and then continue filming, the camera will create a single movie file for smooth playback. The optical zoom with autofocus can be used when filming and you can record in iFrame format. Connect the camera directly to an HDTV using the built-in HDMI connector. Auto HDR mode: capture images with impressive tonal detail in any situation when you shoot in HDR mode. The camera combines two shots taken at different exposures during a single shutter release to create an image with wide dynamic range and rich colour gradation. Smart portrait system: snap perfect portraits every time. Smile timer takes the shot when your subject smiles, Blink proof alerts you when someoneâ\u0080\u0099s eyes were closed, and Glamour retouch options help you make portraits look more flattering. Easy Panorama 360Â°/180Â°: pan vertically or horizontally to create dynamic panoramas. 3D shooting mode: create 3D images that can be displayed on 3D-capable TVs and computers. Retouch menu: enhance your photos on the spot with a wide range of filter effects, including quick effect mode in playback. Examples include Selective Colour, which converts your image to monochrome and then adds a splash of colour to the area of your choice, while Cross Screen adds a starry effect to bright objects. High-speed continuous shooting: capture sharp shots of the action with ease. The camera can shoot up to 5 frames at a fast 7.5 fps. Mode dial: access the most important shooting modes quickly and easily via the conveniently placed mode dial. 19 scene modes: scene modes automatically optimize the camera settings for popular photographic styles, effects and locations. Achieve great shots just by selecting the mode that matches your situation. Fast and accurate AF: when you want to capture complex subjects, you can shoot in manual focus with a 99-point autofocus system for extra-sharp results. Subject Tracking AF: capture sharp shots of subjects on the move. Subject Tracking AF keeps the camera focused on a selected subject even if it refuses to stay still. Wireless transfer: compatible with Eye-Fi X2 (or later) cards. Transmit your digital photos (in JPEG format) directly to your smart device or computer, and then go online to take advantage of Nikonâ\u0080\u0099s photo sharing service, my Picturetown. Slimline body: measuring just 30.7 mm at its widest and 23 mm at its thinnest, the COOLPIX S9400 proves itâ\u0080\u0099s possible to be packed with features and slim all at once. EXPEED C2: Nikonâ\u0080\u0099s fast and powerful image processing system provides high-speed operation, enhanced movie recording, high-sensitivity performance and maximum image quality. SPECIFICATIONS Megapixels 18.0 Sensor type CMOS Sensor size 1 / 2.3 inch Resolution 4896 x 3672 Optical zoom (x) 18.0 Focal length (tele) 450 Focal length (wide) 25 Image stabilisation Yes Max aperture (tele) 6.3 Max aperture (wide) 3 Minimum focus distance 50cm Shutter speed max 1/4000 sec Shutter speed min 4 sec Exposure modes Auto, Scene auto selector, Scene (Portrait, Landscape, Sports, Party/indoor, Beach, Snow, Sunset, Dusk/dawn, Close-up, Food, Museum, Fireworks show, Black and white copy, Easy panorama, Pet portrait, 3D photography), Night landscape, Night portrait, Backlighting, Special effects, Smart portrait ISO min 125 ISO max 3200 Viewfinder type 3.0 inch Wide Angle OLED Anti-Reflection Monitor Screen size (inches) 3.0 Screen resolution (pixels) 614000 Flash metering TTL auto flash with monitor pre-flashes Movie mode 1080p Full HD Face detection Technology Yes Card format Internal memory (approx. 65 MB); SD/SDHC/SDXC memory card File formats Still pictures: JPEG; 3D images: MPO; Sound files (voice memo): WAV; Movies: MOV (Video: H.264/MPEG-4 AVC, Audio: AAC stereo), DCF, Exif 2.3, DPOF, and MPF compliant Connectivity Hi-Speed USB (MTP, PTP) dedicated connector (Mini-B compatible) HDMI Mini Connector. A/V output (PAL/NTSC) Battery model Rechargeable Li-ion Battery EN-EL12 Colour Black Size 110.1 x 60.3 x 30.7mm Weight (g) 200 Manufacturers link Click here Exposure Control +/- 2.0EV, 1/3EV step THESE CAMERAS ARE NIKON REFURBISHED ITEMS THEY ARE A GRADE A 12 MONTH WARRANTY IS SUPPLIED IF YOU WOULD LIKE ANY MORE INFORMATION ABOUT THIS ITEM, OR ANY OF OUR OTHER ITEMS ON OUR EBAY STORE OR IF YOU WOULD LIKE TO PAY WITH CREDIT/DEBIT CARD THEN PLEASE FEEL FREE TO CALL ONE OF OUR STORES ON: CARDIFF : 02920 394182 NEWPORT : 01633 262738 **RETURNS** UNDER THE DISTANCE SELLERS ACT YOU ARE ENTITLED TO CANCEL AND RETURN YOUR ORDER LESS THE COST OF POSTAGE THAT IT HAS COST US TO POST THE ITEM TO YOU. THIS ONLY COVERS YOU FOR BUY IT NOW ITEMS NOT AUCTION STYLE PURCHASES. IF FOR ANY REASON YOU WISH TO RETURN ANY ITEM THAT YOU BUY FROM CAMERA CENTRE UK THEN PLEASE INCLUDE A COPY OF YOUR ORIGINAL RECEIPT AND A COVER NOTE EXPLAINING THE REASON FOR THE RETURN. THIS WILL INSURE THAT YOUR REQUEST IS PROCESSED QUICKLY AND EFFICIENTLY WITHOUT DELAY. RETURNS MUST BE WITHIN 7 DAYS OF RECEIVING YOUR ITEM. THE MAXIMUM RETURNS POSTAGE WE WILL PAY IS Â£7.90 FOR UK .PLEASE DO NOT SEND THE ITEM BACK SPECIAL DELIVERY AS WE WILL ONLY COVER UP TO THIS MUCH. WE ENDEVOUR TO SORT ANY ISSUES OUT AS SOON AS THEY ARISE, BUT IN SOME CASES THERE MAY BE A SMALL DELAY. THIS IS NOT A HUGE PROBLEM IF YOU BID AND CHANGE YOUR MIND, OR JUST BID BY MISTAKE, BUT PLEASE - IF YOU WISH TO CANCEL YOUR BID - LET US KNOW ATLEAST 24 HOURS PRIOR TO THE LISTING ENDING, THIS WILL INSURE THAT NO EBAY CASES ARE OPENED AND THAT OTHERS CAN HAVE THE CHANCE TO PURCHASE THE ITEM WITHOUT HAVING TO WAIT WHILE THE ITEM IS RELISTED. **POSTAGE** IN SOME CASES POSTAGE MAY BE A LITTLE MORE TO SOME AREAS OF THE WORLD. IF YOU ARE UNSURE OF THE COST TO YOUR AREA PLEASE FEEL FREE TO EMAIL AND ASK AND WE WILL GET BACK TO YOU AS SOON AS POSSIBLE. THIS WILL INSURE THAT YOUR ORDER IS PROCESSED THANK YOU FOR LOOKING Russian Customers We are only able to ship to business addresses in Russia. If you do not supply us with a business address then we will not be able to send your items to you. Further note Minimum delivery charge to Russia is Â£29.99 FINANCE AVAILABLE ON ALL NEW PRODUCTS OVER Â£300 PLEASE CALL US ON 01633 262738 OR 02920 394182 FOR DETAILS",
    "brand": "Nikon",
    "maxaperturewide": "3",
    "maxaperturetele": "6.3",
    "sensortype": "CMOS",
    "connectivity": "Hi-Speed USB (MTP, PTP) dedicated connector (Mini-B compatible) HDMI Mini Connector. A/V output (PAL/NTSC)",
    "cardformat": "Internal memory (approx. 65 MB); SD/SDHC/SDXC memory card",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "fileformats": "Still pictures: JPEG; 3D images: MPO; Sound files (voice memo): WAV; Movies: MOV (Video: H.264/MPEG-4 AVC, Audio: AAC stereo), DCF, Exif 2.3, DPOF, and MPF compliant",
    "weightg": "200",
    "integratedmemorysize": "65 MB",
    "screensizeinches": "3.0",
    "moviemode": "1080p Full HD",
    "imagestabilisation": "Yes",
    "opticalzoom": "18x",
    "colour": "Black",
    "cameratype": "Compact",
    "exposuremodes": "Auto, Scene auto selector, Scene (Portrait, Landscape, Sports, Party/indoor, Beach, Snow, Sunset, Dusk/dawn, Close-up, Food, Museum, Fireworks show, Black and white copy, Easy panorama, Pet portrait, 3D photography), Night landscape, Night portrait, Backlighting, Special effects, Smart portrait",
    "displaysize": "3\"",
    "screenresolutionpixels": "614000",
    "minimumfocusdistance": "50cm",
    "digitalzoom": "4x",
    "sensorresolution": "18.1 MP",
    "viewfindertype": "3.0 inch Wide Angle OLED Anti-Reflection Monitor",
    "supportedflashmemory": "SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "model": "S9400",
    "resolution": "4896 x 3672",
    "focallengthwide": "25",
    "isomax": "3200"
}