{
    "features": "HDMI, USB",
    "weight": "Approx. 395g / 14 oz.",
    "series": "Nikon COOLPIXType:Compact",
    "metering": "Method: TTL exposure metering using  image sensor; Mode; Matrix metering, Center-weighted metering, Spot  metering, Spot AF area (with support for 99 focus areas) Exposure mode:  P,S,A and M",
    "height": "7.87 cm",
    "recordingmedia": "Internal memory: 94 MB",
    "effectivepixels": "10.1 million",
    "opticalzoom": "7.1xConnectivity:HDMI, USB",
    "filters": "Soft, Nostalgic sepia, High key, Low  key, High-contrast monochrome, Selective color, Cross process, Zoom  exposure, Defocus during exposure, Creative monochrome, Painting",
    "powersource": "Battery: Rechargeable Li-ion  Battery EN-EL14 (7.4 V, 1030 mAh) with ID function; Battery performance:  Approx. 350 shots (with EN-EL14)",
    "manualfocus": "Yes (Center portion enlarged and displayed, autofocus possible with a single operation)",
    "maxvideoresolution": "1280 x 720",
    "category": "camera",
    "monitor": "Size (diagonal length): 7.5 cm (3 in.) Type: TFT LCD monitor; Approx. 921k-dot (VGA), sRGB 100%",
    "movie": "HD 720p stereo, optical zoom, external microphone input",
    "focusrangefromlens": "Normal shooting  (wide-angle position): Approx. 50 cm (1 ft 8 in.) to infinity; Normal  shooting (telephoto position): Approx. 80 cm (2 ft 8 in.) to infinity;  In macro mode (wide-angle position): Approx. 2 cm (0.8 in.) to infinity  Shortest focus distance in macro mode: Approx. 2 cm (0.8 in.) to  infinity; In macro mode (telephoto position): Approx. 50 cm (1 ft 8 in.)  to infinity",
    "digitalzoom": "4x",
    "width": "15.24 cm",
    "recordingformat": "Movies: MOV (Video: MPEG-4 AVC/H.264, Audio: AAC stereo) Audio: Stereo WAV (22.050 kHz, 16 bit)",
    "aperture": "Range: 13 steps; Aperture control;  Electronically controlled six-blade iris diaphragm; f-number: T (f/5.6,  f/8); Wide-angle: W (f/2.8, f/8)",
    "dimensionswxhxd": "Approx. 4.6 x 3.1 x 1.9 in.",
    "imageprocessing": "Picture control: Standard, Neutral, Vivid, Monochrome, Custom Picture and Controls; Active D-Lighting",
    "brand": "NikonScreen Size:3\"",
    "lens": "Magnification: 7.1x optical zoom, NIKKOR  lens; Focal length: 6.0-42.6mm; View angle: 35mm [135] format equivalent  angle of view: 28 to 200 mm Maximum aperture: f/2.8-5.6 Lens  construction: 11 elements in 9 groups; ED glass: 2 elements",
    "screensize": "3\"",
    "supportedflashmemory": "SD Card, SD Memory Card, SDHC Card, SDHC Memory Card, SDXC Card, SDXC Memory Card",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "integratedmemorysize": "94 MB",
    "displaytype": "LCD",
    "imageformats": "4:3, 16:9, 3:2 and 1:1",
    "focusadjustment": "Automatic",
    "cameratype": "Compact",
    "builtinflash": "Guide number: 7.0 (ISO 100, m );  Flash control range: Wide-angle Approx. 0.3 to 8 m, Telephoto Approx.  0.3 to 4 m. Mode: Auto, Auto with red-eye reduction, Fill flash, Off,  Manual Slow sync, Rear-curtain sync",
    "imagesensor": "Type: 1/1.7-in. interline-transfer  CCD; Color filter array: RGB primary color filters; Total pixels: 10.39  million; Recording pixels: 9.98 million (3648 x 2736)",
    "megapixels": "10.1 MP",
    "displaysize": "3\"",
    "shutter": "Shutter speed: 1/4000-8 s, 1/4000-60 s (M mode), and 4 s (Fireworks show scene mode)",
    "depth": "4.82 cm",
    "sensorresolution": "10.1 MP",
    "sensortype": "CCD",
    "viewfinder": "Optical viewfinder: Yes; Diopter adjustment: Yes",
    "model": "P7100Battery Type:Lithium-Ion",
    "interface": "Hi-Speed USB, PictBridge, HDMI",
    "whitebalance": "Mode: Auto1,2 Preset manual  Daylight Incandescent Fluorescent: FL 1, FL 2, and FL 3 Cloudy Built-in  flash Choose color temp (K) White balance bracketing",
    "vibrationreduction": "Still images: Lens shift (optical system) Movies: Lens shift (optical system)"
}