{
    "features": "Brand / Designer: NIKON Item Type: COOLPIX S3500 Compact 20.1 Mge Pixel HD Digital Camera Colour: Purple Material: Metal Description: This is a purple COOLPIX S3500 digital camera from Nikon. With close attention paid to design and detail, the slender 20-megapixel COOLPIX S3500 fits in your hand like it was made to be there. Deliciously colourful and easy to use, this camera is the perfect companion for lives lived to the full and on the go. The 7x NIKKOR optical zoom lens with vibration reduction technology delivers clear photos and crisp video clips. View photos and videos with ease on the large 2.7 inch TFT LCD screen, with anti-reflection coating. Smart auto functions offer perfect results in any situation and photos can be enhanced on the spot using fun in-camera filter effects. Accessories: Comes with software cd-rom.",
    "weight": "129 gr",
    "flashtype": "Built-in Flash",
    "series": "Nikon COOLPIXFeatures:720p HD Video Recording, Built-in Flash, Face Detection, Image Stabilisation, Shock Resistant, Automatic Pixel Mapping (APM), Sharpness Control",
    "height": "5.78 cm",
    "displaytype": "LCD",
    "displaysize": "2.7\"",
    "category": "camera",
    "dimensions": "15cm (w) x 7cm (d) x 13cm (h).",
    "depth": "2.05 cm",
    "comments": "Sold as photographed. Our photographs are taken immediately prior to the auction commencing. If you have any questions about this item please contact us and we will answer promptly.",
    "sensorsize": "1/2.3\"",
    "width": "9.68 cm",
    "mpn": "VNA293E1",
    "brand": "NikonWeight:129 gr",
    "sensortype": "CCD",
    "screensize": "2.7\"",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "condition": "There are some small scratches on the cameras exterior but otherwise ion good condition. Please review the photos above for more details.",
    "cameratype": "Compact",
    "maxshutterspeed": "1/2000 sec",
    "age": "Unknown",
    "opticalzoom": "7xColour:Purple",
    "digitalzoom": "4x",
    "supportedflashmemory": "SD Card, SDHC Memory Card, SDXC Card",
    "model": "S3500Type:Compact"
}