{
    "meteringrange": "Matrix or center-weighted metering: 0 to 20 EV. Spot metering: 2 to 20 EV (ISO 100 equivalent, f/1.4 lens, 20Â°C/68Â°F)",
    "exposurebracketing": "2 to 3 frames in steps of 1/3, 1/2, 2/3 or 1 EV",
    "exposuremode": "Auto (auto; auto (flash off)), Scene (Portrait, Landscape, Child, Sports, Close up, Night portrait, Night landscape, Party/indoor, Beach/snow, Sunset, Dusk/dawn, Pet portrait, Candlelight, Blossom, Autumn colors, Food, Silhouette, High key, Low key), programmed auto with flexible program (P), shutter-priority auto (S), aperture-priority auto (A), manual (M), U1 (user settings 1), U2 (user settings 2)",
    "exposurecompensation": "-5 to +5 EV in increments of 1/3 or 1/2 EV",
    "reflexmirror": "Quick return",
    "monitor": "Full-frame and thumbnail (4, 9 or 72 images or calendar) playback with playback zoom, movie playback, slide show, highlights, histogram display, auto image rotation and image comment (up to 36 characters)",
    "diopteradjustment": "-3 to +1 m-1",
    "isosensitivity": "ISO 100 to 6400 in steps of 1/3 or 1/2 EV; can also be set to approx. 0.3, 0.5, 0.7, 1 or 2 EV (ISO 25600 equivalent) above ISO 6400; auto ISO sensitivity control available (Recommended Exposure Index)",
    "accessoryterminal": "Remote Cord MC-DC2 (available separately), GPS Unit GP-1 (available separately)",
    "mpn": "VBA290AE",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (Single-servo AF) or by pressing AE-L/AF-L button",
    "detectionrange": "-1 to +19 EV (ISO 100 equivalent, 20Â°C /68Â°F)",
    "sensortype": "CMOS",
    "adlbracketing": "2 frames using selected value for one frame or 3 frames using preset values for all frames",
    "flashreadyindicator": "Lights when built-in flash or optional flash unit such as SB-900, SB-800, SB-700, SB-600, SB-400, SB-80DX, SB-28DX or SB-50DX is fully charged; blinks for 3 s after flash is fired at full output",
    "compatiblelenses": "DX NIKKOR: All functions supported. Type G or D AF NIKKOR: All functions supported (PC Micro-NIKKOR does not support some functions); IX NIKKOR lenses not supported. Other AF NIKKOR: All functions supported except 3D color matrix metering II; lenses for F3AF not supported. AI-P NIKKOR: All functions supported except 3D color matrix metering II. Non-CPU: Can be used in modes A and M; color matrix metering and aperture value display supported if user provides lens data (AI lenses only); electronic rangefinder can be used if maximum aperture is f/5.6 or faster",
    "shutter": "Electronically-controlled vertical-travel focal-plane shutter",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "videooutput": "NTSC, PAL; images can be displayed on external device while camera monitor is on",
    "accessoryshoe": "ISO 518 hot-shoe with sync and data contacts, and safety lock",
    "weight": "Approx. 1 lb. 8.3 oz. (690 g) camera body only; approx. 1 lb. 11.5 oz. (780 g) with battery and memory card but without body cap",
    "flashtype": "Detachable Flash",
    "effectivepixels": "16.2 million",
    "category": "camera",
    "batterypack": "Optional Multi-Power Battery Pack MB-D11 with one Rechargeable Li-ion Battery ENEL15 or six R6/AA size alkaline, NiMH or lithium batteries",
    "stillimageformat": "DCF 2.0, DPOF, EXIF 2.3, JPEG, Raw Image",
    "selftimer": "2 s, 5 s, 10 s, 20 s; 1â\u0080\u00939 exposures at intervals of 0.5, 1, 2, or 3 s",
    "flashcontrol": "TTL: i-TTL balanced fill-flash and standard i-TTL flash for digital SLR using 2,016-pixel RGB sensor are available with built-in flash and SB-900, SB-800, SB-700, SB-600 or SB-400 (i-TTL balanced fill-flash is available when matrix or center-weighted metering is selected). Auto aperture: Available with SB-900/SB-800 and CPU lens. Non-TTL auto: Supported flash units include SB-900, SB-800, SB-28, SB-27 and SB-22S. Distance priority manual: Available with SB-900, SB-800 and SB-700",
    "tripodsocket": "1/4 in. (ISO 1222)",
    "effectiveangleofview": "Approx. 1.5 Ã\u0097 lens focal length (Nikon DX format)",
    "lensmount": "Nikon F mount (with AF coupling and AF contacts)",
    "shutterspeed": "1/8,000 to 30 s in steps of 1/3 or 1/2 EV, bulb, time (requires optional Remote Control ML-L3), X250",
    "flashbracketing": "2 to 3 frames in steps of 1/3, 1/2, 2/3 or 1 EV",
    "builtinflash": "Auto flash with auto pop-up. Manual pop-up with button release",
    "imagesensor": "23.6 x 15.6 mm CMOS sensor; total pixels: 16.9 million",
    "displaysize": "3\"",
    "operatingenvironment": "Temperature: 32â\u0080\u0093104 Â°F/0â\u0080\u009340 Â°C; humidity: less than 85% (no condensation)",
    "lensaperture": "Instant return, electronically controlled",
    "typeofcamera": "Single-lens reflex digital camera",
    "fileformat": "MOV",
    "features": "AF Tracking, Automatic flash, HDMI, Interchangeable Lenses, USB 2.0, With Tripod Mount",
    "battery": "One Rechargeable Li-ion Battery EN-EL15",
    "height": "10.414 cm",
    "displaytype": "LCD",
    "depthoffieldpreview": "Pressing depth-of-field preview button stops lens aperture down to value selected by user (A and M modes) or by camera (other modes)",
    "afareamode": "Face-priority AF, wide-area AF, normal-area AF, subject-tracking AF",
    "usb": "Hi-Speed USB",
    "width": "13.208 cm",
    "magnification": "Approx. 0.94 x (50mm f/1.4 lens at infinity, -1.0 m-1)",
    "focuspoint": "Can be selected from 39 or 11 focus points",
    "meteringmethod": "Matrix",
    "dustreductionsystem": "Image Sensor Cleaning, Image Dust Off reference data (optional Capture NX 2 software required)",
    "minshutterspeed": "1/2 sec",
    "releasemode": "S (single frame), CL (continuous low speed), CH (continuous high speed), Q (quiet shutterrelease), (self-timer), (remote control), MUP (mirror up)",
    "ean": "00018208254682, 0018208918324, 018208254743, 018208884704, 0182089183246, 689466358292, 689466358308",
    "brand": "Nikon",
    "frameadvancerate": "1 to 5 fps (CL) or 6 fps (CH) (CIPA guidelines)",
    "videocompression": "H.264/MPEG-4 Advanced Video Coding",
    "focusingscreen": "Type B BriteView Clear Matte screen Mark II with AF area brackets (framing grid can be displayed)",
    "screensize": "3\"",
    "digitalvideoformat": "QuickTime",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "storagemedia": "SD (Secure Digital), SDHC and SDXC memory cards",
    "supportedlanguages": "Arabic, Chinese (Simplified and Traditional), Czech, Danish, Dutch, English, Finnish, French, German, Indonesian, Italian, Japanese, Korean, Norwegian, Polish, Portuguese, Russian, Spanish, Swedish, Thai, Turkish",
    "cameratype": "Digital SLR",
    "audiocompression": "Linear PCM",
    "guidenumber": "Approx. 39 /12, 39/12 with manual flash (ft./m, ISO 100, 68 Â°F/20 Â°C)",
    "framesizepixelsandframerate": "[NTSC] 1,920 Ã\u0097 1,080 (24p); 24 (23.976) fps. 1,280 Ã\u0097 720 (30p); 30 (29.97) fps. 1,280 Ã\u0097 720 (24p); 24 (23.976) fps. 640 Ã\u0097 424 (30p); 30 (29.97) fps. [PAL] 1,920 Ã\u0097 1,080 (24p); 24 (23.976) fps. 1,280 Ã\u0097 720 (25p); 25 fps. 1,280 Ã\u0097 720 (24p); 24 (23.976) fps. 640 Ã\u0097 424 (25p); 25fps",
    "liveviewlensservo": "Autofocus (AF): Single-servo AF (AF-S); full-time-servo AF (AF-F). Manual focus (M)",
    "viewfinder": "Eye-level pentaprism single-lens reflex viewfinder",
    "exposuremetercoupling": "Combined CPU and AI",
    "flashsyncspeed": "X = 1/250 s; synchronizes with shutter at 1/320 s or slower (flash range drops at speeds between 1/250 and 1/320 s)",
    "maximumlength": "Approx. 20 minutes",
    "maxvideoresolution": "640 x 424",
    "nikoncreativelightingsystemcls": "Advanced Wireless Lighting supported with built-in flash, SB-900, SB-800, SB-700 or Lighting System SU-800 as commander and SB-900, SB-800, SB-700, SB-600 or SB-R200 as remotes; Auto FP high-speed sync and modeling illumination supported with all CLS-compatible flash units except SB-400; Flash Color Information Communication and FV lock supported with all CLS-compatible flash units",
    "lensforsd": "Body Only",
    "syncterminal": "AS-15 sync terminal adapter (available separately)",
    "dimensionswxhxd": "Approx. 5.2 Ã\u0097 4.1 Ã\u0097 3.0 in. (132 Ã\u0097 105 Ã\u0097 77 mm)",
    "autofocus": "Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected)",
    "hdmioutput": "Type C mini-pin HDMI connector; camera monitor turns off when HDMI cable is connected",
    "lensservo": "Autofocus (AF): Single-servo AF (AF-S); continuous-servo AF (AF-C); auto AF-S/AF-C selection (AF-A); predictive focus tracking activated automatically according to subject status. Manual focus (M): Electronic rangefinder can be used",
    "audioinput": "Stereo mini-pin jack (3.5-mm diameter)",
    "flashcompensation": "-3 to +1 EV in increments of 1/3 EV or 1/2 EV",
    "picturecontrolsystem": "Standard, Neutral, Vivid, Monochrome, Portrait, Landscape; selected Picture Control can be modified; storage for custom Picture Controls",
    "imagesizepixels": "4,928 Ã\u0097 3,264 [L], 3,696 Ã\u0097 2,448 [M], 2,464 Ã\u0097 1,632 [S]",
    "continuousshootingspeed": "6 frames per second",
    "audiorecordingdevice": "Built-in monaural or external stereo microphone; sensitivity adjustable",
    "activedlighting": "Auto, Extra high, High, Normal, Low or Off",
    "moviemetering": "TTL exposure metering using main image sensor",
    "exposuremetering": "TTL exposure metering using 2,016-pixel RGB sensor",
    "eyepoint": "19.5 mm (-1.0 m-1)",
    "acadapter": "AC Adapter EH-5a; requires Power Connector EP-5B (available separately)",
    "shopcategoriesshophomecanoncashbackitemscrumplerexdemofujifilmlowepromanfrottonikonolympuspentaxsonytamractamronusedusedvelbonother": "Nikon D7000 Body Only LENS NOT INCLUDED NEW NIKON UK STOCK 2 YEAR WARRANTY VALID ANYWHERE IN EUROPE Product Description Packing high-end image technologies into a surprisingly portable body, the D7000 marks a new era in creative flexibility. Sturdy enough to travel anywhere and powerful enough to handle any situation, its range of advanced features will satisfy any photographer ready to further their skills. If photography is your passion, this is the D-SLR you need. 16.2 megapixel DX-format CMOS image sensor High ISO (100-6400) light sensitivity - extendable up to 25600 EXPEED 2: Nikonâ\u0080\u0099s advanced image processing engine Durable design with magnesium alloy top and rear covers Twin SD card slots: SDXC compatible Razor-sharp 39-point AF system 16.2 megapixel DX-format CMOS image sensor delivers lifelike images with vivid colors, reduced noise and smooth tonal gradations. High ISO (100-6400) light sensitivity manually extendable up to 25600 using the Hi2 setting. Enables faster shutter speeds for finely detailed images with minimal noise when you shoot fast-moving subjects or take pictures in low light. Features an Auto ISO setting. EXPEED 2 image processing engine: optimizes the camera's technologies for superior performance and maximum image quality, all while consuming minimal energy. Durable design: boasts tough, yet light, magnesium alloy top and rear covers, and environmentally-sealed joints that protect the camera from dust and moisture. 100 Percent viewfinder coverage with approx. 0.94x magnification for precise composition. Durable shutter unit tested to 150,000 cycles. Delivers precise shutter control and exceptional reliability with a shutter speed of up to 1/8000s, and flash synchronization at up to 1/250s. Twin SD memory card slots: for enhanced shooting flexibility. Use the second card when the first is full, or record stills on one and movies on another. SDXC compatible. Razor-sharp 39-point Autofocus system with nine cross-type sensors in the center. Offers fast and precise autofocus coverage across the frame. Four AF-area modes, including 3D-tracking AF, deliver sharp results, whether your subject is off-center, moving fast or completely unpredictable. 2,016 pixel RGB metering sensor delivers highly accurate metering for exact exposures and provides precise data to the camera's Scene Recognition System, which optimizes exposure, autofocus and white balance immediately before the shutter is released for sharply defined images. 6 fps continuous shooting: capture fast-moving action at six frames per second. Quick response: boasts a near-instant start-up time and approx. 0.052-second shutter-release time lag. D-Movie â\u0080\u0093 full HD (1920 x 1080) movie clips: a dedicated record button lets you capture beautiful high-definition (HD) movie clips instantly. AF-F mode keeps everything in focus while you are shooting and the camera supports use of an external microphone so you can record in quality stereo sound. Simple editing functions let you make edits of your clips in-camera. Large 7.5 cm (3-in.), 920k-dot, high-resolution LCD monitor with reinforced glass makes it easy to view essential camera information, and a pleasure to review and edit your photos and movies. Product Specification Type of camera Single-lens reflex digital camera Lens mount Nikon F mount (with AF coupling and AF contacts) Effective angle of view Approx. 1.5 Ã\u0097 lens focal length (Nikon DX format) Effective pixels 16.2 million Image sensor 23.6 x 15.6 mm CMOS sensor; total pixels: 16.9 million Dust-reduction system Image Sensor Cleaning, Image Dust Off reference data (optional Capture NX 2 software required) Image size (pixels) 4,928 Ã\u0097 3,264 [L], 3,696 Ã\u0097 2,448 [M], 2,464 Ã\u0097 1,632 [S] File format NEF (RAW): 12 or 14 bit, lossless compressed or compressed. JPEG: JPEG-Baseline compliant with fine (approx. 1:4), normal (approx. 1:8) or basic (approx. 1:16) compression (Size priority); Optimal quality compression available. NEF (RAW) + JPEG: Single photograph recorded in both NEF (RAW) and JPEG formats Picture Control System Standard, Neutral, Vivid, Monochrome, Portrait, Landscape; selected Picture Control can be modified; storage for custom Picture Controls Storage media SD (Secure Digital), SDHC and SDXC memory cards Double card slots Slot 2 can be used for overflow or backup storage or for separate storage of copies created using NEF+JPEG; pictures can be copied between cards File system DCF (Design Rule for Camera File System) 2.0, DPOF (Digital Print Order Format), Exif 2.3 (Exchangeable Image File Format for Digital Still Cameras), PictBridge Viewfinder Eye-level pentaprism single-lens reflex viewfinder Frame coverage Approx. 100% horizontal and 100% vertical Magnification Approx. 0.94 x (50mm f/1.4 lens at infinity, -1.0 m-1) Eyepoint 19.5 mm (-1.0 m-1) Diopter adjustment -3 to +1 m-1 Focusing screen Type B BriteView Clear Matte screen Mark II with AF area brackets (framing grid can be displayed) Reflex mirror Quick return Depth-of-field preview Pressing depth-of-field preview button stops lens aperture down to value selected by user (A and M modes) or by camera (other modes) Lens aperture Instant return, electronically controlled Compatible lenses DX NIKKOR: All functions supported. Type G or D AF NIKKOR: All functions supported (PC Micro-NIKKOR does not support some functions); IX NIKKOR lenses not supported. Other AF NIKKOR: All functions supported except 3D color matrix metering II; lenses for F3AF not supported. AI-P NIKKOR: All functions supported except 3D color matrix metering II. Non-CPU: Can be used in modes A and M; color matrix metering and aperture value display supported if user provides lens data (AI lenses only); electronic rangefinder can be used if maximum aperture is f/5.6 or faster Shutter Electronically-controlled vertical-travel focal-plane shutter Shutter speed 1/8,000 to 30 s in steps of 1/3 or 1/2 EV, bulb, time (requires optional Remote Control ML-L3), X250 Flash sync speed X = 1/250 s; synchronizes with shutter at 1/320 s or slower (flash range drops at speeds between 1/250 and 1/320 s) Release mode S (single frame), CL (continuous low speed), CH (continuous high speed), Q (quiet shutterrelease), (self-timer), (remote control), MUP (mirror up) Frame advance rate 1 to 5 fps (CL) or 6 fps (CH) (CIPA guidelines) Self-timer 2 s, 5 s, 10 s, 20 s; 1â\u0080\u00939 exposures at intervals of 0.5, 1, 2, or 3 s Remote release mode Delayed remote, quick-response remote, remote mirror-up Exposure metering TTL exposure metering using 2,016-pixel RGB sensor Metering method Matrix: 3D color matrix metering II (type G and D lenses); color matrix metering II (other CPU lenses); color matrix metering available with non-CPU lenses if user provides lens data. Center-weighted: Weight of 75% given to 8 mm circle in center of frame; diameter of circle can be changed to 6, 10 or 13 mm, or weighting can be based on average of entire frame (fixed at 8-mm when non-CPU lens is used). Spot: Meters 3.5 mm circle (about 2.5 % of frame) centered on selected focus point (on center focus point when non-CPU lens is used) Metering range Matrix or center-weighted metering: 0 to 20 EV. Spot metering: 2 to 20 EV (ISO 100 equivalent, f/1.4 lens, 20Â°C/68Â°F) Exposure meter coupling Combined CPU and AI Exposure mode Auto (auto; auto (flash off)), Scene (Portrait, Landscape, Child, Sports, Close up, Night portrait, Night landscape, Party/indoor, Beach/snow, Sunset, Dusk/dawn, Pet portrait, Candlelight, Blossom, Autumn colors, Food, Silhouette, High key, Low key), programmed auto with flexible program (P), shutter-priority auto (S), aperture-priority auto (A), manual (M), U1 (user settings 1), U2 (user settings 2) Exposure compensation -5 to +5 EV in increments of 1/3 or 1/2 EV Exposure bracketing 2 to 3 frames in steps of 1/3, 1/2, 2/3 or 1 EV Exposure lock Luminosity locked at detected value with AE-L/AF-L button ISO sensitivity ISO 100 to 6400 in steps of 1/3 or 1/2 EV; can also be set to approx. 0.3, 0.5, 0.7, 1 or 2 EV (ISO 25600 equivalent) above ISO 6400; auto ISO sensitivity control available (Recommended Exposure Index) Active D-Lighting Auto, Extra high, High, Normal, Low or Off ADL bracketing 2 frames using selected value for one frame or 3 frames using preset values for all frames Autofocus Nikon Multi-CAM 4800DX autofocus sensor module with TTL phase detection, finetuning, 39 focus points (including 9 cross-type sensors), and AF-assist illuminator (range approx. 0.5 to 3 m/1 ft. 8 in. to 9 ft. 10 in.) Detection range -1 to +19 EV (ISO 100 equivalent, 20Â°C /68Â°F) Lens servo Autofocus (AF): Single-servo AF (AF-S); continuous-servo AF (AF-C); auto AF-S/AF-C selection (AF-A); predictive focus tracking activated automatically according to subject status. Manual focus (M): Electronic rangefinder can be used Focus point Can be selected from 39 or 11 focus points AF-area mode Single-point AF; 9-, 21- or 39-point dynamic-area AF, 3D-tracking, auto-area AF Focus lock Focus can be locked by pressing shutter-release button halfway (Single-servo AF) or by pressing AE-L/AF-L button Built-in flash Auto flash with auto pop-up. Manual pop-up with button release Guide Number Approx. 39 /12, 39/12 with manual flash (ft./m, ISO 100, 68 Â°F/20 Â°C) Flash control TTL: i-TTL balanced fill-flash and standard i-TTL flash for digital SLR using 2,016-pixel RGB sensor are available with built-in flash and SB-900, SB-800, SB-700, SB-600 or SB-400 (i-TTL balanced fill-flash is available when matrix or center-weighted metering is selected). Auto aperture: Available with SB-900/SB-800 and CPU lens. Non-TTL auto: Supported flash units include SB-900, SB-800, SB-28, SB-27 and SB-22S. Distance priority manual: Available with SB-900, SB-800 and SB-700 Flash compensation -3 to +1 EV in increments of 1/3 EV or 1/2 EV Flash bracketing 2 to 3 frames in steps of 1/3, 1/2, 2/3 or 1 EV Flash-ready indicator Lights when built-in flash or optional flash unit such as SB-900, SB-800, SB-700, SB-600, SB-400, SB-80DX, SB-28DX or SB-50DX is fully charged; blinks for 3 s after flash is fired at full output Accessory shoe ISO 518 hot-shoe with sync and data contacts, and safety lock Nikon Creative Lighting System (CLS) Advanced Wireless Lighting supported with built-in flash, SB-900, SB-800, SB-700 or Lighting System SU-800 as commander and SB-900, SB-800, SB-700, SB-600 or SB-R200 as remotes; Auto FP high-speed sync and modeling illumination supported with all CLS-compatible flash units except SB-400; Flash Color Information Communication and FV lock supported with all CLS-compatible flash units Sync terminal AS-15 sync terminal adapter (available separately) White balance Auto (2 types), Incandescent, Fluorescent (7 types), Direct Sunlight, Flash, Cloudy, Shade, preset manual (up to 5 values can be stored), choose color temperature (2,500 K to 10,000 K), all with fine tuning; white balance bracketing: 2 to 3 frames in steps of 1, 2 or 3 Live View lens servo Autofocus (AF): Single-servo AF (AF-S); full-time-servo AF (AF-F). Manual focus (M) AF-area mode Face-priority AF, wide-area AF, normal-area AF, subject-tracking AF Autofocus Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected) Movie metering TTL exposure metering using main image sensor Metering method Matrix Frame size (pixels) and frame rate [NTSC] 1,920 Ã\u0097 1,080 (24p); 24 (23.976) fps. 1,280 Ã\u0097 720 (30p); 30 (29.97) fps. 1,280 Ã\u0097 720 (24p); 24 (23.976) fps. 640 Ã\u0097 424 (30p); 30 (29.97) fps. [PAL] 1,920 Ã\u0097 1,080 (24p); 24 (23.976) fps. 1,280 Ã\u0097 720 (25p); 25 fps. 1,280 Ã\u0097 720 (24p); 24 (23.976) fps. 640 Ã\u0097 424 (25p); 25fps Maximum length Approx. 20 minutes File format MOV Video compression H.264/MPEG-4 Advanced Video Coding Audio compression Linear PCM Audio recording device Built-in monaural or external stereo microphone; sensitivity adjustable Monitor Full-frame and thumbnail (4, 9 or 72 images or calendar) playback with playback zoom, movie playback, slide show, highlights, histogram display, auto image rotation and image comment (up to 36 characters) USB Hi-Speed USB Video output NTSC, PAL; images can be displayed on external device while camera monitor is on HDMI output Type C mini-pin HDMI connector; camera monitor turns off when HDMI cable is connected Accessory terminal Remote Cord MC-DC2 (available separately), GPS Unit GP-1 (available separately) Audio input Stereo mini-pin jack (3.5-mm diameter) Supported languages Arabic, Chinese (Simplified and Traditional), Czech, Danish, Dutch, English, Finnish, French, German, Indonesian, Italian, Japanese, Korean, Norwegian, Polish, Portuguese, Russian, Spanish, Swedish, Thai, Turkish Battery One Rechargeable Li-ion Battery EN-EL15 Battery pack Optional Multi-Power Battery Pack MB-D11 with one Rechargeable Li-ion Battery ENEL15 or six R6/AA size alkaline, NiMH or lithium batteries AC adapter AC Adapter EH-5a; requires Power Connector EP-5B (available separately) Tripod socket 1/4 in. (ISO 1222) Dimensions (W x H x D) Approx. 5.2 Ã\u0097 4.1 Ã\u0097 3.0 in. (132 Ã\u0097 105 Ã\u0097 77 mm) Weight Approx. 1 lb. 8.3 oz. (690 g) camera body only; approx. 1 lb. 11.5 oz. (780 g) with battery and memory card but without body cap Operating environment Temperature: 32â\u0080\u0093104 Â°F/0â\u0080\u009340 Â°C; humidity: less than 85% (no condensation) NIKON UK STOCK SUPPLIED WITH WE ARE SUPPLYING A 12 MONTH WARRANTY  WITH THIS ITEM. FOR MORE INFORMATION OR FOR CREDIT/DEBIT CARD PAYMENTS PLEASE CALL ONE OF OUR STORES ON: CARDIFF: 02920 394182 NEWPORT: 01633 262738 ** PLEASE NOTE ** WE DO NOT DELIVER TO SOUTH AMERICA, AFRICA OR SOUTHERN ASIA. IF YOU ARE UNSURE PLEASE ASK. ** Please Note ** All item that are returned to us in perfect unopened and unused condition will receive a full refund. Any item that has been opened or used will incur a 10% restocking/repackaging fee. This includes software packs, neck straps etc.. We are unable to accept returns of consumables that have been opened, this includes batteries,memory cards etc.. Russian Customers We are only able to ship to business addresses in Russia. If you do not supply us with a business address then we will not be able to send your items to you. Further note Minimum delivery charge to Russia is Â£29.99 FINANCE AVAILABLE ON ALL NEW PRODUCTS OVER Â£300 PLEASE CALL US ON 01633 262738 OR 02920 394182 FOR DETAILS",
    "depth": "7.62 cm",
    "sensorresolution": "16.2 MP",
    "viewfindertype": "Optical (Through-the-lens)",
    "filesystem": "DCF (Design Rule for Camera File System) 2.0, DPOF (Digital Print Order Format), Exif 2.3 (Exchangeable Image File Format for Digital Still Cameras), PictBridge",
    "supportedflashmemory": "SD Card, SDHC Card, SDXC Card",
    "model": "D7000",
    "framecoverage": "Approx. 100% horizontal and 100% vertical",
    "whitebalance": "Auto, Cloudy (Preset), Daylight / Sunny (Preset), Flash (Preset), Fluorescent (Preset), Incandescent (Preset), Manual, Shade (Preset)"
}