{
    "wifi": "Yes",
    "hdmioutput": "Yes",
    "weight": "153 g",
    "series": "Nikon COOLPIXBattery Type:Lithium-Ion",
    "isosensitivity": "ISO 125, 200, 400, 800, 1600, 3200",
    "audiofileformats": "WAV",
    "memorycard": "SD, SDHC, SDXC (up to 128 GB), UHS-1",
    "bluetooth": "No",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "opticalzoom": "12xType:Compact",
    "normaldistance": "50 cm to infinity",
    "batterytype": "Li-ion EN-EL19",
    "videomode": "Yes, with sound",
    "maxvideoresolution": "1920 x 1080",
    "category": "camera",
    "startuptime": "1.4 secs",
    "continuousshooting": "Yes",
    "dimensions": "56 x 95 x 26 mm (L x W x D)",
    "batterylife": "150",
    "panoramamode": "Yes",
    "brand": "NikonMegapixels:16.0 MP",
    "builtin": "Yes",
    "screenfeatures": "- Anti-reflection coating - 5-level brightness adjustment",
    "selftimer": "Yes - 2, 10 secs",
    "attr35mmequivalent": "25-300 mm",
    "photofileformats": "JPEG",
    "pictbridgedirectprinting": "No",
    "poweroptions": "Rechargeable battery",
    "aperture": "f/3.1-6.5",
    "size": "1/2.3\"",
    "type": "CMOS",
    "maximumphotoresolution": "4624 x 3464p",
    "hardcopymanualsupplied": "Yes",
    "gps": "No",
    "focallength": "4.5-54.0 mm",
    "screen": "3\" TFT LCD",
    "internalmemory": "25 MB",
    "effects": "No",
    "imagestabiliser": "Optical",
    "interface": "USB",
    "videofileformats": "MOV",
    "otherfeatures": "- Crop - D-Lighting - Glamor Retouch - Quick Effects - Quick retouch - Skin softening - Small Picture - Trim",
    "shutterspeed": "1 sec - 1/2000th",
    "tvoutput": "No",
    "integratedmemorysize": "64 MB",
    "minimumdistance": "Approx 8 cm",
    "maximumvideoresolution": "Full HD 1920 Ã\u0097 1080p (30 fps)",
    "displaytype": "LCD",
    "guidenumber": "No",
    "colour": "Red",
    "cameratype": "Advanced compact digital camera",
    "exposuremodes": "Programmed Auto, Back Light, Beach, Black and White Copy, Close Up, Copy, Dusk/Dawn, Easy Panorama, Fireworks Show, Food, Landscape, Museum, Night Landscape, Night Portrait, Party/Indoor, Pet Portrait, Portrait, Scene Auto Selector, Snow, Sports, Sunset, 3D Photography",
    "displaysize": "3\"",
    "shopcategoriesshophomecanoncashbackitemscrumplerexdemofujifilmlowepromanfrottonikonolympuspentaxsonytamractamronusedusedvelbonother": "cameracentreuk Store NIKON Coolpix Coolpix S6500 Advanced Compact Digital Camera - Red 16 megapixels Sensor type: CMOS Optical zoom: 12x HD video: Full HD 1080p Product details With a CMOS sensor, enhanced lens capabilities and built-in WiFi, the Nikon Coolpix S6500 Advanced Compact Digital Camera has all the tools you need to create breathtaking imagery . Advanced imaging The Coolpix S6500 has incorporated many of the intelligent features that make up costly DSLR cameras, delivered to you in a light, stylish package. The powerful, backlit CMOS sensor delivers superb image clarity, with a 16 MP resolution through a lens with wide-angle coverage and 12x optical zoom. With this impressive compact camera you can also capture precious moments in Full 1080p HD video using the simple recording function which has full sound. Autofocus and lens-shift vibration reduction on the Coolpix work together to deliver images and videos that are crystal-clear and free from blur. Shoot and share With built-in WiFi you can share your latest photos in a flash, for family and friends to enjoy on your favourite social networks. Use your smartphone as a remote for your Coolpix S6500 to make capturing self portraits, easy and hassle-free. Set the scene Let Nikon tailor settings to suit any scene by choosing from a range of exposure modes such as black and white, sports, dusk and dawn, pet portrait, snow and even 3D photography. For close ups, use the macro setting to take in beautiful, precious details with a minimum focusing distance of 8 cm. Capture the beauty of sweeping images or the excitement of a packed party using the Panorama Mode on the Coolpix S6500 . Whether you're using the portrait mode to shoot a friend or the self-timer to get a shot of the whole family, the Glamour Retouch tool will ensure everyone looks their best, from teeth whitening to skin softening. For professional looking images that are easy to achieve and quick to share choose the Nikon Coolpix S6500 Advanced Compact Digital Camera . Product code: 045138 Print product details OVERVIEW Camera type Advanced compact digital camera SENSOR Resolution 16 megapixels Type CMOS Size 1/2.3\" ISO sensitivity ISO 125, 200, 400, 800, 1600, 3200 Image stabiliser Optical LENS Focal length 4.5-54.0 mm 35 mm equivalent 25-300 mm Aperture f/3.1-6.5 Minimum distance Approx 8 cm Normal distance 50 cm to infinity Focusing Autofocus ZOOM Optical zoom 12 x Digital zoom 4 x VIEWFINDER Type Live View Screen 3\" TFT LCD Screen features - Anti-reflection coating - 5-level brightness adjustment SHUTTER Shutter speed 1 sec - 1/2000th Continuous shooting Yes Self-timer Yes - 2, 10 secs SETTINGS Exposure modes Programmed Auto, Back Light, Beach, Black and White Copy, Close Up, Copy, Dusk/Dawn, Easy Panorama, Fireworks Show, Food, Landscape, Museum, Night Landscape, Night Portrait, Party/Indoor, Pet Portrait, Portrait, Scene Auto Selector, Snow, Sports, Sunset, 3D Photography Effects No 3D mode Yes Panorama mode Yes White balance Auto, Cloudy, Daylight, Flash, Fluorescent, Incandescent, Preset Manual PHOTO Maximum photo resolution 4624 x 3464p Photo file formats JPEG VIDEO Video mode Yes, with sound Maximum video resolution Full HD 1920 Ã\u0097 1080p (30 fps) Video file formats MOV Audio file formats WAV MEMORY Memory card SD, SDHC, SDXC (up to 128 GB), UHS-1 Internal memory 25 MB FLASH Built-in Yes Guide number No CONNECTIONS Interface USB TV output No Pictbridge / direct printing No Bluetooth No WiFi Yes GPS No POWER Power options Rechargeable battery Battery type Li-ion EN-EL19 Battery life 150 Start-up time 1.4 secs GENERAL Colour Red Other features - Crop - D-Lighting - Glamor Retouch - Quick Effects - Quick retouch - Skin softening - Small Picture - Trim Hard copy manual supplied Yes Accessories supplied - EN-EL19 Rechargeable Battery - EH-70P AC Adapter/Charger - UC-E6 USB Cable - AN-CP19 Strap - NikonView NX 2 CD-ROM Dimensions 56 x 95 x 26 mm (L x W x D) Weight 153 g NIKON UK STOCK A GRADE REFURBISHED. COME COMPLETE AS NEW 12 MONTH WARRANTY IF YOU WOULD LIKE ANY MORE INFORMATION ABOUT THIS ITEM, OR ANY OF OUR OTHER ITEMS ON OUR EBAY STORE OR IF YOU WOULD LIKE TO PAY WITH CREDIT/DEBIT CARD THEN PLEASE FEEL FREE TO CALL ONE OF OUR STORES ON: CARDIFF : 02920 394182 NEWPORT : 01633 262738 **RETURNS** UNDER THE DISTANCE SELLERS ACT YOU ARE ENTITLED TO CANCEL AND RETURN YOUR ORDER LESS THE COST OF POSTAGE THAT IT HAS COST US TO POST THE ITEM TO YOU. THIS ONLY COVERS YOU FOR BUY IT NOW ITEMS NOT AUCTION STYLE PURCHASES. IF FOR ANY REASON YOU WISH TO RETURN ANY ITEM THAT YOU BUY FROM CAMERA CENTRE UK THEN PLEASE INCLUDE A COPY OF YOUR ORIGINAL RECEIPT AND A COVER NOTE EXPLAINING THE REASON FOR THE RETURN. THIS WILL INSURE THAT YOUR REQUEST IS PROCESSED QUICKLY AND EFFICIENTLY WITHOUT DELAY. RETURNS MUST BE WITHIN 7 DAYS OF RECEIVING YOUR ITEM. THE MAXIMUM RETURNS POSTAGE WE WILL PAY IS Â£7.90 FOR UK .PLEASE DO NOT SEND THE ITEM BACK SPECIAL DELIVERY AS WE WILL ONLY COVER UP TO THIS MUCH. WE ENDEVOUR TO SORT ANY ISSUES OUT AS SOON AS THEY ARISE, BUT IN SOME CASES THERE MAY BE A SMALL DELAY. THIS IS NOT A HUGE PROBLEM IF YOU BID AND CHANGE YOUR MIND, OR JUST BID BY MISTAKE, BUT PLEASE - IF YOU WISH TO CANCEL YOUR BID - LET US KNOW ATLEAST 24 HOURS PRIOR TO THE LISTING ENDING, THIS WILL INSURE THAT NO EBAY CASES ARE OPENED AND THAT OTHERS CAN HAVE THE CHANCE TO PURCHASE THE ITEM WITHOUT HAVING TO WAIT WHILE THE ITEM IS RELISTED. **POSTAGE** IN SOME CASES POSTAGE MAY BE A LITTLE MORE TO SOME AREAS OF THE WORLD. IF YOU ARE UNSURE OF THE COST TO YOUR AREA PLEASE FEEL FREE TO EMAIL AND ASK AND WE WILL GET BACK TO YOU AS SOON AS POSSIBLE. THIS WILL INSURE THAT YOUR ORDER IS PROCESSED THANK YOU FOR LOOKING Russian Customers We are only able to ship to business addresses in Russia. If you do not supply us with a business address then we will not be able to send your items to you. Further note Minimum delivery charge to Russia is Â£29.99 FINANCE AVAILABLE ON ALL NEW PRODUCTS OVER Â£300 PLEASE CALL US ON 01633 262738 OR 02920 394182 FOR DETAILS",
    "focusing": "Autofocus",
    "digitalzoom": "4x",
    "sensorresolution": "16.0 MP",
    "attr3dmode": "Yes",
    "supportedflashmemory": "SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "model": "S6500Screen Size:3\"",
    "resolution": "16 megapixels",
    "whitebalance": "Auto, Cloudy, Daylight, Flash, Fluorescent, Incandescent, Preset Manual",
    "screensize": "3\""
}