{
    "flashguidenumber": "0",
    "hdmioutput": "Yes",
    "weight": "383 gr",
    "flashsyncspeed": "1/60",
    "displaytype": "LCD",
    "isomax": "6400",
    "shutterspeedmin": "30 seconds",
    "screenresolution": "921000",
    "size": "113 x 76 x 43.5mm",
    "category": "camera",
    "integratedcleaning": "Dust shield glass",
    "autofocuspoints": "135",
    "ean": "0182089218054",
    "lensforsd": "VR 10-30mm f/3.5-5.6",
    "sensorsize": "13.2 x 8.8mm",
    "liveview": "Yes",
    "framespersecond": "60",
    "screensize": "3\"",
    "batterymodel": "EN-EL15",
    "maxvideoresolution": "1920 x 1080",
    "flashmetering": "i-TTL flash control using image sensor available with optional SB-N5 flash uni",
    "autofocussystem": "Hybrid auto focus (phase detection/contrast detect AF); AF-assist illuminator",
    "brand": "Nikon",
    "sensortype": "CMOS",
    "connectivity": "Hi-Speed USB, NTSC, PAL, Type C mini-pin HDMI connector",
    "screensizeinches": "3.0",
    "meteringsystem": "Matrix, Center-weighted, and Spot",
    "cardformat": "SD (Secure Digital), SDHC, and SDXC memory cards",
    "supportedflashmemory": "SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "aspectratio": "3:2",
    "fileformats": "RAW, JPEG, MOV, ACC",
    "weightg": "383",
    "isomin": "100",
    "moviemode": "1080p",
    "cameratype": "Mirrorless Interchangeable Lens",
    "lensmount": "Nikon 1 mount",
    "megapixels": "10.1",
    "displaysize": "3\"",
    "shopcategoriesshophomecanoncashbackitemscrumplerexdemofujifilmlowepromanfrottonikonolympuspentaxsonytamractamronusedusedvelbonother": "cameracentreuk Store Nikon 1 V1 BLACK Digital Camera with 10-30mm VR Lens The smart design of the Nikon 1 V1 Interchangeable Lens camera is designed for the passionate photographer and is fitted with the newest advanced technology to take your photos to the next level. Packed with speed, simplicity and enjoyment in mind, the stylish 10.1 megapixel camera features a revolutionary AF system and a CX-format CMOS image sensor that offers the ideal balance between size, speed, light sensitivity, resolution and depth of field. Whether youâ\u0080\u0099re shooting stills or capturing a HD movie, the bright 1440k-dot high-resolution electronic viewfinder delivers a clear, stable view and 100% frame coverage for sharp, steady shooting, in all lighting conditions. Combined with this advanced technology is Nikons powerful EXPEED 3 image processor, engineered to deliver full resolution images at up to 60 frames per second with fixed-point AF. The V1 comes with a wide ISO range of 100-6400 (extended), RAW shooting, a Multi-accessory port, Motion Snapshot and Smart Photo Selector. Key features of the Nikon 1 V1 Nikon 1: A quick, intelligent and portable camera system. Boasts a dedicated range of compact 1 NIKKOR interchangeable lenses and system accessories. Crafted to bring new levels of speed, simplicity and enjoyment to the way you capture your world. Bright 1440k-dot electronic viewfinder: cleverly housed in the cameraâ\u0080\u0099s compact body. Delivers a clear, stable view and 100% frame coverage for sharp, steady shooting, even in bright sunlight. The camera automatically senses when youâ\u0080\u0099re using the viewfinder and switches LCD screen off. CX-format CMOS image sensor: offers the ideal balance between system size, speed, light sensitivity, resolution and depth-of-field. Delvers superb color reproduction, 100-6400 (extended) ISO, RAW shooting and 10.1 megapixel resolution. Incorporates a dust reduction system for spot-free images. EXPEED 3 image processor: engineered to deliver unparalleled levels of speed and performance in any situation. Equipped with two powerful engines that can process images at an incredible 600 megapixels a second. Offers superior noise reduction and enables the cameraâ\u0080\u0099s groundbreaking shooting modes. Revolutionary Autofocus system: instantly switches between 73-point Phase-Detection AF system and 135-point Contrast Detect AF system for sharp movies and stills in any situation. And with Phase-Detection AF available during movie recording, you get sharply focused action scenes every time. Blazingly fast continuous shot: keeps subjects in focus while you shoot the action. Lets you capture full resolution images at up to 60fps with fixed-point AF, and at up to 10fps with Adaptive AF*3. Motion Snapshot: brings your stills to life in a click. Harnesses the cameraâ\u0080\u0099s processing speed to simultaneously record a slow motion movie and a still image. As soon as youâ\u0080\u0099ve taken your shot it instantly combines the two to create a â\u0080\u0098living imageâ\u0080\u0099 and capture a moment in time as never before. Smart Photo Selector: always gets the best shot. Uses pre-post capture technology to shoot 20 high-resolution images before and after you release the shutter. Saves your â\u0080\u0098bestâ\u0080\u0099 five shots for you to choose from. Images are recommended based on facial expression, composition and focus. Advanced movie recording: capture high-resolution photos*1 while filming, or shoot in extreme slow motion. You can record full HD movies at 60 and 30 fps and Phase-detection AF, which is quick to focus on movement, is available during recording. Offers 60i, 60p and 30p frame rates. Take total control: with Exposure Modes (P/S/A/M), and access to key settings that let you control aperture and shutter speed so even experienced photographers wont be left wanting. Boasts a range of Picture Controls that let you set the look and mood of your stills or movies before shooting. Smart design: boasts a strong yet lightweight body available in iconic black or white, with magnesium alloy re-enforced parts. Compact and portable, it packs a 7.5 cm (3-in.), 920k-dot LCD monitor with wide viewing angle and protective glass. 1 NIKKOR interchangeable lenses: the family of 1 NIKKOR lenses cover practically every type of scene, are all optimized for movie recording and boast a compact design for superior portability. Mount Adapter FT1: attaches to the cameraâ\u0080\u0099s 1-mount to let you use any NIKKOR SLR lens. And if you use AF-S and AF-I NIKKOR lenses you can still make full use of the incredible Nikon 1 autofocus system*2. Multi-accessory port: expands your shooting options further. The compact SB-N5 Speedlight flash can be rotated vertically or horizontally to bounce light off the ceiling or walls. The tiny GP-N100 GPS unit is a great way to make sure you can always tag your images to the right location. Nikon 1 Short Movie Creator: automatically creates short movies from your still images and movie footage. Incredibly easy-to-use, it preserves the quality of every photo or frame of footage you shoot. Movies can be up to 30 minutes long and you have a range of styles to choose from. *1 Full resolution images in movie mode (aspect ratio 16:9) 3,840 x 2,160 (1,080/60i). *2 For accurate information about compatibility with F-mount NIKKOR lenses, please refer to the manual. *3 With default settings, you can shoot at a high speed of 10fps by pressing the shutter-release button down all the way. While shooting, the camera will focus on the subject within the AF area in the center of the screen. Face-priority AF is not available. You can adjust the shooting speed to 30 fps and 60 fps by changing the camera settings in the menu. SPECIFICATIONS Megapixels 10.1 Sensor type CMOS Autofocus points 135 Lens mount Nikon 1 mount Metering system Matrix, Center-weighted, and Spot Frames per second 60 ISO min 100 ISO max 6400 Screen size (inches) 3.0 Card format SD (Secure Digital), SDHC, and SDXC memory cards Battery model EN-EL15 Weight (g) 383 Size 113 x 76 x 43.5mm Resolution 3872 x 2592 Aspect ratio 3:2 Sensor size 13.2 x 8.8mm Autofocus system Hybrid auto focus (phase detection/contrast detect AF); AF-assist illuminator Screen resolution 921000 File formats RAW, JPEG, MOV, ACC Connectivity Hi-Speed USB, NTSC, PAL, Type C mini-pin HDMI connector Flash guide number 0 Flash metering i-TTL flash control using image sensor available with optional SB-N5 flash uni Flash sync speed 1/60 Integrated cleaning Dust shield glass Live view Yes Shutter speed max 1/16000 second Shutter speed min 30 seconds Viewfinder Electronic viewfinder Manufacturer link Click here Movie mode 1080p NIKON UK A GRADE REFURB ISHED 12 MONT HS WARRANTY IF YOU WOULD LIKE ANY MORE INFORMATION ABOUT THIS ITEM, OR ANY OF OUR OTHER ITEMS ON OUR EBAY STORE OR IF YOU WOULD LIKE TO PAY WITH CREDIT/DEBIT CARD THEN PLEASE FEEL FREE TO CALL ONE OF OUR STORES ON: CARDIFF :  02920 394182 NEWPORT : 01633 262738 **RETURNS** UNDER THE DISTANCE SELLERS ACT YOU ARE ENTITLED TO CANCEL AND RETURN YOUR ORDER LESS THE COST OF POSTAGE THAT IT HAS COST US TO POST THE ITEM TO YOU. THIS ONLY COVERS YOU FOR BUY IT NOW ITEMS NOT AUCTION STYLE PURCHASES. IF FOR ANY REASON YOU WISH TO RETURN ANY ITEM THAT YOU BUY FROM CAMERA CENTRE UK THEN PLEASE INCLUDE A COPY OF YOUR ORIGINAL RECEIPT AND A COVER NOTE EXPLAINING THE REASON FOR THE RETURN. THIS WILL INSURE THAT YOUR REQUEST IS PROCESSED QUICKLY AND EFFICIENTLY WITHOUT DELAY. RETURNS MUST BE WITHIN 7 DAYS OF RECEIVING YOUR ITEM. THE MAXIMUM RETURNS POSTAGE WE WILL PAY IS Â£7.90 FOR UK .PLEASE DO NOT SEND THE ITEM BACK SPECIAL DELIVERY AS WE WILL ONLY COVER UP TO THIS MUCH. WE ENDEVOUR TO SORT ANY ISSUES OUT AS SOON AS THEY ARISE, BUT IN SOME CASES THERE MAY BE A SMALL DELAY. THIS IS NOT A HUGE PROBLEM IF YOU BID AND CHANGE YOUR MIND, OR JUST BID BY MISTAKE, BUT PLEASE - IF YOU WISH TO CANCEL YOUR BID - LET US KNOW ATLEAST 24 HOURS PRIOR TO THE LISTING ENDING, THIS WILL INSURE THAT NO EBAY CASES ARE OPENED AND THAT OTHERS CAN HAVE THE CHANCE TO PURCHASE THE ITEM WITHOUT HAVING TO WAIT WHILE THE ITEM IS RELISTED. **POSTAGE** IN SOME CASES POSTAGE MAY BE A LITTLE MORE TO SOME AREAS OF THE WORLD. IF YOU ARE UNSURE OF THE COST TO YOUR AREA PLEASE FEEL FREE TO EMAIL AND ASK AND WE WILL GET BACK TO YOU AS SOON AS POSSIBLE. THIS WILL INSURE THAT YOUR ORDER IS PROCESSED THANK YOU FOR LOOKING ** PLEASE NOTE ** WE DO NOT DELIVER TO SOUTH AMERICA, AFRICA OR SOUTHERN ASIA. IF YOU ARE UNSURE PLEASE ASK. ALL ORDERS OVER Â£300 COME WITH FREE NEXT DAY SPECIAL DELIVERY ALL ORDERS OVER Â£300 ARE SENT SPECIAL NEXT DAY DELIVERY. ** Please Note ** All item that are returned to us in perfect unopened and unused condition will receive a full refund. Any item that has been opened or used will incur a 10% restocking/repackaging fee. This includes software packs, neck straps etc.. We are unable to accept returns of consumables that have been opened, this includes batteries,memory cards etc.. Russian Customers We are only able to ship to business addresses in Russia. If you do not supply us with a business address then we will not be able to send your items to you. Further note Minimum delivery charge to Russia is Â£29.99",
    "sensorresolution": "10.1 MP",
    "viewfinder": "Electronic viewfinder",
    "model": "V1",
    "resolution": "3872 x 2592",
    "shutterspeedmax": "1/16000 second"
}