{
    "exposurecompensation": "+/-2 stops in 1/3-stop increments",
    "imagerecordingformat": "Normal, Fine",
    "label38": "Maximum Aperture f/3.4 (W) - f/5.9 (T)",
    "flash": null,
    "computerinterface": "USB 2.0 Hi-Speed USB (dedicated female connector with unified type of digital, audio and video) mini-B compatible",
    "totalpixels": "Approx. 12.8 Megapixels",
    "jpegcompressionmode": "Still Image",
    "label8": "High-Speed Burst Mode allows continuous shooting and Super Slow Motion Movie records video at high speeds to allow playback in slow motion",
    "label9": "Intelligent IS automatically chooses from six different modes to optimize image stabilization for the shooting condition",
    "flashrange": "12 in. - 10.2 ft. (30 cm-3.1 m) (W), 3.3 - 5.6 ft. (1.0 - 1.7 m) (T)",
    "label0": "12.1 MP Compact Digital Camera",
    "label1": "12x Optical / 4x Digital Zoom",
    "label2": "Full HD 1080p Video",
    "label3": "3.2-inch Colour Touch Panel LCD",
    "label4": "28mm Wide-Angle lens, 12x Optical Zoom, and Optical Image Stabilizer",
    "label5": "12.1 Megapixel CMOS sensor combined with Canon's DIGIC 4 Image Processor creates the Canon HS SYSTEM for outstanding low-light performance up to ISO 3200",
    "label6": "Capture stunning Full HD 1080p video in stereo sound with a dedicated movie button; zoom while shooting and play back videos on an HDTV via the HDMI output",
    "label7": "3.2-inch wide touch panel LCD offers easy and intuitive operation, and Touch Shutter makes shooting easy and interactive",
    "recyclingtime": "10 sec. or less (battery voltage",
    "operatinghumidity": "10-90%",
    "playbacktime": "Approx. 4 hours",
    "lcdpixels": "Approx. 461,000 dots",
    "inthebox": null,
    "weight": "Approx. 7.27 oz / 206 g (Including battery and memory card), Approx. 6.46 oz / 183 g (camera body only)",
    "sensitivity": "Auto, ISO 100/200/400/800/1600/3200 (in P mode)",
    "erasemodes": "Select image, select range, all images (all filtered images)",
    "label18": "The 12.1 Megapixel CMOS sensor in the PowerShot ELPH 510 HS incorporates advanced light reception technology that enhances sensitivity",
    "label19": "The DIGIC 4 Image Processor provides a major boost in noise reduction, expanding the usable ISO range to an amazing high of 3200",
    "powersource": "Battery Pack NB-9L, Compact Power Adapter CA-DC10 (included with AC Adapter Kit ACK-DC70)",
    "label12": "Face Detection Technology including Smart Shutter",
    "label10": "Improved Smart AUTO intelligently selects the proper settings for the camera based on 32 predefined shooting situations",
    "label11": "Movie Digest records a short video clip right before shooting a photo and then combines one day's worth of clips into one video",
    "label16": "Beautiful low-light shots are possible with minimal noise and maximum detail in highlight and shadow areas",
    "label15": "Lets you take bright, clear photos in an even wider range of shooting situations",
    "category": "camera",
    "label96": "Battery Pack NB-9L",
    "label97": "Battery Charger CB-2LB",
    "label95": "PowerShot ELPH 510 HS Body",
    "label98": "Wrist Strap WS-DC10",
    "label99": "USB Interface Cable IFC-400PCU",
    "selftimer": "Approx. 10-sec. delay, Approx. 2-sec. delay, custom*  *Delay time (0-15sec. (in one-second increments), 20/25/30 sec.) and number of shots (1-10 shots (in one-shot increments)) can be specified)",
    "autofocussystem": "TTL Autofocus",
    "focallength": "5.0 (W) - 60.0 (T) mm (35mm film equivalent",
    "interfaces": null,
    "whitebalancecontrol": "Auto, Daylight, Cloudy, Tungsten, Fluorescent, Fluorescent H, Custom",
    "lightmeteringmethod": "Evaluative, Center weighted average, Spot",
    "shutterspeed": "1-1/4000 sec.; 15-1/4000 sec. (Total shutter speed range)",
    "label23": "Image Capture Device;",
    "audioout": "Stereo (dedicated connector (female) unified type of digital, audio, and video)",
    "operatingtemperature": "32-104°F/0-40°C",
    "shootingmodes": "Auto*1, P, Movie Digest, Portrait, Kids & Pets, Smart Shutter*2, High-Speed Burst, Best Image Selection, Handheld Night Scene, Low Light, Fish-eye Effect, Miniature Effect, Toy Camera Effect, Monochrome, Super Vivid, Poster Effect, Colour Accent, Colour Swap, Beach, Foliage, Snow, Fireworks, Long Shutter, iFrame Movie, Super Slow Motion Movie",
    "builtinflash": "Auto, Flash On, Slow Synchro, Flash Off",
    "label64": "Differs depending on the zoom position",
    "lcdcoverage": "Approx. 100%",
    "fileformat": "Design rule for camera file system, DPOF Version 1.1 compliant",
    "photoeffects": "My Colours Off, Vivid, Neutral, Sepia, Black & White, Positive Film, Lighter Skin, Darker Skin, Vivid Blue, Vivid Green, Vivid Red, Custom Colour* *Adjustment of contrast, sharpness, saturation, red, green, blue and skin tone are available",
    "stillimages": "Single, Index (6-130 thumbnails), Magnification (2x-10x), Information Display, Red-eye Correction, i-Contrast, Trimming, Resize, My Colours, Focus Check, Histogram, Overexposure Warning",
    "focusingrange": "Auto",
    "powersupply": "Battery Pack NB-9L, Compact Power Adapter CA-DC10 (included with AC Adapter Kit ACK-DC70) Approx. 170 shots Approx. 4 hours",
    "opticalviewfinder": "N/A",
    "exposurecontrol": null,
    "imagestorage": null,
    "label75": "Displays playback position and shooting time",
    "label76": "Using the software included with the camera (ZoomBrowser EX/ImageBrowser), there are 8 levels (1/8x to 1x) of playback speed possible on a computer",
    "type": "12.1 Megapixel, 1/2.3-inch CMOS",
    "flashexposurecompensation": "N/A",
    "storagemedia": "SD Memory Card, SDHC memory Card, SDXC Memory Card , Eye-Fi",
    "lcdmonitor": "3.2-inch wide TFT Colour Touch Panel LCD with wide viewing angle",
    "videoout": "NTSC/PAL (dedicated connector (female) with unified type of digital, audio and video); Mini-HDMI connector",
    "label49": "Facial brightness is also evaluated in Face Detect",
    "viewfinders": null,
    "effectivepixels": "Approx. 12.1 Megapixels",
    "videos": "Normal Playback (Audio settings available in 5 levels), Slow Motion (5 levels (including normal playback), sound not available), Skip Backward (Approximately 4 seconds), Previous Frame (Rewind and Fast-forward are also available), Next Frame (Rewind and Fast-forward are also available), Skip forward (Approximately 4 seconds)",
    "af": "Approx. 0.8 shots/sec. (in P mode), Approx. 1.2 shots/sec. (in Low Light mode)",
    "label63": "Under conditions where the flash does not fire automatically",
    "shootingcapacity": "Approx. 170 shots",
    "continuousshooting": null,
    "other": "Memory card slot; direct connection to Canon SELPHY Compact Photo Printers, PIXMA Inkjet Photo Printers and PictBridge-compatible printers via camera's USB 2.0 Hi-speed cable",
    "exposurecontrolmethod": "AE Lock",
    "dimensionswxhxd": "3.90 x 2.32. x 0.86 in / 99.0 x 58.9 x 21.9 mm",
    "normal": "Approx. 3.3 shots/sec. (in P Mode), Approx. 7.8 shots/sec. (in High-speed Burst mode)",
    "specifications": null,
    "lens": null,
    "label20": "The Canon HS SYSTEM takes the frustration out of low-light shooting, delivering clear, blur-free images",
    "wirelesscontrol": "N/A",
    "digitalzoom": "Approx. 4.0x (Up to approx. 48x in combinations with the optical zoom)",
    "whitebalance": null
}