{
    "attr2speedzoom": "Yes",
    "playbackmode": "All, Slideshow, Filtering Play (Picture Only, Video Only, 3D Play, GPS Area Play, Map, Travel, Category Selection, Select Date, Favorite), Calendar",
    "nanosurfacecoating": null,
    "intelligentzoom": "40x",
    "focallength": "f = 4.3 - 86.0 mm (24 - 480 mm in 35 mm equiv.) (28 - 560 mm in 35 mm equiv. in video recording)",
    "focus": "Normal / AF Macro / Macro Zoom, Touch AF/AE, Quick AF On / Off (on in Intelligent Auto), Continuous AF (only for motion picture), AF Tracking",
    "label30": "Edge Smoothing NR technology also helps rendering smooth edges even in image recording at high ISO setting",
    "exposurecompensation": "1/3 EV step, +-2 EV",
    "label32": "Processes large amount of progressive full HD data at high speed",
    "label33": "At the same time, the multi-task image-processing engine, the Venus Engine realizes a super-fast response time",
    "label35": "MOS sensor lets the DMC-ZS30(TZ40) shoot 10 fps in 18.1-megapixel full resolution with mechanical shutter and 5 fps with continuous AF",
    "label36": "You can take a series of shots, then choose the ones you like the best and delete the rest",
    "includedsoftware": "PHOTOfunSTUDIO 9.1 PE, Adobe Reader",
    "label38": "With the industry's first Creative Panorama, 12 filter effects make panorama images more impressive, and expand your expressive abilities",
    "label13": "Gives you a wider range of composition possibilities with approx. 213% larger viewing space compared to that of 35mm camera",
    "label10": "Powerful 20x optical zoom lens in a slim body draws your subjects right up close, and lets you freely capture decisive sports scenes, along with the natural expressions of people and animals",
    "lightmetering": "Intelligent Multiple / Center Weighted / Spot",
    "label17": "The 20x optical can virtually extend to 40x equivalent",
    "label14": "High-quality LEICA DC lens minimizes distortion at the wide end",
    "focusingarea": "Normal",
    "category": "camera",
    "label25": "O.I.S. suppresses the low-frequency vibration hand-shake component, which is physically generated when pressing the shutter button or when shooting at night with a slow shutter speed",
    "microphonespeaker": "Stereo / Mono",
    "opticalzoominmotionpicture": "Yes",
    "digitalredeyecorrectionredeyeremoval": "Yes",
    "label16": "Extensive zoom function using digital zoom with minimum deterioration of image quality thanks to the Intelligent Resolution technology",
    "selftimer": "2 sec / 10 sec",
    "weightapprox": "172 g (0.38 lb) without Battery and SD Memory Card  171 g (0.38 lb); 198 g (0.44 lb) with Battery and SD Memory Card; 197 g (0.43 lb)",
    "recmodemodedial": "Intelligent Auto, P (Program), A (Aperture Priority), S (Shutter Priority), M (Manual), C1 (Custom), C2 (Custom), Panorama Shot, Scene, Creative Control",
    "builtinmemory": "Approx. 12 MB",
    "colormode": "Standard, Black & White, Sepia, Vivid (in P / A / S / M Mode), Happy (only in iA Mode)",
    "aperture": "F3.3 - 6.4 / Multistage Iris Diaphragm (F3.3 - 8.0 (W), F6.4 - 8.0 (T))",
    "pictbridgesupport": "Single / Multi / All / Favorites / DPOF",
    "dimensionswxhxdapprox": "108.3 x 58.9 x 27.7 mm (4.26 x 2.32 x 1.09 inch)",
    "label8": "Light Speed AF",
    "specifications": null,
    "afassistlamp": "Yes (On / Off)",
    "power": "Li-ion Battery Pack (3.6V, 1,250 mAh, 4.5 Wh); AC Adaptor (Input",
    "sensorsizetotalpixelsfilter": "1/2.3-inch High Sensitivity MOS sensor / 18.9 Total Megapixels / Primary Color Filter",
    "label0": "18.1 MP Compact Digital Camera",
    "label1": "20x Optical Zoom",
    "label2": "Full HD Video",
    "label3": "3.0\" TFT Touch Screen LCD",
    "label4": "Control it and share instantly from your smartphone",
    "label5": "Stunning sharp Full HD video from an optically stabilized 20X Zoom",
    "label6": "Create your memories with built-in creative effects",
    "label7": "Quick Start-up Time",
    "label23": "The Panasonic's black box technology Nano Surface Coating boasts extremely low reflectance ratio and it is applied to DMC-ZS30 for exceptional optical performance with stunning clarity by minimizing flaring and ghosting",
    "lcd": "3.0\" (7.5 cm) TFT Touch Screen LCD Display (920K dots), AR Coating, Multi-Touch; Field of View",
    "label20": "Adoption of ultra-thin lens for its optical system makes the unit's overall length short to fit in the slim body",
    "label26": "The O.I.S. also works for powerful zoom shots, which are especially susceptible to hand-shake. Plus, the HYBRID O.I.S. + is highly effective for video recording",
    "cameraeffectivepixels": "18.1 Megapixels",
    "interface": "micro HDMI, AV Output, USB (AV / USB Multi)",
    "label29": "Wavelet NR (Noise Reduction) system in the Venus Engine enables deliberate noise reduction process without missing low-frequency noise by enlarging its detection area by approx.64x",
    "label28": "18.1-megapixel High Sensitivity MOS sensor realizes both high quality image recording and high speed signal processing",
    "shutterspeed": "Approx. 4 - 1/2,000 sec; Starry Sky Mode",
    "exposure": "Program AE, Aperture Priority AE, Shutter Priority AE, Manual",
    "extraopticalzoomez": "24.5x (4",
    "lens": "LEICA DC VARIO-ELMAR, 12 elements in 10 groups (3 Aspherical Lenses / 6 Aspherical Surfaces / 2 ED Lenses)",
    "nfc": "Yes",
    "imagequality": "Fine / Standard (3D Mode",
    "autoaebracketing": "1/3 - 1 EV step, Max. +-1 EV, 3 frames",
    "builtinflash": "Auto, Auto / Red-eye Reduction, Forced On, Slow Sync. / Red-eye Reduction, Forced Off; 0.6 - 6.4 m (Wide / ISO Auto), 1.0 - 3.3 m (Tele / ISO Auto)",
    "continuousshootingmode": "Full-Resolution Image",
    "wifi": "IEEE 802.11b/g/n; 2412 MHz ? 2462 MHz (1-11 ch); WPA / WPA2; Infrastracture Mode / WPS / Wi-Fi Direct; Wi-Fi Button",
    "recordingmedia": "Built-in Memory, SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "label21": "Passing Leica's stringent standards, this lens boasts exceptional optical performance with stunning clarity with minimum distortion and flare",
    "afmetering": "Face / AF Tracking / 23-area / 1-area / Spot / Touch Area (in Touch AF/AE)",
    "stillimagescenemode": "Portrait, Soft Skin, Scenery, Sports, Night Portrait, Night Scenery, Handheld Night Shot, HDR, Food, Baby1, Baby2, Pet, Sunset, High Sensitivity, Starry Sky, Glass Through, Underwater, High Speed Video, 3D Photo",
    "digitalzoom": "4x (When Digital Zoom is used simultaneously with Intelligent Zoom, you can only increase the zoom ratio up to 2x.)",
    "label19": "A 24mm ultra wide-angle 20x optical zoom LEICA DC lens is outstanding in class for its quality and versatility",
    "creativecontrolmode": "Expressive, Retro, High Key, Low Key, Sepia, Dynamic Monochrome, Impressive Art, High Dynamic, Cross Process, Toy Effect, Miniature Effect, Soft Focus, Star Filter, One Point Color",
    "opticalzoom": "20x",
    "label40": "Creative Control (in the recording mode) and the Creative Retouch (in the playback mode) give you the expressive power to turn ordinary situations into highly special scenes",
    "opticalimagestabilizerfiveaxiscorrection": "HYBRID O.I.S. + (On / Off) / Yes",
    "label12": "Rare on a compact camera",
    "gps": "Yes (GPS / GLONASS) / Map / GPS Log",
    "whitebalance": "Auto / Daylight / Cloudy / Shade / Incandescent / White Set / White Balance Adjustment (Except Auto)",
    "isosensitivitystandardoutputsensitivity": "Auto / i.ISO / 100 / 200 / 400 / 800 / 1600 / 3200 / 6400* (*Extended ISO); High Sensitivity Mode (ISO1600 - 6400)",
    "recordingfileformat": "Still Image"
}