{
    "size": "75 mm (3\"), 460K dots",
    "smartauto": "1/8 ~ 1/2000 s., Program",
    "label56": "+-2EV (1/3EV steps)",
    "label31": "With Samsung cameras, you can capture exactly the photos you want",
    "label54": "Program AE, Aperture Priority AE, Shutter Priority AE, Manual Exposure",
    "label19": "Alternately, when you want to enter text - such as an email address, for when you're sharing photos - simply input the characters on the touch screen, much like you would on a smartphone",
    "imagestabilization": null,
    "av": "NTSC, PAL (User selectable)",
    "label13": "Lets you easily snap a 10-megapixel photo while you're recording",
    "label10": "The dedicated DIRECT LINK hot key helps you quickly connect to Wi-Fi networks, while AutoShare, Social Sharing, Cloud, email, AllShare Play and PC Auto Backup let you share memories with friends and family around the world",
    "label11": "Features including, Software Upgrade Notifier, the Samsung SMART CAMERA App, MobileLink and Remote Viewfinder make it easy to connect to your smartphone and tablet",
    "label17": "Presenting a user interface with twice the advantages",
    "label14": "You won't have to stop recording and open a still photo feature; simply snap the photo while your clip is running",
    "stillimage": "JPEG (DCF), EXIF 2.21 * Movie Clip",
    "category": "camera",
    "microphone": "Mono Internal",
    "dimensionsweight": null,
    "label78": "i-Launcher",
    "stillimagemode": "1X ~ 5X",
    "label75": "110.6 x 65 x 21.5 mm",
    "label76": "218 g (without battery and memory card media)",
    "flash": null,
    "storage": null,
    "label0": "16.3 MP Compact Digital Camera",
    "speaker": "Mono",
    "label30": "Aperture Priority and Shutter Priority settings let you experiment with shutter speeds and depth of field - for example, when you're shooting fast-moving images in low light",
    "label15": "You won't have to sacrifice your memories while you shoot live action, do it all from one device",
    "type": "TTL Auto Focus (Center AF, Multi AF, Tracking AF, Face Detection AF, Touch AF), Manual Focus",
    "label2": "Enhanced Wi-Fi Connectivity",
    "lens": null,
    "label9": "Experience the wireless advantages of the SMART CAMERA's Wi-Fi connectivity and truly intelligent features",
    "power": null,
    "specifications": null,
    "label1": "21x Digital Zoom",
    "label23": "A sunset beach party, a dimly-lit dance club - great photo opportunities don't always have the best lighting. Capture properly exposed images in low-light situations with the 16-megapixel BSI (Back Side Illuminated) CMOS sensor, which needs less light than conventional sensors",
    "label3": "Hybrid Touch User Interface",
    "label5": "The 23 mm wide-angle lens allows you to get wider shots at close range",
    "label6": "You can increase your viewing angle and capture the smallest details with incredible realism",
    "label7": "The 21x zoom will also help you capture clearer, more detailed shots from far distances",
    "internalmemory": "Approximately 9.5 MB External Memory",
    "fno": "2.8 (W) ~ 5.9 (T)",
    "label21": "The user-friendly Smart Panel puts all the most important controls at your fingertips",
    "label20": "Navigating controls and sharing images couldn't be easier",
    "label59": "Auto WB, Daylight, Cloudy, Fluorescent_H, Fluorescent_L, Tungsten, Custom, K",
    "label26": "Shoot 1920 x 1080 Full HD videos with continuous AF while capturing lifelike color and extraordinarily sharp details",
    "label24": "And use Low Light Shot to automatically select the best setting and merge four continuous shots into one, clear photo",
    "focusing": null,
    "label29": "Full Manual (A / S / M) allows you full creative control",
    "rechargeablebattery": "SLB-10A Connector Type",
    "shutterspeed": null,
    "exposure": null,
    "totalpixel": "Approx. 17 Mega pixels",
    "label67": "USB 2.0",
    "label40": "21x Optical Zoom",
    "imagesensor": null,
    "effectivepixel": "Approx. 16.3 Mega pixels",
    "label44": "Optical Image Stabilization",
    "display": null,
    "range": "Wide",
    "label55": "Multi, Spot, Center-weighted, Face Detection AE",
    "mode": "Auto, Auto & Red-eye reduction, Fill-in flash, Slow sync, Flash Off, Red-eye fix",
    "sensortype": "1/2.3\" (Approx. 7.76 mm) BSI CMOS",
    "label27": "The H.264 format records longer videos than a camera with MPEG format. Hook up the camcorder to your HDTV and watch your brilliant HD footage in the comfort of your living room",
    "interface": null,
    "whitebalance": null
}