{
    "isosensitivity": "Auto / i.ISO / 100 / 200 / 400 / 800 / 1600 / 3200 (changeable to 1/3 EV step) / High Sensitivity Mode (1600 - 6400)",
    "focus": "Normal / AF Macro / Macro Zoom / MF / Quick AF On/Off(On in Intelligent Auto), Continuous AF(only for motion picture), / AF/AE Lock Button, Manual Focus, One Shot AF, AF Area Select, AF Tracking",
    "exposurecompensation": "1/3 EV step, +/-3 EV",
    "label33": "3.0-inch, 460,000-dot Wide Viewing Angle Intelligent LCD screen",
    "label34": "HDR (High Dynamic Range) mode",
    "label35": "Panorama Shot mode",
    "label36": "3D Photo mode",
    "lightmetering": "Intelligent Multiple / Center Weighted / Spot",
    "focusingarea": "Normal",
    "modedialmodebutton": "Intelligent Auto, P, A, S, M, Creative Video, C1, C2, SCN, Creative Control",
    "avchdactualrecordabletimemotionpictures": "approx. 90 min (FSH), 100 min (SH)",
    "label9": "With the camera's Intelligent Zoom function, zoom can be increased to 48x equivalent while Intelligent Resolution technology maintains picture quality",
    "label0": "16.1 MP Compact Digital Camera",
    "label1": "24x Optical Zoom",
    "label2": "MOS Sensor",
    "label3": "Full-HD Video Recording",
    "label4": "3\" LCD Display",
    "label5": "Auto Retouch Feature",
    "label6": "High Speed Response",
    "cameraeffectivepixels": "16.1 Megapixels",
    "label31": "The popular Creative Control mode has been upgraded, adding eight filter options including Soft Focus, Dynamic Monochrome, Impressive Art, One Point Color, Cross Process, Low Key, Toy Effect and Star Filter in addition to the conventional Expressive, Retro, High Key, Sepia, High Dynamic, Miniature Effect modes",
    "autoaebracketing": "1/3 - 3 EV step, Max.+/-3EV, 3 frames",
    "creativecontrolmode": "Expressive, Retro, High Key, Low Key, Sepia, Dynamic Monochrome, Impressive Art, High Dynamic, Cross Process, Toy Effect, Miniature Effect, Soft Focus, Star Filter, One Point Color",
    "optics": null,
    "weight": "Approx. 449g without Battery and SD Memory Card (0.99lb) / Approx. 493g with Battery and SD Memory Card (1.09lb)",
    "intelligentzoom": "48x",
    "label19": "The powerful 24x optical zoom with POWER O.I.S. is available in video recording and Active Mode encourages recording at a wide angle such as shooting while walking, without causing deterioration of image quality",
    "additionalfeatures": null,
    "label12": "16.1-megapixel High Sensitivity MOS sensor combined with the high performance image processing LSI Venus Engine results in elevated response, sensitivity and image quality",
    "label13": "Integrating high-speed digital signal output technology, the LUMIX FZ60 shoots 10 fps (frames per second) in 16.1-megapixel full resolution",
    "label10": "Nano Surface Coating technology, is dramatically minimizes light reflection for the entire visual light range (380nm-780nm) by applying the extra-low refractive index coating with nano-sized structure on the surface of the lens resulting in super clear picture with dramatic reduction of ghost and flare Compared of 14 elements in 10 groups, including 3 ED lenses and 2 aspherical lenses with 3 aspherical surfaces, the LUMIX FZ60's advanced lens system fits within an outstandingly compact body while delivering exceptional optical performance and suppressing distortion at the wide-end and color bleeding at the tele-end",
    "label16": "The LUMIX FZ60 is an advanced photographic tool for recording not only great photos but also beautiful high-resolution full-HD 1,920 x 1,080 60i (NTSC, sensor output 30p) videos in AVCHD (MPEG-4 / H.264) format or 30p in MP4",
    "label17": "A special, separate button on the top of the camera body allows the user to instantly start recording videos while shooting photos without having to change any settings",
    "label14": "with mechanical shutter and 5 fps with continuous AF.  Combined with its quick start-up time of approximately 0.9 seconds, the LUMIX FZ60 is able to capture even the most fleeting shooting opportunities",
    "category": "camera",
    "pictureadjustment": "Contrast / Sharpness / Color Saturation / Noise reduction",
    "mp4continuousrecordabletimemotionpictures": "approx. 160 min (FHD)",
    "selftimer": "2sec / 10sec / 10sec 3pcs",
    "attr2speedzoom": "Yes",
    "power": "Li-ion Battery Pack (7.2V, Minimum",
    "focallength": "f=4.5 - 108mm (25 - 600mm in 35mm equiv.) / (28 - 672mm in 35mm equiv. in video recording)",
    "opticalimagestabilizer": "Power O.I.S. (On with Active Mode(only for Video) / Off)",
    "interface": "miniHDMI, AV Output (NTSC), USB Multi",
    "shutterspeed": "Still Image",
    "extraopticalzoomez": "30.3x (4",
    "label23": "The stereo microphone comes with zoom noise reduction system and the Auto Wind Cut function blocks out most of the noise from background wind",
    "photostylefilmmode": "Standard / Vivid / Natural / Monochrome / Scenery / Portrait / Custom",
    "builtinflash": "Auto, Auto/Red-eye Reduction, Forced On, Slow Sync./Red-eye Reduction, Forced Off, Flash Synchro;1st/2nd Slow Sync / 0.3 - 13.5m (Wide/ISO Auto), 1.0 - 7.3m (Tele/ISO Auto)",
    "afmetering": "Face / AF Tracking / 23-area / 1-area (flexible/scalable)",
    "fileformat": "Still Image",
    "recordingmedia": "Built-in Memory, SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "digitalredeyecorrectionredeyeremoval": "Yes",
    "mp4actualrecordabletimemotionpictures": "approx. 90 min (FHD)",
    "avchdcontinuousrecordabletimemotionpictures": "approx. 160 min (FSH), 180 min (SH)",
    "builtinmemory": "Approx. 70MB",
    "aperture": "F2.8 - 5.2 / Multistage Iris Diaphragm (F2.8 - 8 (W) / F5.2 - 8 (T))",
    "standardaccessories": "Battery Charger, Battery Pack, USB Cable, Shoulder Strap, CD-ROM, Lens Cap, Lens Cap String",
    "lcdmonitor": "3.0\" (7.5cm) TFT Screen LCD Display (460K dots) / Field of View",
    "imagequality": "Fine / Standard (3D Mode",
    "recording": null,
    "viewfinder": "0.20\" Color EVF (202K Pixels equiv.), Field of View",
    "continuousshootingmode": "Full- Resolution Image",
    "includedsoftware": "PHOTOfunSTUDIO 8.3 AE, / Adobe Reader",
    "other": null,
    "batterylifeapprox": "450 pictures (CIPA Standard)",
    "dimensionswxhxd": "120.3 x 80.8 x 91.9 mm / (4.74 x 3.18 x 3.62 inch)",
    "stillimagescenemode": "Portrait, Soft Skin, Scenery, Panorama Shot, Sports, Panning, Night Portrait, Night Scenery, / Handheld Night Shot, HDR, Food, Baby1, Baby2, Pet, Sunset, High Sensitivity, Glass Through, 3D Photo",
    "zoominmotionpicture": "Yes",
    "sensorsizetotalpixelsfilter": "1/2.33-inch High Sensitivity MOS Sensor / 17.5 Total Megapixels / Primary Color Filter",
    "specifications": null,
    "microphonespeaker": "Stereo / Mono",
    "lens": "LEICA DC VARIO- ELMARIT / 14 elements in 10 groups / (2 Aspherical Lenses / 3 Aspherical Surfaces / 3 ED Lenses / 1 Nano Surface Coating Lens)",
    "label22": "The high-quality stereo sound of Dolby Digital Stereo Creator offers highly realistic sound to accompany the motion images",
    "label21": "The popular iA (Intelligent Auto) is also available in video recording and Creative Video mode lets the user set the shutter speed and aperture manually to make even more impressive videos",
    "label26": "Additionally,  iA Plus mode is enhanced to enable defocus control, exposure compensation and white balance adjustment using iA mode",
    "label25": "A comprehensive integration of POWER O.I.S. with Active Mode, AF Tracking, Face Recognition, Intelligent ISO Control, Intelligent Scene Selector, Intelligent D-range Control, Intelligent Handheld Night Shot, Intelligent HDR (High Dynamic Range) and Motion Deblur functions, iA mode lets the camera do all the work, leaving the user free to compose shots, aim and shoot subjects",
    "label24": "The LUMIX FZ60 incorporates Intelligent Auto mode in pursuit of the ultimate ease of operation and the reduction of missed shots",
    "label29": "With its P/A/S/M mode, users can enjoy creative shooting, expressing themselves not only in photos but also in video",
    "label28": "While offering a convenient shooting-assist function such as iA / iA Plus, the LUMIX FZ60 is capable of full manual control for users a step beyond the beginner stage who enjoy more creative photography",
    "exposure": "Program AE, Aperture Priority AE, Shutter Priority AE, Manual",
    "opticalzoom": "24x",
    "digitalzoom": "Max. 4x",
    "afassistlamp": "Yes (On/Off )",
    "whitebalance": "Auto / Daylight / Cloudy / Shade / Flash / Incandescent / White Set1 / White Set2 / Color Temperature (2-axis adjustable)"
}