{
    "isosensitivity": "80-6400",
    "noisereduction": "Night Scene, Night + Portrait, Candle,Sunset and Fireworks",
    "label30": "Automatically identifies the scene you're shooting-up to 30 different scene including Portrait, Landscape, Night + Portrait, Macro or Sports-and adjusts the settings for ideal results",
    "label32": "Combines Sensor-Shift Image Stabilization with high ISO sensitivity and fast shutter speeds to capture crisp, clear images in any situation",
    "label34": "Express your creativity with 12 special effects for your photos & HD Videos",
    "label35": "Magic Art Filters infuse familiar scenes with new and unexpected moods ranging from the exciting to the serene and from the whimsical to the mysterious",
    "label36": "Choose from Pop Art, Pin Hole, Drawing, Fish Eye, Soft Focus, Punk, Watercolor, Miniature, Reflection, Sparkle, Fragmented, and Dramatic. (Effects may reduce image size. Not all effects are compatible with video recording.)",
    "label38": "Let the camera soften shadows and smooth wrinkles and blemishes on your subject's face with Beauty Mode",
    "label39": "Or, digitally apply enhancements to your portraits like eyeshadow, whitening teeth and lifting cheek bones with Beauty Make-Up mode",
    "flash": "Built-in",
    "label9": "Get into range with this staggering 40x optical zoom",
    "label0": "14 MP CMOS Sensor Digital Camera",
    "label1": "40x Optical Zoom",
    "label2": "1080p Full HD Video",
    "label3": "3.0 inch LCD",
    "label5": "With a staggering 40x optical zoom you can get incredibly close to your subjects, while the 22.4mm - 896mm ultra wide-angle lens lets you capture breathtaking panoramas and group shots",
    "label6": "with the iHS Technology, you'll be able to capture Full HD Video in 1080p, spectacular low light images and fast action subjects",
    "label7": "Whether you're taking in a game or quietly snapping images of wildlife from afar, the SP-820UZ packs all the versatility you need to capture your stories",
    "focusrange": "Wide: 3.94\" (0.1 m) - Infinity Telephoto: 9.84' (3 m) - Infinity Wide Macro: 3.94\" (0.1 m) - Infinity Tele Macro: 9.84' (3.0 m) - Infinity Super-Macro: 3.94\" (0.1 m) - Infinity",
    "moviemode": "1080p, 720p, HS720 60fps, HSVGA 120fps, HSQVGA 240fps, VGA",
    "label80": "Quick Start Guide",
    "zoom": "40x Optical Zoom + 4x Digital Zoom",
    "shutter": "4-1/2000 sec",
    "weight": "485 g",
    "memorycardtype": "SD/SDHC/SDXC",
    "label18": "HDMI output and control makes playing back videos on your HDTV a breeze",
    "label19": "Want high speed recording for slow motion playback? The SP-820 is equipped with HSQVGA recording up to 240 frames per second",
    "acpoweradapter": "N/A",
    "label12": "A powerful, DSLR-quality TruePic V Image Processor and a CMOS sensor come together to dramatically improve image quality with spectacular low-light performance, blazing fast autofocus, enhanced Intelligent Auto for spectacular scene and subject recognition and Super-Resolution Zoom",
    "label13": "It's Intelligent. It's High Speed. It's High Sensitivity. It's iHS.",
    "label10": "It propels you into the action when you can't get closer, like at a concert or a sports arena, and it's perfect for snapping skittish wildlife",
    "label16": "Multi-Motion Movie Image Stabilization that minimizes blur caused by large and small movements alike such as walking, breathing or panning across your subject matter, you'll get clear, smooth videos",
    "label17": "And with Linear PCM recording, the same technology used in Olympus's professional voice recorders, your HD Videos will be accompanied by higher-than-CD quality audio",
    "label15": "A simple, one-touch button allows you to record videos with amazing clarity in high-definition, right from your camera",
    "category": "camera",
    "selftimer": "2 sec, 12 sec",
    "shootingassistfunctions": "Histogram, Frame Assist, Voice Recording",
    "shutterspeed": "1/2000 sec. ?1/4 sec. (up to 4 sec. in Night Scene mode)",
    "fileformats": "JPEG",
    "iauto": null,
    "outerconnectors": "Multi-Terminal (USB Connector, Audio/Video Output); HDMI Type D",
    "remotecontrol": "None",
    "connectivity": "AV Output, HDMI D, USB 2.0",
    "flashmodes": "Auto (for low light and backlit conditions), Red-Eye Reduction, Fill-in, Off",
    "builtinflash": "Yes",
    "imagesensor": "14 Megapixels (effective), 1/2.3\" CMOS",
    "label75": "4x AA Batteries",
    "focussystem": "CMOS contrast detection",
    "motionblursuppression": "Dual Image Stabilization",
    "software": "Windows 2000PRO/XP/VISTA/7, Mac OS X 10.3 - 10.5",
    "warranty": "1 year warranty",
    "externalflashconnection": "None",
    "battery": "4 AA Batteries",
    "panorama": "In-Camera Panorama (Smart Panorama), PC Panorama (Up to 10 frames automatically stitchable with ib software)",
    "displayscreentype": "LCD Rear Screen",
    "label78": "Hand Strap",
    "burstrate": "Up to 1.5 fps at 14 MP for up to 200 frames Up to 30 fps at 3 MP for up to 34 frames",
    "autoconnectusb": "USB 2.0 High-Speed (USB Mass Storage)",
    "operatingstoragetemperature": "0 to 40C (32 to 104F) Humidity: 0-85%",
    "label76": "CB-USB8 USB Cable",
    "builtinmemory": "N/A",
    "afilluminator": "Yes",
    "meteringmethod": "Evaluative, Spot",
    "imageprocessing": "TruePic V",
    "flashworkingrange": "W",
    "screensize": "3.0\"",
    "playbackediteffects": "Still Image",
    "focallengthlensconfiguration": "4.0 - 160.0mm (22.4? 896mm equivalent in 35mm photography)",
    "cameratype": "Super Zoom",
    "aperturerange": "f3.4 (W) / f5.7 (T)",
    "focusrangefromlenssurface": "Normal Mode",
    "focusmode": "iESP Auto, Spot AF, Face Detection AF, AF Tracking",
    "shootingmodes": "Intelligent Auto, Program Auto, Beauty Mode, Panorama, Hand-Held Starlight, Photo+Video Clip, Scene Modes (Portrait, Landscape, Night Scene, Night + Portrait, Sport, Indoor, Self Portrait, Sunset, Fireworks, Cuisine, Documents, Beach & Snow, Pet (Cat), Pet (Dog), Backligh HDR), HD Movie; Magic Filter",
    "effectivepixels": "14.0MP",
    "display": "3.0-inch LCD, 460,000 dots",
    "label52": "Exposure CompensationL +-2 EV steps in 1/3 EV steps",
    "imagestabilization": "Yes",
    "whitebalancemodes": "N/A",
    "systemrequirements": "Auto-Connect USB",
    "specifications": null,
    "sensortypesize": "1/2.3\" CMOS",
    "removablemediacard": "SD/SDHC/SDXC Card (not supported for UHSspeedclass)",
    "lens": "EFL: 4.0-160.0 mm (35 mm equivalent: 22.4-896 mm) Aperture: f/3.4 (W) - 5.7 (T)",
    "label22": "At 3MP, the frame rate increases to an astounding 30 shots per second",
    "label21": "With 3 fps high-speed burst shooting at full resolution, nail the perfect shot by taking a quick sequence at the touch of a button",
    "label27": "Shooting into backlight typically results in washed out, overly bright images",
    "label25": "No computer necessary",
    "label24": "Capture breathtaking panoramic views and vistas just as you remember them, all in one frame and at the touch of a button, by simply panning the camera across the scene",
    "aspectratio": "4:3, 16:9",
    "label28": "Backlight HDR Adjustment takes a collage of images at various exposure levels and blends them into one, perfectly exposed image",
    "colour": "Black",
    "exposuremodes": "Modes: Programmed Auto Compensation: -2 EV to +2 EV (in 1/3 EV steps)",
    "opticalzoom": "40x",
    "digitalzoom": "4x",
    "imagefileformat": "Still Image",
    "viewfindertype": "LCD Display",
    "dualimagestabilization": null,
    "exposuremetering": "ESP/Spot"
}