{
    "exposurebracketing": "No",
    "isosensitivity": "ISO 125-3200, Auto (auto gain ISO 125-800), Fixed range auto (ISO 125-400, 125-800)",
    "label30": "Get a better view with the S9200's ultra-high-resolution monitor",
    "exposurecompensation": "+- 2 EV in steps of 1/3",
    "label32": "921,000 dots provide ultra high-resolution for a sharp, clear display in both image and movie capture and playback",
    "label34": "When a single photo won't tell the whole story, choose Continuous Shooting Mode and let the S9200 fire off more than six shots in approximately one second for a thrilling sequence of images",
    "label35": "Freeze the action with a simple press of the shutter button to capture those once-in-a-lifetime moments",
    "chargingtime": "3 hours and 20 minutes when battery is fully discharged (using Charging AC Adapter EH-69P/EH-69C) (Approx.)",
    "label37": "Creating expansive panoramic photos has never been easier",
    "label38": "Easy Panorama Mode combines multiple shots into a seamless 180° or 360° panoramic image",
    "builtinflashrangeapproxisosensitivity": "Auto)",
    "monitorresolution": "921,000-dots",
    "sensorsize": "1/2.3 in.",
    "totalpixels": "16.79 million (approx.)",
    "label8": "16.0 megapixel CMOS sensor for clear, sharp photos and videos - even in low light",
    "label9": "Give your images a new creative look with extensive filter options and special effects",
    "maximumautofocusareaspoints": "99",
    "label0": "Refurbished Nikon COOLPIX S9200",
    "label1": "16 MP Compact Digital Camera",
    "label2": "18x Wide-angle Optical Zoom",
    "label3": "Full HD (1080p) Movies",
    "label4": "3.0 inch TFT LCD",
    "label6": "A compact camera designed for easy portability with maximum versatility",
    "label7": "Combines a powerful 18x wide-angle optical Zoom-NIKKOR glass lens",
    "focusrange": "[W]",
    "voicememofunction": "Yes",
    "label31": "A large 3-inch display with wide viewing angles, anti-reflective coating and brightness adjustment gives you a big bold look of the world",
    "highspeedcontinuousshooting": null,
    "lenszoom": "18x",
    "shutter": "Mechanical and CMOS electronic shutter",
    "lensfnumber": "f/3.5-5.9",
    "exposurelock": "Yes",
    "videooutput": "NTSC, PAL",
    "exposurecontrol": "Programmed auto exposure (shutter speed, ND filter selection and ISO sensitivity), Flexible program with motion detection",
    "autofocusaffocusareaselection": "Auto (9-area automatic selection), Centre, Face priority, Manual with 99 focus areas, Subject tracking",
    "label18": "With 16.0 megapixel CMOS sensor technology, you can capture all the night's action with low noise for better images",
    "label19": "Use the Night Landscape Mode and the camera will take a series of images and automatically combine them in the camera",
    "label39": "Begin by focusing on your starting point, then start panning across the scene",
    "approxweight": "7.4 oz. (209g) With battery and SD memory card",
    "label13": "Now you can carry a portable camera with an amazing 18x zoom range from wide-angle (25mm) to telephoto (450mm)",
    "label10": "Capture a fleeting moment with high speed framing rates and Full HD (1080p) movie recording",
    "label11": "Less than 1.5-inches slim and only 7.4 ounces",
    "label17": "Great pictures are made after the sun sets",
    "label14": "Zoom-NIKKOR glass lens renders sharp, clear images every time",
    "label15": "Built-in optical VR Image Stabilization system minimizes the effects of camera shake for incredible images and movies, even when zoomed all the way in",
    "category": "camera",
    "movie": "Audio file format",
    "powersources": "One Rechargeable Li-ion Battery EN-EL12 (supplied)",
    "selftimer": "Can be selected from 10 and 2 seconds duration",
    "imagesizepixels": "4608 x 3456 (16M)",
    "topcontinuousshootingspeedatfullresolution": "Up to 7 shots at approx. 6.9 frames per second",
    "tripodsocket": "ISO 1222",
    "interface": "Hi-speed USB",
    "shutterspeed": "1/2000-1 sec. (when ISO sensitivity set to Auto), 4 sec. (when scene mode is set to Fireworks show)",
    "lens": "18x optical Zoom, NIKKOR ED glass lens Lens Focal Length",
    "label118": "Nikon refurbished COOLPIX compact cameras come with a six month Nikon Canada warranty.",
    "builtinflash": "Yes",
    "imagesensor": "CMOS",
    "scenemodes": "Beach, Close Up, Copy, Dusk/Dawn, Fireworks Show, Food, Landscape, Museum, Night Portrait, Panorama Assist, Party/Indoor, Pet Portrait, Portrait, Snow, Sports, Sunset, 3D Photography",
    "batterybatteries": "Rechargeable Li-ion Battery EN-EL12",
    "interfacedatatransferprotocol": "MTP, PTP",
    "lowestisosensitivity": "125",
    "incameraimageediting": "Crop, D-Lighting, Filter Effects, Quick retouch, Rotate image, Skin softening, Small Pic",
    "ioterminal": "Audio/video (A/V) output, Digital I/O (USB), HDMI Mini Connector (HDMI output)",
    "aperture": "Electronically controlled ND filter (-2.0 AV) insertion",
    "type": "Compact Digital Camera",
    "autofocusaf": "Contrast-detect TTL AF",
    "internalmemory": "Approx. 25MB",
    "storagemedia": "SD memory card, SDHC memory card, SDXC memory card",
    "highestisosensitivity": "3200",
    "label40": "Once the S9200 detects your direction, the shooting starts and the images begin stitching together in-camera",
    "label43": "The result is an image with wider tonality and richness",
    "label42": "Turn on S9200's built-in HDR mode, and the camera will automatically combine two different exposures of the same shot",
    "label45": "Nikon's optical VR Image Stabilization system minimizes the effects of camera shake for sharper, clearer still images and movies",
    "builtinflashcontrol": "TTL auto flash with monitor preflashes",
    "effectivepixels": "16 million",
    "vibrationreduction": "Lens-shift VR",
    "monitorframecoverageshootingmode": "97% horizontal (Approx.), 97% vertical (Approx.)",
    "storagefileformats": "Still pictures",
    "storagefilesystem": "DCF, EXIF 2.3, DPOF compliant",
    "hdmioutput": "Can be selected from",
    "approxdimensions": "Height",
    "monitortype": "TFT-LCD with Anti-reflection coating, 5-level brightness adjustment",
    "monitorsize": "3.0 in. diagonal",
    "specifications": null,
    "focuslock": "Yes",
    "lensconstruction": "11 elements in 10 groups",
    "label23": "Frame your shot with the optical zoom even as you're recording",
    "label22": "Simply press the record button and start shooting your own movies",
    "label21": "The S9200 is not only an exceptional camera, it's also an exceptional movie camera",
    "label26": "Sound is automatically recorded in stereo and the HDMI port enables easy hook up to an HDTV",
    "label25": "Even record slow- and fast-motion movies for some very creative and entertaining moments",
    "label24": "Pause the recording and restart to create a seamless movie file",
    "label28": "Powerful in-camera processing allows a myriad of creative effects. Special effects like Sepia, Monochrome, Selective color, Soft Low and High Key can be selected prior to shooting stills or movies, and filter effects like Miniature, Fisheye, Cross Screen, Soft and Selective Color can be selected after the still shot has been taken",
    "monitorframecoverageplaybackmode": "100% horizontal (Approx.)",
    "exposuremodes": "Programmed Auto",
    "digitalzoom": "Up to 4x (angle of view equivalent to that of approx. 1800mm lens in 35mm [135] format)",
    "exposuremetering": "256-segment matrix, centre-weighted",
    "whitebalance": "Auto, Cloudy, Daylight, Flash, Fluorescent, Incandescent, Manual"
}