{
    "isosensitivity": "200-6400 (Custom Function: 100-25600)",
    "focus": "mode",
    "label30": "By setting a relatively high eye point (distance between the eyepiece and the naked eye) of about 15mm, the design facilitates natural and comfortable viewing even by glasses wearers",
    "exposurecompensation": "-2.0EV - +2.0EV 1/3EV step",
    "label32": "Optical Image Clarity and Rich Information Display",
    "label36": "100% Coverage 2,360K-dot High Definition Quality",
    "label37": "When using the EVF, you will enjoy 100% coverage on a sharp image display delivered by a 0.48-inch (12mm) high-definition LCD delivering 2,360K-dot resolution. From precision framing of macro shots with \"Live View\" to quick post-shot reviewing of your results, the EVF is ready with its vividly accurate display whenever you need it",
    "label39": "Tapping the power of the phase detection pixels integrated in the X-Trans CMOS II sensor, Digital Split Image helps you manually focus your shot with greater precision. While checking the split image displayed in the LCD monitor or EVF, you can manually adjust for pinpoint focus, especially helpful when working with an open aperture or macro shooting",
    "flash": "Auto flash (Super Intelligent Flash); Effective range",
    "terminal": "Digital interface",
    "guidetothenumberofavailableframesforbatteryoperation": "Approx. 300 frames",
    "exposuremode": "Programmed AE, Shutter priority AE, Aperture priority AE, Manual exposure",
    "label8": "X-Trans CMOS II incorporates an original colour filter array with a highly random pattern, eliminating the need for an optical low-pass filter (OLPF)",
    "label9": "OLPF filters are used in conventional systems to inhibit moiré at the expense of resolution",
    "hotshoe": "YES (dedicated TTL Flash compatible)",
    "label0": "16.3 MP Compact Digital Camera",
    "label1": "X-Trans CMOS II Sensor",
    "label2": "Hybrid Viewfinder",
    "label3": "2.8\" TFT Colour LCD",
    "label4": "APS-C X-TRANS CMOS II SENSOR",
    "label5": "OLPF-less (optical low-pass filter) architecture and the original pixel array are the keys to resolution rivaling a full-size sensor",
    "label6": "With the unique integration of phase detection pixels in the array, the X100S takes a dramatic leap in AF speed",
    "label7": "Clarity of the signal achieved by the optimization of every aspect of its processing circuitry, and the enhanced image quality produced by the powerful EXR Processor II",
    "focusrange": "Normal: 1.64' (50 cm) - Infinity Macro: 3.94\" (10 cm) - 6.56' (2 m)",
    "otherfunctions": "PictBridge, Exif Print, 35 languages, Time difference, High Performance mode, OVF power save mode, Silent mode, Shutter sound select",
    "operatinghumidity": "10 - 80 degrees (no condensation)",
    "highspeedcontinuousshooting": "Shoot at a maximum burst speed of 6 frames per second (max. 29 frames) at full 16-megapixel resolution to capture a series of exposures of moving subjects and other challenging photographic scenes",
    "shutter": "Type: Mechanical Speed: 30 - 1/4000 sec",
    "shutterspeedwithmechanicalshutter": "(P mode) 1/4 sec. to 1/4000* sec., (All other modes) 30 sec. to 1/4000 sec.; Bulb (max.60min.)",
    "builtinndfilter": null,
    "exposurecontrol": "TTL 256-zone metering, Multi / Spot / Average",
    "weight": "Approx. 445 g / 15.7 oz. (including battery and memory card); Approx. 405 g / 14.3 oz. (excluding accessories, battery and memory card)",
    "sensitivity": "AUTO (Control available up to ISO6400); Equivalent to ISO 200 - 6400 (Standard Output Sensitivity); Extended output sensitivity equivalent ISO 100, 12800 and 25600",
    "memorycardtype": "SD/SDHC/SDXC",
    "label18": "Framing your shot through the Optical Viewfinder (OVF) or Electronic Viewfinder (EVF), your eye will see the subject and scene plus a range of shooting data projected by an integrated high-definition LCD panel",
    "effectivepixels": "16.3MP",
    "acpoweradapter": "N/A",
    "label12": "HIGH SPEED AUTO FOCUS AND QUICK RESPONSE",
    "label10": "The X-Trans CMOS II array lets the sensor capture unfiltered light from the lens, achieving an unprecedented level of resolution",
    "label11": "Using the enhanced performance of the EXR Processor II, Lens Modulation Optimizer (LMO) factors are calculated to compensate for aberrations and diffraction blur that occur when light passes through the lens and then are applied to produce images with amazing sharpness",
    "category": "camera",
    "dimensions": "126.5 (W) x 74.4 (H) x 53.9 (D) mm / 5.0. (W) x 2.9 (H) x 2.1 (D) in.",
    "selftimer": "2 Sec, 10 Sec",
    "fileformats": "JPEG, RAW",
    "label118": "Shoulder strap",
    "label119": "USB cable",
    "connectivity": "HDMI C, USB 2.0",
    "flashmodes": "Red-eye removal OFF",
    "builtinflash": "Yes",
    "label65": "Uses numbered dials for aperture, shutter speed and exposure compensation and is equipped with a viewfinder that allows you to select your composition",
    "label64": "DESIGN AND STYLE THAT FOLLOW FUNCTION",
    "label63": "Outstanding shooting range and exceptional performance in a variety of scenes set this lens apart",
    "label62": "The FUJIFILM X100S lets you bring the edge of the lens as close as 10cm from your subject",
    "storagemedia": "Internal memory; SD memory card / SDHC memory card / SDXC (UHS-I) memory card*1",
    "label60": "In situations where the light is very strong but you want to shoot at a slow shutter speed or don't want to close the aperture, the built-in ND filter captures the flow of water, flowers swaying in the breeze in bright sunlight or professional portraits with a beautiful defocused background",
    "operatingstoragetemperature": "0 to 40C (32 to 104F) Humidity: 10-80%",
    "fileformat": "still image",
    "warranty": "2 year warranty",
    "externalflashconnection": "Hot Shoe",
    "autobracketing": "AE Bracketing",
    "battery": "NP-95",
    "powersupply": "NP-95 Li-ion battery (included)",
    "displayscreentype": "LCD Screen",
    "eyesensor": null,
    "manualfocusing": "In the viewfinder, the distance index bar is displayed together with the depth of field scale and aperture value, providing helpful guides for focusing. For pinpoint precision in manual focus mode, just press the Command Dial and confirm sharpness with a 5x zoom view of the focus point. At a touch of the AE/AF Lock button, you activate the built-in Focus Aid function for automatic focusing of the subject in the focus frame",
    "burstrate": "Up to 6 fps for up to 31 frames",
    "label74": "2.8-inch, 460K-dot LCD with high contrast, high brightness and the convenience of a wide viewing angle",
    "label75": "On the LCD, you can view the same image displayed in the electronic viewfinder. You can also switch it to show the Shooting Data display",
    "focusdistancefromlenssurface": "Normal",
    "photographyfunctions": "Select custom setting, Motion panorama, Colour space, Film Simulation, Advanced Filter, Multiple Exposure, Auto red-eye removal, Framing guideline, Frame No. memory, Histogram display, Preview depth of focus, Focus check, Focus Peak Highlight, Digital Split Image, Electronic level, RAW",
    "builtinmemory": "N/A",
    "aperture": "F2 - F16 1/3EV step (controlled with 9-blade aperture diaphragm)",
    "movierecording": "1920 x 1080 pixels (60 fps / 30 fps) with stereo sound",
    "meteringmethod": "Multi, Spot, TTL 256-zones",
    "screensize": "2.8\"",
    "remotecontrol": "N/A",
    "lcdmonitor": "2.8-inch, approx. 460K-dot, TFT colour LCD monitor (Approx. 100% coverage)",
    "operatingtemperature": "0 - 40 degrees C",
    "label49": "The result is perfectly balanced optical excellence promising low aberration, sharp resolution and faithful colour reproduction",
    "label48": "Uncompromising image quality is assured by the application of multi-layer HTC-EBC (High Transmittance Electron Beam Coating) coating and other technologies",
    "cameratype": "Advanced",
    "label42": "FUJINON 23mm F2 FIXED FOCAL LENGTH LENS",
    "label45": "Optimization of the sensor for this special lens fully exploits the advantage of a fixed focal length lens for superior edge-to-edge image quality",
    "label44": "Non-interchangeable, non-collapsible, fixed focal length lens. While featuring the generous brightness of a maximum F2 aperture, the large-diameter rear lens group is integrated into the body for an ultra-slim profile",
    "label47": "The simple all-glass lens configuration (6 groups/8 elements) is designed around a single high-performance double-sided aspheric lens",
    "viewfinder": "Hybrid viewfinder; Optical viewfinder",
    "imagesensor": "23.6mm x 15.8mm (APS-C) X-Trans CMOS II with primary colour filter",
    "label56": "Providing a circular opening at the largest aperture, the 9-blade aperture diaphragm lets you capture pleasingly defocused background effects",
    "label54": "Reducing ghosting and lens flare, the treatment promises clear image quality",
    "label53": "All the lens elements used in the FUJIFILM X100S have been treated with multi-layer Super EBC (Electron Beam Coating), the same process used for Fujinon broadcasting video lenses and large-format camera lenses acclaimed by professionals",
    "imagestabilization": "N/A",
    "label51": "The FUJIFILM X100s employs spherical lens elements including a double-sided aspheric lens made by a glass moulding process for delivering maximum performance",
    "label59": "Equivalent to 3 f-stops, the ND filter in the FUJIFILM X100S lens reduces the amount of light to 1/8",
    "label120": "Lens cap",
    "playbackfunctions": "RAW conversion, Image rotate, Photobook assist, Erase selected frames, Image search, Multi-frame playback (with micro thumbnail), Slide show, Mark for upload, Protect, Crop, Resize, Panorama, Favorites",
    "whitebalancemodes": "Auto, Custom, Fluorescent (Day White), Fluorescent (Natural White), Fluorescent (White), Incandescent, Kelvin, Shade, Underwater",
    "numberofeffectivepixels": "16.3 million pixels",
    "accessoriesincluded": null,
    "specifications": null,
    "sensortypesize": "23.6 x 15.8\" CMOS",
    "lens": "Fujinon Single focal length lens, focal length",
    "label22": "Offering a comfortable horizontal apparent field of view (approx. 26 degrees), the viewfinder 0.5x magnification is ideal for the lens with a 35mm focal length (35mm format equivalent). Adoption of a high-precision prism, high-refractive glass and Super EBC coating enhance your enjoyment of a bright, clear optical image with minimal aberrations",
    "label26": "When you bring the camera to your eye, the viewfinder can sense it and will switch automatically to viewfinder mode. Then when you lower the camera, the display switches to the LCD on the back of the camera. Alternatively, you can select to always display images on the LCD or always use the Viewfinder depending on your preference",
    "label24": "The unique viewfinder shutter controls the entry of light from the optical viewfinder. When it is open, your eye sees the precise clarity of an optical image. When it is closed, the sharp definition of the Live View projected from the LCD panel is displayed",
    "aspectratio": "In addition to 3",
    "label28": "You can easily change viewfinder focus setting from -2 to +1m-1 (dpt) via the dial located next to the viewfinder",
    "colour": "Black/Silver",
    "exposuremodes": "Modes: Aperture Priority, Manual, Program, Shutter Priority Compensation: -2 EV to +2 EV (in .3 EV steps)",
    "digitalzoom": "N/A",
    "viewfindertype": "Optical, Electronic, LCD Display",
    "whitebalance": "Automatic scene recognition"
}