{
    "label99": "EN-EL14 Rechargeable Li-ion Battery",
    "isosensitivity": "ISO 80-1600; ISO 3200, Hi 1 (equivalent to 6400) (available when using A, B, C or D mode)",
    "label30": "All the camera's settings are accessible through easy-to-navigate menus, and key features are at your fingertips. You can even program your favourite settings for quick recall",
    "exposurecompensation": "+-3 EV in steps of 1/3",
    "label32": "The COOLPIX P7700 includes a full-size accessory shoe that's compatible with Nikon's most popular D-SLR accessories",
    "builtinflashrangeapproxisosensitivity": "Auto)",
    "monitorresolution": "921,000-dots",
    "sensorsize": "1/1.7 in.",
    "totalpixels": "12.76 million (approx.)",
    "label9": "1/1.7\" 12.2-megapixel CMOS sensor-larger than the sensor in most compact cameras-that delivers exceptional image quality and detail",
    "maximumautofocusareaspoints": "99",
    "label0": "12.2 MP Compact Digital Camera",
    "label1": "7.1x Optical Zoom",
    "label2": "1/1.7\" CMOS sensor",
    "label3": "3.0 inch Vari-Angle TFT LCD",
    "label4": "Full HD (1080p) videos with uncompromising speed",
    "label5": "Take complete creative control with PSAM modes, or let one of 19 Scene Modes do the thinking for you",
    "label6": "Extra-large CMOS image sensor is paired with one of the best NIKKOR lenses we've ever put in a COOLPIX camera",
    "label7": "With an Auto Mode you can rely on every time, 19 Scene Modes for getting the most out of every shooting situation, creative in-camera effects, complete PSAM control, RAW shooting and more, the COOLPIX P7700 will go as far as you want to go",
    "focusrange": "[W]",
    "voicememofunction": "Yes",
    "lenszoom": "7.1x",
    "shutter": "Electronically controlled mechanical and CMOS electronic shutter",
    "lensfnumber": "f/2-4",
    "videooutput": "NTSC; PAL",
    "accessoryshoe": "Yes",
    "exposurecontrol": "Programmed auto exposure with flexible program; aperture-priority auto; exposure bracketing (Tv, Av, Sv); exposure compensation (-3.0 to +3.0 EV in steps of 1/3 EV); manual; shutter priority auto",
    "autofocusaffocusareaselection": "Auto (9-area automatic selection); Centre; Face priority; Manual with 99 focus areas; Subject tracking",
    "memorycardtype": "SD/SDHC/SDXC",
    "label18": "Plus, every photo and video will be sharp and steady, even if your hands are not-Nikon's VR image stabilization ensures a little camera shake won't ruin the shot",
    "effectivepixels": "12.2 million",
    "acpoweradapter": "N/A",
    "approxweight": "13.9 oz. (392g), With battery and SD memory card",
    "label13": "Great low-light performance starts with the lens, and the COOLPIX P7700 has one of the best lenses we've ever put in a COOLPIX camera",
    "label10": "A 7.1x Zoom-NIKKOR glass lens takes you from wide-angle (28mm) to telephoto (200mm) in an instant",
    "label11": "Create an expansive landscape one shot, a stunning close-up the next",
    "label17": "Life moves fast, but the COOLPIX P7700 keeps up. In an instant, it powers up, zooms in, autofocuses and captures stunning shot after shot.Hold down the shutter button and fire a blazing-fast 8 fps (up to 6 shots) for some of the most impressive action-freezing sequences you've ever seen",
    "label14": "With a maximum aperture that's wider than most compact cameras (f/2.0), the 7.1x Zoom-NIKKOR glass lens gathers maximum light so you can shoot with faster shutter speeds",
    "label15": "Combine that with a highly sensitive CMOS image sensor and Nikon's renowned ISO performance, and you'll capture the shots you've been missing?low-light indoor shots, evening group shots around a fire, nighttime cityscapes, fast-moving subjects and much more",
    "category": "camera",
    "label96": "AN-CP22 Strap",
    "label97": "UC-E17 USB Cable",
    "movie": "Audio file format",
    "label98": "EG-CP16 Audio Video Cable",
    "powersources": "One Rechargeable Li-ion Battery EN-EL14 (supplied)",
    "selftimer": "2 Sec, 10 Sec",
    "imagesizepixels": "4000 x 3000 (12M)",
    "aspectratio": "4:3, 16:9",
    "sensortypesize": "1/1.7\" CMOS",
    "topcontinuousshootingspeedatfullresolution": "Up to 6 shots at approx. 8 frames per second",
    "tripodsocket": "1/4 in.",
    "interface": "Hi-speed USB Interface Data transfer protocol",
    "shutterspeed": "1/4000-1 sec.; 1/4000- 60 sec. (when ISO sensitivity is set to 80 - 400 in D mode)",
    "fileformats": "JPEG, RAW",
    "lensfocallength": "6.0-42.8mm (angle of view equivalent to that of 28-200 mm lens in 35mm [135] format)",
    "remotecontrol": "N/A",
    "connectivity": "1/8\" Microphone, AV Output, HDMI C, USB 2.0",
    "flashmodes": "Auto Auto/Red-eye Reduction Fill-in Off Second-curtain Sync Slow Sync",
    "builtinflash": "Yes",
    "imagesensor": "CMOS",
    "scenemodes": "Back Light, Beach, Black and White Copy, Close Up, Dusk/Dawn, Fireworks Show, Food, Landscape, Museum, Night Landscape, Night Portrait, Panorama Assist, Party/Indoor, Pet Portrait, Portrait, Scene Auto Selector, Snow, Sports, Sunset, 3D Photography",
    "operatingenvironment": "Temperature",
    "batterybatteries": "Rechargeable Li-ion Battery EN-EL14",
    "warranty": "2 year warranty",
    "externalflashconnection": "Hot Shoe",
    "lowestisosensitivity": "80",
    "battery": "EN-EL14",
    "displayscreentype": "LCD Rear Screen",
    "incameraimageediting": "Black Border, Cross Screen, Crop, D-Lighting, Fisheye, Miniature effect, NRW (Raw) Processing, Paint, Quick retouch, Selective Colour, Skin softening, Small Pic, Straighten, Vignette",
    "externalflashshoe": "Yes",
    "ioterminal": "Audio/video (A/V) output; Digital I/O (USB); External microphone connector (Stereo mini-pin jack (3.5 mm diameter), plug-in power type); HDMI Mini Connector (HDMI output)",
    "burstrate": "Up to 8 fps at 12.2 MP for up to 6 frames",
    "operatingstoragetemperature": "0 to 40C (32 to 104F) Humidity: 0-85%",
    "builtinmemory": "86MB",
    "aperture": "Electronically-controlled 7-blade iris diaphragm",
    "meteringmethod": "Center-weighted, Matrix, Spot",
    "autofocusaf": "Contrast-detect TTL AF",
    "internalmemory": "Approx. 86MB",
    "screensize": "3.0\"",
    "storagemedia": "SD memory card, SDHC memory card, SDXC memory card",
    "highestisosensitivity": "3200",
    "cameratype": "Advanced",
    "type": "Compact Digital Camera",
    "continuousshootingoptions": "Best Shot Selector, Continuous H, Continuous H 60, Continuous H 120, Continuous M, Continuous L, Interval Timer, Multi-shot 16, Single",
    "builtinflashcontrol": "TTL auto flash with monitor preflashes",
    "vibrationreduction": "Lens-shift VR",
    "monitorframecoverageshootingmode": "100% horizontal (Approx.), 100% vertical (Approx.)",
    "batterylifeshotspercharge": "Still pictures",
    "storagefileformats": "Still pictures",
    "storagefilesystem": "DCF, EXIF 2.3, DPOF MPF compliant",
    "imagestabilization": "Yes",
    "hdmioutput": "Can be selected from",
    "approxdimensions": "Height",
    "monitortype": "Vari-Angle TFT-LCD with Anti-reflection coating",
    "suppliedaccessories": null,
    "whitebalancemodes": "Cloudy, Daylight, Flash, Fluorescent, Incandescent, Preset Manual",
    "monitorsize": "3.0 in. diagonal",
    "specifications": null,
    "focuslock": "Yes",
    "lensconstruction": "13 elements in 10 groups",
    "lens": "7.1x optical zoom, NIKKOR ED glass lens",
    "label22": "In tight, cramped spaces, raise the camera overhead and get the shot or video you need. Every shot you frame, review or share is rendered in 921,000 dots of brilliant detail. When transporting the camera, protect the LCD by flipping it to the closed position",
    "label21": "Hold the COOLPIX P7700 at ground level for a surprising view of a common scene",
    "label20": "When you can swivel your camera's LCD display to just about any position, you're free to explore exciting perspectives all around you",
    "label26": "The built-in stereo microphone captures clear, natural audio (it even includes wind noise reduction), but for maximum sound fidelity, add the optional ME-1 stereo microphone",
    "label25": "The COOLPIX P7700 lets you use the optical zoom while recording, so you can frame exactly the shot you want. It also lets you maintain creative control; adjust the aperture and exposure settings, add creative filters, special effects and more",
    "label24": "Apply your creativity to videography. With the touch of a button, go from shooting stills to recording Full HD (1080p) videos that can easily be shared on your computer, social networking sites or an HDTV",
    "label29": "Its compact, ergonomic body lets you create comfortably",
    "label28": "The COOLPIX P7700 is designed to be used?as often as possible",
    "monitorframecoverageplaybackmode": "100% horizontal (Approx.)",
    "colour": "Black",
    "exposuremodes": "Programmed Auto",
    "opticalzoom": "7.1x",
    "digitalzoom": "Up to 4x (angle of view equivalent to that of approx. 800mm lens in 35mm [135] format)",
    "viewfindertype": "LCD Display",
    "exposuremetering": "224-segment matrix, centre-weighted; Spot (digital zoom 2X or more)",
    "whitebalance": "Auto 1 (Normal), Auto 2 (Warm), Cloudy, Daylight, Flash, Fluorescent, Incandescent, Preset Manual"
}