{
    "autobracketing": "AE Bracketing",
    "exposurecontrol": "TTL 256-zones metering, Multi / Spot / Average",
    "weight": "Approx. 232g / 8.1oz. (including battery and memory card), Approx. 212g / 7.4oz. (excluding battery and memory card)",
    "exposuremode": "Programmed AE, Aperture Priority AE, Shutter Priority AE, Manual",
    "focus": "Mode",
    "label30": "The F800EXR boasts Fujifilm's exclusive EXR CMOS sensor for breathtaking image quality in low-light scenes and the EXR Processor for lightning-fast auto focus",
    "label31": "EXR Auto recognizes your settings and takes perfect photos easily",
    "label18": "Capturing your moments in exquisite distortion-free detail, the outstanding resolution of Fujinon lenses is the product of advanced lens design supported by original high precision lens engineering and processing technologies",
    "label52": "When bright sunlight makes composing or viewing the monitor difficult, you can use the Fn button to easily switch to the \"Monitor Sunlight Mode\" and enjoy comfortable framing and review of shots on the large 3-inch high-contrast 460,000-dot LCD",
    "filmsimulationmode": "Simulate the distinctive look of 5 different types of film with the touch of a button. Modeled on Fujifilm brands loved by professional photographers, each breathes life into your image with a quality that previously only film could capture",
    "label13": "From Zoom to Super-wide Angle, a Full Range of Shooting is Available",
    "label10": "Enhanced WLAN connectivity lets you send photos to your smartphone or tablet effortlessly",
    "label11": "Free dedicated apps for iOS and Android platforms make it easy to share high-impact high-resolution images that only a real camera can capture",
    "label16": "Fujifilm's proprietary super resolution technology offers an overwhelming 40x Intelligent Digital Zoom in a compact body. With more clearly defined outlines and reduced noise, you can take pictures of high quality. As the zoom can be used in the EXR AUTO mode, you can just leave optimal settings up to the camera, resulting in any photo you like",
    "label14": "Conventional digital zoom basically only resizes the optical image data, often resulting in lack of definition, but the Intelligent Digital Zoom uses the speed and power of the EXR Processor to instantly sharpen image edges and reduce noise for images with natural clarity and crispness of detail across the digital zoom range",
    "category": "camera",
    "selftimer": "10 sec. / 2 sec. Delay / Auto release / Auto release (Dog, Cat)",
    "lcdmonitor": "3.0-inch, approx. 460,000 dots, TFT color LCD monitor, approx. 100% coverage",
    "continuousshooting": "Super High",
    "facedetection": "Optimizes people pictures by detecting faces and adjusting focus and exposure to ensure bright, clear results",
    "focusdistancefromlenssurface": "Normal",
    "flash": "Auto flash (super i-flash), Effective range",
    "lensconstruction": "11 groups 14 lenses",
    "terminal": "Video output",
    "focallength": "f=4.6 - 92mm, equivalent to 25 - 500mm on a 35mm camera",
    "powersupply": "NP-50A Li-ion battery (included) / CP-50 with AC power adapter AC-5VX (sold separately)",
    "aperture": "F3.5 / F7.1 / F10 (Wide), F5.3 / F11 / F16(Telephoto) with ND filter",
    "photographyfunctions": "EXR mode (EXR Auto/Resolution priority / High ISO & Low noise priority / Dynamic range priority), Face recognition, Face Detection, Auto red-eye removal, Film simulation, Auto release, Auto release(Dog,Cat), Framing guideline, Power management, Frame No. memory, Advanced mode (Motion panorama360, Pro focus, Pro low light,",
    "movierecording": "1920 x 1080 pixels / 1280 x 720 pixels / 640 x 480 pixels (30 frames / sec.) with stereo sound, Optical zoom function can be used",
    "facerecognition": "The FinePix F800EXR not only detects faces in a frame but it can also recognize who is who! You can register up to 8 people in your camera and, next time you take a photo of them, it will bring up their name and optimize settings in favour of your registered faces. In playback, you can search for all photos containing registered faces to quickly find photos of your favourites.",
    "sensitivity": "Auto, Equivalent to ISO 100 / 200 / 400 / 800 / 1600 / 3200 / 6400* / 12800* (Standard Output Sensitivity)",
    "numberofeffectivepixels": "16.0 million pixels",
    "label8": "Advanced Filters lets you add creative effects that make your memories even more fun to post. EXR sensor recognizes 103 scenes and creates optimum settings for foolproof shots, even in low light. Or shoot videos at Full HD 1080p with a scene recognition feature for excellent videos",
    "imagestabilizer": "CMOS shift type",
    "specifications": null,
    "accessoriesincluded": null,
    "label0": "16.0 MP Compact Digital Camera",
    "label1": "20x Optical Zoom",
    "label2": "1/2\" EXR CMOS Sensor",
    "label3": "3.0\"  LCD",
    "label4": "Full HD 1080p",
    "label5": "Share memories wirelessly from anywhere with the FinePix F800EXR digital camera. It's the perfect companion to your smartphone or tablet",
    "label6": "Take excellent images with the 20x optical zoom that expands to 40x, then use the free app to send them wirelessly to your phone or tablet to share with friends everywhere",
    "label7": "You can even add location information to your photos to show where you are",
    "label23": "Dramatically minimizing chromatic aberration which frequently occurs in conventional super telephoto lenses, the high-quality ED glass lens delivers superior sharpness and colour fidelity",
    "lcd": null,
    "label20": "By precisely focusing light at the same point on the focal plane, aspheric lens design eliminates the need for additional corrective lens elements",
    "label27": "Fujinon's Double Sliding Structured Lens Technology empowers you with both 20x zoom and 25mm wide angle in a stylish pocket-sized compact",
    "fullhd": null,
    "label25": "Long telephoto shots magnify not only the subject, but also camera shake and subject movement, often resulting in blurry photos. Using a combination of CMOS Shift and High ISO image stabilization, the FinePix F800EXR ensures your shots are sharp and clear, even at maximum zoom settings",
    "storagemedia": "Internal memory (approx.30MB), SD/SDHC/SDXC(UHS-I) memory card",
    "otherfunctions": "Landmark Navigator, PictBridge, Exif Print, Print Image Matching II, 35 Languages, Time difference, Silent mode",
    "shutterspeed": "(Auto mode) 1/4 sec. to 1/2000 sec., (All other modes) 8 sec. to 1/2000 sec.",
    "dimensions": "105.1(W) x 63.3(H) x 36.0(D) mm / 4.1(W) x 2.4(H) x 1.4(D) in. (Minimum depth",
    "lens": "Fujinon 20x optical zoom lens",
    "attr6400": "M mode or lower, ISO12800",
    "whitebalance": "Automatic scene recognition; Preset",
    "fullaperture": "F3.5(Wide) - F5.3(Telephoto)",
    "exposurecompensation": "-2.0EV - +2.0EV 1/3EV step",
    "shootingmodes": "SP",
    "imagesensor": "1/2-inch EXR CMOS with primary color filter",
    "highspeedcontinuousshooting": "Capture action at almost 8 fps at full 16-megapixel resolution or shoot at 11 fps at 8-megapixel resolution.",
    "label21": "While this lens reduces distortion at wide angles, improves resolution in both center and edge areas, cuts glare and reflections, and minimizes chromatic aberration throughout the zoom range, the lens also makes possible a lighter and more compact design",
    "label28": "Fourteen lens elements smoothly telescope and slide into position to bring you closer to your subject for shots like never before",
    "fileformat": "still image",
    "label41": "Fujifilm's EXR AUTO with Night (tripod) capability virtually reduces subject blur in low light conditions. With the addition of Motion Detection, Intelligent Scene Recognition technology in EXR Auto mode automatically recognizes and optimizes white balance, focus, exposure and other settings for a total of 103 shooting patterns",
    "digitalzoom": "EXR Auto mode",
    "multipleexposure": "The F800EXR's multiple exposure function lets you superimpose two different exposures in a single frame to create artistic, one-of-a-kind photos",
    "advancedfilter": "A selection of six special filters lets you create distinctive photo effects. Filter effects can be viewed on the LCD screen to ensure you get exactly the results you're shooting for"
}