{
    "label30": "Powered by a fast quad core CPU, so you can shoot and instantly review on a large screen without any lag",
    "label32": "Now you don't have to connect to your computer because you can edit right from your camera",
    "label33": "Set of 65 powerful editing features so you can edit professionally while on the go. Best Face lets you replace faces with the perfect moment, and Paper Artist lets you turn your photos into artful sketches. And with Auto Face Calibration, Photo Wizard, Video Wizard and even more apps from the Google Play Store, you?ll always have plenty of editing options",
    "label35": "Now you can leave your laptop at home and save the luggage space. The GALAXY Camera is the only truly connected camera in the world. Straight from the camera, you can connect, upload and share",
    "label36": "It also comes with built-in apps like Intagram, Facebook, Picasa, Flickr and more. So now you can take a photo and share it instantly, all without compromising the professional quality",
    "label38": "Remember all those annoying group photos that take forever because everyone brought their own camera? With the GALAXY Camera, you only need to shoot it once because you can share your photos right after you shoot them",
    "label39": "With the help of Wi-Fi Direct, Share Shot and Easy Share, you can share your pictures with up to 8 other Wi-Fi direct devices within range",
    "stillimage": null,
    "dimensionshxwxd": "70.8 x 128.7 x 19.1 mm",
    "flash": null,
    "sensorsize": "1/2.3\"",
    "location": null,
    "label9": "Shoot from a distance and with the flexibility to frame your shots creatively",
    "label0": "16.3 MP Digital Camera",
    "auto": "1/8 ~ 1/2,000 sec",
    "label2": "3G/4G Connectivity",
    "label3": "4.8\" HD Touch Display",
    "label5": "Capture the perfect trails of light at night on a busy intersection full of red tail lights",
    "label6": "Or instantly shoot a high-speed sports scene with Action Freeze",
    "label7": "With just a tap of Smart Pro Mode, you can set up and perfectly shoot almost any scene",
    "sensortype": "BSI CMOS",
    "specialfeatures": "Instagram, Paper Artist, Gallery, Photo wizard, Video Editor, AllShare Play, S-Suggest, S-Voice",
    "manual": "16 ~ 1/2,000 sec",
    "mode": "Auto WB, Daylight, Cloudy, Fluorescent_H, Fluorescent_L, Tungsten, Custom",
    "weight": "300 g",
    "totalpixel": "Approx. 17.0 Mega pixels",
    "label19": "Instead of playing back your HD footage in slow motion, record it that way with Slow Motion video",
    "label13": "Shoot professional-quality photos with the help of a high ISO sensor",
    "label10": "T21x zoom lets you get incredibly close while the 23 mm wide lens lets you pull back and capture large spaces with ease",
    "label11": "Now you can perfectly frame your photos the way you want",
    "label16": "Now you can capture high-speed action shots in low light with full range f/2.8 aperture",
    "label17": "The GALAXY Camera lets you capture and share sharp and crisp shots without having to rely on perfect lighting, so you can pull out your camera and take the perfect photo every time",
    "label14": "A high ISO sensor allows you to take photos with less noise and artifacts, so you can shoot clean photos that require less touching up",
    "category": "camera",
    "capacity": "1,650 mAh Battery Capacity",
    "focallength": "f = 4.1 ~ 86.1mm (35mm film equivalent",
    "shutterspeed": null,
    "movieclip": null,
    "videoframerate": "Recording up to 30fps",
    "label23": "The simple and intuitive touch interface is easy to understand and use",
    "imagesensor": null,
    "range": "Wide",
    "fno": "2.8 (W) ~ 5.9 (T)",
    "os": null,
    "battery": null,
    "isoequivalent": "Auto, 100, 200, 400, 800, 1600, 3200",
    "colordepth": "16M",
    "size": "4.8\"",
    "usb": "USB v2.0",
    "standbytime": "Up to 280 hours (3G/4G)",
    "connector": "Micro USB available",
    "memory": null,
    "type": "TTL Auto Focus (Center AF, Multi AF, Face Detection AF)",
    "rechargingtime": "Approx. 4 sec.",
    "imagesize": "16M",
    "focusing": null,
    "label41": "Now you can browse the web right from your GALAXY Camera. Look up reference shots, how-tos and any other information you can find online without having to find a computer or take out your phone",
    "label43": "No matter what you shoot, you'll always have it saved",
    "label45": "Just connect your GALAXY Camera to your Dropbox account and start shooting",
    "label44": "Auto-Cloud Backup feature saves all of your photos and videos directly to Dropbox without you having to do a thing",
    "recording": "Movie Size",
    "compensation": "+-2EV (1/3EV steps)",
    "chipset": null,
    "display": null,
    "control": "Program AE, Aperture Priority AE, Shutter Priority AE, Manual Exposure",
    "wifi": "DirectWi-Fi Direct available",
    "label56": "Android 4.1 (Jelly Bean)",
    "connectors": null,
    "imagestabilization": null,
    "audioformat": "MP3, AAC, AMR, WMA, OGG, FLAC, 3GA/M4A, WAV",
    "shooting": "Auto; Smart (15 Mode)",
    "technology": "HD Super Clear LCD (TFT)",
    "videoresolution": "Full HD (1080p) Video Recording & Playback available",
    "automacro": "10cm ~ Infinity (Wide), 150cm ~ Infinity (Tele)",
    "videoformat": "AVI, MP4/3GP, WMV, FLV, MKV, WEBM",
    "label1": "21x Optical Zoom Lens",
    "specifications": null,
    "effect": "Normal, Vintage, Black & White, Autumn Brown, Negative, Nostalgia, Color Fade, Retro, Sunshine, Old Photo, Comic, Pastel Sketch, Gothic Noir, Impressionist",
    "lens": null,
    "label22": "With the GALAXY Camera, you won't be intimidated by the amount of manual options",
    "label20": "The GALAXY Camera captures your most precious memories at an amazing 120 frames per second and 720 x 480 resolution, and then plays them back slowly in crystal-clear video",
    "meteringsystem": "Multi, Spot, Center-weighted, Face Detection AE",
    "label26": "The GALAXY Camera is the first camera to include Android Jelly Bean, the latest operating system available for smartphones. Jelly Bean helps make your camera smooth, fast and customizable. It also supports all of the apps and options you're familiar with. Now you can have the latest and most powerful operating system on our camera",
    "label24": "Whether you need to set up the perfect family portrait or catch a few frames of the soccer game, big icons and helpful menus will guide you to the perfect option",
    "label28": "Now you don't have to wait until you get back home to properly review and edit your photos",
    "exposure": null,
    "macro": "10cm ~ 80cm (Wide), 150cm ~ 350cm (Tele)",
    "effectivepixel": "Approx. 16.3 Megapixels",
    "opticalzoom": "21x Zoom Lens",
    "resolution": "1280*720 (HD)",
    "whitebalance": null
}