{
    "weightapprox": "17 oz (782g)",
    "dimensionsapprox": "4 1/2\" x 2 5/8\" x 2 3/4\" (113.3 x 65.4 x 69.6mm)",
    "exposurecompensation": "+/- 3.0EV, 1/3EV step",
    "pictureeffects": "Yes, 13 effects",
    "label33": "Combining the data from all six, it creates a single image with a reduction in noise equivalent to two additional steps of ISO sensitivity",
    "label34": "Sensitivity selectable up to ISO 25600 (Recommended for still subjects)",
    "label36": "Focus as fast as 0.13 seconds with high speed AF",
    "label37": "To improve focusing speed and sensitivity, the Exmor CMOS sensor uses its rapid throughput to deliver high-quality image signals to the camera's BIONZ processor, which provides intelligent response data to a new high speed actuator motor in the lens",
    "label38": "The result is fast, DSLR-like focusing speeds even in low light",
    "batterytype": "LITHIUM ION NP-BX1 (supplied)",
    "facedetection": "8 Faces (Off / On(Registered Faces) / On)",
    "facedetectionregistrationtechnology": null,
    "flash": null,
    "label8": "Fixed lens digital camera to sport a 35mm full-frame sensor",
    "label9": "Captures gorgeous, high-quality 24.3-megapixel photos and Full HD video",
    "label0": "24.3MP Compact Digital Camera",
    "label1": "35mm Full-frame Exmor CMOS Sensor",
    "label2": "f/2.0 Carl Zeiss Sonnar T* Lens",
    "label3": "Full HD 24p/60i/60p Video",
    "label4": "ISO 100-25600",
    "label5": "14-bit RAW image capture",
    "label6": "9 aperture blades",
    "label7": "P/A/S/M modes",
    "label86": "You can even fine-tune contrast, saturation, and sharpness to your personal taste.",
    "label80": "Digital level gauge to allow easier leveling of the camera",
    "label31": "Experience incredible low-light shooting without a flash",
    "label82": "Manual focus becomes much easier because peaking highlights the edges that are in focus in your choice of three colors (white, red, or yellow)",
    "label88": "Realize your creative potential with Picture Effect, a fun and simple way to convert ordinary landscapes and portraits come to life by heightening mood and emphasizing certain attributes",
    "accessoryshoe": "Multi Interface Shoe",
    "isosensitivitymovie": "Auto (ISO100-3200 equivalent (1/3 EV stop), selectable with upper/lower limit), 100/6400",
    "amazinglowlightperformance": null,
    "label18": "Large-diameter F2.0 Carl Zeiss Sonnar T* lens delivers refined background defocusing - bokeh, and macro capabilities",
    "label19": "A premium multi-layered T* coating also dramatically reduces ghost and flare caused by light reflection",
    "label12": "The multi-interface shoe lets you add a variety of accessories to further enrich the capabilities of this incredible camera",
    "label13": "The camera fits in the palm of a hand and allows users to carry it nearly everywhere to capture any shooting opportunity that arises",
    "label10": "Complete manual control puts the power to fulfill your creative vision in the palm of your hand, while the big, bright f/2.0 Carl Zeiss Sonnar T* lens delivers beautifully defocused backgrounds and macro capabilities",
    "label11": "Shoot stunning Full HD 24p/60i/60p video, and exercise creative freedom with manual control of P/A/S/M modes",
    "label16": "BIONZ image processor enables up to 5 fps high-speed continuous shooting and 14-bit RAW image data recording",
    "label15": "the 24.3 MP effective 35 mm full-frame sensor, a normal sensor range of ISO 100 ? 25600, and a sophisticated balance of high resolving power, gradation and low noise",
    "label92": "Press the shutter, sweep vertically or horizontally",
    "label93": "The camera does the rest, continuously shooting images and stitching them together",
    "label97": "Simply photograph a person and Auto Portrait Framing will save an additional, optimally framed image in portrait or landscape orientation",
    "stillimagemode": "JPEG, RAW (Sony ARW 2.3 format)",
    "label95": "The camera can automatically detect and register up to eight individual faces and adjust focus, exposure, white balance and flash to help deliver crisp, properly lit images of family and friends. Can prioritize children or adults",
    "label98": "Combining Face Detection and By Pixel Super Resolution technologies with rule of thirds, Auto Portrait Framing provides beautifully composed and appealingly balanced full resolution portraits",
    "selftimer": "10sec. / 2sec.",
    "sweeppanorama": "Sweep Panorama",
    "capturejpegfilesrawfilesorboth": null,
    "hdoutput": "Micro HDMI",
    "power": null,
    "autohdrmode": null,
    "brightnesscontrol": "Auto / Manual (5 steps) / Sunny Weather mode",
    "effectivepictureresolution": "24.3MP (approx.)",
    "sweeppanoramamode": null,
    "drivesystem": null,
    "label23": "Full HD 24p video with manual control and audio input",
    "creativestylesettings": null,
    "label69": "Enjoy the convenience of flash photography everywhere you go",
    "label67": "This provides the freedom to choose a ratio that matches the scene or the specific shooting purpose",
    "label64": "Combines the best highlight detail from one shot, the best mid-tones from a second and the best shadow detail from a third for one incredible shot (up to 6 EV stops), all in a split second (Recommended for still subjects)",
    "label63": "Captures more scene dynamic range than a single exposure can handle?and more range than photo film",
    "scenemodes": "Portrait, Sports Action, Landscape, Sunset, Night Scene, Handheld Twilight, Night Portrait",
    "label61": "The large display delivers brilliant-quality still images and movies while enabling easy focusing operation",
    "label60": "WhiteMagic technology increases visibility in bright daylight",
    "label32": "The camera captures six images in a fraction of a second",
    "flashcoverage": "ISO Auto 0.75m to 21.7m / ISO 25600 up to 43.4",
    "focussystem": "Single-shot AF (AF-S) / Continuous AF (AF-C) / Direct Manual Focus (DMF) / Manual Focus (MF)",
    "brightf20carlzeisssonnartlens": null,
    "lcddisplay": null,
    "clearimagezoom": "2x",
    "fullframeburstshooting": null,
    "weightsandmeasurements": null,
    "category": "camera",
    "drangeoptimizer": "Off, Dynamic Range Optimizer (Auto/Level), Auto High Dynamic Range",
    "interface": null,
    "stillimagesize16": "9",
    "label78": "It also has Manual Focus for manual focusing freedom, and Direct Manual Focus (DMF), that first uses autofocusing to focus on the subject, and then allows fast and easy switching to manual focusing for even more precise adjustment",
    "attr243mp35mmfullframesensor": null,
    "multiframenr": null,
    "label74": "RAW files save images prior to de-mosaicing, white balance, sharpness and color enhancement",
    "label75": "This retains maximum latitude for enhancing the image on your PC",
    "stillimagesize3": "2",
    "opticslens": null,
    "camera": null,
    "convenientlyplaceddials": null,
    "usbports": "Micro USB, Hi-Speed USB (USB2.0)",
    "aperture": "F2-22",
    "afmodes": "Multi point AF (25 points) / Center weighted AF / Flexible spot / Flexible spot (tracking focus) / Flexible sport (face tracking)",
    "imagingsensor": "35mm full-frame (35.8mm × 23.9mm) ExmorTM CMOS Sensor, aspect ratio 3",
    "threecontrollensrings": null,
    "whitebalancemode": "Auto/Daylight/Shade/Cloudy/Incandescent/Fluor (Warm White)/Fluor (Cool White)/Fluor (Day White)/Fluor (Daylight)/Flash/C. Temp., Filter/Custom",
    "exposuresystem": null,
    "conveniencefeatures": null,
    "label48": "Pressing the Fn button activates Quick Navi, which allows the user to check camera settings at a glance and promptly change settings without having to search for dedicated menus",
    "shuttertype": "Program Auto (30-1/2000) / Manual (Bulb, 30-1/2000) / Aperture Priority (30-1/2000) / Shutter Priority (30-1/2000)",
    "highspeedautofocus": null,
    "cameratype": "Professional compact digital camera",
    "label40": "High speed continuous shooting at up to 5 frames per second (fps) is made possible by the BIONZ processor and 24 megapixel sensor",
    "label43": "Users can keep their eyes on the subject and concentrate on the composition while comfortably adjusting the dedicated aperture, focusing, and macro switching rings",
    "label42": "Full manual operation is intuitive on the RX1",
    "label45": "Quick access to conveniently placed exposure compensation and focus mode dials",
    "label47": "Quick Navi enhances direct control of your favourite functions",
    "intelligentscenerecognitionmode": null,
    "flashmodes": "Auto/Fill-flash/Slow Sync/Rear Sync/Off/Wireless",
    "lenstype": "Carl Zeiss® Sonnar T*",
    "lcdtype": "3.0' (7.5cm) (4",
    "imagestabilization": "SteadyShot Image Stabilization",
    "label51": "Settings include zoom magnification, white balance, exposure compensation, shutter speed, drive mode and metering modes",
    "creativestyle": "Standard, Vivid, Neutral, Clear, Deep, Light, Portrait, Landscape, Sunset, Night Scene, Autum Leaves, Black, White, Sepia",
    "label56": "The multi interface shoe allows easy connection with wide-ranging accessories expanding the range of photographic expression",
    "steadyshotmode": "Active",
    "label54": "Nine aperture blades form a nearly perfect circle throughout the normally used aperture range of F2 to F22, resulting in background defocusing that is smooth and genuinely beautiful",
    "label52": "This enables quick switching of settings at the right moment",
    "label50": "MR (memory recall) mode can memorize up to three groups of the user's preferred settings",
    "powerconsumptioninoperation": "Approx. 1.5W",
    "videomode": "AVCHD",
    "label59": "The 3\" (1,229k dots) Xtra Fine LCD Display makes it easy to scroll through menus and preview live Picture Effects",
    "focuscontrol": null,
    "meteringmodes": "Multi segment / Center weighted / Spot",
    "videoformat": "AVCHD Ver2.0, MP4",
    "intelligentauto": "Yes",
    "recording": null,
    "focaldistance": "AF approx. 24cm to infinity (Normal mode), approx. 14cm to 29cm (Macro mode))",
    "specifications": null,
    "lensconstruction": "8 elements in 7 groups (3 aspherical elements including AA lens)",
    "mediatype": "Memory Stick Duo, Memory Stick PRO Duo, Memory Stick PRO Duo (High Speed), Memory Stick PRO-HG Duo, SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "continuousshootingspeed": "5 fps at 24.3MP",
    "label21": "Fixed lens 35 mm full-frame digital camera which offers an uncompromising design that focuses on an intuitive, user-friendly operation",
    "label20": "9 aperture blades delivers refined background defocusing and macro capabilities",
    "builtinpopupflash": null,
    "label26": "Additionally, an optional microphone (Sold Separately) can be plugged into the camera",
    "label25": "Enjoy clear sound recording and playback via built-in stereo microphone and mono speaker",
    "label24": "For creative flexibility while shooting movies and stills, users can enter Program Auto (P), Aperture Priority (A), Shutter Speed Priority (S) or Manual Exposure (M) mode for manual shooting and exposure control",
    "panoramastillimagesize": "Standard (3872 x 2160/8192 x 1856) / Wide (5536 x 2160/12416 x 1856)",
    "label29": "The combination of the RX1's large 35mm sensor and bright f/2.0 Carl Zeiss Sonnar T* lens with class-leading image processing and noise reduction deliver outstanding low-light performance to capture the moment as you see it",
    "label28": "Now you can capture the mood of the moment without a flash",
    "focallength35mmequivalent": "[Still image 3",
    "memorycardslot": "MS Duo and SD/SDHC/SDXC Compatible",
    "stillimageplaybackoptions": "Control for HDMI, Slideshow",
    "pixelgross": "24.7MP (approx.)",
    "advancedfeatures": null,
    "pictureeffectmode": null,
    "digitalzoom": "24M approx. 4x / 10M approx. 6.1x / 4.6M approx. 9.1x",
    "apertureblade": "Iris diaphragm (9 blades)",
    "weightapproxmainunitonly": "16 oz (453g )",
    "microphoneinput": "Microphone jack"
}