{
    "isosensitivity": "ISO 125-3200, ISO 3200 (available when using Auto mode)",
    "exposurecompensation": "+- 2 EV in steps of 1/3",
    "label32": "For even more options, browse thousands of popular Android photography and video apps",
    "label34": "You can show exactly where every photo and video was taken. You can even share that info when you post to sites like Facebook",
    "label35": "Integrate your geotagged photos and movie files with Nikon's my Picturetown photo sharing site, Google Earth mapping service and Nikon ViewNX 2",
    "chargingtime": "4 hours when battery is fully discharged (using Charging AC Adapter EH-69P/EH-69C) (Approx.) Battery / Batteries",
    "label37": "No one will mind when you tag them in your photos, thanks to Nikon's Smart Portrait System",
    "label38": "It optimizes your camera settings, identifies and focuses on faces, adds subtle skin softening and more to ensure everyone looks their best",
    "builtinflashrangeapproxisosensitivity": "Auto)",
    "monitorresolution": "819,000-dots",
    "sensorsize": "1/2.3 in.",
    "totalpixels": "16.79 million (approx.)",
    "label9": "Introducing the most connected COOLPIX yet, S800c with the superior imaging power of a Nikon point-and-shoot camera and all the capabilities of an Android smart device",
    "label0": "16.0 MP Compact Digital Camera",
    "label1": "10x Optical Zoom",
    "label2": "3.5-inch Touchscreen",
    "label3": "Built-in GPS",
    "label4": "Full HD 1080p Videos",
    "label5": "Android smart device",
    "label6": "All the imaging power of a Nikon?superior optics, telephoto zooming, a high resolution image sensor and much more, meets the endless possibilities of the Android OS and Wi-Fi connectivity",
    "label7": "Create exceptional photos and Full HD videos, then edit, style and share them easier and faster than ever before",
    "focusrange": "[W]",
    "label85": "Self-timer Can be selected from 10 and 2 seconds duration",
    "label31": "Explore black & white photography, selectively highlight one colour within a composition, create wider-than-possible Fisheye shots or give your photos an antique feel with Nostalgic Sepia",
    "shutter": "Mechanical and CMOS electronic shutter",
    "lensfnumber": "f/3.2-5.8 .Lens Construction 8 elements in 8 groups",
    "label40": "With the touch of a button, you can record professional looking Full HD (1080p) videos with stereo sound",
    "exposurelock": "Yes",
    "videooutput": "NTSC, PAL",
    "exposurecontrol": "Programmed auto exposure, Exposure compensation (-2.0 to +2.0 EV in steps of 1/3 EV)",
    "autofocusaffocusareaselection": "Auto (9-area automatic selection); Centre; Face priority; Subject tracking",
    "memorycardtype": "SD/SDHC",
    "label18": "Forget about blurry images-Optical VR image stabilization means a little camera shake won't keep you from taking sharp photos",
    "label19": "And when you're in a tricky shooting situation, let Scene Modes optimize the camera settings for you",
    "acpoweradapter": "NIEH69P (Optional)",
    "label12": "Its an all-in-one smart device that will change the way you create and share memories",
    "label10": "Create beautiful photos and Full HD videos, then instantly share them right from your camera-email them to friends, post them on Facebook, upload them to my Picturetown or wirelessly transfer them to your laptop, smartphone or tablet",
    "label11": "You can even install popular Android photography and social networking apps from Google Play",
    "label16": "Shoot beautiful 16.0 megapixel photos and Full HD (1080p) videos, even in low light conditions",
    "label17": "With a 10x optical Zoom-NIKKOR ED glass lens, zoom in to telephoto distances (25-250mm) and make faraway objects appear right in front of you",
    "label14": "The brilliant image quality of a Nikon camera So many moments deserve the superior image quality and zoom power of a camera",
    "suppliedaccessories": null,
    "category": "camera",
    "movie": "Audio file format",
    "powersources": "One Rechargeable Li-ion Battery EN-EL12 (supplied)",
    "selftimer": "2 Sec, 10 Sec",
    "imagesizepixels": "4608 x 3456 (16M)",
    "topcontinuousshootingspeedatfullresolution": "Up to 3 shots at approx. 8 frames per second",
    "tripodsocket": "1/4 in.",
    "interface": "Hi-speed USB",
    "shutterspeed": "1/2000-1 sec.; 1/4000 sec. (maximum speed during high-speed continuous shooting); 4 sec. (when scene mode is set to Fireworks show)",
    "fileformats": "JPEG",
    "lensfocallength": "4.5-45.0mm (angle of view equivalent to that of 25-250 mm lens in 35mm [135] format)",
    "lens": "10x optical zoom, NIKKOR ED glass lens",
    "remotecontrol": "N/A",
    "connectivity": "HDMI C, USB 2.0",
    "flashmodes": "Auto",
    "builtinflash": "Yes",
    "imagesensor": "CMOS",
    "label62": "Monitor Frame coverage (playback mode)L 100% horizontal (Approx.)",
    "operatingenvironment": "Temperature",
    "warranty": "2 year warranty",
    "interfacedatatransferprotocol": "MTP, PTP",
    "externalflashconnection": "N/A",
    "lowestisosensitivity": "125",
    "battery": "NIENEL12",
    "displayscreentype": "OLED Rear Screen",
    "incameraimageediting": "Border, Crop, D-Lighting, Filter Effects, Quick retouch, Rotate image, Skin softening, Small Pic",
    "aspectratio": "4:3",
    "ioterminal": "Digital I/O (USB), HDMI Mini Connector (HDMI output)",
    "scenemodes": "Back Light, Beach, Black and White Copy, Close Up, Dusk/Dawn, Easy Panorama, Fireworks Show, Food, Landscape, Night Landscape, Night Portrait, Party/Indoor, Pet Portrait, Portrait, Snow, Sports, Sunset",
    "burstrate": "Up to 8 fps for up to 3 frames",
    "operatingstoragetemperature": "0 to 40C (32 to 104F) Humidity: 0-84%",
    "builtinmemory": "1.7GB",
    "aperture": "Electronically controlled ND filter (-2.0 AV) insertion",
    "meteringmethod": "Center-weighted, Matrix, Spot",
    "gps": "Yes (Built-in)",
    "autofocusaf": "Contrast-detect TTL AF",
    "internalmemory": "Approx. 1.7GB",
    "wififunctionality": "Yes",
    "screensize": "3.5\"",
    "storagemedia": "SD memory card, SDHC memory card",
    "highestisosensitivity": "3200",
    "cameratype": "Advanced",
    "label41": "Then you can watch them, or videos from the web, on the COOLPIX S800c's bright high-resolution 3.5-inch OLED touchscreen",
    "type": "Compact Digital Camera",
    "label42": "A world of apps, at your fingertips Since the COOLPIX S800c is powered by the Android operating system, you have access to the thousands of apps on Google Play-everything from photo and video editing apps to social networking apps, games and more",
    "continuousshootingoptions": "Best Shot Selector, Continuous H, Continuous H 60, Continuous H 120, Continuous L, Multi-shot 16, Single",
    "builtinflashcontrol": "TTL auto flash with monitor preflashes",
    "effectivepixels": "16.0 million",
    "vibrationreduction": "Combination of Lens-shift and Electronic VR (still pictures)",
    "monitorframecoverageshootingmode": "98% horizontal (Approx.), 98% vertical (Approx.)",
    "batterylifeshotspercharge": "Still pictures",
    "storagefileformats": "Still pictures",
    "storagefilesystem": "DCF, EXIF 2.3, DPOF compliant",
    "imagestabilization": "Yes",
    "hdmioutput": "Can be selected from",
    "approxdimensions": "Height",
    "monitortype": "OLED (touch panel) with Anti-reflection coating, Touch screen control",
    "label15": "With the COOLPIX S800c, you no longer have to choose between great photos and connectivity-you get both",
    "whitebalancemodes": "Auto, Cloudy, Daylight, Flash, Fluorescent, Incandescent, Preset Manual",
    "monitorsize": "3.5 in. diagonal",
    "specifications": null,
    "focuslock": "Yes",
    "sensortypesize": "1/2.3\" CMOS",
    "label23": "Capture the moment in 16.0 megapixels of brilliant clarity and then instantly share to Google+ social service, Facebook, Twitter, Nikon's my Picturetown, with your email contacts",
    "label22": "Now you can share all your stories through beautiful Nikon-quality photos and videos",
    "label21": "Your friends and family love seeing what you've been up to",
    "label27": "The COOLPIX S800c is more than a camera-it's also an Android smart device with a 3.5-inch high-resolution touchscreen",
    "label25": "It's simple, it's fast and it's totally wireless",
    "label24": "Plus, you can wirelessly back up your photos and videos or offload your memory card contents in an instant and keep shooting",
    "label29": "Plus, you get access to all the amazing Android apps on Google Play, including thousands of photography and video apps for taking, editing and sharing photos and videos",
    "label28": "That means you can do all the things one can do with an Android smartphone or tablet. Check your email and Facebook. View photos and videos from your friends. Browse the web. Stream music. The possibilities are endless",
    "colour": "Black",
    "exposuremodes": "Programmed Auto",
    "opticalzoom": "10x",
    "digitalzoom": "Up to 4x (angle of view equivalent to that of approx. 1000mm lens in 35mm [135] format)",
    "viewfindertype": "LCD Display",
    "exposuremetering": "256-segment matrix, centre-weighted (digital zoom less than 2X); Spot (digital zoom 2X or more)",
    "whitebalance": "Auto, Cloudy, Daylight, Flash, Fluorescent, Incandescent, Preset Manual"
}