{
    "exposurebracketing": "Yes",
    "isosensitivity": "ISO 100-3200, Hi 1 (equivalent to 6400), Auto (auto gain ISO 100-1600), Fixed range auto (ISO 100-400, 100-800)",
    "label30": "Choose from special effects such as High Contrast Monochrome or Nostalgic Sepia and add a creative touch to your movies",
    "exposurecompensation": "+- 2 EV in steps of 1/3",
    "label32": "The P510 connects easily to your HDTV via the HDMI port so you can share the sights and sounds of your adventure",
    "label34": "The P510 boasts a variety of quick creative options that include Backlight HDR",
    "label36": "Use the 3-inch ultra-high-resolution (921,000 dot) Vari-angle LCD monitor to capture the most unconventional angles",
    "label38": "Keep it simple",
    "builtinflashrangeapproxisosensitivity": "Auto)",
    "monitorresolution": "921,000-dots",
    "sensorsize": "1/2.3 in.",
    "totalpixels": "16.79 million (approx.)",
    "label8": "Bring your subjects up close and personal, with an incredible zoom range of 24mm-1,000mm Spontaneous action is captured sharp and clear with optical VR Image Stabilization and amazingly fast autofocus",
    "label9": "Every image and Full HD (1080p) movie dazzles when produced by the advanced 16.1 MP CMOS sensor",
    "maximumautofocusareaspoints": "99",
    "label0": "Refurbished Nikon COOLPIX P510",
    "label1": "16.1 MP Compact Digital Camera",
    "label2": "42x Optical Zoom",
    "label3": "Full HD (1080p) Movies",
    "label4": "Built-in GPS",
    "label5": "Optical Zoom-NIKKOR 24mm-1,000mm ED glass lens",
    "label7": "For the outdoor photographer, the COOLPIX P510 puts you where you need to be",
    "voicememofunction": "Yes",
    "label31": "You can even shoot in slow- or fast-motion for more dramatic action sequences",
    "chargingtime": "4 hours and 30 minutes when battery is fully discharged (using Charging AC Adapter EH-69P/EH-69C) (Approx.)",
    "highspeedcontinuousshooting": null,
    "lenszoom": "42x",
    "shutter": "Electronically controlled mechanical and CMOS electronic shutter",
    "lensfnumber": "f/3.3-5.9",
    "exposurelock": "Yes",
    "videooutput": "NTSC, PAL",
    "exposurecontrol": "Programmed auto exposure with flexible program, aperture-priority auto, manual, motion detection, shutter priority auto",
    "autofocusaffocusareaselection": "Auto (9-area automatic selection), Centre, Face priority, Manual with 99 focus areas, Subject tracking",
    "label19": "Don't let a slow performing camera allow you to miss a single moment",
    "label39": "Let the camera determine the best settings for the job with 19 pre-programmed Scene modes including Sunset mode",
    "approxweight": "19.6 oz. (555g) With battery and SD memory card",
    "label13": "In addition, its close-up macro mode is incredible, allowing you to focus as close as 0.4 inches (1 cm)",
    "label11": "With a 42x optical Zoom-NIKKOR ED glass lens, an incredible world of optical power and versatility awaits you",
    "label16": "A 16.1 MP CMOS sensor expertly manages high-resolution imagery, delivering exceptional quality in any environment Even when shooting in low light, your photos and movies will look great",
    "label17": "The backside illuminated CMOS technology increases the flow of light to the CMOS sensor's surface, thereby yielding improved quality and minimum image noise",
    "label14": "The optical Vibration Reduction system minimizes the chance of blur while you take both photos and movies and the side zoom control provides easy access to the P510's powerful zoom capabilities",
    "category": "camera",
    "focusrangew": "Approx. 1 ft. 8 in. (50 cm.) to infinity; [T]",
    "movie": "Audio file format",
    "powersources": "EN-EL5 rechargeable Li-on battery",
    "selftimer": "Can be selected from 10 and 2 seconds duration",
    "imagesizepixels": "4608 x 3456 (16M)",
    "topcontinuousshootingspeedatfullresolution": "Up to 5 shots at approx. 7 frames per second",
    "tripodsocket": "ISO 1222",
    "label12": "Shoot from 24mm wide-angle then zoom to an amazing 1,000mm and capture distant images",
    "interface": "Hi-speed USB",
    "shutterspeed": "1/2000-1/2 sec",
    "lensfocallength": "4.3-180mm (angle of view equivalent to that of 24-1000 mm lens in 35mm [135] format)",
    "lens": "42x optical Zoom, NIKKOR glass lens",
    "label118": "This means the product has been inspected, cleaned, and repaired to meet manufacturer specifications and is in excellent condition",
    "label119": "All refurbished units are tested before they are sold",
    "builtinflash": "Yes",
    "imagesensor": "CMOS",
    "scenemodes": "Beach, Close Up, Copy, Dusk/Dawn, Fireworks Show, Food, Museum, Night Portrait, Panorama Assist, Party/Indoor, Pet Portrait, Portrait, Scene Auto Selector, Snow, Sports, Sunset, 3D Photography",
    "operatingenvironment": "Temperature",
    "batterybatteries": "Rechargeable Li-ion Battery EN-EL5]",
    "interfacedatatransferprotocol": "MTP, PTP",
    "lowestisosensitivity": "100",
    "incameraimageediting": "Crop, D-Lighting, Filter Effects, Quick retouch, Rotate image, Skin softening, Small Pic",
    "ioterminal": "Audio/video (A/V) output, Digital I/O (USB), HDMI Mini Connector (HDMI output)",
    "aperture": "Electronically-controlled 6-blade iris diaphragm",
    "type": "Compact Digital Camera",
    "autofocusaf": "Contrast-detect TTL AF",
    "internalmemory": "Approx. 90MB",
    "storagemedia": "SD memory card, SDHC memory card, SDXC memory card",
    "highestisosensitivity": "3200",
    "label41": "Easy Panorama mode automatically combines multiple shots into a seamless 180º or 360º panoramic image.",
    "label42": "Create unique wide views of your scene",
    "builtinflashcontrol": "TTL auto flash with monitor preflashes",
    "effectivepixels": "16.1 million",
    "viewfinder": "Electronic",
    "vibrationreduction": "Lens-shift VR",
    "monitorframecoverageshootingmode": "100% horizontal (Approx.), 100% vertical (Approx.)",
    "batterylifeshotspercharge": "Still pictures",
    "storagefileformats": "Still pictures",
    "storagefilesystem": "DCF, EXIF 2.3, DPOF compliant",
    "hdmioutput": "Can be selected from",
    "label120": "Nikon refurbished COOLPIX compact cameras come with a six month Nikon Canada warranty.",
    "approxdimensions": "Height",
    "monitortype": "TFT-LCD with Anti-reflection coating, 5-level brightness adjustment",
    "monitorsize": "3.0 in. diagonal",
    "specifications": null,
    "focuslock": "Yes",
    "lensconstruction": "14 elements in 10 groups",
    "label23": "A long way from home? Switch on the built-in GPS feature and check your progress",
    "label21": "So whether you're at a sporting event where the action never stops or are simply hoping to capture those fleeting smiles, the P510 delivers all the action with pinpoint accuracy",
    "label20": "Enjoy non-stop shooting with the P510's incredibly fast and responsive performance - up to 5 shots in approximately one second",
    "label26": "Access all the P510 has to offer on its stunningly vivid, ultra-high-resolution 3-inch LCD monitor",
    "label25": "Geotagged photo and movie files integrate with Nikon's my Picturetown photo sharing site, Google Earth and Nikon View NX2 software",
    "label24": "As you shoot, your files are geotagged and provide a visual travelogue that pinpoints latitude and longitude",
    "label29": "With a single touch of the button, record movies using continuous AF and stereo sound",
    "label28": "Capture those once in a lifetime moments with vibrant Full HD (1080p) movies",
    "viewfinderframecoverage": "Approx. 100%",
    "monitorframecoverageplaybackmode": "100% horizontal (Approx.)",
    "exposuremodes": "Programmed Auto",
    "digitalzoom": "Up to 2x (angle of view equivalent to that of approx. 2,000mm lens in 35mm [135] format)",
    "exposuremetering": "224-segment matrix, centre-weighted",
    "whitebalance": "Auto, Cloudy, Daylight, Flash, Fluorescent, Incandescent, Manual"
}