{
    "isosensitivity": "Auto / i.ISO / 100 / 200 / 400 / 800 / 1600 / 3200 / 6400 * (* Extended ISO) (Changeable to 1/3 EV step) / High Sensitivity Mode (ISO 1600 - 6400)",
    "focus": "Normal / AF Macro / MF / Quick AF ON/OFF(On in Intelligent Auto), Continuous AF (only for motion picture) / FOCUS Button, AF/AF Macro/MF Switchable, AF/AE Lock Button, Manual Focus / One shot AF, AF Area Select, AF Tracking",
    "label30": "LUMIX FZ200 is able to produce not only stunning photos but also stunning full-HD in 1,920x1,080 60p videos in AVCHD Progressive (MPEG-4) and MP4 formats",
    "exposurecompensation": "1/3 EV step, +/-3 EV",
    "label32": "Additionally, Active Mode encourages active video recording at wide angle and the popular iA mode allows users to easily create motion images by simple pointing and hitting the record button",
    "label33": "Creative Video mode allows users to set the shutter speed and aperture manually to bring special effects to videos, shoot fast moving objects and shooting subjects at various distances",
    "label35": "RAW and RAW+JPEG data recording option",
    "label36": "3.0-inch, free-angle 460,000-dot Intelligent LCD screen with AR Coating and wide viewing angle ensures comfortable monitoring in various shooting positions",
    "label37": "Long battery life of approximately 540 pictures per charge",
    "label38": "Hot Shoe provides more advanced creative freedom, allowing for various accessory attachment including and optional stereo microphone (DMW-MS1), external flash (DMW-FL220/FL360/FL500) or remote shutter (DMW-RSL1)",
    "label39": "HDR (High Dynamic Range) mode",
    "lightmetering": "Intelligent Multiple / Center Weighted / Spot",
    "focusingarea": "Normal",
    "modedialmodebutton": "Expressive, Retro, High Key, Low Key, Sepia, Dynamic Monochrome, Impressive Art, High Dynamic, Cross Process, Toy Effect, Miniature Effect, Soft Focus, Star Filter, One Point Color",
    "avchdactualrecordabletimemotionpictures": "approx. 80 min (PSH), 90 min (FSH)",
    "label8": "At the heart of this amazing lens is the high-quality of LEICA DC VARIO-ELMARIT optics",
    "label0": "12.1 MP Compact Digital Camera",
    "label1": "24x Optical Zoom",
    "label2": "12 fps Burst Rate",
    "label3": "Full 1080/60p HD Video",
    "label4": "Fast F2.8 Aperture Across Entire Zoom Range",
    "label6": "Full range F2.8 aperture across the entire zoom range ([24X] 25mm-600mm, F2.8 - 35mm equivalent), a feature usually reserved for very high end professional lenses",
    "label7": "The added light collecting ability the F2.8 provides to the FZ200 enables capturing moving subjects clearly with fast shutter speed, even from a distance",
    "focusrange": "Wide: 11.81\" (30 cm) - Infinity Telephoto: 78.74\" (200 cm) - Infinity Wide: 0.39\" (1 cm) - Infinity Telephoto: 39.37\" (100 cm) - Infinity",
    "cameraeffectivepixels": "12.1 Megapixels",
    "label31": "The powerful 24x optical zoom with 2-step zoom and POWER O.I.S. is available in video recording and high-quality Dolby Digital Stereo Creator offers highly realistic, powerful sound for videos The stereo zoom microphone features a zoom noise reduction system and an Auto Wind Cut function to reduce background noise from wind",
    "autoaebracketing": "1/3 EV step, +/-3EV, 3 frames",
    "shutter": "60-1/4000 sec",
    "creativecontrolmode": "Portrait, Soft Skin, Scenery, Panorama Shot, Sports, Panning, Night Portrait, Night Scenery, / Handheld Night Shot, HDR, Food, Baby1, Baby2, Pet, Sunset, High Sensitivity, Glass Through, 3D photo",
    "optics": null,
    "weight": "Approx. 537g without Battery and SD Memory Card (1.18lb) / Approx. 588g with Battery and SD Memory Card (1.29lb)",
    "intelligentzoom": "48x",
    "memorycardtype": "SD/SDHC/SDXC",
    "label18": "Panasonic's Nano Surface Coating technology minimizes light reflection at the entire zoom range (380nm-780nm) resulting in super clear picture with a dramatic reduction of ghost and flare",
    "effectivepixels": "12.1MP",
    "additionalfeatures": null,
    "acpoweradapter": "110-240V AC",
    "label12": "Light Speed AF (auto focus) combines with the LUMIX FZ200's ability to capture high speed burst shooting at 12 fps (frames per second) in full resolution and a quick start-up time of approximately .95 seconds, so users never miss even the most fleeting shooting opportunities",
    "label13": "Furthermore, High Speed Video enables users to record fast-moving subjects at 120 fps (NTSC/HD) or 240 fps (NTSC/VGA) (The recording format is 30p (NTSC))",
    "colormodecoloreffectmycolor": "Color Mode (only in iA Mode)",
    "label16": "The camera's POWER O.I.S. (Optical Image Stabilizer) provides improved correction accuracy to minimize blur, even when zoomed, and Active Mode effectively suppresses handshake vibration in both still picture and video recording",
    "label15": "The LUMIX FZ200's powerful 24x optical zoom can be increased to 48x equivalent with the Intelligent Zoom function, and takes advantage of Intelligent Resolution technology to maintain picture quality",
    "category": "camera",
    "pictureadjustment": "Contrast, Sharpness, Color Saturation, Noise Reduction",
    "label96": "Battery Charger",
    "label97": "Battery Pack",
    "mp4continuousrecordabletimemotionpictures": "approx. 200 min (FHD)",
    "label98": "Lens Hood",
    "label99": "Lens Cap",
    "selftimer": "2sec / 10sec / 10sec 3pcs",
    "attr2speedzoom": "Yes",
    "power": "Li-ion Battery Pack (7.2V, Minimum",
    "focallength": "f=4.5 - 108mm (25 - 600mm in 35mm equiv.) / (28 - 672mm in 35mm equiv. in video recording)",
    "opticalimagestabilizer": "Power O.I.S. (On with Active Mode(only for Video) / Off)",
    "others": null,
    "interface": "miniHDMI, AV Output (NTSC), USB Multi, Microphone",
    "shutterspeed": "Still image",
    "fileformats": "JPEG, MPO, RAW",
    "mp4actualrecordabletimemotionpictures": "approx. 100 min (FHD)",
    "extraopticalzoomez": "29.4x (4",
    "lens": "LEICA DC VARIO-ELMARIT (Nano Surface Coating) / 14 elements in 11 groups / (5 Aspherical Lenses / 9 Aspherical surfaces / 3 ED Lenses / 1 Nano Surface Coating Lens)",
    "photostylefilmmode": "Standard, Vivid, Natural, Monochrome, Scenery, Portrait, Custom",
    "remotecontrol": "None",
    "connectivity": "2.5mm Sub-mini, HDMI C, USB 2.0",
    "flashmodes": "Auto Auto/Red-eye Reduction Forced On Off Second-curtain Sync Slow Sync Slow Sync./Red-eye Reduction",
    "builtinflash": "Yes",
    "afmetering": "1/3 - 3 EV step, Max.+/-3EV, 3 frames",
    "fileformat": "Still Image",
    "warranty": "1 year warranty",
    "externalflashconnection": "Hot Shoe",
    "battery": "Rechargeable Lithium Ion Battery Pack",
    "recordingmedia": "Built-in Memory, SD Memory Card, SDHC Memory Card, SDXC Memory Card (Compatible with UHS-I Standard)",
    "displayscreentype": "LCD Rear Screen",
    "digitalredeyecorrectionredeyeremoval": "Yes",
    "burstrate": "Up to 12 fps at 12.1 MP for up to 12 frames Up to 5.5 fps at 12.1 MP for up to 12 frames Up to 2 fps at 12.1 MP for up to 12 frames Up to 60 fps at 2.5 MP Up to 40 fps at 5 MP",
    "operatingstoragetemperature": "N/A",
    "avchdcontinuousrecordabletimemotionpictures": "approx. 160 min (PSH), 180 min(FSH)",
    "builtinmemory": "Approx. 70MB",
    "aperture": "F2.8 / Multistage Iris Diaphragm (F2.8 - 8 (W, T))",
    "meteringmethod": "Center-weighted, Multi, Spot",
    "standardaccessories": null,
    "screensize": "3.0\"",
    "lcdmonitor": "3.0\" (7.5cm) Free-Angle TFT Screen LCD Display (460K dots), AR Coating / Field of View",
    "imagequality": "RAW / RAW+Fine / RAW+Standard / Fine / Standard (3D Mode",
    "cameratype": "Super Zoom",
    "label41": "3D Photo mode",
    "label40": "Panorama Shot mode",
    "recording": null,
    "viewfinder": "0.21\" Color EVF (1,312K dots equiv.), Field of View",
    "imagestabilization": "Yes",
    "includedsoftware": "PHOTOfunSTUDIO 8.3 PE, SilkyPix Developer Studio, Adobe Reader",
    "label10": "12.1-megapixel High Sensitivity MOS sensor and high performance image processing LSI Venus Engine provide the LUMIX FZ200 with high speed response, high sensitivity recording and superb image quality",
    "batterylifeapprox": "540 pictures (CIPA Standard)",
    "dimensionswxhxd": "125.2 x 86.6 x 110.2 mm / (4.93 x 3.41 x 4.34 inch)",
    "stillimagescenemode": "Full- Resolution Image",
    "whitebalancemodes": "Auto, Cloudy, Daylight, Flash, Fluorescent (Natural White), Fluorescent (White), Incandescent, Shade",
    "zoominmotionpicture": "Yes",
    "sensorsizetotalpixelsfilter": "1/2.3-inch High Sensitivity MOS Sensor / 12.8 Total Megapixels / Primary Color Filter",
    "specifications": null,
    "microphonespeaker": "Stereo / Mono",
    "sensortypesize": "1/2.3\" MOS",
    "label23": "The side lever has been redesigned and placed in a convenient location, allowing for smooth zooming control",
    "label22": "LUMIX FZ200's body has been designed as a full-fledged shooting style digital compact camera with ultimate controllability",
    "label20": "0.2-inch EVF (Electronic View Finder) features a 1,312,000-dot equivalent high resolution, 100% field of view and minimum screen freeze",
    "label27": "With iA (Intelligent Auto) Plus, users can take advantage of popular iA functions - POWER O.I.S. with Active Mode, AF Tracking, Intelligent D-range Control, Intelligent Scene Selector, Face Recognition, Intelligent ISO Control, Intelligent Handheld Night Shot, Intelligent HDR and Motion Deblur - in addition to adjusting exposure compensation, white balance and defocusing background area for more flexible shooting control",
    "label26": "LUMIX FZ200's Creative Control mode features 14 filter options including the Soft Focus, Dynamic Monochrome, Impressive Art, One Point Color, Cross Process, Low Key, Toy Effect and Star Filter in addition to the conventional Expressive, Retro, High Key, Sepia, High Dynamic and Miniature Effect modes. Photo Style is also available and allows users to create more artistic photographs with Standard, Vivid, Natural, Monochrome, Scenery, Portrait and Custom options",
    "label24": "Focus can also be easily changed with this lever, allowing users to concentrate on shutter operation and get the perfect photographic moment",
    "aspectratio": "1:1, 3:2, 4:3, 16:9",
    "label28": "For advanced photography users, the LUMIX FZ200 offers manual control mode allowing users to enjoy a more creative photography experience",
    "exposure": "Program AE, Aperture Priority AE, Shutter Priority AE, Manual",
    "colour": "Black",
    "exposuremodes": "Modes: Aperture Priority, Manual, Programmed Auto, Shutter Priority Compensation: -3 EV to +3 EV (in 1/3 EV steps)",
    "opticalzoom": "24x",
    "digitalzoom": "Max. 4x",
    "viewfindertype": "Electronic, LCD Display",
    "afassistlamp": "Yes (On/Off)",
    "whitebalance": "Auto / Daylight / Cloudy / Shade / Flash / Incandescent / White Set1 / White Set2 / Color Temperature (2-axis adjustable)"
}