{
    "isosensitivity": "i.ISO / 100 / 200 / 400 / 800 / 1600 / High Sensitivity mode (ISO 1600-6400)",
    "focus": "Normal, AF Macro, Macro Zoom / Quick AF (Always On), Continuous AF(only for motion picture) / AF Tracking",
    "label30": "Furthermore, the Auto Retouch function automatically adjusts the contrast and brightness to give any photo a different impression with the touch of a button",
    "exposurecompensation": "1/3 EV step, +/-2 EV",
    "label32": "MEGA O.I.S. (Optical Image Stabilizer) helps to suppress handshake which often occurs when shooting using high zoom",
    "label34": "The LUMIX SZ5 also features special effects to enhance the shooting experience and create fun photo options",
    "label35": "In Miniature Effect mode, the peripherals are defocused while saturation and contrast is emphasized to make the picture look like a diorama",
    "label36": "Video recorded in Miniature Effect mode is played back in 10x fast-forwarding, making it comical and fun to watch",
    "label37": "Panorama Shot makes it possible to shoot a horizontal or vertical panoramic image by taking consecutive shots and then overlaying the photos for the effect of a panoramic photo",
    "label39": "LUMIX SZ5 makes archiving images as simple as charging the camera's battery",
    "lightmetering": "Intelligent Multiple",
    "focusingarea": "Normal",
    "modedialmodebutton": "Intelligent Auto, Normal Picture, SCN, Miniature Effect",
    "label9": "Marrying the conventional digital camera experience with Wi-Fi capability allows users to connect the LUMIX SZ5 directly to a smartphone device and easily shoot and share photos",
    "label0": "14.1 MP Compact Digital Camera",
    "label1": "10.0x Optical Zoom",
    "label2": "1/2.33-inch CCD Sensor",
    "label3": "Wi-Fi Capable",
    "label4": "Auto image transfer to PC, Cloud, and AV devices",
    "label5": "Leica 25mm wide angle 10X zoom (25mm-250mm)",
    "label6": "Wi-Fi remote shooting, browsing and sharing via cell phone",
    "focusrange": "Wide: 19.69\" (50 cm) - Infinity Telephoto: 59.06\" (150 cm) - Infinity Wide: 1.97\" (5 cm) - Infinity Telephoto: 59.06\" (150 cm) - Infinity",
    "cameraeffectivepixels": "14.1 Megapixels",
    "motionpicturerecording": "[HD Video] / 1280 x 720 pixels, 30 fps (HD",
    "autoaebracketing": "No",
    "shutter": "8-1/1600 sec",
    "optics": null,
    "weight": "Approx. 120g without Battery and SD Memory Card (0.27 lb) / Approx. 136g with Battery and SD Memory Card (0.30 lb)",
    "intelligentzoom": "20.0x",
    "memorycardtype": "SD/SDHC/SDXC",
    "label18": "25mm ultra wide-angle LEICA DC VARIO-ELMAR lens system with powerful, 10x optical zoom excels in shooting both dynamic landscapes with wide-angle views and up-close subjects",
    "label19": "With Intelligent Resolution Technology, the Intelligent Zoom feature extends the cameras zoom ratio up to 20x the equivalent while maintaining crisp picture quality",
    "additionalfeatures": null,
    "acpoweradapter": "110-240V AC",
    "label12": "Can be connected directly to a smartphone device by using it as a wireless router, which eliminates the need to of searching for a Wi-Fi hotspot",
    "label13": "With the LUMIX LINK application, for iOS/Android smartphone devices, users can utilize remote shooting, which allows them to place the LUMIX SZ5 at a shooting position and monitor what the lens is seeing live from their smartphone device at 30 fps (frames per second)",
    "colormodecoloreffectmycolor": "Color Mode",
    "label11": "Integrates Wi-Fi connectivity so that users can enjoy flexible shooting style and instant imaging sharing",
    "label17": "In addition to the camera's ease-of-use for connected consumers, the LUMIX SZ5 boasts exceptional optical performance, producing images with stunning clarity imagery in a slim and compact camera body",
    "label14": "Users also have the ability to zoom, set focus position, shoot and playback images directly from their smartphone screen using the app",
    "label15": "Additionally, users can tag location information to images by utilizing the GPS (Global Positioning System) log of a smartphone and share it with their preferred SNS (Social Network Service)",
    "category": "camera",
    "label97": "Battery Pack, AC adaptor, USB Cable, Hand Strap, CD-ROM",
    "mp4continuousrecordabletimemotionpictures": "approx. 90 min (HD)",
    "selftimer": "2sec / 10sec",
    "power": "Li-ion Battery Pack (3.6V, Minimum",
    "focallength": "f=4.5-45.0mm (25-250mm in 35mm equiv.) / (27-270mm in 35mm equiv. in video recording)",
    "opticalimagestabilizer": "MEGA O.I.S. (On/Off)",
    "others": null,
    "interface": "AV Output (NTSC), USB Multi",
    "shutterspeed": "approx. 8 - 1/1600 sec",
    "fileformats": "JPEG",
    "mp4actualrecordabletimemotionpictures": "approx. 45 min (HD)",
    "extraopticalzoomez": "11.8x (4",
    "remotecontrol": "None",
    "connectivity": "AV Output, USB 2.0",
    "flashmodes": "Auto Auto/Red-eye Reduction Forced On Off Slow Sync./Red-eye Reduction",
    "builtinflash": "Yes",
    "afmetering": "Face / AF Tracking / 23-area / 1-area",
    "fileformat": "Still Image",
    "warranty": "1 year warranty",
    "externalflashconnection": "None",
    "battery": "Rechargeable Lithium Ion Battery Pack",
    "recordingmedia": "Built-in Memory, SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "displayscreentype": "LCD Rear Screen",
    "digitalredeyecorrectionredeyeremoval": "Yes",
    "aspectratio": "1:1, 3:2, 4:3, 16:9",
    "burstrate": "Up to 1.5 fps at 14.1 MP",
    "operatingstoragetemperature": "N/A",
    "builtinmemory": "Approx.55MB",
    "aperture": "F3.1 - F5.9 / 2-Step (F3.1 / F9.0 (W), F5.9 / F16.0 (T))",
    "meteringmethod": "Multi",
    "hdvideorecording": null,
    "standardaccessories": null,
    "screensize": "3.0\"",
    "lcdmonitor": "3.0\" (7.5cm) TFT Screen LCD Display (230K dots) / Field of View",
    "cameratype": "Wi-Fi",
    "label40": "Both photo and video, in their original size, can be archived to registered digital equipment, like a PC or compliant Panasonic AV equipment, automatically via a home's wireless router when the camera's battery is being charged, eliminating the need to eject and re-insert the camera's SD Memory Card or connect the camera to a computer via USB cable",
    "label43": "Wi-Fi function also allows for playback of images on DLNA (Digital Living Network Alliance)-compliant VIERA HDTV?s",
    "label42": "Users can also save photos to the Panasonic exclusive cloud service, \"LUMIX CLUB\" and easily transfer images to Facebook, Flickr, Picasa, Twitter or YouTube",
    "label45": "Large, 3-inch Intelligent LCD screen with High Angle Mode that automatically adjusts the backlight based on the environment's lighting",
    "label47": "LUMIX Image Uploader",
    "label46": "USB power charging in addition to the conventional AC power supply",
    "recording": null,
    "effectivepixels": "14.1MP",
    "continuousshootingmode": "Full- Resolution Image",
    "imagestabilization": "Yes",
    "includedsoftware": "PHOTOfunSTUDIO 8.4 SE / Adobe Reader",
    "batterylifeapprox": "250 pictures (CIPA Standard)",
    "dimensionswxhxd": "104.1 x 57.6 x 20.8 mm / (4.10 x 2.27 x 0.82 inch)",
    "stillimagescenemode": "Portrait, Soft Skin, Scenery, Panorama Shot, Sports, Night Portrait, Night Scenery, Food, / Baby1, Baby2, Pet, Sunset, High Sensitivity, Glass Through, Photo Frame",
    "whitebalancemodes": "Auto, Cloudy, Daylight, Incandescent, Shade",
    "zoominmotionpicture": "Yes",
    "sensorsizetotalpixelsfilter": "1/2.33-inch CCD Sensor / 14.5 Total Megapixels / Primary Color Filter",
    "specifications": null,
    "microphonespeaker": "Mono / Mono",
    "sensortypesize": "1/2.33\" CCD",
    "lens": "LEICA DC VARIO-ELMAR / 9 elements in 7 groups / (4 Aspherical Lenses / 6 Aspherical surfaces)",
    "label22": "The 14.1 megapixel CCD sensor and Venus Engine processes high-quality images in both photo and video recording",
    "label20": "Sonic Speed AF (Auto Focus) helps users capture even the most fleeting photo opportunities",
    "label27": "To help ensure the LUMIX SZ5 is easy to use, the digital camera features Panasonic's popular iA (Intelligent Auto) mode",
    "label25": "A dedicated video button allows users to quickly switch between photo mode and video recording",
    "label24": "The LUMIX SZ5 records dynamic HD video in 1280x720 at 30p in MP4 format which can be played back directly on a PC or other portable electronics device without the need to convert the file",
    "label29": "For instance, iA includes Face Detection, AF Tracking, Intelligent ISO Control, Intelligent Scene Selector and Intelligent Exposure",
    "label28": "In iA mode, a suite of technologies are automatically engaged and the camera chooses the best setting based on the shooting environment",
    "exposure": "Auto (Program AE)",
    "colour": "Black",
    "wifi": "IEEE 802.11b/g/n / 2412MHz - 2462MHz (11ch) / Wi-Fi / WPA / WPA2 / Infurastracture mode / Wi-Fi Button",
    "exposuremodes": "Modes: Programmed Auto Compensation: -2 EV to +2 EV (in 1/3 EV steps)",
    "opticalzoom": "10.0x",
    "digitalzoom": "Max. 4x",
    "viewfindertype": "LCD Display",
    "afassistlamp": "Yes (On/Off )",
    "whitebalance": "Auto / Daylight / Cloudy / Shade / Incandescent / White Set"
}