{
    "attr": "More Fujifilm products",
    "category": "camera",
    "picturesize": "62 x 46mm",
    "shootingrangefocusingrange": "0.6m - ∞",
    "exposurecontrol": "Manual switching system (LED indicator in exposure meter)",
    "instantfilm": "Fujifilm Instant Color Film \"instax mini\"",
    "bodytext": "Home » More » Consumer Electronics » Digital Cameras » Fujifilm 355871 Fujifilm Instax Mini 8 Instant Camera - White [355871] Product may vary from image. Rely only on description for purchasing decisions. Our Price: $119.66 (Inc. GST) Availability: (Available) Est. Delivery: 1-3 days (No Pick-ups) Brand: Fujifilm Man. Part #: 355871 Our Part #: 355871 Calculate Delivery Cost Postcode: Product Quantity: We also recommend these add-ons: Product Price Add Qty Digital Camera Accessories Belkin F8K000-SML SMALL CAMERA CASE - BLACK $6.27 Canon EOSBAGS DSLR Backpack - Grey $48.00 FujiFilm Instax Mini 8 Instant Camera - White Overview Cute and compact body design available in five different colors! Simple operation for instant pictures Brightness adjustment dial You can take a high-key photo easily. Specifications Feature Descriptions Others Exposure counter (number of unexposed films), film pack confirmation window Instant Film Fujifilm Instant Color Film \"instax mini\" Picture size 62 x 46mm Shooting range / Focusing range 0.6m - ∞ Shutter Shutter speed: 1/60 sec. Exposure control Manual switching system (LED indicator in exposure meter) Flash Constant firing flash (automatic light adjustment) Recycle time: 0.2 sec. to 6 sec. (when using new batteries), Effective flash range: 0.6m - 2.7 m Power Supply Two LR6/AA-size 1.5V alkaline batteries Capacity: 10 film packs (based on our company research) Dimensions & Weight 116mm x 118.3mm x 68.2mm / 307g (without batteries, strap and film pack) Manufacturer Website: Fujifilm Instax Mini 8 Instant Camera White Bookmark/Share Fujifilm Instax Mini 8 Instant Camera White Product Page Print Fujifilm Instax Mini 8 Instant Camera White Product Page Ask Us About Fujifilm Instax Mini 8 Instant Camera White Price Match Fujifilm Instax Mini 8 Instant Camera Whitebody_text_eof //",
    "flash": "Constant firing flash (automatic light adjustment) Recycle time: 0.2 sec. to 6 sec. (when using new batteries), Effective flash range: 0.6m - 2.7 m",
    "powersupply": "Two LR6/AA-size 1.5V alkaline batteries Capacity: 10 film packs (based on our company research)",
    "feature": "Descriptions",
    "product": "PriceAddQty",
    "ourprice": "$119.66 (Inc. GST)",
    "others": "Exposure counter (number of unexposed films), film pack confirmation window",
    "shutter": "Shutter speed: 1/60 sec.",
    "ourpart": "355871",
    "dimensionsweight": "116mm x 118.3mm x 68.2mm / 307g (without batteries, strap and film pack)",
    "availability": "(Available)",
    "categories": "BRANDS"
}