{
    "attr": "More Sony products",
    "batterysystem": "Lithium N",
    "imagerotation": "YES",
    "exposurecontrol": "± 2.0EV, 1/3EV step",
    "pictbridge": "NO",
    "indexplayback": "16 / 25 images (Folder)",
    "effectivepixelsmegapixels": "Approx. 12.1 Megapixels",
    "attr2dpanorama": "7,152 x 1,080(231deg) / 4,912 x 1,080(158deg) / 4,912 x 1,920(165deg) / 3,424 x 1,920(115deg)",
    "apertureprioritymode": "NO",
    "autofocusareaflexiblespot": "NO",
    "autofocusareacentreweighted": "YES",
    "flashmode": "Auto / Flash On / Slow Synchro / Flash Off",
    "lcdscreensizeinches": "6.7cm (2.7type)",
    "lightmeteringspot": "YES",
    "histogramindicator": "NO",
    "autofocusareamultipoint": "9 points (Under Face Undetected)",
    "availability": "SOLD OUT (Not In Stock)",
    "suppliedaccessories": "Rechargeable Battery Pack(NP-BN1), Battery charger, UAB Cable, Wrist strap, CD-ROM",
    "category": "camera",
    "bodytext": "Home » More » Consumer Electronics » Digital Cameras » Sony DSCW510S Sony Cybershot DSCW510S 12.1 Megapixel Digital Camera [DSCW510S] Product may vary from image. Rely only on description for purchasing decisions. Our Price: $131.78 (Inc. GST) Availability: SOLD OUT (Not In Stock) Est. Delivery: + 1-3 days (No Pick-ups) Brand: Sony Man. Part #: DSCW510S Our Part #: DSCW510S Calculate Delivery Cost Postcode: Product Quantity: Silver colour, 12.1 Megapixels, 4x Optical Zoom, 26mm wide angle, High sensitivity ISO3200 Overview Light, compact and comfortable to carry, the Sony Cyber-shot™ W510 Digital Camera is your perfect companion for holidays, family get-togethers and more. Superb image quality is teamed with simple, uncluttered operation - even if you're a first-time digital camera user. Experience the whole picture Now it's easy to grab breathtaking wide-screen views of that landscape or city scene. Sweep Panorama mode shoots a high-speed burst of frames as you sweep the camera from side to side (or up and down!). Images are stitched together automatically by the camera to create one amazing panoramic image. Better looking pictures made easy Not sure how to pick the perfect camera settings to suit a particular scene? Don’t worry, help is at hand. Intelligent Auto (iAUTO) mode automatically adjusts exposure and other camera settings for optimum results in a wide range of shooting situations. Upload the moment Upload those memories to your favourite sharing sites on the web with a few mouse clicks. PMB Portable software inside the camera lets you select and transfer photos and video clips to any web-connected PC: it’s great if you’re travelling and have a few minutes to drop into the nearest web café. Beautiful portraits made simple Capture beautiful, smiling portraits of friends and family without fuss. Enhanced Face Detection automatically adjusts camera settings for clear, crisp results with natural skin tones. Smile Shutter fires the shutter automatically when your subject smiles to capture those happy moments. Pack more into every scene Dramatic landscapes, architectural shots, interiors and even family scenes can produce disappointing results when a scene gets cut off at the edges. A wide angle lens lets you pack more into the picture without having to stand further back from the subject Key Features 12.1 effective megapixels CCD sensor - Captures high quality images for detail-packed enlargements 4x optical zoom with 26mm wide angle - High quality zoom lens covers wide range of shooting situations, with wide angle for group shots/landscapes Sweep Panorama - Just press the shutter and sweep the camera: automatically combines a burst of images to create extra-wide panoramic pictures Intelligent Auto Mode - Camera recognises common shooting situations, optimising settings for clear, natural results without fuss Movie record - Shoot crisp, clear video clips with sound: enjoy on connected TV (needs AV cable) SteadyShot - Electronic image stabilisation ensures clearer handheld images with reduced blur 6.7cm/2.7\" Clear Photo LCD - Clear Photo LCD screen (230k dot resolution) offers excellent detail, high contrast and wide viewing angle High sensitivity ISO 3200 - Reduces blur when shooting handheld. Combined for high quality, low noise images even at twilight Face Detection - Automatically adjusts focus, exposure and white balance for clearer portraits: priority selectable for children/adults Smile Shutter - Automatically fires shutter when subject smiles: with adjustable smile threshold and priority selectable for children/adults Specifications Lens Optical Zoom 4x Precision Digital Zoom Approx.8x (Total) Smart Zoom up to 25x (with VGA) F 2.8-5.9 Focal Length (f= mm) 4.7-18.8 Focal Length (f=35mm conversion) 26-105 Macro (cm) iAuto(W:Approx.4cm(0.13') to Infinity. T:Approx.60cm(1.97') to Infinity) Image Sensory CCD Type Super HAD CCD Size (Inches) 1/2.3 type(7.79mm) Camera Effective Pixels (Mega Pixels) Approx. 12.1 Megapixels Bionz Processor YES Face Detection YES Smile Shutter YES Sweep Panorama YES Intelligent Sweep Panorama NO Underwater Sweep Panorama NO 3D Sweep Panorama NO Clear RAW NR YES Auto Focus Area (Multi Point) 9 points (Under Face Undetected) Auto Focus Area (Centre weighted) YES Auto Focus Area (Spot) YES Auto Focus Area (Flexible Spot) NO Manual Focus NO Aperture Auto Mode YES Aperture Priority Mode NO Aperture Manual Mode NO Shutter Speed Auto Mode (sec) iAuto(2\" - 1/1,500) / Program Auto(1\" - 1/1,500) NR Slow Shutter 1/3sec or slower Hand Shake Alert YES Exposure Control ± 2.0EV, 1/3EV step White Balance Auto, Daylight, Cloudy, Fluorescent1, Fluorescent2, Fluorescent3, Incandescent, Flash Automatic White Balance YES Light Metering (Multi Pattern) YES Light Metering (Centre weighted) YES Light Metering (Spot) YES ISO Sensitivity (REI) YES (Auto / 80 / 100 / 200 / 400 / 800 / 1600 / 3200) Scene Selection NO AF Illuminator NO SteadyShot SteadyShot capability YES Optical SteadyShot capability NO Built-In-Flash Flash Mode Auto / Flash On / Slow Synchro / Flash Off Pre-flash YES Red-Eye Correction Auto / On / Off Auto Daylight Synchronized Flash YES Distance limitations using Flash (m) ISO Auto: Approx.0.2 - Approx.4.8m(Approx.'-Approx.')(W) / Approx.0.2 - Approx.2.3 m(Approx.'-Approx.')(T), ISO3200: up to Approx.6.0 m(Approx.19.69')(W) / Approx.3.0 m(Approx.9.84')(T) LCD Viewfinder LCD Screen Size (inches) 6.7cm (2.7type) LCD Total Dots Number 230.4 Monitor Type TFT Recording Recording Media Memory Stick™ Duo / Memory Stick PRO Duo™ / Memory Stick PRO Duo™ High Speed (No Speed Advantage) / Memory Stick PRO-HG Duo™ (No Speed Advantage) Recording Media II SD Memory Card(Class2 or Higher for movie), SDHC Memory Card(Class2 or Higher for movie) Recording Format JPEG DCF (Design rule for Camera File System) YES DPOF (Digital Print Order Format) YES Burst Mode (shots) Approx.1.17 fps(100 shots) Burst Interval (approximately sec) Approx.0.85 sec.(100 shots) Still Image size (16M 4608 x 3456) NO Still Image size (14M 4320 x 3240) NO Still Image size (13M 4224 x 3168) NO Still Image size (12M 4000 x 3000) YES Still Image size (10M 3648 x 2736) NO Still Image size (9.0M, 3456 x 2592) NO Still Image size (8.0M, 3264 x 2448) YES Still Image size (7.2M 3072 x 2304) NO Still Image size (5.0M, 2592 x 1944) YES Still Image size (3.1M, 2048 x 1536) NO Still Image size (VGA, 640 x 480) YES Still Image size (16:9 mode, 1920 x 1080) YES Still Image size (16:9 mode, 4,320 x 2,432) NO Still Image size (16:9 mode, 4000 x 2248) YES Still Image size (3:2 mode, 4000 x 2672) NO Still Image size (3:2 mode 3648 x 2432) NO Still Image size (3:2 mode 3456 x 2304) NO 2D Panorama 7,152 x 1,080(231deg) / 4,912 x 1,080(158deg) / 4,912 x 1,920(165deg) / 3,424 x 1,920(115deg) 3D Panorama NO Moving Image Size (1280x720 30fps Fine Approx.9Mbps) NO Moving Image Size (1280x720 30fps Standard Approx.6Mbps) NO Moving Image Size (640x480 30fps Approx.3Mbps) YES Moving Image Size (320x240 30fps) YES Playback/ Edit HD (High Definition) Playback Under 12M(4,000 x 3,000) Slideshow Playback YES Slideshow with Music NO Slideshow Movie NO Trimming YES Playback Zoom YES (8x) Cue & Review (MPEG) YES Index Playback 16 / 25 images (Folder) Image Rotation YES Auto Image Rotation YES Auto grouping and & Best Picture Recognition NO General Battery Remaining Indicator YES Histogram Indicator NO Exposure Warning Indicator NO Disk / Memory Stick remaining indicator YES PTP (Picture Transfer Protocol) NO Print Image Matching YES PictBridge NO Shop Front Mode YES Start up time (approximately sec) Approx. 1.7sec Menu Language English, French, German, Spanish, Italian, Portuguese, Dutch, Swedish, Norwegian, Danish, Finnish, Polish, Czech, Hungarian , Turkish, Greek, Bulgarian, Croatian, Romanian Jacks Multi use Terminal with HD AV(SD)/USB Multi use Terminal YES USB 2.0 High-speed Power/ Others Battery System Lithium N Supplied Battery NP-BN1 Stamina (normal conditions) 220 shots, 110min (CIPA standard with LCD screen on) Battery for Clock Lithium (MS412) Weight (g) Approx. 103g (3.6oz.) Weight with Accessories (g) Approx. 119g (4.2oz.) Supplied Software Picture Motion Browser (Windows only) Supplied accessories Rechargeable Battery Pack(NP-BN1), Battery charger, UAB Cable, Wrist strap, CD-ROM Dimensions Width (mm) 96 Height (mm) 54 Depth (mm) 19.9 Manufacturer Website: Sony Cybershot DSCW510S 12.1 Megapixel Digital Camera Customers who bought Sony Cybershot DSCW510S 12.1 Megapixel also purchased Team TG008G0SD26X 8GB Class 6 SDHC Card [TG008G0SD26X] JT2313_SD-K04GR6W4 Hot Wheels Digital Camcorder + 8GB SD Memory Card [JT2313_SD-K04GR6W4] Bookmark/Share Sony Cybershot DSCW510S 12.1 Megapixel Digital Camera Product Page Print Sony Cybershot DSCW510S 12.1 Megapixel Digital Camera Product Page Ask Us About Sony Cybershot DSCW510S 12.1 Megapixel Digital Camera Price Match Sony Cybershot DSCW510S 12.1 Megapixel Digital Camerabody_text_eof //",
    "sceneselection": "NO",
    "autodaylightsynchronizedflash": "YES",
    "facedetection": "YES",
    "playbackzoom": "YES (8x)",
    "weightg": "Approx. 103g (3.6oz.)",
    "heightmm": "54",
    "clearrawnr": "YES",
    "manualfocus": "NO",
    "bionzprocessor": "YES",
    "shopfrontmode": "YES",
    "depthmm": "19.9",
    "recordingformat": "JPEG",
    "sweeppanorama": "YES",
    "aperturemanualmode": "NO",
    "slideshowmovie": "NO",
    "precisiondigitalzoom": "Approx.8x (Total)",
    "afilluminator": "NO",
    "autofocusareaspot": "YES",
    "ccdtype": "Super HAD CCD",
    "lightmeteringmultipattern": "YES",
    "trimming": "YES",
    "lightmeteringcentreweighted": "YES",
    "apertureautomode": "YES",
    "focallengthfmm": "4.7-18.8",
    "slideshowwithmusic": "NO",
    "suppliedsoftware": "Picture Motion Browser (Windows only)",
    "nrslowshutter": "1/3sec or slower",
    "multiuseterminal": "YES",
    "smileshutter": "YES",
    "automaticwhitebalance": "YES",
    "suppliedbattery": "NP-BN1",
    "monitortype": "TFT",
    "redeyecorrection": "Auto / On / Off",
    "distancelimitationsusingflashm": "ISO Auto: Approx.0.2 - Approx.4.8m(Approx.'-Approx.')(W) / Approx.0.2 - Approx.2.3 m(Approx.'-Approx.')(T), ISO3200: up to Approx.6.0 m(Approx.19.69')(W) / Approx.3.0 m(Approx.9.84')(T)",
    "ourpart": "DSCW510S",
    "menulanguage": "English, French, German, Spanish, Italian, Portuguese, Dutch, Swedish, Norwegian, Danish, Finnish, Polish, Czech, Hungarian , Turkish, Greek, Bulgarian, Croatian, Romanian",
    "categories": "BRANDS",
    "shutterspeedautomodesec": "iAuto(2\" - 1/1,500) / Program Auto(1\" - 1/1,500)",
    "dpofdigitalprintorderformat": "YES",
    "isosensitivityrei": "YES (Auto / 80 / 100 / 200 / 400 / 800 / 1600 / 3200)",
    "recordingmedia": "Memory Stick™ Duo / Memory Stick PRO Duo™ / Memory Stick PRO Duo™ High Speed (No Speed Advantage) / Memory Stick PRO-HG Duo™ (No Speed Advantage)",
    "handshakealert": "YES",
    "f": "2.8-5.9",
    "attr3dsweeppanorama": "NO",
    "opticalzoom": "4x",
    "whitebalance": "Auto, Daylight, Cloudy, Fluorescent1, Fluorescent2, Fluorescent3, Incandescent, Flash",
    "usb20": "High-speed",
    "underwatersweeppanorama": "NO",
    "widthmm": "96",
    "preflash": "YES",
    "intelligentsweeppanorama": "NO",
    "ourprice": "$131.78 (Inc. GST)",
    "autoimagerotation": "YES"
}