{
    "modelname": "WB250F",
    "minimumdiopteradjustment": "No",
    "exposurecontrol": "Program AE; Aperture Priority AE; Shutter Priority AE; Manual",
    "batterybuiltin": "No",
    "color": "Red",
    "audioformatssupported": "AAC",
    "isosensitivity": "Auto; ISO 100; ISO 200; ISO 400; ISO 800; ISO 1600; ISO 3200",
    "longestshutterspeed": "16 Second",
    "wificonnectivity": "Lets you connect your digital camera to a wireless network. Save photos and videos directly to a computer or cloud service while you shoot, email them print them wireless or upload them straight to Facebook® or YouTube™. You will never have to worry about losing a great shot, running out of storage or remembering to bring the correct cable along.",
    "height": "2.4\"",
    "analogvideoout": "Yes",
    "smartmode": "Stop being jealous of the pros with their big cameras, and start taking great shots. A quick tap of Smart Mode and you’re set with various special modes. Capture perfect trails of light at night on a busy intersection full of red taillights or instantly capture a high-speed scene with Action Freeze.",
    "maximumimageresolution": "4320 x 3240",
    "producttype": "Compact Camera",
    "remoteviewfinder": "Control your camera – even from 30 feet away – by using your Smartphone as the Viewfinder. Available for select Smartphones, the Remote Viewfinder App lets you preview images, adjust the camera settings, zoom in and out, frame the scene, and tag the shot with the location – all from your phone, wirelessly. Take the perfect group shot every time, even when you’re in it.",
    "autoshare": "Connect your Samsung Smart Camera to your Smartphone and activate AutoShare – and the pictures you take automatically get sent to your Smartphone.",
    "batterytype": "Lithium Ion (Li-Ion)",
    "batterymodelsupported": "SLB-10A",
    "features": "Continuous Shooting Mode; Live View; Face Detection; Smile Detection; Blink Detection",
    "category": "camera",
    "pcautobackup": "Save images to your computer in a snap. You can wirelessly transfer photos and movies to your PC – even if the computer is turned off. With one simple setting, the camera can turn on any PC with Wake-on LAN functionality. When your images are saved, the camera can shut down the computer to save energy as well as your memories.",
    "minimumfocusdistance": "1.97\"",
    "usb": "Yes",
    "batterylife": "300 Shot/2 Hour Video",
    "numberofbatteriessupported": "1",
    "portalsupported": "Yes",
    "depth": "0.9\"",
    "shortestshutterspeed": "1/2000 Second",
    "selftimer": "2 Second; 10 Second",
    "width": "4.2\"",
    "digitalzoom": "5x",
    "effectivecameraresolution": "14.2 Megapixel",
    "maximumframerate": "30 fps",
    "externalflash": "No",
    "imagesensorsize": "1/2.33\" (0.24\" x 0.18\")",
    "flashmemorycapacity": "25 MB",
    "maximumvideoresolution": "1920 x 1080",
    "wideangle": "Yes",
    "whitebalancemodes": "Auto WB; Daylight; Cloudy; Fluorescent_H; Fluorescent_L; Tungsten; Custom; K",
    "gps": "No",
    "aspectratio": "16:9",
    "cameramodes": "Shooting Modes: ; Auto; Smart; Magic plus; Best Face; Wi-Fi; Settings; Portrait; Night Portrait; Night; Backlight Portrait; Backlight; Landscape; White; Macro; Macro Text; Tripod; Action; Macro Color; Natural Green; Blue Sky; Sunset; Fireworks; Lowlight; Spotlight; Spotlight Macro; Spotlight Portrait",
    "touchscreen": "Yes",
    "softwareincluded": "Intelli-Studio",
    "wirelesslan": "Yes",
    "rechargeable": "Yes",
    "focallength": "4 mm to 72 mm",
    "maximumdiopteradjustment": "No",
    "weight": "6.49 oz",
    "attr2dpanorama": "Capture the sweeping beauty of a natural landscape or the grandeur of a vast skyline. The WB800F panoramic capabilities let you catch every detail on the horizon with the push of a button.",
    "sensortype": "BSI CMOS",
    "focusmodes": "Auto; Manual",
    "brandname": "Samsung",
    "builtindevices": "Speaker; Microphone",
    "videoformats": "MP4; MPEG-4 AVC; H.264",
    "batterysizesupported": "Proprietary Battery Size",
    "mobilelink": "Permits the sharing of digital photographs and videos with select Android Phones. Just capture the photo using the Smart Cameras’ superior optics and then send images directly from your Samsung Smart Camera to any Android 2.2 or higher devices with the Samsung MobileLink App.",
    "focallength35mmequivalent": "24 mm to 432 mm",
    "manufacturer": "QW2301",
    "lcdsize": "3\"",
    "imagestabilization": "Optical",
    "imageformats": "JPEG",
    "displayresolution": "460000 Pixel",
    "flashmodes": "Auto Flash; Flash OFF; Flash ON; Slow Sync; Red-eye Fix; Red-eye Reduction",
    "builtinflash": "Yes",
    "hdmoviemode": "Yes",
    "megapixels": "16.4 Megapixel",
    "opticalzoom": "18x",
    "productname": "WB250 SMART Camera 14.2MP (Red)",
    "memorycardsupported": "Secure Digital (SD) Card; Secure Digital Extended Capacity (SDXC); Secure Digital High Capacity (SDHC) Card; Secure Digital Standard Capacity (SDSC)",
    "item": "601561",
    "certificationsstandards": "CE",
    "batteryincluded": "Yes",
    "viewfindertype": "LCD",
    "ecolabel": "WEEE; RoHS",
    "platformsupported": "PC; Mac",
    "aperturerange": "f/3.2 to 5.8"
}