{
    "wirelesslanstandard": "IEEE 802.11b/g/n",
    "modelname": "NX30",
    "minimumdiopteradjustment": "-4",
    "exposurecontrol": "Program AE; Aperture Priority; Shutter Priority; Manual",
    "weight": "2.15 lb",
    "numberofbatteriessupported": "1",
    "color": "Black",
    "audioformatssupported": "AAC",
    "isosensitivity": "Auto; ISO 100; ISO 200; ISO 400; ISO 800; ISO 1600; ISO 3200; ISO 6400; ISO 12800; ISO 25600",
    "longestshutterspeed": "30 Second",
    "height": "3.8\"",
    "analogvideoout": "Yes",
    "softwareincluded": "Adobe Photoshop Lightroom 5; iLauncher",
    "maximumimageresolution": "5472 x 3648",
    "producttype": "Mirrorless Camera",
    "wifisocialsharing": "Show off a fabulous selfie with the rest of the world in no time flat. As long as you have a Wi-Fi connection, you can post images and videos directly to Facebook, YouTube, and now Flickr. Tag and add comments, too. You can also upload photos right to your blog, or email them to your family. Feel free to keep shooting, because your SMART CAMERA also comes with 2GB of free Dropbox web storage or 50GB if you have a GALAXY smartphone.",
    "productseries": "NX",
    "batterymodelsupported": "BP1410",
    "features": "Near Field Communication (NFC); Face Detection; Live View; Orientation Sensor; Continuous Shooting Mode; External Flash Shoe",
    "category": "camera",
    "pcautobackup": "Wirelessly transfer photos and movies to your PC or Mac. Simply select PC Auto Backup and you're all set. All your photos and videos are wirelessly transferred and safely stored on your computer. Feel free to delete photos from your camera knowing there's a duplicate set on your computer.",
    "minimumfocusdistance": "11.02\"",
    "productline": "Smart",
    "usb": "Yes",
    "languagesupported": "English; Danish; German; Dutch; Swedish; Spanish; Italian; Czech; French; Portuguese; Brazilian (Portuguese); Polish; Finnish; Russian; Chinese (Simplified and Traditional); Arabic; Persian; Korean; Turkish; Hebrew; Thai; Greek; Hungarian; Estonian; Lithuanian; Latvian; Serbian; Croatian",
    "autofocuspoints": "247",
    "wifigroupshare": "From family brunches to nights out with friends, you can take the shots that all your friends and family members want copies of with your Samsung SMART CAMERA. Use Group Share to send images to up to four people simultaneously. Since Group Share eliminates the frustration of having to repeat the sharing process over and over again, you have more time for taking share-worthy snaps",
    "depth": "1.6\"",
    "shortestshutterspeed": "1/8000 Second",
    "selftimer": "2 Second; 30 Second",
    "width": "5\"",
    "flashmodes": "Auto Flash; Flash OFF; Flash ON; Red-eye Reduction; Front Curtain Sync; Rear Curtain Sync; Smart Flash; Flash Exposure Compensation",
    "maximumframerate": "60 fps",
    "imagesensorsize": "0.93\" x 0.62\"",
    "digitalzoom": "2x",
    "samsunglink": "Effortlessly save every moment you’ve captured. Samsung Link instantly and wirelessly streams your photos your PC or favorite web storage service such as Dropbox. No more waiting to go home to manually upload images. With one touch, you can show off photos and videos on your Smart TV or send them to any compatible smartphone. Sharing has never been this easy.",
    "maximumvideoresolution": "1920 x 1080",
    "whitebalancemodes": "Auto; Daylight; Cloudy; Fluorescent (W, N, D); Tungsten; Flash; Custom; K(Manual)",
    "effectivecameraresolution": "20.3 Megapixel",
    "aspectratio": "16:9",
    "cameramodes": "Shooting Modes: ; Smart Auto; Custom1; Custom 2; Lens Priority; Smart; Wi-Fi",
    "wirelesslan": "Yes",
    "autoshare": "Save every photo you take with your smartphone. After you set it up, Samsung AutoShare will automatically send every snap instantly to your smartphone or tablet via Wi-Fi that is powered by NFC technology. Using your smartphone, AutoShare also GPS-tags your photos. Sharing your treasured memories couldn’t be any faster—or easier.",
    "hdmi": "Yes",
    "focallength": "18 mm to 55 mm (Lens 1)",
    "lensconstruction": "12 Elements in 9 Groups",
    "maximumdiopteradjustment": "1",
    "imagestabilization": "Optical",
    "sensortype": "CMOS",
    "filterattachmentdiameter": "58 mm",
    "focusmodes": "Auto; Manual",
    "brandname": "Samsung",
    "lensmounttype": "Samsung NX",
    "builtindevices": "Microphone; Speaker",
    "videoformats": "MP4",
    "batterysizesupported": "Proprietary Battery Size",
    "mobilelink": "Now you can select and send photos or albums directly to a smartphone or tablet with Samsung Mobile Link. No Wi-Fi hotspot is required; the wireless connection is enabled by NFC technology. You don't even have to send the photos as a text message or an email. With Mobile Link, you can control the album on your phone and the changes will be saved to your camera, too.",
    "focallength35mmequivalent": "27.70 mm to 84.70 mm (Lens 1)",
    "manufacturer": "TW8214",
    "lcdsize": "3\"",
    "ecolabel": "WEEE; RoHS",
    "touchscreen": "Yes",
    "imageformats": "JPEG; RAW; MPO",
    "displayresolution": "1036000 Pixel",
    "photobeam": "When a friend wants a copy of that really great shot you took of her, now you can share it right away. Samsung Photo Beam lets you send photos to anybody with just the touch of your camera. Simply tap your SMART Camera on any NFC-compatible smartphone to automatically share whichever image you’re currently viewing. It’s that simple.",
    "builtinflash": "Yes",
    "aperturerange": "f/3.5 to 5.6",
    "megapixels": "21.6 Megapixel",
    "opticalzoom": "3.1x",
    "productname": "Smart Camera NX30",
    "memorycardsupported": "Secure Digital (SD) Card; Secure Digital Extended Capacity (SDXC UHS-I); Secure Digital Extended Capacity (SDXC); Secure Digital High Capacity (SDHC UHS-I); Secure Digital High Capacity (SDHC) Card",
    "item": "602029",
    "certificationsstandards": "CE; FCC",
    "hdmoviemode": "Yes",
    "viewfindertype": "AMOLED",
    "gps": "No",
    "platformsupported": "PC; Mac",
    "cameraassembly": "Body with Lens Kit"
}