{
    "imagestabilization": "Yes",
    "superiorautomode": "Get cleaner, more dynamic pictures and fewer missed shots. The camera automatically recognizes the correct scene mode, then quickly shoots and combines up to six shots to produce images with greater clarity, optimum dynamic range using backlight correction HDR technology and lower image noise using 6 shots layering technology. Superior Auto intelligently detects 33 scenes for still images and 44 scenes for movies, making it easy to get the best shot.",
    "color": "Black",
    "facedetectiontechnology": "Sony\u0092s Face Detection technology can automatically distinguish between children and adults. Face Detection technology detects up to eight individual faces and adjusts flash, focus, exposure, and white balance to help deliver crisp, properly lit images of family and friends.",
    "backgrounddefocus": "DSLR photographs are often beautiful because they blur the background, putting the emphasis on your subject. Now our point-and-shoot cameras can deliver this signature DSLR benefit. The system takes two shots, identifies the background and applies a defocused background keeping the subject crisp and clear.",
    "lcddisplayinches": "3.0\"",
    "opticalzoom": "16 x",
    "softskinmode": "Portrait subjects will love the results. Soft Skin mode recognizes skin tones and reduces the appearance of blemishes and wrinkles without affecting the rest of the shot.",
    "antiblinkfunction": "It\u0092s frustrating to capture the perfect shot, only to review it later and discover subjects blinked during the photo. When the camera is set to Soft Snap, the Anti-blink function captures two images, recording only the photo with less squinting or blinking. If a blink is detected in other shooting modes, a warning will be displayed after you take the shot.",
    "nsiprotectionplus3yearextendedwarrantyfordigitalcameras": "$49.99",
    "intelligentsweeppanoramamode": "With Intelligent Sweep Panorama\u0099 mode just press the shutter, pan the landscape and let the camera do the rest. It automatically links together each frame to produce a high resolution panoramic image providing the ability to zoom in on small details. This model even detects faces and moving subjects to stitch intelligently different widths to help avoid subject distortion.",
    "naturalflash": "Conventional point-and-shoot camera flash shots just don't capture colors the way the eye sees them. Natural Flash mode takes a reference shot without flash and then uses that reference to correct the color, for far more lifelike images.",
    "availability": "In Store Only , Call for Availability",
    "hdmioutput": "The High-Definition Multimedia Interface® (HDMI) is a compact audio/video connector interface for transmitting uncompressed digital streams. HDMI connects digital audio/video sources such as a compatible camcorder, Blu-ray Disc\u0099 player, a personal computer, a video game console, or an AV receiver to a compatible digital audio device and/or video monitor such as a digital television (DTV). Easily connect your Cyber-shot® camera via HDMI cable to any compatible HDMI compatible device to easily enjoy and upload content.",
    "category": "camera",
    "attr162megapixelbackilluminatedexmorrcmosimagesensor": "The DSC-HX9V features a 16.2 megapixel Exmor R\u0094 CMOS image sensor that brings out the full resolving power of the camera\u0092s Sony® G lens to deliver extremely fast speed, high resolution, and stunning low-light sensitivity with improved image clarity and drastically reduced grain. In addition, the combined Exmor R\u0094 CMOS sensor and BIONZ® image processor delivers extremely fast up to 10fps, Anti Motion Blur, Hand-held Twilight and 1080p movie modes.4",
    "motiondetection": "It\u0092s frustrating to capture the perfect shot, only to review it later and discover subjects blinked during the photo. When the camera is set to Soft Snap, the Anti-blink function captures two images, recording only the photo with less squinting or blinking. If a blink is detected in other shooting modes, a warning will be displayed after you take the shot.",
    "compatiblewithpcandmacsystems": "The Full HD video captured with the DSC-HX9V can be used with the provided Picture Motion Browser software for PC and iMovie® (sold separately) for Mac® systems.",
    "backlightcorrectionhdr": "Don\u0092t miss a single detail in high contrast shots. The built in backlight correction analyzes the image and automatically adjusts accordingly to give you a perfectly lit shot. Backlight Correction HDR helps correct for this by taking three pictures at different exposure settings and processing the best elements of each into a single image for more natural looking shots.",
    "sensor": "16.2 Megapixel",
    "attr3dstillimageand3dsweeppanoramamode": "Produce awe-inspiring images with 3D still image and 3D Sweep Panorama\u0099 capabilities.4 Photos will take on a new dimension of creative capabilities for viewing the world in a whole new way.",
    "storagememory": "MS Pro/SD",
    "rechargablebattery": "NP-BG1",
    "part": "DSC-HX9V/B",
    "includessonypmbportablesoftware": "With the pre-installed Picture Motion Browser (PMB) Portable the DSC-HX9V makes it easy to pre-select videos and images in the camera and conveniently upload them from the camera to a compatible PC and popular Internet sharing sites without the need for any additional software to install.²",
    "includessonypmbpicturemotionbrowsersoftwarever55": "Sony Picture Motion Browser software offers a simple, intuitive way to transfer, sort, and view your video and still images on your compatible PC. In addition, multiple output options let you burn your memories to DVD using an external DVD burning device (sold separately), as well as take advantage of one click upload to a number of popular video and photo sharing sites (such as Facebook® and Sony\u0092s Personal Space\u0099 site).",
    "isospeed": "100-3200",
    "computerinterface": "USB 2.0",
    "type": "Point & Shoot",
    "megapixels": "16.2",
    "nsiprotectionplus5yearextendedwarrantyfordigitalcameras": "$69.99",
    "digitalzoom": "Capturing the right shot at the right moment has never been so easy. Digital zoom brings you right close up to the action so you can get that perfect shot, every time.",
    "nsiprotectionplus2yearextendedwarrantyfordigitalcameras": "$29.99",
    "smileshuttertechnology": "Smile Shutter\u0099 technology captures a smile the moment it happens. Simply press the Smile Shutter\u0099 button and the camera does the rest. You can also select adult and child priority and indicate the degree of Smile Detection sensitivity. Intelligent Scene Recognition can be used together with Smile Shutter\u0099 mode. This means that beautiful smiles can be captured with settings optimized for the particular scene, even in difficult conditions such as twilight and backlighting.",
    "opticalsteadyshotimagestabilization": "Optical SteadyShot\u0099 image stabilization uses a built-in gyro sensor to detect camera shake and automatically shifts the lens to help prevent blur without sacrificing image quality."
}