{
    "incameraretouchingtools": "Retouch and enhance your photos on the go with in-camera Trimming, Red-Eye Correction, and Unsharp Masking functions",
    "phototvhd": "Bring your photos to life and enjoy highly detailed, high definition images with PhotoTV HD-capable Sony® BRAVIA® HDTVs. PhotoTV HD fine tunes settings on your PhotoTV HD enabled BRAVIA HDTV, such as sharpness, gradation, and color to display images that look more like printed photos.5",
    "imagestabilization": "Yes",
    "facedetectiontechnology": "Sony\u0092s Face Detection technology can automatically distinguish between children and adults. Face Detection technology detects up to eight individual faces and adjusts flash, focus, exposure, and white balance to help deliver crisp, properly lit images of family and friends.",
    "lcddisplayinches": "3.0\"",
    "nsiprotectionplus5yearextendedwarrantyfordigitalcameras": "$69.99",
    "softskinmode": "Your portrait subjects will thank you for this. Soft Skin mode recognizes skin tones and reduces the appearance of blemishes and wrinkles without affecting the rest of the shot.",
    "antiblinkfunction": "It\u0092s frustrating to think you\u0092ve captured that perfect shot, only to review it later and discover one of your subjects blinked just as you pressed the shutter. When the camera is set to Soft Snap, the Anti-blink function captures two images, recording only the photo with less squinting or blinking. If a blink is detected in other shooting modes, a warning will be displayed after you take the shot.",
    "nsiprotectionplus3yearextendedwarrantyfordigitalcameras": "$49.99",
    "availability": "In Store Only , Call for Availability",
    "motiondetection": "Motion Detection, along with Face Motion Detection adjusts ISO sensitivity and increases the shutter speed when movement is detected, reducing blur in moving subjects and faces.",
    "transferjettechnology": "TransferJet\u0099 technology, developed by Sony® and advanced and promoted by consortium of 18 other companies, allows you to transfer files between two TransferJet enabled devices just by touching them together, without the hassle of hunting for cables or the complication of pairing.",
    "sensor": "14.1 Megapixel",
    "category": "camera",
    "storagememory": "MS Pro/SD",
    "sweeppanoramamode": "Reach beyond the traditional wide angle lens, and capture more breathtaking shots with Sweep Panorama Mode. Simply press the shutter button and sweep the camera in the desired direction and the camera continuously shoots at a high speed, then seamlessly stitches the images together with automatic position adjustment to create one stunning panoramic image. Available in wide and ultra-wide options, the camera can take panoramic shots of up to 265 degrees. Now capturing wide landscapes is as easy as press and sweep.",
    "scenemodes": "The DSC-T99 features 13 convenient scene modes",
    "part": "DSC-T99S",
    "computerinterface": "USB 2.0",
    "type": "Point & Shoot",
    "megapixels": "14.1",
    "opticalzoom": "4 x",
    "digitalzoom": "4.7 x",
    "nsiprotectionplus2yearextendedwarrantyfordigitalcameras": "$29.99",
    "smileshuttertechnology": "Smile Shutter\u0099 technology captures a smile the moment it happens. Simply press the Smile Shutter\u0099 button and the camera does the rest. You can also select adult and child priority and indicate the degree of Smile Detection Sensitivity. Intelligent Scene Recognition can be used together with Smile Shutter\u0099 mode. This means that beautiful smiles can be captured with settings optimized for the particular scene, even in difficult conditions such as twilight and backlighting.",
    "opticalsteadyshotimagestabilization": "Optical SteadyShot\u0099 image stabilization uses a built-in gyro sensor to detect camera shake and automatically shifts the lens to help prevent blur without sacrificing image quality."
}