{
    "usablelenses": "PENTAX KAF3, KAF2 (power zoom   not compatible), KAF, K-mount (with restrictions) lenses ; compatible with   SDM ultrasonic lenses Compatible with S-mount lenses, 67 / 645 / M-42 lenses (adapters ref 37954,   38455 or 30120 required with restrictions)",
    "meteringrange": "EV-3 to EV 18 (at Standard ISO 100/at normal temperature)",
    "sensitivity": "Auto, Manual: ISO 100 to 12800 (1/3EV, 1/2EV or 1EV steps) Extended sensitivity: from ISO 80 to 51200 Bulb mode: up to ISO 1600",
    "fieldofview": "approx. 100%",
    "metering": "Metering system: TTL open-aperture 77-segment metering Metering mode: Multi-segment, center-weighted or spot metering",
    "exposurecompensation": "from -2 EV to +1EV (1/3EV steps)",
    "effectivepixels": "approx. 16.3 megapixels",
    "still": "JPEG: [16M] 4928x3264 pixels, [10M] 3936x2624 pixels, [6M]   3072x2048 pixels, [2M] 1728x1152 pixels 4 levels of quality in JPEG (good, better, best, premium) RAW 14 bits : [16M] 4928x3264 pixels",
    "speed": "Auto   and Manual : 1/8000 - 30 sec. + Bulb (1/3 or 1/2 EV steps) Continuous   shooting: Max. approx. 7.0 fps, JPEG (16M: ★★★ at Continuous Hi): up to   approx. 30 frames, RAW: up to approx. 20 frames*at ISO100 Max.   approx. 1.6 fps, JPEG (16M: ★★★ at Continuous Lo): until SD Memory Card is   full, RAW: up to approx. 40 frames Custom   Image: Bright, Natural, Portrait, Landscape, Vibrant, Muted, Reversal                     Film, Monochrome, Bleach Bypass",
    "size": "23.7mm x 15.7mm",
    "category": "camera",
    "sensorcleaning": "Dust Removal II mechanism: Image sensor moving mechanism, SP Coating and Dust alert function﻿",
    "functions": "Focus modes: AF.A(auto), AF.S(single, with focus lock),   AF-C(continuous) 11 AF points (9 cross type in the center) 5-point or 11-point Auto, Select or Center",
    "movie": "FULL HD: 1960x1080 (16:9) at 25fps HD TV: 1280x720 (16:9) at 30 or 25fps VGA: 640x480 (4:3) at 30 or 25fps",
    "digitalfilter": "In Playback mode: Toy Camera, Monochrome, Retro, Colour,   High Contrast, Soft, Extract Colour, Star Burst, Sketch, Water Colour,   Fish-Eye, Pastel, Slim, Miniature, HDR, Posterization, Base Parameter   Adjustment, Custom Filter",
    "filename": "Date (100_MMDD…), PENTX (100PENTX...)",
    "liveview": "Field of view: Approx. 100% Enlargement: In AF mode: 2x, 4x, 6x, in Manual mode: 2x, 4x, 6x, 8x,   10x Autofocus: Contrast detection, Face detection, phase difference   detection Options: Grid pattern, histogram display, bright/dark area warning",
    "magnification": "approx. 0.92x (with FA 50mm F1.4 lens, at infinity)",
    "playback": "Single image or index view (up to 81 images), Image   Comparison, Magnification (up to 32x, scroll and quick magnification   available), Rotation, Calendar view, Folder view, Histogram (Y histogram, RGB   histogram), Slideshow, Bright/Dark area warning, Resize, Cropping, Copyright   and detailed Exif information display﻿ ﻿",
    "angleofviewcoverage": "Wide-angle lens, equivalent to 28mm in 35mm forma﻿t",
    "diopteradjustment": "approx. -2.5 - +1.5m-1",
    "type": "Built-in retractable P-TTL auto pop-up flash",
    "autoexposurelock": "Assignable to AF/AE-L button through the menu﻿",
    "mpn": "12015",
    "label3": "50mm for £50 Pentax 50mm only £50 when bought with any Pentax DSLR Offer ends 10/01/15",
    "afassist": "available (at front)",
    "focusingscreen": "Natural Bright Matte III focusing screen﻿, exchangeable",
    "xsynchronization": "Hot-shoe flash, 1/180 sec, high speed, P-TTL flash sync   available with dedicated wireless system, with dedicated   flash",
    "external": "Compatible with SD and SDHC memory cards",
    "shakereduction": "Sensor-shift Shake Reduction, up to 3EV Compatible with ALL PENTAX lenses",
    "editing": "Movie   editing available Movie   processing:Custom Image (Bright, Natural, Portrait, Landscape, Vibrant,             Muted, Monochrome,   Reversal Film, Bleach Bypass), Cross processing (Shuffle, preset 1-3,   favorite 1-3), Digital filters (Retro, Toy Camera, High-contrast, Extract   Colour, Colour)",
    "manufacturer": "Pentax",
    "modes": "One shot, Self-timer (2 or 12 sec), Continuous shooting   (Hi, Lo), Remote control (0, 3 sec or continuous), Super-Impose (up to 9   pictures), Interval up to 999 pictures, Exposure bracketing (2, 3 or 5   frames, also available with self-timer and remote control), Mirror lock-up   (w/ or w/o remote control)﻿",
    "boxcontents": "AV cable, USB cable, Li-ion battery D-LI90, Battery charger D-BC90, AC cable, Strap, Eye cup FR and hot shoe cover (already mounted), Finder cap for ME, Body mount cover, Sync socket 2P cap, Bottom of body's cap, Software",
    "cameratype": "TTL autofocus, auto-exposure digital SLR digital-still   camera with built-in retractable P-TTL auto pop-up flash",
    "guidenumber": "approx 13 (ISO 100/m)",
    "mount": "PENTAX KAF2 bayonet mount",
    "exposuremodes": "Green,   Program (P), Sensitivity-Priority (Sv), Shutter-Priority (Tv),   Aperture-Priority (Av), Shutter and Aperture Priority (TAv), Metered Manual   (M), Bulb, X, User, Video",
    "fileformat": "Still   images: RAW 14 bits (PEF, DNG), JPEG (Exif 2.21), DCF 2.0 RAW and JPEG simultaneously recordable JPEG:4 levels of quality (good, better, best, premium) Color space: sRGB, Adobe RGB﻿ Movies: AVI (Motion JPEG) with monaural sound ﻿",
    "recording": "FULL HD: 1960x1080 (16:9) at 25fps HDTV: 1280x720 (16:9) at 30 or 25fps VGA: 640x480 (4:3) at 30 or 25fps﻿ 3 levels of quality (good, better, best)",
    "compensation": "± 5EV (selectable EV steps: 1/3 or 1/2 steps)",
    "model": "K5 II",
    "resolution": "Approx. 921 000 dots",
    "whitebalance": "Auto, Daylight, Shade, Cloudy, Fluorescent light (D, N, W,   L), Tungsten light, Flash, CTE, Manual (configuration on monitor, colour   temperature from 2 500 to 10 000K, 100K steps)﻿"
}