{
    "meteringrange": "EV 1-20 (at 23°C with 50mm f/1.8 II lens ISO100)",
    "externalflashcompatibility": "E-TTL II with EX series Speedlites, wireless multi-flash   support (with optional accessory)",
    "coverageverticalhorizontal": "Approx. 95%",
    "exposurecompensation": "+/-5 EV in 1/3 or 1/2 stop increments (can be combined   with AEB).",
    "batteries": "1 x Rechargeable Li-ion Battery   LP-E12",
    "movielength": "Max duration 29min 59sec, Max file size 4GB (If file size   exceeds 4GB a new file will be created automatically)",
    "flash": "Canon Speedlites (90EX, 220EX, 270EX, 270EX II, 320EX,   420EX, 430EX, 430EX II, 550EX, 580EX, 580EX II, 600EX, 600EX-RT,   Macro-Ring-Lite, MR-14EX, Macro Twin Lite MT-24EX, Speedlite Transmitter   ST-E2, Speedlite Transmitter ST-E3-RT)",
    "afworkingrange": "Centre AF point: EV -0.5 -18 (at 23°C & ISO100) Other AF points: EV 0.5 -18 (at 23°C & ISO100)",
    "drivemodes": "sRGB and Adobe RGB",
    "moviesize": "1920 x 1080 (29.97, 25, 23.976 fps) 1280 x 720 (59.94, 50 fps) 640 x 480 (30, 25 fps)",
    "externalflashcontrol": "via camera menu screen",
    "isosensitivity": "AUTO(100-6400), 100-12800 in 1-stop increments ISO can be expanded to H: 25600 During Movie shooting: Auto (100-6400), 100-6400 (Whole stop increments) ISO   can be expanded to H: 12800",
    "displayoptions": "Grid overlay (x2), Histogram, Multi aspect ratios",
    "case": "Semi-Hard Case EH25-L",
    "stillimagetype": "JPEG: Fine, Normal   (Exif 2.30 [Exif Print] compliant) / Design rule for Camera File system   (2.0), RAW: RAW (14bit, Canon original RAW 2nd edition), Digital Print Order Format [DPOF] Version 1.1 compliant",
    "mpn": "No",
    "eyepieceshutter": "On strap",
    "metadatatag": "User copyright information (can be set in camera)",
    "rawjpegsimultaneousrecording": "Yes (RAW + Large JPEG only)",
    "flashexposurebracketing": "Yes, with compatible External Flash",
    "afpointselection": "Automatic selection, Manual selection",
    "predictiveaf": "¹ with EF300mm f/2.8L IS USM at 50kph",
    "settings": "AWB, Daylight, Shade, Cloudy, Tungsten, White Fluorescent light, Flash, Custom. White balance compensation: 1. Blue/Amber +/-9 2. Magenta/ Green +/-9.",
    "colourfiltertype": "Primary Colour",
    "aeb": "3 shots +/- 2 EV, 1/2 or 1/3-stop increments",
    "menulanguages": "25 Languages English, German, French, Dutch, Danish, Portuguese, Finnish, Italian,   Norwegian, Swedish, Spanish, Greek, Russian, Polish, Czech, Hungarian,   Romanian, Ukrainian, Turkish, Arabic, Thai, Simplified Chinese, Traditional   Chinese, Korean and Japanese",
    "customwhitebalance": "Yes, 1 setting can be registered",
    "flashexposurecompensation": "'+/- 2EV in 1/2 or 1/3 increments",
    "displayformats": "(1) Single image with information (2 levels) (2) Single image (3) Index display (4/9/36/100 images) (4) Jump Display (1/10/100 images, by Date,by Folder, Movies only, Stills   only, by Rating)",
    "colourspace": "sRGB and Adobe RGB",
    "customfunctions": "8 Custom Functions with 24 settings",
    "effectivepixels": "Approx. 18.0 megapixels",
    "flashexposurelock": "Yes",
    "mirror": "Quick-return half mirror (Transmission: reflection ratio   of 40:60, no mirror cut-off with EF600mm f/4 or shorter)",
    "category": "camera",
    "afassistbeam": "Intermittent firing of built-in flash or emitted by   optional dedicated Speedlite",
    "batteryindicator": "4 levels",
    "aelock": "Auto: In 1-shot AF mode with evaluative metering exposure   is locked when focus is achieved. Manual: By AE lock button in creative zone modes.",
    "builtinflashrecycletime": "Approx. 3 seconds",
    "bodymaterials": "Aluminium alloy and polycarbonate resin with carbon and   glass fiber",
    "highlightalert": "Yes (Shooting information display only)",
    "weightbodyonly": "Approx. 407g (CIPA testing standard, including battery and   memory card)",
    "manufacturer": "Canon",
    "imageeraseprotection": "Erase: Single image, All images in folder, Checkmarked   images, unprotected images Protection: Single image, all images in folder, all images on card",
    "imagesensor": "Type 22.3 x 14.9mm CMOS Effective Pixels Approx. 18.0 megapixels Total Pixels Approx. 18.5 megapixels Aspect Ratio 3:2 Low-Pass Filter Built-in/Fixed Sensor Cleaning EOS integrated cleaning system Colour Filter   Type Primary ColourIMAGE PROCESSORType DIGIC 5LENSLens Mount EF/EF-S Focal Length Equivalent to 1.6x the focal length of the lensFOCUSINGType TTL-CT-SIR with a CMOS sensor AF System/   Points 9 AF points (f/5.6 cross type at centre, extra sensitivity   at f/2.8) AF Working Range Centre AF point: EV -0.5 -18 (at 23°C & ISO100) Other AF points: EV 0.5 -18 (at 23°C & ISO100) AF Modes AI Focus One Shot AI Servo AF Point   Selection Automatic selection, Manual selection Selected AF   Point Display Superimposed in viewfinder and indicated on LCD monitor Predictive AF Yes, up to 10m¹ AF Lock Locked when shutter button is pressed half way in One Shot   AF mode. AF Assist Beam Intermittent firing of built-in flash or emitted by   optional dedicated Speedlite Manual Focus Selected on lensEXPOSURE CONTROLMetering Modes TTL full aperture metering with 63-zone SPC (1) Evaluative metering (linked to all AF points) (2) Partial metering at center (approx. 9% of viewfinder) (3) Spot metering (approx. 4% of viewfinder at center) (4) Center weighted average metering Metering Range EV 1-20 (at 23°C with 50mm f/1.8 II lens ISO100) AE Lock Auto: In 1-shot AF mode with evaluative metering exposure   is locked when focus is achieved. Manual: By AE lock button in creative zone modes. Exposure   Compensation +/-5 EV in 1/3 or 1/2 stop increments (can be combined   with AEB). AEB 3 shots +/- 2 EV, 1/2 or 1/3-stop increments ISO Sensitivity* AUTO(100-6400), 100-12800 in 1-stop increments ISO can be expanded to H: 25600 During Movie shooting: Auto (100-6400), 100-6400 (Whole stop increments) ISO   can be expanded to H: 12800SHUTTERType Electronically-controlled focal-plane shutter, with   electronic first curtain Speed 30-1/4000 sec (1/2 or 1/3 stop increments), Bulb (Total   shutter speed range. Available range varies by shooting mode)WHITE BALANCEType Auto white balance with the imaging sensor Settings AWB, Daylight, Shade, Cloudy, Tungsten, White Fluorescent light, Flash, Custom. White balance compensation: 1. Blue/Amber +/-9 2. Magenta/ Green +/-9. Custom White   Balance Yes, 1 setting can be registered WB Bracketing +/-3 levels in single level increments 3 bracketed images per shutter release. Selectable Blue/Amber bias or Magenta/Green bias.VIEWFINDERType Pentamirror Coverage   (Vertical/Horizontal) Approx. 95% Magnification Approx. 0.87x¹ Eyepoint Approx. 19mm (from eyepiece lens centre) Dioptre   Correction -3 to +1 m-1 (dioptre) Focusing Screen Fixed Mirror Quick-return half mirror (Transmission: reflection ratio   of 40:60, no mirror cut-off with EF600mm f/4 or shorter) Depth of Field   Preview Yes, with Depth of Field preview button. Eyepiece Shutter On strapLCD MONITORType Touch screen 7.7cm (3.0\") 3:2 Clear View II TFT,   approx. 1040K dots Coverage Approx. 100% Viewing Angle   (Horizontally/Vertically) Approx 170° Coating Solid Structure and Anti smudge Brightness   Adjustment Adjustable to one of seven levels Display Options (1) Quick Control Screen (2) Camera settingsFLASHBuilt-in Flash   GN (ISO 100, meters) 9.4 Built-in Flash   Coverage up to 18mm focal length (35mm equivalent: 29mm) Built-in Flash   Recycle Time Approx. 3 seconds Modes Auto, Manual Flash Red-Eye   Reduction Yes - with red eye reduction lamp X-Sync 1/200sec Flash Exposure   Compensation '+/- 2EV in 1/2 or 1/3 increments Flash Exposure   Bracketing Yes, with compatible External Flash Flash Exposure   Lock Yes Second Curtain   Synchronisation Yes HotShoe/ PC   Terminal Yes/ No External Flash   Compatibility E-TTL II with EX series Speedlites, wireless multi-flash   support (with optional accessory) External Flash   Control via camera menu screenSHOOTINGModes Scene Intelligent Auto (Stills and Movie), No Flash,   Creative Auto, Portrait, Landscape, Close-up, Sports, SCN(Kids, Food,   Candlelight, Night Portrait, Handheld Night Scene, HDR Backlight Control),   Program AE , Shutter priority AE, Aperture priority AE, Manual (Stills and   Movie) Picture Styles Auto, Standard, Portrait, Landscape, Neutral, Faithful,   Monochrome, User Defined (x3) Colour Space sRGB and Adobe RGB Drive Modes sRGB and Adobe RGB Continuous   Shooting Max. Approx. 4.0fps. (speed maintained for minimum of   approx. 28 images (JPEG)¹, 7 images (RAW)²³LIVE VIEW MODEType Electronic viewfinder with image sensor Coverage Approx. 100% (horizontally and vertically) Frame Rate 60 fps Focusing Manual Focus (Magnify the image 5x or 10x at any point on   screen) Autofocus: Hybrid CMOS AF II (Face detection and Tracking AF,   FlexiZone-Multi, FlexiZone-Single), Phase detection AF (Quick mode) Metering Real-time evaluative metering with image sensor. Evaluative metering, partial metering, spot metering, center-weighted average   metering. Display Options Grid overlay (x2), Histogram, Multi aspect ratiosFILE TYPEStill Image Type JPEG: Fine, Normal   (Exif 2.30 [Exif Print] compliant) / Design rule for Camera File system   (2.0), RAW: RAW (14bit, Canon original RAW 2nd edition), Digital Print Order Format [DPOF] Version 1.1 compliant RAW+JPEG   Simultaneous Recording Yes (RAW + Large JPEG only) Image Size JPEG 3:2: (L) 5184x3456, (M) 3456x2304, (S1) 2592x1728,   (S2) 1920x1280, (S3) 720x480 JPEG 4:3: (L) 4608x3456, (M) 3072x2304, (S1) 2304x1728, (S2) 1696x1280, (S3)   640x480 JPEG 16:9: (L) 5184x2912, (M) 3456x1944, (S1) 2592x1456 (S2) 1920x1080, (S3)   720x400 JPEG 1:1: (L) 3456x3456, (M) 2304x2304, (S1) 1728x1728, (S2) 1280x1280, (S3)   480x480 RAW: (RAW) 5184x3456 Movie Type MOV (Video: H.264, Sound: Linear PCM, recording level can   be manually adjusted by user) Movie Size 1920 x 1080 (29.97, 25, 23.976 fps) 1280 x 720 (59.94, 50 fps) 640 x 480 (30, 25 fps) Movie Length Max duration 29min 59sec, Max file size 4GB (If file size   exceeds 4GB a new file will be created automatically) Folders New folders can be manually created and selected File Numbering (1) Consecutive numbering (2) Auto reset (3) Manual resetOTHER FEATURESCustom Functions 8 Custom Functions with 24 settings Metadata Tag User copyright information (can be set in camera) Intelligent   Orientation Sensor Yes Playback Zoom 1.5x - 10x enabled in 15steps Display Formats (1) Single image with information (2 levels) (2) Single image (3) Index display (4/9/36/100 images) (4) Jump Display (1/10/100 images, by Date,by Folder, Movies only, Stills   only, by Rating) Slide Show Image selection: All images, by Date, by Folder, Movies,   Stills, Rating Playback time: 1/2/3/5/10 or 20 seconds Repeat: On/Off Transition Effect: Off, Slide 1, Slide 2, Fade 2, Fade 2, Fade 3 Background Music: On, Off Histogram Brightness: Yes RGB: YesBrightness: Yes RGB: Yes Highlight Alert Yes (Shooting information display only) Image   Erase/Protection Erase: Single image, All images in folder, Checkmarked   images, unprotected images Protection: Single image, all images in folder, all images on card Menu Categories 1) Shooting menu (x6) (2) Playback menu (x2) (3) Setup menu (x4) (4) My Menu Menu Languages 25 Languages English, German, French, Dutch, Danish, Portuguese, Finnish, Italian,   Norwegian, Swedish, Spanish, Greek, Russian, Polish, Czech, Hungarian,   Romanian, Ukrainian, Turkish, Arabic, Thai, Simplified Chinese, Traditional   Chinese, Korean and Japanese Firmware Update Update possible by the user.INTERFACEComputer Hi-Speed USB Other Video output (PAL/ NTSC) (integrated with USB terminal),   HDMI mini output (HDMI-CEC compatible), External microphone (3.5mm Stereo   mini jack)DIRECT PRINTCanon Printers Canon Compact Photo Printers and PIXMA Printers supporting   PictBridge PictBridge YesSTORAGEType SD, SDHC or SDXC (UHS-I)cardSUPPORTED OPERATING SYSTEMPC &   Macintosh Windows XP inc. SP3 / Vista inc. SP2 (excl. Starter   Edition) / 7 inc. SP1(excl. Starter Edition) / 8 OS X v10.6-10.8 (Intel processor required)SOFTWAREBrowsing &   Printing ImageBrowser EX Image Processing Digital Photo Professional Other PhotoStitch, EOS Utility, Picture Style EditorPOWER SOURCEBatteries 1 x Rechargeable Li-ion Battery   LP-E12 Battery Life Approx. 380 (at 23°C, AE 50%, FE 50%)¹ Approx. 350 (at 0°C, AE 50%, FE 50%) Battery Indicator 4 levels Power Saving Power turns off after 30sec or 1, 2, 4, 8 or 15mins. Power Supply   & Battery Chargers AC Adapter Kit ACK-E15, Battery   charger LC-E12PHYSICAL SPECIFICATIONSBody Materials Aluminium alloy and polycarbonate resin with carbon and   glass fiber Operating   Environment 0 – 40 °C, 85% or less humidity Dimensions   (WxHxD) 116.8 x 90.7 x 69.4mm Weight (Body   Only) Approx. 407g (CIPA testing standard, including battery and   memory card)ACCESSORIESViewfinder Eyecup Ef, E-series Dioptric Adjustment Lens with Rubber   Frame Ef, Eyepiece Extender EP-EX15II, Angle Finder C Case Semi-Hard Case EH25-L Wireless File   Transmitter Compatible with Eye-Fi cards Lenses All EF and EF-S lenses Flash Canon Speedlites (90EX, 220EX, 270EX, 270EX II, 320EX,   420EX, 430EX, 430EX II, 550EX, 580EX, 580EX II, 600EX, 600EX-RT,   Macro-Ring-Lite, MR-14EX, Macro Twin Lite MT-24EX, Speedlite Transmitter   ST-E2, Speedlite Transmitter ST-E3-RT) Battery Grip None Remote   Controller/ Switch Remote Controller RC-6, Remote Switch RS-60E3 Other Hand Strap E2, GPS Receiver GP-E2 Predictive AF ¹ with EF300mm f/2.8L IS USM at 50kph Magnification ¹ with 50mm lens at infinity, -1m-1 dpt Continuous   Shooting ¹ Large/Fine(Quality 8) resolution ² Based on Canon's testing conditions, JPEG, ISO 100, Standard Picture Style.   Varies depending on the subject, memory card brand and capacity, image   recording quality, ISO speed, drive mode, Picture Style, Custom functions   etc. ³ Maximum fps and buffer capacity may be reduced depending on the cameras   settings and light level Battery Life ¹ Based on the CIPA Standard and using the batteries and   memory card format supplied with the camera, except where indicated*Recommended Exposure Index",
    "operatingenvironment": "0 – 40 °C, 85% or less humidity",
    "firmwareupdate": "Update possible by the user.",
    "picturestyles": "Auto, Standard, Portrait, Landscape, Neutral, Faithful,   Monochrome, User Defined (x3)",
    "powersaving": "Power turns off after 30sec or 1, 2, 4, 8 or 15mins.",
    "metering": "Real-time evaluative metering with image sensor. Evaluative metering, partial metering, spot metering, center-weighted average   metering.",
    "depthoffieldpreview": "Yes, with Depth of Field preview button.",
    "builtinflashcoverage": "up to 18mm focal length (35mm equivalent: 29mm)",
    "batterylife": "¹ Based on the CIPA Standard and using the batteries and   memory card format supplied with the camera, except where indicated",
    "asmallandresponsivedslrtotakeeverywherethe18megapixeleos100ddeliverssuperbphotosandvideoandfeaturesanopticalviewfinderandintuitivetouchscreencontrolsthecameradoesintroduceanewlensfromcanon1855mmisstmallowingforquieterfocusingesspeciallyonvideotheeos100dtheworldssmallestdslr": "• High-quality low-noise photography with a highly compact, take-everywhere DSLR • Shoot 18-megapixel photos and Full-HD video with the same camera • Quick to use, with an optical viewfinder and responsive controls • Easy to use, large touch-screen • Get shooting quickly and easily with Scene Intelligent AutoA DSLR you’ll never want to leave behind The EOS 100D is a fully-featured, responsive DSLR that is also small  and light enough to take everywhere. The ideal camera to document your  lifestyle. Shoot 18-megapixel photos and Full HD movies everywhere you  go and enjoy great performance even in poor light: a maximum ISO  sensitivity of 12800 (extendable to ISO 25600) allows you to shoot  images that are low in noise but full of atmosphere. Easy and enjoyable to use Compose your photos using a bright, responsive optical viewfinder or  use the 1,040,000-dot 7.7cm (3.0”) 3:2 Clear View II TFT Touch screen to  control the camera. Navigate menus, review pictures and even focus and  shoot by tapping, swiping and pinching.Simple operation – fantastic results Canon’s Scene Intelligent Auto technology analyses the scene and sets  the most appropriate cameras settings automatically. And as your  photography develops a built-in Feature Guide will teach you how to get  the most from the camera. Capture Full HD movies Shoot high-quality video at resolutions up to Full-HD (1080p). Take  control of exposure, focusing, sound and more, or use the Video Snapshot  mode to capture edited movie sequences in-camera. Hybrid CMOS AF II  provides continuous focusing while shooting, ideal for keeping moving  subjects sharp.Capture the action Track and shoot fast moving subjects at 4 fps and take advantage of  nine AF points to focus swiftly and accurately, even with off-centre  subjects. Taking your next creative steps Express your creative side with one of the EOS 100D’s Creative  filters. Extra Effect Shot captures a filtered and unfiltered shot  simultaneously. Choose from Grainy Black & White, Toy Camera,  Miniature Effect and more, and preview the effect of each filter before  you shoot.A mode for whatever you are shooting Theme-based Scene modes automatically choose the right camera  settings for the subject you’re shooting. Choose from Portrait,  Landscape, Sports, Kids, Food and more. And when you’re ready, progress  to Creative Auto mode for more control over factors like background  blur, via an intuitive interface. Welcome to the EOS System Take advantage of the extensive range of lenses, accessories and flashes that make up the EOS System.",
    "remotecontrollerswitch": "Remote Controller RC-6, Remote Switch RS-60E3",
    "afsystempoints": "9 AF points (f/5.6 cross type at centre, extra sensitivity   at f/2.8)",
    "magnification": "¹ with 50mm lens at infinity, -1m-1 dpt",
    "wirelessfiletransmitter": "Compatible with Eye-Fi cards",
    "intelligentorientationsensor": "Yes",
    "type": "Electronic viewfinder with image sensor",
    "hotshoepcterminal": "Yes/ No",
    "dioptrecorrection": "-3 to +1 m-1 (dioptre)",
    "freewificard": "Get an 8GB FlashAir SD card and send photos and videos from your camera to your phone or tablet without the need for cables or a computer, when you purchase this cameraWinter CashbackClaim cashback and FREE accessories on selected Canon cameras, lenses, camcorders and printers.The Cashback promotion runs from 29/10/15 to 21/01/2015.To claim your cashback and free Wi-Fi card please visit the following link - www.canon.co.uk/wintercashback",
    "imageprocessing": "Digital Photo Professional",
    "filenumbering": "(1) Consecutive numbering (2) Auto reset (3) Manual reset",
    "wbbracketing": "+/-3 levels in single level increments 3 bracketed images per shutter release. Selectable Blue/Amber bias or Magenta/Green bias.",
    "movietype": "MOV (Video: H.264, Sound: Linear PCM, recording level can   be manually adjusted by user)",
    "histogram": "Brightness: Yes RGB: YesBrightness: Yes RGB: Yes",
    "focusingscreen": "Fixed",
    "focusing": "Manual Focus (Magnify the image 5x or 10x at any point on   screen) Autofocus: Hybrid CMOS AF II (Face detection and Tracking AF,   FlexiZone-Multi, FlexiZone-Single), Phase detection AF (Quick mode)",
    "brightnessadjustment": "Adjustable to one of seven levels",
    "boxcontents": "No",
    "afmodes": "AI Focus One Shot AI Servo",
    "viewinganglehorizontallyvertically": "Approx 170°",
    "totalpixels": "Approx. 18.5 megapixels",
    "framerate": "60 fps",
    "aflock": "Locked when shutter button is pressed half way in One Shot   AF mode.",
    "browsingprinting": "ImageBrowser EX",
    "viewfinder": "Eyecup Ef, E-series Dioptric Adjustment Lens with Rubber   Frame Ef, Eyepiece Extender EP-EX15II, Angle Finder C",
    "secondcurtainsynchronisation": "Yes",
    "coating": "Solid Structure and Anti smudge",
    "manualfocus": "Selected on lens",
    "builtinflashgniso100meters": "9.4",
    "imagesize": "JPEG 3:2: (L) 5184x3456, (M) 3456x2304, (S1) 2592x1728,   (S2) 1920x1280, (S3) 720x480 JPEG 4:3: (L) 4608x3456, (M) 3072x2304, (S1) 2304x1728, (S2) 1696x1280, (S3)   640x480 JPEG 16:9: (L) 5184x2912, (M) 3456x1944, (S1) 2592x1456 (S2) 1920x1080, (S3)   720x400 JPEG 1:1: (L) 3456x3456, (M) 2304x2304, (S1) 1728x1728, (S2) 1280x1280, (S3)   480x480 RAW: (RAW) 5184x3456",
    "selectedafpointdisplay": "Superimposed in viewfinder and indicated on LCD monitor",
    "sensorcleaning": "EOS integrated cleaning system",
    "continuousshooting": "¹ Large/Fine(Quality 8) resolution ² Based on Canon's testing conditions, JPEG, ISO 100, Standard Picture Style.   Varies depending on the subject, memory card brand and capacity, image   recording quality, ISO speed, drive mode, Picture Style, Custom functions   etc. ³ Maximum fps and buffer capacity may be reduced depending on the cameras   settings and light level",
    "redeyereduction": "Yes - with red eye reduction lamp",
    "other": "Hand Strap E2, GPS Receiver GP-E2",
    "meteringmodes": "TTL full aperture metering with 63-zone SPC (1) Evaluative metering (linked to all AF points) (2) Partial metering at center (approx. 9% of viewfinder) (3) Spot metering (approx. 4% of viewfinder at center) (4) Center weighted average metering",
    "menucategories": "1) Shooting menu (x6) (2) Playback menu (x2) (3) Setup menu (x4) (4) My Menu",
    "dimensionswxhxd": "116.8 x 90.7 x 69.4mm",
    "batterygrip": "None",
    "folders": "New folders can be manually created and selected",
    "slideshow": "Image selection: All images, by Date, by Folder, Movies,   Stills, Rating Playback time: 1/2/3/5/10 or 20 seconds Repeat: On/Off Transition Effect: Off, Slide 1, Slide 2, Fade 2, Fade 2, Fade 3 Background Music: On, Off",
    "coverage": "Approx. 100% (horizontally and vertically)",
    "aspectratio": "3:2",
    "lowpassfilter": "Built-in/Fixed",
    "eyepoint": "Approx. 19mm (from eyepiece lens centre)",
    "xsync": "1/200sec",
    "modes": "Scene Intelligent Auto (Stills and Movie), No Flash,   Creative Auto, Portrait, Landscape, Close-up, Sports, SCN(Kids, Food,   Candlelight, Night Portrait, Handheld Night Scene, HDR Backlight Control),   Program AE , Shutter priority AE, Aperture priority AE, Manual (Stills and   Movie)",
    "playbackzoom": "1.5x - 10x enabled in 15steps",
    "powersupplybatterychargers": "AC Adapter Kit ACK-E15, Battery   charger LC-E12",
    "lenses": "All EF and EF-S lenses",
    "model": "EOS 100D"
}