{
    "usablelenses": "KAF3, KAF2 (power zoom not compatible), KAF, KA mount   lenses-",
    "meteringrange": "EV0 to 22 (ISO100 at 50mm F1.4)-",
    "autobracketing": "3 frames-",
    "features": "World   time : 75 cities, 28 time zones Digital   Filters :  Monochrome, Extract Color, Toy Camera, Retro, High Contrast,   Shading, Invert Color, Color, Tone Expansion, Sketch Filter, Water Color,   Pastel, Posterization, Miniature, Soft, Starburst, Fish-eye, Slim, Base   Parameter Adjustment Custom   Functions : 22 items Mode   Memory : 12 items Electronic   level  : Displayed in viewfinder (horizontal direction only); displayed   on LCD monitor (horizontal direction and vertical direction) USER   Mode: Up to 2 settings can be saved Button/Dial   Customization: RAW/Fx   Button (One Push File Format, Exposure Bracketing, Optical preview, Digital   Preview, Composition Adjustment, Select AF Point), AF/AE-L button (Enable AF1, Enable AF2, Cancel AF, AE Lock) Various settings for the action of the e-dials in each exposure mode can also   be saved. Text   Size: Standard, Large AF   Fine Adjustment: ±10 step, Uniform adjustment, Individual adjustment (up   to 20 can be saved) Copyright   Information: Names of \"Photographer\" and \"Copyright   Holder\" are embedded to the image file.-",
    "weight": "Approx.   650 g (loaded and ready with the dedicated battery and SD Memory Card),   Approx. 590 g (body only)-",
    "sensitivity": "AUTO/100 to 51200 (EV steps can be set to 1EV, 1/2EV, or   1/3EV)-",
    "fieldofview": "Approx.   100%-",
    "metering": "TTL open aperture, 77 segmented metering, center-weighted   and spot metering-",
    "height": "96.5mm-",
    "exposurecompensation": "–2.0 to +1.0 EV-",
    "effectivepixels": "approx. 16.28 MP-",
    "still": "JPEG：16M(4928x3264),   12M(4224x2816), 8M(3456x2304), 5M(2688x1792) 4 quality level of JPEG (★ good, ★★ better, ★★★ best) RAW：16M(4928x3264) RAW (12bit): DNG RAW   (DNG), JPEG (Exif 2.3), DCF2.0 compliant RAW   and JPEG simultaneously recordable-",
    "speed": "Auto: 1/6000 to 30 sec., Manual: 1/6000 to 30 sec. (1/3EV   step or 1/2EV step), Bulb.-",
    "size": "23.7 x 15.7mm-",
    "category": "camera",
    "sensorcleaning": "Dust Removal: SP coating and CMOS sensor operations-",
    "functions": "Auto:   5 points, Auto: 11 points, Select（Expanded Area AF available),   Spot Brightness Range: EV-1 to 18 (ISO 100) AF   Mode: Auto   AF (AF.A), Single AF (AF.S), Continuous AF (AF.C) Focus priority or shutter priority mode for AF.S Focus priority or FPS priority mode for AF.C-",
    "pc": "Windows   XP (SP3), Vista, 7 and 8-",
    "movie": "Full   HD (1920x1080, 16:9, 30fps/25fps/24fps) HD   (1280x720, 16:9, 60fps/50fps/30fps/25fps/24fps) VGA   (640x480, 4:3, 30fps/25fps/24fps) Quality   levels ★★★(Best), ★★(Better), ★(Good)-",
    "digitalfilter": "Monochrome, Extract Color, Toy Camera, Retro, High   Contrast, Shading, Invert Color, Color, Tone Expansion, Sketch Filter, Water   Color, Pastel, Posterization, Miniature, Soft, Starburst, Fish-eye, Slim,   Base Parameter Adjustment-",
    "depth": "70.0mm-",
    "width": "129.0mm-",
    "magnification": "Approx.   0.92x (50mm F1.4 at infinity)-",
    "playback": "Single frame, Multi-image display (4/9/16/36/81 seg.),   Display magnification (up to 16x, scrolling & quick magn.), rotating,   histogram, bright/dark area warning, copyright display, calendar filmstrip,   display, folder display, slideshow, Eye-Fi transfer-",
    "totalpixels": "approx. 16.49MP-",
    "performance": "Rechargeable Lithium-ion Battery D-LI109: Number   of recordable images: approx. 410 images (with 50% flash usage), approx. 480   images (without flash usage) Playback   time: approx. 270 minutes *   Using a new lithium-ion battery under the temperature at 23 °C, Tested in   compliance with CIPA standard. Actual results may vary depending on the   shooting conditions/circumstances. AA   Lithium batteries: Number   of recordable images:approx. 710 images (with 50% flash usage), approx. 1250   images (without flash usage) Playback   time: approx. 560 minutes *   Using 4x new Energizer Ultimate Lithium Batteries under the temperature at 23   °C, Tested in compliance with CIPA standard. Actual results may vary   depending on the shooting conditions/circumstances.-",
    "type": "Built-in   retractable P-TTL auto pop-up flash-",
    "autoexposurelock": "Can be assigned to the AF/AE-L button from the menu-",
    "mpn": "10893",
    "afassist": "Dedicated LED AF assist light-",
    "mac": "10.8 or above-",
    "fileformat": "RAW   (DNG), JPEG (Exif 2.3), DCF2.0 compliant Image   sizes : JPEG   : 16M(4928x3264),12M(4224x2816),8M(3456x2304),5M RAW   :[3:2]16M(4928x3264) Quality level RAW (12bit): DNG JPEG: ★★★ (Best), ★★ (Better), ★ (Good) Color space : sRGB, Adobe RGB-",
    "xsynchronization": "Sync Speed : 1/180 sec.-",
    "external": "Compatible   with SD, SDHC, and SDXC Memory Card (Eye-Fi card compatible)-",
    "shakereduction": "Sensor shift Shake Reduction-",
    "liveview": "Type: TTL   method using CMOS image sensor Focusing   Mechanism: Contrast detection + Face Detection, Tracking, Select, Spot Display: Field   of View approx. 100%, Magnified view (2x, 4x, 6x), Grid display (4x4 Grid,   Golden Section, Scale display), Bright/dark area warning, Histogram-",
    "manufacturer": "Pentax",
    "modes": "Drive   Modes Mode   Selection: Single   frame, Continuous (Hi, Lo), Self-timer (12sec., 2sec.), Remote Control (0   sec., 3 sec.), Auto Bracketing (3 frames) Continuous   shooting : Approx.   6 fps, JPEG (JPEG, Cont. Hi) Approx. 3 fps, JPEG (JPEG, Cont. Lo) Capture   Functions Custom   Image: Bright, Natural, Portrait, Landscape, Vibrant, Radiant, Muted,   Bleach Bypass, Reversal Film, Monochrome, Cross Processing Noise   Reduction: Slow Shutter Speed NR, High-ISO NR Dynamic Range Setting: Highlight   Correction, Shadow Correction Lens   Correction: Distortion Correction, Lateral Chromatic Aberration   Correction Digital   Filter: Extract Color, Toy Camera, Retro, High Contrast, Shading, Invert   Color, Color HDR   Capture:  Auto, HDR 1, HDR 2, HDR 3, Automatic composition correction   function, Exposure Bracket Value: ±1EV, ±2EV, ±3EV Multi-exposure: Number   of shots: 2-9, Exposure adjusted automatically Horizon   Correction: SR On: correction up to 1 degrees, SR Off: correction up to   1.5 degrees Composition   Adjustment: Adjustment range of ±1mm up, down, left or right (0.5mm when   rotated), Rotating range of 1 degrees Interval   Shooting: Shooting interval: 3 sec. to 24 hr., Number of shots: up to   999 images, Start Interval setting: immediately, from the set time-",
    "boxcontents": "No",
    "mount": "PENTAX KAF2 bayonet mount (AF coupler, lens   information contacts, K-mount with power contacts)-",
    "exposuremodes": "Program,   Sensitivity Priority, Shutter Priority, Aperture Priority, Shutter &   Aperture Priority, Manual, Bulb Auto   Picture mode: automatically selects from Standard, Portrait, Landscape,   Macro, Moving Object, Night Scene Portrait, Night Scene, Blue Sky, Forest Scene   Mode: Portrait, Landscape, Macro, Moving Object, Night Scene Portrait,   Sunset, Blue Sky, Forest, Night Scene, Night   Scene HDR*, Night Snap, Food, Pet, Kids, Surf & Snow, Backlight   Silhouette, Candlelight, Stage Lighting, Museum *JPEG   only-",
    "focusingscreen": "Interchangeable   Natural-Bright-Matte III focusing screen-",
    "whitebalance": "Daylight,   Shade, Cloudy, Fluorescent Light (D: Daylight Color, N:Daylight White, W:   Cool White, L: Warm White), Tungsten, Flash, CTE, Manual, Color Adjustable   ±7 steps on A-B axis or G-M axis Auto: Method   using a combination of the CMOS image sensor and the light source detection   sensor Manual:   Configuration using the display screen (up to 3 settings can be saved), Color Temperature settings, Copying the white balance setting of a captured   image-",
    "recording": "Recorded   pixels: Full HD (1920x1080, 16:9, 30fps/25fps/24fps), HD (1280x720, 16:9, 60fps/50fps/30fps/25fps/24fps), VGA (640x480, 4:3, 30fps/25fps/24fps) Quality   levels: ★★★(Best), ★★(Better), ★(Good) File   Format: MPEG–4 AVC／H.264 Sound: Built-in   monaural microphone, Recording Sound Level Recording   Time: Up to 25 minutes; automatically stops recording if the internal   temperature of the camera becomes high Custom   Image: Bright, Natural, Portrait, Landscape, Vibrant, Radiant, Muted,   Bleach Bypass, Reversal Film, Monochrome, Cross Processing Digital   Filter: Extract Color, Toy Camera, Retro, High Contrast, Invert Color,   Color Interval   Movie: Recording interval: 3 sec., 5 sec., 10 sec., 30 sec., 1 min., 5min.,   10 min., 30 min., 1 hr., Recording time: 4 sec. to 99 hr., Start Interval setting: immediately, from the set time *The   File format is Motion JPEG(AVI)-",
    "guidenumber": "approx.   12 (ISO 100/m)-",
    "compensation": "± 5EV (1/2EV step or 1/3EV can be selected)-",
    "source": "Rechargeable   Lithium-ion Battery D-LI 109 With   AA Battery Holder D-BH109 (optional), four AA batteries (Lithium, Ni-MH   rechargeable, alkaline) can be used AC   Adapter Kit K-AC128 (optional)-",
    "model": "K50",
    "resolution": "Approx. 921k dots-",
    "options": "Delete: Delete   single image, delete all images, select & delete, delete folder, delete   instant review image RAW   Development: File Format (JPEG), Image Capture Settings(Aspect Ratio,   Recorded Pixels, Quality Level, Color Space), Lens Correction(Distortion   Correction, Lateral Chromatic Aberration Correction), Custom Image, White   Balance, Sensitivity, High-ISO NR, Shadow Correction Edit:   Resize, Cropping (Aspect ratio and Slant adjustment available), Index, Movie   Editing (Divide or delete selected frames), Capturing a JPEG still picture   from a movie, Saving the RAW file data in the buffer memory-",
    "kitcontent": "USB   Cable I-USB7 Strap O-ST132 Rechargeable Lithium-ion Battery D-LI109 Battery Charger D-BC109 Software (CDROM) S-SW138 Mounted   on the camera: Hot shoe cover FK Body Mount Cover-"
}