{
    "weight": "Approx.980 g",
    "battery": "EN-EL15 battery",
    "additionalfeatures": "Faster Expeed 4 Processor and New Sensor",
    "category": "camera",
    "dimensions": "Approx.146 x 123 x 81.5 mm",
    "maxiso": "64–12800",
    "manufacturerslink": "Click Here",
    "mpn": "No",
    "continuous": "Upto 5 fps (or 7fps @ 15.3mp in crop Mode)",
    "sensortype": "FX, Type: CMOS, Size: 35.9 mm x 24.0 mm",
    "screensize": "3.2 Inch (Approx.1229k-dot)",
    "lensmount": "Nikon F mount (with AF coupling and AF contacts)",
    "partexbonus": "Part exchange any camera and receive £300 bonus against a Nikon D810Request a PX valuation hereInterest Free Credit Available In Our Stores!For further details please contact your nearest store Here .",
    "manufacturer": "Nikon",
    "lens": "None",
    "boxcontents": "Rechargeable Li-ion battery with terminal cover, battery charger, Strap, USB cable, USB cable clip, body cap, accessory shoe cover, monitor cover, ViewNX 2 installer CD",
    "megapixels": "36.3 Million",
    "createyournewmasterpiecewiththeexquisitenikond810fromdelicatetexturestohighspeedmovementthisallversatile363megapixelcameraisreadyforanything": "With a redesigned FX-format sensor,  ultra-wide ISO range, and EXPEED 4 image processor, you get  unprecedented sharpness, sumptuous tonality, and reduced noise across  all sensitivities. Flagship AF performance, a burst rate of up  to 7 fps, and Full HD movie recording at 1080/60p ensure you’re free to  capture any kind of scene with rigorous precision. Nikon’s Picture  Control 2.0 provides exceptional in-camera image processing/optimisation  flexibility.Key Features36.3-MP FX-format sensorThe all-new sensor without an OLPF  offers the ultimate in image detail. Boasts fast channel readout, wide  dynamic range, and clean performance at high sensitivities.EXPEED 4Boosts the camera’s overall performance to a whole  new level. Vastly improves image rendering and ISO performance, and  allows higher frame rates when shooting movies.Up to 7 fps burst rateCapture fast-moving subjects with  incredible flexibility. Shoot uncompromised full-resolution images at up  to 5 fps. Shoot 15.3-MP images at up to 7 fps in DX crop mode.Extensive ISO rangeIn a first for a D-SLR, the D810’s ISO  range starts at ISO 64 for cleaner, better-defined images. Shoot at up  to ISO 12800, or extend the range from 32 to 51200 ISO (equivalent).Cinema ReadyRecord Full HD (1080p) movies at 50p/60p. Access  the full light sensitivity range, from ISO 64, while filming, and  control shutter speed, aperture, and audio levels, too.Flagship AF performanceBoasting  the same AF system as Nikon’s D4S, the D810 delivers the ultimate in  high-resolution precision. Offers fast acquisition and improved  background isolation even in challenging lighting conditions with the  new Group Area AF mode.RAW Size SAccelerate  your workflow with Nikon’s RAW Size S file format. Delivers richly  graded 12-bit uncompressed Nikon NEF files that enable faster image  transfer and smoother post-production.",
    "cardtype": "CompactFlash, SD, SDHC, SDXC",
    "video": "Full 1080p @ 60,50,30,25 & 24 frames",
    "model": "D810"
}