{
    "batterysystem": "NP-FM500H",
    "pictbridge": "NO",
    "indexplayback": "YES",
    "whitebalancebracketing": "3 frames, Selectable 2 steps",
    "effectivepixelsmegapixels": "Approx. 20.1",
    "isosensitivitysetting": "ISO100 - 16000 equivalent",
    "automaticwhitebalance": "YES",
    "exposurecompensation": "YES, +/- 3.0EV (1/3EV steps)",
    "flashmode": "Autoflash, Fill-flash, Slow sync, Rear flash sync, Red-eye reduction",
    "depthoffieldpreview": "YES",
    "usb20hispeed": "YES",
    "type": "Electronic, Xtra Fine",
    "lightmeteringspot": "YES",
    "aebracketing": "With 0.3 EV, 0.7 EV, 1.0 EV, 2.0 EV, 3.0 EV increments, 3 frames",
    "category": "camera",
    "imagesizespixels": "2736 x 1824 (5M)",
    "audiorecordingformat": "Dolby Digital (AC-3) / MPEG-4 AAC-LC, 2ch",
    "redeyereduction": "YES",
    "antimotionblur": "NO",
    "widthmm": "128.6",
    "imagerotation": "YES",
    "depthmm": "77.7",
    "recordingformat": "JPEG (DCF Ver. 2.0, Exif Ver. 2.3, MPF Baseline compliant), RAW (Sony ARW   2.3 format), RAW & JPEG",
    "sweeppanorama": "YES",
    "afilluminator": "YES (built-in, Flash type)",
    "aelock": "YES",
    "flashmeteringsystem": "ADI / Pre-flash TTL",
    "sensor": "15 points (3 points cross type)",
    "histogramindicator": "YES",
    "monitortype": "TFT",
    "videoout": "NO",
    "fieldofview": "100",
    "flashcompensation": "+/- 2.0EV (1/3EV steps)",
    "heightmm": "95.5",
    "mpn": "No",
    "focuslock": "YES",
    "movierecordingformat": "AVCHD / MP4",
    "drivemode": "Single, Continuous, 10 seconds and 2 seconds Self-timer, Bracket   (continues, single, white balance bracket)",
    "videocompression": "MPEG-4 AVC (H.264)",
    "focusingscreen": "NO",
    "screensize": "6.7cm(2.7type)",
    "suppliedbattery": "NP-FM500H",
    "diopteradjustment": "-4.0 to +4.0m-1",
    "lensmount": "Sony α mount YES Sony E mount NOLens CompatibilityAll types of Sony α lenses YES All types of Sony E lenses NO Minolta & Konica Minolta α/MAXXUM/DYNAX lenses YESImage SensoryImage sensor type Exmor™ APS HD CMOS sensor Image sensor colour filter R, G, B, Primary color Size (mm) 23.2 x 15.4mm (APS-C size)CameraTotal sensor Pixels (megapixels) Approx. 20.4 Effective Pixels (megapixels) Approx. 20.1 Automatic White Balance YES White balance: preset selection Auto / Daylight/ Shade/ Cloudy/ Incandescent/ Fluorescent, Flash White balance: custom setting YES White balance: types of color temperature 2500 - 9900 k (G7 to M7,15-step) (A7 to B7,15-step) White balance bracketing 3 frames, Selectable 2 steps ISO Sensitivity Setting ISO100 - 16000 equivalentSteadyShot INSIDESystem: Sensor-shift mechanism YES SteadyShot INSIDE scale (in viewfinder) NO Camera-Shake warning (in viewfinder) NO SteadyShot INSIDE capability Approx. 2.5 to 4.5 steps in shutter speeds *Varies according to shooting   conditions and lens used SteadyShot INSIDE compatibility All Sony DSLR lenses and A-Mount bayonet lenses from Minolta and Konica   Minolta *SteadyShot INSIDE was previously known as Super SteadyShotAnti-DustCharge protection coating YESAuto Focus SystemTTL phase-detection system YES Contrast AF system NO Sensor 15 points (3 points cross type) Sensitivity Range (at ISO 100 equivalent); EV -1 to 18 Eye Start AF System (on off selectable) YES AF Area: Wide focus area YES (auto with 15 areas) AF Area: Spot YES AF Area: Local focus area selection YES AF Area: Multi Point NO AF Area: Center Weighted NO AF Area: Flexible Spot NO AF Modes Single-shot AF, Automatic AF, Continuous AF Predictive Focus Control YES Focus Lock YES AF Illuminator YES (built-in, Flash type) AF Illuminator range (meters) Approx. 1-5Auto Exposure SystemLight metering type 1200-zone evaluative metering Light metering cell Exmor™ APS HD CMOS sensor Light metering: Multi segment YES Light metering: Spot YES Light metering: Center weighted YES Exposure: Automatic YES Exposure: Program Auto YES Exposure: iAUTO YES Exposure: AUTO+ NO Superior Auto YES Exposure: Shutter priority YES Exposure: Aperture priority YES Exposure: Manual YES Exposure: Scene selection YES Sweep Panorama YES Anti Motion Blur NO AE Lock YES Exposure compensation YES, +/- 3.0EV (1/3EV steps) AE Bracketing With 0.3 EV, 0.7 EV, 1.0 EV, 2.0 EV, 3.0 EV increments, 3 framesShutterType Electronically-controlled, vertical-traverse, focal-plane type Shutter Speed Range   (seconds) 1/4000 - 30 and bulb Flash Sync Speed; second 1/160 Flash Sync Speed (With Steady Shoot On); second 1/160FlashBuilt-in-Flash Guide Number (in meters at ISO 100) 10 Flash Metering System ADI / Pre-flash TTL Flash Compensation +/- 2.0EV (1/3EV steps) Built-in-Flash Recycling Time (approx. time in seconds) 4 Flash Mode Autoflash, Fill-flash, Slow sync, Rear flash sync, Red-eye reduction Wireless flash mode YES (with optional compatible accessory flash) Red-Eye Reduction YES Flash Popup AutoViewfinderType Electronic, Xtra Fine Focusing Screen NO Field of View (%) 100 Magnification (with 50mm lens at infinity) 0.88x Eye Relief Approx. 26.5mm from the eyepiece (Magnification setting : Maximum) Approx.   23mm from the eyepiece (Magnification setting : Standard) Diopter Adjustment -4.0 to +4.0m-1Live ViewLive View YESLCD screenScreen Size 6.7cm(2.7type) Monitor Type TFT LCD Total Dot Number 460800 Brightness adjustable YES Tilting screen YESRecordingDrive Mode Single, Continuous, 10 seconds and 2 seconds Self-timer, Bracket   (continues, single, white balance bracket) Continuous-Advance Rate (approx. frames per second at maximum) max. 8 fps Number of Continuous Advance Tele-zoom Continuous Advance priority AE] Fine: 16 images/Standard: 19   images, Continuous shooting- Fine: 7 images/Standard: 8 images/RAW &   JPEG: 5 images/RAW: 6 images Recording Media Memory Stick PRO Duo™, Memory Stick PRO-HG Duo™, Memory Stick XC-HG Duo™,   SD, SDHC, SDXC memory cards Recording Format JPEG (DCF Ver. 2.0, Exif Ver. 2.3, MPF Baseline compliant), RAW (Sony ARW   2.3 format), RAW & JPEG Image Size L - JPEG (pixels) 5456 x 3632 (20M) Image Size M (pixels) 3872 × 2576 (10M) Image Size S (pixels) 2736 x 1824 (5M) Panorama size:Max. degrees of sweep angle(focal length 16mm/18mm) Wide: horizontal 12,416 x 1,856 (23M), vertical 5,536 x 2,160 (12M),   Standard: horizontal 8,192 x 1,856 (15M), vertical 3,872 x 2,160 (8.4M) 3D Panorama size:Max. degrees of sweep angle(Focal length:16mm/18mm) NO Still Image quality RAW, RAW+JPEG, JPEG Fine, JPEG Standard Movie Recording Format AVCHD / MP4 Video Compression MPEG-4 AVC (H.264) Audio recording Format Dolby Digital (AC-3) / MPEG-4 AAC-LC, 2ch Movie recording mode - AVCHD 1920 x 1080 (50i 24 Mbps, 50i 17 Mbps, 25p 24 Mbps, 25p 17 Mbps) Movie recording mode - MP4 1440 x 1080(Approx.25fps, 12Mbps(Average bit-rate) Noise Reduction (Long exp.NR) On/Off, available at shutter speeds longer than 1 second Noise Reduction (High ISO NR) YES Noise Reduction (Multi Frame NR) YES Color Space (sRGB) YES Color Space (Adobe RGB) YES Color mode/DEC/Creative styles Standard, Vivid, Portrait , Landscape, Sunset, Black & White,   Contrast, Saturation, Sharpness Dynamic Range Optimizer Off, Auto, Advanced: LevelPlayback/EditWhite/Black Out Alert YES Index Playback YES Enlarge (Maximum magnification) L: 15x, M: 11x, S: 7.7x Image Rotation YES Auto Image Rotation YESGeneralInfoLITHIUM Battery Indicator YES Histogram Indicator YES Exif YES Exif Print YES PictBridge NO Menu Language English, French, German, Spanish, Italian, Portuguese, Dutch, Russian,   Swedish, Danish, Norwegian, Finish, Polish, Czech, Hungarian, Greek, Turkish Zone Matching NO Depth-of-Field Preview YES PRINT Image Matching III YES Remote Release Terminal NO IR Remote Control NO DPOF(Digital Print Order Format) YES Indicator of remaining memory space YES Beep Sound On/Off selectable File Number Memory On/Off selectable Folder Name Mode Standard and Date Operating Temperature (degrees C) 0 - 40JacksVideo Out NO HD/HDMI® Out YES USB 2.0 Hi-Speed YES USB Mode Mass-storage, MTPPower/OthersBattery System NP-FM500H Supplied Battery NP-FM500H Stamina (battery life in CIPA condition) Approx.690 shots (Viewfinder) / approx.700 shots (LCD monitor) (CIPA   standard) Weight (g) (Body only) Approx. 492DimensionsWidth (mm) 128.6 Height (mm) 95.5 Depth (mm) 77.7",
    "menulanguage": "English, French, German, Spanish, Italian, Portuguese, Dutch, Russian,   Swedish, Danish, Norwegian, Finish, Polish, Czech, Hungarian, Greek, Turkish",
    "lightmeteringcenterweighted": "YES",
    "manufacturer": "Sony",
    "dpofdigitalprintorderformat": "YES",
    "boxcontents": "No",
    "irremotecontrol": "NO",
    "afmodes": "Single-shot AF, Automatic AF, Continuous AF",
    "superiorauto": "YES",
    "recordingmedia": "Memory Stick PRO Duo™, Memory Stick PRO-HG Duo™, Memory Stick XC-HG Duo™,   SD, SDHC, SDXC memory cards",
    "eyerelief": "Approx. 26.5mm from the eyepiece (Magnification setting : Maximum) Approx.   23mm from the eyepiece (Magnification setting : Standard)",
    "model": "Sony A58 &18-55mm",
    "autoimagerotation": "YES"
}