{
    "meteringrange": "Spot: EV 2 to 21; Center Weighted: EV 1 to 21; Center Spot: EV 1 to 21",
    "weight": "1.8 lb / 830 g (body only)",
    "powersupply": "Rechargeable Li-ion battery (7.2 VDC / 2900 mAh)",
    "isorange": "16 to 6400 (excluding any exposure adjustment)",
    "category": "camera",
    "flashsync": "TTL hot-shoe on viewfinder or standard PC connector on camera body",
    "dimensions": "5.7 x 4.3 x 3.5\" / 144 x 110 x 88 mm",
    "flashcontrol": "Automatic TTL-OTF center weighted system. Uses built-in flash or flashes compatible with SCA3002 (Metz). Output can be adjusted from -3 to +3EV. For manual flashes a built-in metering system is available.",
    "flashmetering": "Available when using manually controlled flashes",
    "multiexposure": "2, 3, 4, 5 and no limit. Available with film only",
    "focusingscreen": "Acute Matte type D with markings for spot metering area and AF sensitive area. Optional screens with grid and/or format markings available",
    "imageformat": "56 x 41.5 mm",
    "focusing": "Automatic and manual focusing. Instant manual focus override. AF metering with passive central cross-type   sensor. Metering range EV 1 to 19 at ISO100. High power white focus assist LED for low light conditions",
    "viewfinders": "•HV 90x: 90° eye-level viewfinder w. diopter adjustment (-4 to +2.5D). Image magnification 2.7 times. Integral fill-flash (G.No. 12 @ ISO100). Hot shoe for SCA3002-system flashes from Metz •HV 90x-II: 90° eye-level viewfinder w. diopter adjustment (-4 to +2.5D). Image magnification 2.7 times. Integral fill-flash (G.No. 12 @ ISO100). Hot shoe for SCA3002-system flashes from Metz •HVD 90x: 90° eye-level viewfinder w. diopter adjustment (-5 to +3.5D). Image magnification 3.1 times. Integral fill-flash (G.No. 12 @ ISO100). Hot shoe for SCA3002-system flashes from Metz •HVM: Waist-level viewfinder",
    "cameratype": "SLR type medium-format camera with optional interchangeable lenses, viewfinder and magazines",
    "exposuremodes": "Manual, Aperture priority, Shutter speed priority, Programmed and Programmed Variable",
    "shutter": "Electronically controlled integral lens shutter in each lens. Shutter speed range 1/800th second to 18 hours",
    "exposuremetering": "Spot, Center Spot and Center Weighted (with HV 90x-II and HVD 90x) Exposure lock with separate button on camera",
    "lcddisplay": "Two dot-matrix LCDs (one on the camera grip and one in the viewfinder)",
    "intervalshooting": "1 second to 1 hour. Maximum 32 frames with film (unlimited with digital back).",
    "focusingmodes": "Manual with optional focus indication in viewfinder Single shot AF and Continuous AF. Focus lock available in AF modes either with shutter release or any of the four programmable buttons. True Focus to compensate for focus shift when re-composing",
    "lenses": "Hasselblad HC and HCD lenses with integral lens shutter. Autofocus or manual focusing. All C-type lenses from the V system with optional CF lens adapter"
}