{
    "exposurebracketing": "2 – 9 frames, in steps of1/3, 1/2, 2/3, or 1EV, 2–5 frames in steps of 2 or 3 EV",
    "exposurecompensation": "Can be adjusted by –5 – +5EV, in steps of1/3 or 1/2EV, in P, S, A, M, SCENE, and night vision modes",
    "reflexmirror": "Quick-return type",
    "speed": "1/4000–, 30s, in steps of 1/3 or 1/2 EV, bulb, time, X200",
    "monitorresolution": "Approx.1229k-dot, (VGA; 640 x RGBW x 480 = 1,228,800 dots)",
    "sensorsize": "35.9mm, x24.0mm",
    "totalpixels": "24.93million",
    "diopteradjustment": "–3 – +1m{sup(-1)}",
    "accessoryterminal": "Wireless remote controllers: WR-1, WR-R10 (available separately) Remote cord: MC-DC2 (available separately) GPS unit: GP-1/GP-1A (available separately)",
    "cardslot": "Double slot: Slot 2 can be used for overflow or backup storage or for separate storage of copies created using NEF+JPEG; pictures can be copied between cards.",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (single-servo AF) or by pressing AE-L/AF-L button",
    "detectionrange": "–3 – +19 EV (ISO 100, 20 {deg}C/68 {deg}F)",
    "shippingweight": ":(kg or dimension) : 3",
    "adlbracketing": "2 frames using selected value for one frame or 3–5 frames using preset values for all frames",
    "dimensionswxhxd": "Approx.140.5, x113, x78mm (5.6, x4.5, x3.1in.)",
    "communicationsprotocols": "IEEE 802.11b: DSSS/CCK IEEE 802.11g: OFDM",
    "shipto": ":Within Malaysia",
    "flashreadyindicator": "Lights when built-in flash or optional flash unit is fully charged; blinks after flash is fired at full output",
    "compatiblelenses": "Compatible with AF NIKKOR lenses, including type G, E, and D lenses (some restrictions apply to PC lenses) and DX lenses (using DX 24 x 16 1.5x image area), AI-P NIKKOR lenses, and non-CPU AI lenses (A and M modes only). IX NIKKOR lenses, lenses for the F3AF, and non-AI lenses can not be used. The electronic rangefinder can be used with lenses that have a maximum aperture of f/5.6 or faster (the electronic rangefinder supports the 11 focus points with lenses that have a maximum aperture of f/8 or faster).",
    "standards": "IEEE 802.11b, IEEE 802.11g",
    "mode": "Auto, auto with red-eye reduction, auto slow sync, auto slow sync with red-eye reduction, fill-flash, red-eye reduction, slow sync, slow sync with red-eye reduction, rear-curtain with slow sync, rear-curtain sync, off; Auto FP High-Speed Sync supported",
    "wirelesssetup": "Supports WPS",
    "audioinput": "Stereo mini-pin jack (3.5 mm diameter; plug-in power supported)",
    "accessoryshoe": "ISO 518 hot-shoe with sync and data contacts and safety lock",
    "weight": "Approx.840g (1 lb 13.7 oz), with battery and memory card but without body cap; approx. 750 g (1 lb 10.5 oz; camera body only)",
    "liveviewshooting": "Live view photography (still images), Movie live view (movies)",
    "effectivepixels": "24.3million",
    "category": "camera",
    "batterypack": "Optional MB-D16 multi-power battery pack with one Nikon EN-EL15 rechargeable Li-ion battery or six AA alkaline, Ni-MH, or lithium batteries",
    "picturecontrolsystem": "Standard, Neutral, Vivid, Monochrome, Portrait, Landscape, Flat, ; selected Picture Control can be modified; storage for custom Picture Controls",
    "isosensitivityrecommendedexposureindex": "ISO100–, 12800, in steps of1/3 or 1/2EV, Can also be set to approx. 0.3, 0.5, 0.7, or 1 EV (ISO 50 equivalent) below ISO 100 or to approx. 0.3, 0.5, 0.7, 1, or 2 EV (ISO 51200 equivalent) above ISO 12800; auto ISO sensitivity control available",
    "tripodsocket": "1/4–in. (ISO 1222)",
    "selftimer": "2 s, 5 s, 10 s, 20 s; 1–9 exposures at intervals of 0.5, 1, 2, or 3 s",
    "imagesensorformat": "FX",
    "autofocussystem": "Nikon Advanced Multi-CAM 3500 II autofocus sensor module with TTL phase detection, fine-tuning, 51 focus points (including 15 cross-type sensors; f/8 supported by 11 sensors), and AF-assist illuminator (range approx. 0.5–3 m/1 ft 8 in.–9 ft 10 in.)",
    "effectiveangleofview": "Nikon FX format",
    "lensmount": "Nikon F mount, (with AF coupling and AF contacts)",
    "security": "Authentication: Open system, WPA2-PSK Encryption: AES",
    "flashbracketing": "2 – 9 frames in steps of 1/3, 1/2, 2/3, or 1 EV, 2–5 frames in steps of 2 or 3 EV",
    "imagesensortype": "CMOS",
    "builtinflash": "Auto, portrait, child, close up, night portrait, party/indoor, pet portrait, color sketch: Auto flash with auto pop-up P, S, A, M, food: Manual pop-up with button release",
    "range": "(ISO 100, f/1.4 lens, 20 {deg}C/68 {deg}F) Matrix, center-weighted, or highlight-weighted metering: 0–20 EV Spot metering: 2–20 EV",
    "operatingenvironment": "Temperature: 0 {deg}C–40 {deg}C (+32 {deg}F–104 {deg}F) Humidity: 85% or less (no condensation)",
    "lensaperture": "Instant return, electronically controlled",
    "fileformat": "MOV",
    "battery": "One EN-EL15 rechargeable Li-ion battery",
    "metering": "TTL exposure metering using main image sensor",
    "depthoffieldpreview": "Yes, Pressing Pv button stops lens aperture down to value selected by user (A and M modes) or by camera (other modes)",
    "rangelineofsight": "Approximately 30 m/98 ft (assumes no interference; range may vary with signal strength and presence or absence of obstacles)",
    "operatingfrequency": "2412–2462 MHz (channels 1–11)",
    "audiorecordingformat": "Linear PCM",
    "magnification": "Approx. 0.7x (50 mm f/1.4 lens at infinity, –1.0m{sup(-1)})",
    "meteringmethod": "Matrix, center-weighted, or highlight-weighted",
    "dustreductionsystem": "Image sensor cleaning, Image Dust Off reference data (Capture NX-D software required)",
    "remotereleasemodes": "Delayed remote, quick-response remote, remote mirror-up (ML-L3)",
    "videocompression": "H.264/MPEG-4 Advanced Video Coding",
    "focusingscreen": "Type B BriteView Clear Matte Mark III screen with AF area brackets (framing grid can be displayed)",
    "whitebalancebracketing": "2–3 frames in steps of 1, 2, or 3",
    "paymentmethod": ":Internet Banking, ATM / Bank In, Bank Transfer, Cash on Collection (COC), Cheque, Credit Card",
    "audiooutput": "Stereo mini-pin jack (3.5 mm diameter)",
    "datarate": "54 Mbps Maximum logical data rates according to IEEE standard. Actual rates may differ.",
    "type": "Electronically-controlled vertical-travel focal-plane shutter",
    "guidenumber": "Approx. 12/39, 12/39 with manual flash (m/ft, ISO 100, 20 {deg}C/68 {deg}F)",
    "framesizepixelsandframerate": "1920 x 1080; 60 p (progressive), 50 p, 30 p, 25 p, 24 p 1280 x 720; 60 p, 50 p Actual frame rates for 60 p, 50 p, 30 p, 25 p, and 24 p are 59.94, 50, 29.97, 25, and 23.976 fps respectively; options support both high and normal image quality",
    "otheroptions": "Index marking, time-lapse photography",
    "viewfinder": "Eye-level pentaprism single-lens reflex viewfinder",
    "shippingmethod": ":Courier Services, Self Collect, Others :, Poslaju",
    "control": "TTL: i-TTL flash control using RGB sensor with approximately 91K (91,000) pixels is available with built-in flash; i-TTL balanced fill-flash for digital SLR is used with matrix, center-weighted, and highlight-weighted metering, standard i-TTL flash for digital SLR with spot metering",
    "afareamode": "Face-priority AF, Wide-area AF, Normal-area AF, Subject-tracking AF",
    "exposuremetercoupling": "CPU, AI",
    "flashsyncspeed": "X=, 1/200s, ; synchronizes with shutter at 1/250 s or slower (flash range drops at speeds between 1/200 and 1/250 s)",
    "frameadvancerate": "Approx.6fps, 1–6 fps (CL), 6.5 fps (CH), or 3 fps (Qc)",
    "nikoncreativelightingsystemcls": "Nikon CLS supported; commander mode option available",
    "media": "SD, SDHC (UHS-I compliant), SDXC (UHS-I compliant)",
    "accessprotocols": "Infrastructure",
    "syncterminal": "AS-15 sync terminal adapter (available separately)",
    "playback": "Full-frame and thumbnail (4, 9, or 72 images or calendar) playback with playback zoom, movie playback, photo and/or movie slide shows, histogram display, highlights, photo information, location data display, and auto image rotation",
    "monitortype": "low-temperature polysilicon tilting TFT LCD with approx. 170 {deg} viewing angle, approx. 100% frame coverage, and brightness and angle adjustment",
    "autofocus": "Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected)",
    "lensservo": "Autofocus (AF): Single-servo AF (AF-S); full-time servo AF (AF-F) Manual focus (M)",
    "focuspoint": "51, Can be selected from 51 or 11 focus points",
    "flashcompensation": "-3 – +1 EV in steps of 1/3 or 1/2 EV",
    "monitorsize": "8cm (3.2–in.) diagonal",
    "imagesizepixels": "FX (36x24) image area, (L)6016, x4016, (M)4512, x3008, (S)3008, x2008, 1.2x (30x20) image area, (L)5008, x3336, (M)3752, x2504, (S)2504, x1664, DX (24x16) image area, (L)3936, x2624, (M)2944, x1968, (S)1968, x1312, FX-format photographs taken in movie live view, (L)6016, x3376, (M)4512, x2528, (S)3008, x1688, DX-format photographs taken in movie live view, (L)3936, x2224, (M)2944, x1664, (S)1968, x1112, Note: Photographs taken in movie live view have an aspect ratio of 16 : 9. The camera offers a choice of DX- and FX-based formats.",
    "meteringsystem": "TTL exposure metering using RGB sensor with approximately 91K (91,000) pixels",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "activedlighting": "Auto, Extra high, High, Normal, Low, Off",
    "eyepoint": "21 mm (–1.0 m{sup(-1)}; from center surface of viewfinder eyepiece lens)",
    "acadapter": "EH-5b AC adapter; requires EP-5B power connector (available separately)",
    "modes": "S (single frame), CL (continuous low speed), CH (continuous high speed), Q (quiet shutter-release), Self-timer, MUP (mirror up), Qc (quiet continuous shutter-release)",
    "filesystem": "DCF 2.0, DPOF, Exif 2.3, PictBridge",
    "audiorecordingdevice": "Built-in or external stereo microphone; sensitivity adjustable",
    "framecoverage": "FX (36x24): Approx. 100% horizontal and 100% vertical, 1.2x (30x20): Approx. 97% horizontal and 97% vertical, DX (24x16): Approx. 97% horizontal and 97% vertical",
    "whitebalance": "Auto (2 types), incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual (up to 6 values can be stored, spot white balance measurement available during live view), choose color temperature (2500 K–10000 K), all with fine-tuning"
}