{
    "ethernettechnology": "Fast Ethernet",
    "producttype": "Network Camera",
    "connectivitytechnology": "Cable",
    "audiolinein": "Yes",
    "illumination": "Minimum 0 Lux",
    "securityfeatures": "Administrator and user group protection Password authentication HTTP and RTSP digest encryption",
    "networkrj45": "Yes",
    "features": "ePTZ Motion Detection",
    "category": "camera",
    "statusindicators": "LEDs: Power Status",
    "audiolineout": "Yes",
    "colorsupported": "Color",
    "maximumframerate": "30 fps",
    "imagesensorsize": "1/4\"",
    "maximumvideoresolution": "1280 x 800",
    "manufacturerpartnumber": "DCS-7010L",
    "videoformats": "H.264 MPEG-4 Motion JPEG",
    "focallength": "4.3 mm",
    "weightapproximate": "510 g",
    "viewingangle": "83.3°",
    "manufacturerwebsiteaddress": "http://www.dlink.ca",
    "brandname": "D-Link",
    "protocols": "IPv4 IPv6 TCP/IP UDP ICMP DHCP NTP DDNS DNS SMTP FTP HTTP HTTPS PPPoE UPnP RTP RTSP RTCP IP COS QoS Multicast IGMP ONVIF",
    "manufacturer": "D-Link Systems, Inc",
    "applicationusage": "Outdoor",
    "imageformats": "JPEG",
    "imagesensortype": "CMOS",
    "productmodel": "DCS-7010L",
    "maximumpowerconsumption": "5.40 W",
    "aperturerange": "f/2",
    "productname": "DCS-7010L HD Mini Bullet Outdoor Network Camera",
    "digitalzoom": "10x",
    "systemrequirements": "OS Supported: Microsoft Windows7, Vista, or XP (for CD-ROM Setup Wizard), Mac OS or Linux Processor: PC with 1.3GHz or above Memory: At least 128MB RAM Browser Supported: Internet Explorer 7 or above, Firefox 3.5 or above, Safari 4 and Chrome 8.0 or above Existing 10/100 Ethernet-based network A MicroSD memory card (optional) is required for recording to onboard storage. SDHC Class 6 or above is recommended Broadband Internet connection",
    "lensincluded": "Yes",
    "ethernet": "Yes",
    "platformsupported": "PC Mac",
    "marketinginformation": "24/7 HD Surveillance for Your Home or Office The DCS-7010L is built with a megapixel image sensor to give you high-quality snapshots and video with resolutions up to 720p HD. This gives you sharp, high-resolution snapshots and videos with rich detail. Get a closer look with ePTZ, which lets you zoom in, zoom out, and pan across your camera's video so you can survey a large area easily. An infrared cut removable (ICR) filter is also built into the DCS-7010L, which blocks infrared light during the day for improved image quality. At night, it moves out of the way to use all available light for low-light surveillance, and paired with a powerful IR LED illuminator with a 10 meter range, this camera can monitor an area even in complete darkness."
}