{
    "ethernettechnology": "Fast Ethernet",
    "audioformats": "PCM AMR",
    "connectivitytechnology": "Cable",
    "producttype": "Network Camera",
    "illumination": "Minimum 0 Lux",
    "networkrj45": "Yes",
    "category": "camera",
    "statusindicators": "LEDs: Power Link/Act",
    "audiolineout": "Yes",
    "tilt": "90° to 20°",
    "certificationsstandards": "CE FCC",
    "colorsupported": "Color",
    "maximumframerate": "30 fps",
    "imagesensorsize": "1/4\"",
    "manufacturer": "TRENDnet",
    "manufacturerpartnumber": "TV-IP262PI",
    "swivel": "-175° to 175°",
    "videoformats": "MPEG-4 H.264 Motion JPEG",
    "focallength": "3.6 mm",
    "weightapproximate": "570 g",
    "viewingangle": "89°",
    "manufacturerwebsiteaddress": "http://www.trendnet.com",
    "brandname": "TRENDnet",
    "lensmounttype": "Board Mount",
    "packagecontents": "Megapixel PoE Day / Night Dome Internet Camera Multi-language Quick Installation Guide CD-ROM (Utility, Software, and User's Guide) Power Adapter (12 V DC, 1.5 A) Network Cable (1.5 m / 5 ft.) Camera Mounting Hardware",
    "protocols": "TCP/IP IPv4 DHCPv6 UDP ICMP DHCP NTP DNS DDNS SMTP FTP HTTP HTTPS PPPoE UPnP Bonjour RTP RTSP SSL RTCP 3GPP ONVIF",
    "greencompliancecertificateauthority": "WEEE RoHS",
    "applicationusage": "Indoor",
    "imagesensortype": "CMOS",
    "productmodel": "TV-IP262PI",
    "maximumpowerconsumption": "7 W",
    "aperturerange": "f/2",
    "maximumvideoresolution": "1280 x 1024",
    "greencompliant": "Yes",
    "productname": "Megapixel PoE Day / Night Dome Internet Camera",
    "digitalzoom": "3x",
    "systemrequirements": "Operating System: Windows 7 (32/64-bit) Vista (32/64-bit) XP (32/64-bit) Windows Server 2003 Windows Server 2008 Browser Supported: Internet Explorer 6.0 or above Software: SecurView Pro",
    "lensincluded": "Yes",
    "ethernet": "Yes",
    "platformsupported": "PC",
    "marketinginformation": "TRENDnet's Megapixel PoE Dome Day / Night Internet Camera, model TV-IP262PI, provides powerful megapixel night vision in complete darkness for up to 12 meters (40 feet). View and manage the tamper resistant indoor dome IP camera from any computer with an internet connection. Manually pan the camera side-to-side 350° and tilt it up-and-down 70° to fix its final viewing position. No need to install this camera near a power source, power and data are received through a single Ethernet cable using Power over Ethernet (PoE) technology. View this camera on your mobile device with TRENDnet's free mobile Apps. Manage up to 32 TRENDnet cameras with the included complimentary camera management software. Define up to three motion detection windows used to send snapshots via email and initiate video recording. Scheduled recording sessions and define video storage location with Samba client support. Program H.264, MPEG-4, and MJPEG dual streaming videos. Other features include two-way audio support (mic and speaker sold separately), date / time text overlay, mask overlay to conceal sensitive areas, and image flip capabilities for upside down installations. Integrated cabling allows for easy wall / ceiling mounting and the off-white IP camera housing blends into most environments."
}