{
    "attr": "Please call or email us with any additional information that you feel may assist us in the processing of your order.",
    "exposurebracketing": "3 continuous or single shots in 1/3 or 2/3 EV steps",
    "weight": "6.9 oz. (194g)",
    "itemincludesprecisiondesign8sd2microsdmemorycardcasewith1yearprecisiondesignusawarranty": "Precision Design Memory Card Case Secure your memory cards and protect your digital photos. The Precision Design Memory Card Case provides protection and durability where it counts, and keeps up to 8 SecureDigital (SD) cards safe from impacts, moisture and other hazards. This tough plastic case also includes two microSD card holders (shaped like standard SD cards) that can be used to securely store these especially small memory cards.",
    "isosensitivity": "Stills: ISO 100-16000 selectable in 1 EV steps, Auto (100-3200) Movies: ISO 100-3200 selectable in 1 EV steps, Auto (200-3200)",
    "attr8009913350": "(631) 389-2138",
    "shutterspeeds": "1/4000 to 30 seconds, bulb",
    "exposurecompensation": "Still images: +/-3.0 EV(1/3EV steps selectable) Movies: +/-2.0 EV(1/3EV steps selectable)",
    "effectivepixels": "20.1 million",
    "imagestabilization": "Yes (Optical SteadyShot)",
    "powersource": "NP-FW50 Lithium-ion Battery",
    "itemincludesfreeprintsfromyorkphotowith": "50 FREE PRINTS from York Photo Superb archival quality prints that won't fade over time York Photo is your best resource for turning great photos into lasting memories! As part of this kit, we will give you 50 4x6 digital prints , FREE when you register online as a new York Photo customer. York Photo will send you an email with a unique link to create your free account and take advantage of this special offer. Click Here for Offer Details and Additional Information Membership is free at York Photo. As a leading online provider of digital prints, books, calendars, and photo gifts, York makes superior quality products at everyday low prices. Upload your digital photos and start exploring everything that online photography has to offer! York makes it incredibly easy for you to get great prints and more. On future orders , York offers 4x6 digital prints for as low as 9Â¢ each and sends you special discounts and promotions. Plus, you can share and edit your pictures for free. York Photo... developing smiles for more than 50 years!",
    "maximummagnification": "0.3x (APS-C)",
    "attr1": "Sony Alpha A3000 Digital Camera & 18-55mm Lens (Black)",
    "imagesizes": "Max Effective Resolution: L (20 MP) 5456 x 3632 16:9: L (17 MP) 5456 x 3064, M (8.4 MP) 3872 x 2176, S (4.2 MP) 2736 x 1536 3:2: L (20 MP) 5456 x 3632, M (10 MP) 3872 x 2576, S (5 MP) 2736 x 1824 Panorama: Horizontal Wide: 12,416 x 1,856 (23M) / Horizontal Std.: 8,192 x 1,856 (15M) / Vertical Wide: 2,160 x 5,536 (12M) / Vertical Std.: 2,160 x 3,872 (8.4M)",
    "shippingpricecoversallshippinginsuranceandhandlingchargesimportdutiestaxeschargesarenotincludedinitempriceorshippingpricethesearethebuyersresponsibilitywecannotmarkanypackageasagiftallinternationalpackagesaremarkedebaypurchaseontheinsuranceform": "For a list of eligible countries, and current shipping rates and methods, please click eBay's \"Shipping and payments\" tab near the top of this listing.",
    "category": "camera",
    "dimensionsdiamxlength": "2-7/16 x 2-3/8\" (62 x 60mm)",
    "minimumfocusdistance": "9.8\" (0.25m)",
    "attr6552photos10mpjpg": "480 minutes of video (9Mbps)8,000 songs (4MB MP3)",
    "normalview": "0.45x Wide Angle View",
    "movie": "AVCHD / MP4 (MPEG-4 AVC (H.264))",
    "paybyphoneorebaysecureonlinecheckoutorforyourconveniencewecanprocessallpaymentsincludingpaypaloverthephone": "Click here for Frequently Asked Questions ● We automatically notify the winner by email (to the address that you have registered with eBay) immediately after listing ends. ● If you have not received an email, or you are having problems emailing us, please call us to process your order. Check your junk mail filters for any missing or misdirected email. ● All shipping methods will appear as an option in checkout or over the phone. ● We supply a sales receipt with all orders. ● Manufacturer mail-in rebate forms will be provided (if applicable: rebate info will be stated in the listing). Rebate offers are valid only to orders shipped to a USA address. ● Auction/BIN price already reflects any point of sale instant rebates, if applicable. ● When your package has shipped, you will be notified by email with the tracking number. ● We leave positive feedback for all eBay customers after the order has been shipped. ● Please include your eBay item number and shipping address with all correspondence. ● Please call or email us with any additional information that you feel may assist us in the processing of your order.Cameta Camera offers fast and friendly customer service. If you have any questions, please contact us by email or phone (see hours below), and we will do our best to address any concerns as quickly as possible. Email: Ask Seller a Question Phone: Toll Free USA Local / International (800) 991-3350 (631) 389-2138 Hours: Click here for operating hours",
    "flash": "Built-in pop-up flash Hot Shoe",
    "storage": "Memory Stick Pro Duo / Memory Stick PRO HG-Duo / SD / SDHC / SDXC",
    "monitorresolution": "230,400 Dots",
    "itemincludestranscend32gbsecuredigitalsdhc300xuhs1class10memorycardwithlifetimetranscendusawarranty": "Transcend 32GB SecureDigital (SDHC) 300x UHS-1 Class 10 Memory Card Shoot and store more pictures at blazing-fast Class 10 speed! More memory means more pictures, and you'll be able to store hundreds of high-quality photos and videos with this ultra-fast Transcend 32GB SecureDigital (SDHC) 300x UHS-1 Class 10 Memory Card . SDHC features high data transfer speeds, allowing you to capture images and video faster than with a standard SD card. Now you can shoot faster, capture super-smooth digital video, and take full advantage of your camera's maximum image quality and resolution settings . UHS-1 Cards are fully compatible with SD 3.01 standards , easy to use with plug-and-play operation and feature built-in Error Correcting Code (ECC) to detect and correct transfer errors. Approximate Storage Capacity (32GB): 6,552 photos (10MP JPG) 480 minutes of video (9Mbps) 8,000 songs (4MB MP3)",
    "sensorsize": "23.5 x 15.6mm",
    "selftimer": "2, 10 sec. delay",
    "liveview": "Continuous Live View",
    "attr3": "Spare NP-FW50 Battery for Sony",
    "playback": "Grid, Histogram display, Digital Level Gauge, Grid Line, Magnified display for playback",
    "attr5": "Precision Design PD-C15 Digital Camera/Camcorder Case",
    "attr4": "Battery Charger for Sony NP-FW50",
    "totalpixels": "20.4 million",
    "attr6": "Precision Design 50\" PD-50PVTR Compact Travel Tripod",
    "filtersize": "49mm",
    "monitortype": "TFT Clear Photo LCD",
    "exposuremodes": "iAUTO Flash Off Superior Auto Scene Selection Sweep Panorama Picture Effect Continuous Advance Priority AE Movie Programmed AE (P) Aperture priority (A) Shutter-speed priority (S) Manual (M)",
    "minimumaperture": "f/22 - 32",
    "hdrpainting": "MINIATURESOFT FOCUSRETRO PHOTO",
    "maximumaperture": "f/3.5 - 5.6",
    "attr11": "Precision Design Universal LCD Screen Protectors",
    "itemincludesprecisiondesignuniversallcdscreenprotectorswith3lcdprotectorssqueegeecard5yearprecisiondesignusawarranty": "Precision Design Universal LCD Screen Protectors Keep your LCD screen clean and protected from scratches. This package contains 3 Universal LCD Screen Protectors that can be easily cut to size, attached and removed. Each piece protects your LCD screen from scratches and wear, and reduces glare for enhanced viewing. A squeegee card is also included to make application even easier, and to reduce air bubbles. These screen protectors can be used on a variety of electronic devices including digital cameras, camcorders, cell phones, handheld video games, and more. Key Features: Prevents scratches and wear Reduces glare Helps to maintain LCD and product warranty Can be trimmed to fit any size LCD screen (up to 5 inches diagonally)",
    "cameratype": "Interchangeable Lens Digital SLR camera",
    "attr7": "Precision Design 2.5x Telephoto & .45x Wide-Angle Digital Lenses (49mm/52mm/55mm/58mm)",
    "monitorsize": "3.0 in. diagonal",
    "attr10": "Precision Design 8 SD / 2 MicroSD Memory Card Case",
    "focallength": "18-55mm",
    "flashcompensation": "Â±2.0 EV (switchable between 1/3 EV steps)",
    "lensconstruction": "9 groups, 11 elements (4 aspheric surfaces)",
    "continuousburstshooting": "Burst Buffer: JPEG Standard (30 shots) JPEG Fine (13 shots) RAW+JPEG (5 shots) Continuous Shooting Speed: Continuous mode 2.5 fps Speed Priority Continuous mode 3.5 fps",
    "pricecoversallshippinginsuranceandhandlingchargesnewyorkstaterequiresthatwecollectsalestaxonordersshippedwithinnystateallshippingoptionscanbechosenatcheckouttime": "$17.95 $32.21 $49.39",
    "sensortype": "Exmor APS HD CMOS sensor",
    "itemincludes1yearsubscriptiontooutdoorphotographymagazinevouchercardmailintoactivatewith": "1-Year Subscription to Outdoor Photography Magazine Your #1 Guide for Better Outdoor Photography is the premier magazine about outdoor photography. A one-year subscription is included as part of your purchase... that's Outdoor Photographer 11 issues packed with valuable tips, tricks and news about nature photography, conveniently delivered to your door! A prepaid Subscription Voucher Card will be included with your order, which will activate your subscription when mailed to Outdoor Photography. The first of your eleven issues will then be sent to your address (USA and Canadian addresses only) in about 10 weeks. One subscription per household. Outdoor Photography's technique articles are geared to helping you capture the best wildlife, travel and outdoor sports photography. Review photography tips and keep up with digital photography as applied to nature photography, and stay current with the latest in photography equipment. You can also explore readers' favorite places that offer the best in photography locations.",
    "focusmodes": "Single-shot AF(AF-S) Continuous AF(AF-C) Automatic AF(AF-A) selectable Direct Manual Focus (DMF) Manual Focus",
    "autofocustype": "25 points (contrast-detection AF) AF Illuminator: Built-in LED",
    "attr8": "Precision Design 49mm UV Glass Filter",
    "focustype": "Auto / Manual",
    "interface": "Multi / Micro USB Terminal",
    "flashcontrol": "Pre-flash TTL",
    "lensmount": "Sony E-mount",
    "attr2": "Transcend 32GB SecureDigital (SDHC) 300x UHS-1 Class 10 Memory Card",
    "hours": "Click here for operating hours",
    "attr13": "Free Prints from York Photo",
    "attr12": "1-Year Subscription to Outdoor Photography Magazine Voucher Card (Mail in to activate)",
    "shuttertype": "Electronically-controlled, vertical-traverse, focal-plane shutter",
    "imageformats": "JPEG (Standard, Fine), RAW, RAW+JPEG",
    "itemincludesprecisiondesign25xtelephoto45xwideangledigitallenses49mm52mm55mm58mmwith2lenspouches3stepringadapters495852585558mmfrontbacklenscovers1yearprecisiondesignusawarranty": "2.5x Telephoto & .45x Wide-Angle Digital Lenses Extend your Telephoto, Wide Angle & Macro capabilities These handy lenses have been designed to enhance your wide angle, telephoto and macro capabilities, while maintaining the full autofocus and auto exposure operations of your camera. Construction from durable , lightweight aluminum , these attachments easily fit to the front of most small-diameter lenses with a filter thread, and are themselves threaded to accept filters for further creative effects and picture control. The all-glass lens elements are fully coated to reduce reflections and flare, and will match the optical quality of today's high-performance digital cameras and camcorders. Each lens is supplied with front and rear lens caps, and soft case for protection. These lenses will fit the following filter mounts: 49mm, 52mm, 55mm, 58mm These add-on lenses work best with standard focal length lenses, such as NOTE: 18-55mm lenses included with most DSLR cameras. 2.5x Telephoto Lens: When your camera can't get you close enough to capture the action in detail, this 2.5x Telephoto lens will bring the action to you! Optically multiplying the focal length of your camera's lens by a factor of 2.5, it more than doubles your telephoto magnification and detail without any pixelization. This is dramatically better than the \"Digital Zoom\" feature of many cameras where the magnification is obtained by merely enlarging the existing image, resulting in a loss of sharpness. This 2.5x telephoto attachment is perfect for all your long-distance imaging including sports, candids, surveillance, nature and wildlife. You will also be able to utilize your camera's macro capability at over twice the usual distance , allowing for easier subject lighting with less shadows and intrusion. Normal View 2.5x Telephoto View 0.45x Wide Angle Lens: When you've run out of room, and can't possibly fit anything else into the frame, this 0.45x Wide Angle adapter will allow you to capture it all! This attachment more than doubles your camera's wide angle field-of-view . Scenic shots will be more panoramic and you'll be able to take outstanding group photos, even in tight places. In addition, the detachable Macro Lens enables you to photograph small objects up close. Great for jewelry, coins, stamps, flowers, and more. Even if your camera already has macro capability, this macro lens will get you even closer for truly amazing close-up photos. Normal View 0.45x Wide Angle View",
    "phone": "Toll Free USALocal / International",
    "exposuremeteringsystem": "Advanced 1200-zone evaluative metering Multi-segment, Center-weighted, Spot",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "itemincludesprecisiondesign6piececameralenscleaningkitwithhurricaneairblowerlenscleaningtissuesmicrofibercleaningclothlenscleaningliquidsoftbrushcottonswabs1yearprecisiondesignusawarranty": "Precision Design 6-Piece Lens & Digital SLR Cleaning Kit Essential items for the proper maintenance of your equipment. It's obvious that the cleaner the lens and camera sensor, the sharper your pictures will be. Dirt, dust, and fingerprints will degrade the image quality of even the finest optics. However, it's equally important to avoid using incorrect cleaning materials which can permanently damage your photo equipment. This 6-piece cleaning kit contains everything you'll ever need to properly clean your lenses and digital SLR camera , including an air blower, soft brush, cleaning solution, lens tissues, cotton swabs, and a microfiber cloth. Also includes a soft carrying pouch.",
    "attr9": "Precision Design 6-Piece Camera & Lens Cleaning Kit",
    "email": "Ask Seller a Question",
    "itemincludesprecisiondesign50pd50pvtrcompacttraveltripodwithcarryingcase1yearprecisiondesignusawarranty": "Precision Design 50\" PD-50PVTR Compact Travel Tripod Get increased performance and extraordinarily sharp pictures Lightweight and sturdy, this 50-inch Compact Digital Travel Tripod is ideal for keeping your camera steady in nearly any location, allowing you to capture crisp, clear, steady images with ease. With the use of a tripod, you can freely shoot at slow shutter speeds and extreme telephoto settings, and you can compose shots with precise control for perfect portraits and group pictures. Key Features: Extends to 50 inches tall, fold down to 17 inches 2.5 pound load capacity, weighs just over one pound 4-Section Aluminum Legs with Quick-Release leg locks and Non-Slip feet Quick-Release Photo/Video Platform 3-Way, 360-Degree Swivel Panhead Adjustable Tilt and Pan Controls Gearless Center Column Bubble Level Indicator Includes Nylon Carrying Case with Shoulder Strap",
    "diaphragmblades": "7",
    "viewfinder": "1/2-inch (1.3 cm) color electronic viewfinder",
    "exposurelock": "Yes (AE Lock button)",
    "nofilter": "with UV filter",
    "whitebalance": "Auto, Daylight, Shade, Cloudy, Incandescent, Fluorescent, Flash, Color temperature range 2500 to 9900K, Custom",
    "dimensionswxhxd": "4 x 2.2 x 1.5 in. (101.6 x 58.1 x 38.3mm)"
}