{
    "externalflashconnection": "Hot Shoe",
    "leftbardescstart": "DMC-GX7BKBODY Browse Our Store Store                                                                                                                         home Point & Shoot Cameras Pro. SLR Cameras Digital Camera Lenses Camcorders Projectors GPS Navigation Home audio Blu-ray / DVD PlayersLeft Bar Desc //End !Right Bar Desc //Start !Panasonic LUMIX GX7 16MP DSLM Camera w/ Tilt-Live Viewfinder Body (Black) Brand New, Never Been Used 16MP Digital Live MOS Sensor Venus Engine Image Processor Micro Four Thirds System 3.0\" 1,040k-Dot Tilting Touchscreen LCD 90&deg; Tilting 2,764k-Dot EVF Full HD 1080p AVCHD Video at 60 fps MEGA O.I.S. In-Body Image Stabilization Built-In Wireless and NFC Connectivity Focus Peaking and Magnification Windows Magnesium Alloy Body Construction Panasonic             Lumix DMC-GX7 Mirrorless Micro Four Thirds Digital Camera DMW-BLG10 ID Li-ion Battery for Lumix DMC-GF6 Camera (7.2V, 1025 mAh) Battery Charger Body Cap Shoulder Strap USB Cable CD-ROM Panasonic LUMIX GX7 16MP DSLM Came ... SPECIFICATIONS Imaging Lens Mount Micro Four Thirds Camera Format Micro Four Thirds  (2x Crop Factor) Pixels Actual: 16.84 MegapixelEffective: 16 Megapixel Max Resolution 15.8MP: 4592 x 3448 at 4:3 Other Resolutions 7.8MP: 3232 x 2424 at 4:3 3.9MP: 2272 x 1704 at 4:3 2.5MP: 1824 x 1368 at 4:3 14.1MP: 4592 x 3064 at 3:2 7MP: 3232 x 2160 at 3:2 3.5MP: 2272 x 1520 at 3:2 2.2MP: 1824 x 1216 at 3:2 11.9MP: 4592 x 2584 at 16:9 5.9MP: 3232 x 1824 at 16:9 2.1MP: 1920 x 1080 at 16:9 1.9MP: 1824 x 1024 at 16:9 11.7MP: 3424 x 3424 at 1:1 5.8MP: 2416 x 2416 at 1:1 2.9MP: 1712 x 1712 at 1:1 Sensor Type / Size MOS, 17.3 x 13 mm File Formats Still Images: JPEG, MPO, RAW Movies: MP4, MPEG-4 AVCHD Audio: AAC, Dolby Digital 2ch Dust Reduction System Yes Memory Card Type SD SDHC SDXC Image Stabilization Sensor-Shift AV Recording Video Recording Yes, NTSC Resolution 1920 x 1080: 60 fps, 30 fps, 24 fps 1280 x 720: 60 fps, 30 fps 640 x 480: 30 fps Aspect Ratio 4:3, 16:9 Video Clip Length Up to 70 Min Audio Recording Built-in Mic: With Video, Stereo, Focus Control Focus Type Auto & Manual Focus Mode Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M) Viewfinder/Display Viewfinder Type Electronic Viewfinder Pixel Count 2,764,800 Viewfinder Eye Point 17.5 mm Viewfinder Coverage 100% Viewfinder Magnification Approx. 1.39x Diopter Adjustment - 4 to +3 m Display Screen 3\" Rear Touchscreen Tilting  LCD (1,040,000) Screen Coverage 100% Live View Yes Exposure Control ISO Sensitivity Auto, 200-25600 (Extended Mode: 125-25600) Shutter Type: Electronic & MechanicalSpeed: 60 - 1/8000 sec Type: Electronic & MechanicalSpeed: 120 - 1/8000 sec in Bulb Mode Type: Electronic & MechanicalSpeed: 1/25 - 1/16000 sec in Movie Mode Remote Control DMW-AC8 (Optional) Metering Method Center-weighted average metering, Multi-zone metering, Spot metering Exposure Modes Modes: Aperture Priority, Manual, Programmed Auto, Shutter PriorityMetering Range: EV 0.0 - EV 18.0Compensation: -5 EV to +5 EV (in .3 EV steps) White Balance Modes Auto, Cloudy, Color Temperature, Daylight, Flash, Incandescent, Shade, White Set 1, White Set 2 Burst Rate Up to 5 fps at 16 MP Up to 4.3 fps at 16 MP Up to 4 fps at 16 MP Up to 2 fps at 16 MP Up to 40 fps at 3.9 MP Up to 10 fps at 3.9 MP Flash Flash Modes Auto Auto/Red-eye Reduction Flash On w/ Red-eye Reduction Forced On Off Slow Sync Slow Sync./Red-eye Reduction Built-in Flash Yes Effective Flash Range Not Specified By Manufacturer Guide No. 16.4' (5 m) ISO100 Max Sync Speed 1 / 320 sec Flash Compensation Not Specified By Manufacturer External Flash Connection Hot Shoe Performance In-Camera Image Editing Clear Retouch, Cropping, Face Recognition Edit, Favorite, Location Logging, Print Set, Protect, Resize Image, Rotate, Stop Motion Animation, Text Stamp, Time Lapse Video, Title Edit, Video Divide Continuous Shooting Up to 40 fps Self Timer 10 sec, 2 sec Wi-Fi Capable Yes Power Battery 1x   Rechargeable Lithium-Ion Battery Pack, 7.2VDC, 1025mAh AC Power Adapter DMW-AC8 (Optional) Operating/Storage Temperature Operating 32 to 104°F (0 to 40°C)Humidity: 10 - 80% Physical Dimensions (WxHxD) 4.8 x 2.8 x 2.1\" / 122.6 x 70.7 x 54.6 mm Weight 14.18 oz / 402  g with battery and memory card Back to Top PANDMCGX7BK TERMS AND CONDITIONS We usually ship within 1 business day after receiving payment. Please be aware                                                                                                                                         that weekends are not business days. All express methods of shipment still may require 1 day of processing time. Canadians and international buyers are responsible for all duties, customs                                                                                                                                         charges, and/or brokerage fees. We cannot ship as a gift, or claim as lower value. New Jersey buyers are responsible for applicable sales tax. We ship everything professionally in our state of the art warehouse. All products we sell are brand new and includes warranty coverage unless clearly                                                                                                                                         specified on the listing. \"Free Shipping\" applies to orders shipped within the continental                                                                                                                                         US. Domestic orders ship FedEx, UPS, and USPS. Our packages are insured and may require a signature. In accordance with PayPal                                                                                                                                         and eBay policies, we cannot reroute your package to a different address or hold                                                                                                                                         your shipment at the local hub for pick up, your order must be delivered to the                                                                                                                                         confirmed PayPal address received with your purchase. We cannot change your address                                                                                                                                         before the order ships. Please do not submit handling instructions in the notes                                                                                                                                         of your order requesting special handling, a specific courier or a change of address,                                                                                                                                         as we will be unable to meet these requests. We reserve the right to cancel any orders addressed to P.O. boxes, freight                                                                                                                                         forwarders, or resellers. We do not offer price protection if the price of an item                                                                                                                                         that you purchased. Prices do change frequently. We reserve the right to cancel orders placed without a registered eBay or                                                                                                                                         PayPal account. Orders placed by eBay guest checkout require additional verification                                                                                                                                         and may be delayed. Orders placed without a registered PayPal account cannot be                                                                                                                                         accepted and will be cancelled and refunded upon receipt. We offer a customer 30 day return privilege policy. A Return Merchandise Authorization                                                                                                                                             (RMA) number must be obtained for any return. To obtain an RMA number, please call                                                                                                                                             us toll free at 866-673-7187 . Returned packages without proper RMA demarcations will be refused by our warehouse                                                                                                                                             and returned to you. Customers who refuse a delivery, will be subject to charges                                                                                                                                             for return shipping to us. If the item was advertised as Free Shipping, then we                                                                                                                                             will charge the amount of shipping as determined by the FedEx shipping calculator. Some returns are subject to a restocking fee. The restocking percentage will depend                                                                                                                                             on the condition of the returned product. Defective products are eligible for exchange,                                                                                                                                             and no restock fee will apply. All returns must be packed with all contents which came with the original package                                                                                                                                             including, cables, software, plastic and cardboard packaging, and unregistered warranty                                                                                                                                             card. This return policy excludes Televisions and Home Theater Projectors. For further                                                                                                                                             questions please call us toll free at 866-673-7187 . You can also                                                                                                                                             contact us using the contact form found here . Return shipping costs are not reimbursable. International Customers: All electronic products are packaged for sale in the US with US Voltage. View International Policies Back to Top CONTACT INFO AND STORE HOURS ANY QUESTIONS? CALL US TOLL FREE: +1-866-673-7187 STORE HOURS: Monday - Friday 10:00AM to 3:00PM EST Email us anytime! Back to TopRight Bar Desc //End !",
    "acpoweradapter": "DMW-AC8 (Optional)",
    "weight": "14.18 oz / 402  g with battery and memory card",
    "battery": "1x   Rechargeable Lithium-Ion Battery Pack, 7.2VDC, 1025mAh",
    "isosensitivity": "Auto, 200-25600 (Extended Mode: 125-25600)",
    "memorycardtype": "SD SDHC SDXC",
    "viewfinderpixelcount": "2,764,800",
    "imagestabilization": "Sensor-Shift",
    "incameraimageediting": "Clear Retouch, Cropping, Face Recognition Edit, Favorite, Location Logging, Print Set, Protect, Resize Image, Rotate, Stop Motion Animation, Text Stamp, Time Lapse Video, Title Edit, Video Divide",
    "aspectratio": "4:3, 16:9",
    "viewfindercoverage": "100%",
    "category": "camera",
    "shutter": "Type: Electronic & MechanicalSpeed: 60 - 1/8000 sec Type: Electronic & MechanicalSpeed: 120 - 1/8000 sec in Bulb Mode Type: Electronic & MechanicalSpeed: 1/25 - 1/16000 sec in Movie Mode",
    "maxsyncspeed": "1 / 320 sec",
    "burstrate": "Up to 5 fps at 16 MP Up to 4.3 fps at 16 MP Up to 4 fps at 16 MP Up to 2 fps at 16 MP Up to 40 fps at 3.9 MP Up to 10 fps at 3.9 MP",
    "operatingstoragetemperature": "Operating 32 to 104°F (0 to 40°C)Humidity: 10 - 80%",
    "viewfindereyepoint": "17.5 mm",
    "lensforsd": "Body Only",
    "pixels": "Actual: 16.84 MegapixelEffective: 16 Megapixel",
    "selftimer": "10 sec, 2 sec",
    "liveview": "Yes",
    "viewfindermagnification": "Approx. 1.39x",
    "guideno": "16.4' (5 m) ISO100",
    "videorecording": "Yes, NTSC",
    "dimensionswxhxd": "4.8 x 2.8 x 2.1\" / 122.6 x 70.7 x 54.6 mm",
    "otherresolutions": "7.8MP: 3232 x 2424 at 4:3 3.9MP: 2272 x 1704 at 4:3 2.5MP: 1824 x 1368 at 4:3 14.1MP: 4592 x 3064 at 3:2 7MP: 3232 x 2160 at 3:2 3.5MP: 2272 x 1520 at 3:2 2.2MP: 1824 x 1216 at 3:2 11.9MP: 4592 x 2584 at 16:9 5.9MP: 3232 x 1824 at 16:9 2.1MP: 1920 x 1080 at 16:9 1.9MP: 1824 x 1024 at 16:9 11.7MP: 3424 x 3424 at 1:1 5.8MP: 2416 x 2416 at 1:1 2.9MP: 1712 x 1712 at 1:1",
    "meteringmethod": "Center-weighted average metering, Multi-zone metering, Spot metering",
    "audiorecording": "Built-in Mic: With Video, Stereo,",
    "whitebalancemodes": "Auto, Cloudy, Color Temperature, Daylight, Flash, Incandescent, Shade, White Set 1, White Set 2",
    "dustreductionsystem": "Yes",
    "maxresolution": "15.8MP: 4592 x 3448 at 4:3",
    "flashcompensation": "Not Specified By Manufacturer",
    "mpn": "DMC-GX7SBODY",
    "brand": "Panasonic",
    "sensortypesize": "MOS, 17.3 x 13 mm",
    "cameraformat": "Micro Four Thirds  (2x Crop Factor)",
    "screensize": "3\"",
    "focustype": "Auto & Manual",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "continuousshooting": "Up to 40 fps",
    "lensmount": "Micro Four Thirds",
    "displayscreen": "3\" Rear Touchscreen Tilting  LCD (1,040,000)",
    "fileformats": "Still Images: JPEG, MPO, RAW Movies: MP4, MPEG-4 AVCHD Audio: AAC, Dolby Digital 2ch",
    "screencoverage": "100%",
    "remotecontrol": "DMW-AC8 (Optional)",
    "diopteradjustment": "- 4 to +3 m",
    "displaytype": "TFT LCD",
    "flashmodes": "Auto Auto/Red-eye Reduction Flash On w/ Red-eye Reduction Forced On Off Slow Sync Slow Sync./Red-eye Reduction",
    "builtinflash": "Yes",
    "cameratype": "Mirrorless Interchangeable Lens",
    "exposuremodes": "Modes: Aperture Priority, Manual, Programmed Auto, Shutter PriorityMetering Range: EV 0.0 - EV 18.0Compensation: -5 EV to +5 EV (in .3 EV steps)",
    "displaysize": "3\"",
    "focusmode": "Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M)",
    "sensorresolution": "16.0 MP",
    "viewfindertype": "Electronic",
    "effectiveflashrange": "Not Specified By Manufacturer",
    "videocliplength": "Up to 70 Min",
    "supportedflashmemory": "SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "model": "DMC-GX7",
    "resolution": "1920 x 1080: 60 fps, 30 fps, 24 fps 1280 x 720: 60 fps, 30 fps 640 x 480: 30 fps",
    "wificapable": "Yes"
}