{
    "attr": "We cannot offer One Day Shipping to Puerto Rico, Guam, Virgin Islands, Palua, Northern Mariana Islands, Federated States of Micronesia, American Samoa or the Marshall Islands.",
    "exposurebracketing": "+/- 3.0 EV 0.3 or 0.5 EV increments",
    "weight": "23.8 oz. (675g) (body only)",
    "itemincludesprecisiondesign8sd2microsdmemorycardcasewith1yearprecisiondesignusawarranty": "Precision Design Memory Card Case Secure your memory cards and protect your digital photos. The Precision Design Memory Card Case provides protection and durability where it counts, and keeps up to 8 SecureDigital (SD) cards safe from impacts, moisture and other hazards. This tough plastic case also includes two microSD card holders (shaped like standard SD cards) that can be used to securely store these especially small memory cards.",
    "isosensitivity": "ISO 100 - 12800 (in 1/3-stop or whole-stop increments) ISO 25600 can be enabled with a Custom Function",
    "attr8009913350": "(631) 389-2138",
    "itemincludesprecisiondesignuniversallcdscreenprotectorswith3lcdprotectorssqueegeecard5yearprecisiondesignusawarranty": "Precision Design Universal LCD Screen Protectors Keep your LCD screen clean and protected from scratches. This package contains 3 Universal LCD Screen Protectors that can be easily cut to size, attached and removed. Each piece protects your LCD screen from scratches and wear, and reduces glare for enhanced viewing. A squeegee card is also included to make application even easier, and to reduce air bubbles. These screen protectors can be used on a variety of electronic devices including digital cameras, camcorders, cell phones, handheld video games, and more. Key Features: Prevents scratches and wear Reduces glare Helps to maintain LCD and product warranty Can be trimmed to fit any size LCD screen (up to 5 inches diagonally)",
    "shutterspeeds": "1/8000 to 1/60 sec., X-sync at 1/250 sec.",
    "exposurecompensation": "Manual: Â±5 stops in 1/3- or 1/2-stop increments AEB: Â±3 stops in 1/3- or 1/2-stop increments",
    "effectivepixels": "Approx. 20.2 megapixels",
    "imagestabilization": "No (IS available in lenses)",
    "powersource": "LP-E6 Battery Pack Optional BG-E9 Battery Grip",
    "itemincludesfreeprintsfromyorkphotowith": "50 FREE PRINTS from York Photo Superb archival quality prints that won't fade over time York Photo is your best resource for turning great photos into lasting memories! As part of this kit, we will give you 50 4x6 digital prints , FREE when you register online as a new York Photo customer. York Photo will send you an email with a unique link to create your free account and take advantage of this special offer. Click Here for Offer Details and Additional Information Membership is free at York Photo. As a leading online provider of digital prints, books, calendars, and photo gifts, York makes superior quality products at everyday low prices. Upload your digital photos and start exploring everything that online photography has to offer! York makes it incredibly easy for you to get great prints and more. On future orders , York offers 4x6 digital prints for as low as 9Â¢ each and sends you special discounts and promotions. Plus, you can share and edit your pictures for free. York Photo... developing smiles for more than 50 years!",
    "itemincludesprecisiondesignsdsdhcmicrosdhccardreaderwith1yearprecisiondesignusawarranty": "Precision Design USB 2.0 SD / microSD Memory Card Reader Easily transfer files from your SD or microSD memory card. The Precision Design USB 2.0 SD / microSD Card Reader transfers photos and videos from your SD, SDHC, microSD or microSDHC memory card to your computer quickly and easily, without the hassle of connecting your camera to the computer. It provides fast transfer speeds, universal USB 2.0 connectivity, and easy plug-and-play installation. It is compatible with both Windows and Mac , and requires no external power. Key Features: Compatible with SD, SDHC, microSD & microSDHC Easy plug-and-play installation Reads and writes data to and from memory cards Conserves camera battery life Rapid data transfer High speed USB",
    "imagesizes": "4:3 Aspect Ratio Large: Approx. 17.7 Megapixels (4864 x 3648) Medium: Approx. 7.9 Megapixels (3248 x 2432) Small 1: Approx. 4.4 Megapixels (2432 x 1824) Small 2: Approx. 2.2 Megapixels (1696 x 1280) Small 3: Approx. 0.31 Megapixels (640 x 480) RAW: Approx. 17.7 Megapixels (4864 x 3648) mRAW: Approx. 10.0 Megapixels (3648 x 2736) sRAW: Approx. 4.4 Megapixels (2432 x 1824)",
    "flashcompensation": "Up to Â±3 stops in 1/3- or 1/2-stop increments",
    "category": "camera",
    "selftimer": "10-sec. or 2-sec. delay (self-timer/remote control)",
    "itemincludes1yearsubscriptiontooutdoorphotographymagazinevouchercardmailintoactivatewith": "1-Year Subscription to Outdoor Photography Magazine Your #1 Guide for Better Outdoor Photography is the premier magazine about outdoor photography. A one-year subscription is included as part of your purchase... that's Outdoor Photographer 11 issues packed with valuable tips, tricks and news about nature photography, conveniently delivered to your door! A prepaid Subscription Voucher Card will be included with your order, which will activate your subscription when mailed to Outdoor Photography. The first of your eleven issues will then be sent to your address (USA and Canadian addresses only) in about 10 weeks. One subscription per household. Outdoor Photography's technique articles are geared to helping you capture the best wildlife, travel and outdoor sports photography. Review photography tips and keep up with digital photography as applied to nature photography, and stay current with the latest in photography equipment. You can also explore readers' favorite places that offer the best in photography locations.",
    "movie": "MOV (Image data: H.264, Audio: Linear PCM) 1920 x 1080 (29.97, 25, 23.976 fps) 1280 x 720 (59.94, 50 fps) 640 x 480 (59.94, 50 fps)",
    "flash": "Auto pop-up, retractable, built-in flash in the pentaprism",
    "storage": "SD/SDHC/SDXC card",
    "monitorresolution": "1,040,000 dots",
    "sensorsize": "22.5 x 15.0 mm CMOS sensor",
    "languages": "English, German, French, Dutch, Danish, Portuguese, Finnish, Italian, Norwegian, Swedish, Spanish, Greek, Russian, Polish, Czech, Hungarian, Romanian, Ukraine, Turkish, Arabic, Thai, Simplified/Traditional Chinese, Korean, Japanese",
    "liveview": "Live View shooting Remote Live View shooting (with a personal computer installed with EOS Utility)",
    "attr3": "Spare LP-E6 Battery for Canon",
    "playback": "Single image display (Two types of single-image full display and two types of shooting information display), Index display (4-image index and 9-image index), Jump display (1/10/100 images, shooting date, by folder, video, stills, rating), AF point display, Histogram (1. Brightness 2. RGB), Magnify zoom display (1.5x to 10x enabled in 15 steps), Rotated display (Manual, Auto) Slide Show (Image selection: Playback according to All images, Date, Folder, Movies, Stills, or Rating; Display time: 1, 2, 3, 5, 10, or 20 sec.; Repeat: Enable/Disable; Transition effect: Off, Slide in, Fade 1, Fade 2)",
    "attr5": "Precision Design DSLR300 High Power Auto Flash",
    "attr4": "Precision Design PD-BP2 Deluxe Sling Digital SLR Camera Backpack Case (Black/Silver)",
    "totalpixels": "Approx. 20.9 megapixels",
    "attr6": "Vivitar RC-6 Wireless Shutter Release Remote Control for Canon Digital SLR Cameras",
    "attr9": "Precision Design SD/SDHC & MicroSD HC Card Reader",
    "dimensionswxhxd": "5.5 x 4.1 x3.1 in. (139.0 x 104.3 x 78.5mm)",
    "email": "Ask Seller a Question",
    "monitortype": "TFT color, liquid-crystal vari-angle monitor",
    "shippingpricecoversallshippinginsuranceandhandlingchargesimportdutiestaxeschargesarenotincludedinitempriceorshippingpricethesearethebuyersresponsibilitywecannotmarkanypackageasagiftallinternationalpackagesaremarkedebaypurchaseontheinsuranceform": "For a list of eligible countries, and current shipping rates and methods, please click eBay's \"Shipping and payments\" tab near the top of this listing.",
    "monitorsize": "Wide 3.0-inch (Screen aspect ratio of 3:2)",
    "attr10": "Precision Design 8 SD / 2 MicroSD Memory Card Case",
    "continuousburstshooting": "High-speed Continuous: Max. 7.0 shots/sec. (approx.) Low-speed Continuous: Max. 3.0 shots/sec. (approx.) Burst: JPEG (Large/Fine): approx. 40 RAW: approx. 15 RAW+JPEG (Large/Fine): approx. 8",
    "pricecoversallshippinginsuranceandhandlingchargesnewyorkstaterequiresthatwecollectsalestaxonordersshippedwithinnystateallshippingoptionscanbechosenatcheckouttime": "$19.95 $33.63 $50.61",
    "sensortype": "High-sensitivity, high-resolution, large single-plate CMOS sensor",
    "phone": "Toll Free USALocal / International",
    "focusmodes": "Autofocus, One-Shot AF, Predictive AI Servo AF, AI Focus AF, Manual focusing (MF)",
    "autofocustype": "TTL secondary image-forming, phase-difference detection with AF-dedicated CMOS sensor",
    "attr8": "Precision Design HDMI to Mini-HDMI (C) Gold Audio/Video Cable (6')",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "paybyphoneorebaysecureonlinecheckoutorforyourconveniencewecanprocessallpaymentsincludingpaypaloverthephone": "Click here for Frequently Asked Questions ● We automatically notify the winner by email (to the address that you have registered with eBay) immediately after listing ends. ● If you have not received an email, or you are having problems emailing us, please call us to process your order. Check your junk mail filters for any missing or misdirected email. ● All shipping methods will appear as an option in checkout or over the phone. ● We supply a sales receipt with all orders. ● Manufacturer mail-in rebate forms will be provided (if applicable: rebate info will be stated in the listing). Rebate offers are valid only to orders shipped to a USA address. ● Auction/BIN price already reflects any point of sale instant rebates, if applicable. ● When your package has shipped, you will be notified by email with the tracking number. ● We leave positive feedback for all eBay customers after the order has been shipped. ● Please include your eBay item number and shipping address with all correspondence. ● Please call or email us with any additional information that you feel may assist us in the processing of your order.Cameta Camera offers fast and friendly customer service. If you have any questions, please contact us by email or phone (see hours below), and we will do our best to address any concerns as quickly as possible. Email: Ask Seller a Question Phone: Toll Free USA Local / International (800) 991-3350 (631) 389-2138 Hours: Click here for operating hours",
    "lensmount": "Canon EF / EF-S lens mount",
    "attr14": "Free Prints from York Photo",
    "attr11": "Precision Design 6-Piece Camera & Lens Cleaning Kit",
    "hours": "Click here for operating hours",
    "attr13": "1-Year Subscription to Outdoor Photography Magazine Voucher Card (Mail in to activate)",
    "exposuremeteringsystem": "TTL maximum aperture metering with 63-zone metering sensor Metering range: EV 1 - 20 EV",
    "shuttertype": "Vertical-travel, mechanical, focal-plane shutter with all speeds electronically-controlled",
    "imageformats": "Still: JPEG: JPG, RAW: CR2 (Canon Raw 2nd edition), RAW+JPEG",
    "meteringmodes": "Evaluative metering (linked to all AF points) Partial (6.5% at center) Spot metering (approx. 2.8% at center) Center-weighted average",
    "cameratype": "Digital, single-lens reflex, AF/AE camera",
    "itemincludesprecisiondesign6piececameralenscleaningkitwithhurricaneairblowerlenscleaningtissuesmicrofibercleaningclothlenscleaningliquidsoftbrushcottonswabs1yearprecisiondesignusawarranty": "Precision Design 6-Piece Lens & Digital SLR Cleaning Kit Essential items for the proper maintenance of your equipment. It's obvious that the cleaner the lens and camera sensor, the sharper your pictures will be. Dirt, dust, and fingerprints will degrade the image quality of even the finest optics. However, it's equally important to avoid using incorrect cleaning materials which can permanently damage your photo equipment. This 6-piece cleaning kit contains everything you'll ever need to properly clean your lenses and digital SLR camera , including an air blower, soft brush, cleaning solution, lens tissues, cotton swabs, and a microfiber cloth. Also includes a soft carrying pouch.",
    "attr7": "Xit 12\" Flexible DSLR Camera Tripod (Red/Black)",
    "shootingmodes": "Auto, No Flash, Creative Auto, Portrait, Landscape, Close-up, Sport, Night Portrait, Movie, Program AE , Shutter priority AE, Aperture priority AE, Manual, Custom",
    "attr2": "Transcend 64GB SecureDigital SDXC 300x UHS-1 Class 10 Memory Card",
    "attr1": "Canon EOS 70D Digital SLR Camera Body",
    "flashsyncterminal": "PC Sync flash terminal",
    "viewfinder": "Eye-level pentaprism 96% coverage (Vert/Horz) Approx. 0.95x (-1m-1 with 50mm lens at infinity) magnification / 27.0Â° angle of view",
    "exposurelock": "Auto AE lock - In the One-Shot AF mode with evaluative metering, AE lock takes effect when focus is achieved. Manual AE lock - With AE lock button. (AE lock is updated each time you press the button.) Enabled in all metering modes.",
    "attr12": "Precision Design Universal LCD Screen Protectors",
    "interface": "USB 2.0 Hi-Speed Video output (PAL / NTSC) HDMI connector N3 type wired remote control PC Sync flash terminal External microphone (3.5mm Stereo mini jack)",
    "whitebalance": "Auto, Daylight, Shade, Cloudy, Tungsten Light, White Fluorescent Light, Flash, Custom, Color Temperature setting",
    "flashcontrol": "E-TTL II auto flash"
}