{
    "weight": "6.35 oz (180g) without battery 7 oz (200g) loaded and ready",
    "battery": "Battery: Rechargeable Lithium-ion Battery D-LI68 Number of recordable images: approx. 250 images (with 50% flash usage), approx. 270 images (without flash usage)",
    "isosensitivity": "AUTO: ISO 100 to 6400 (1/3 EV steps) Bulb mode: up to ISO 1600",
    "imagestabilization": "Still: Sensor shift Shake Reduction",
    "category": "camera",
    "modeselection": "Auto Picture, Program, Manual, USER, Movie, Blur Correction, Av, Tv, Scene: (Portrait, Landscape, Macro, Moving Object, Night Scene Portrait, Sunset, Blue Sky, Night Scene, Night Scene HDR, Night Snap, Forest, Surf & Snow, HDR, Backlight Silhouette, Kids, Pet, Quick Macro, Food, Candlelight, Stage Lighting, Museum)",
    "facedetection": "Yes",
    "flash": "Type: Built-in retractable P-TTL flash Guide number: approx. 4.9 (ISO100/m) / approx. 7 (ISO200/m) Angle of view: coverage: wide angle-lens, equivalent to 28mm in 35mm format Flash modes: P-TTL, Red-eye Reduction, Slow-speed Sync, Trailing Curtain Sync Sync Speed: Lens shutter: 1/2000 seconds, Electronic shutter: 1/13 seconds Flash Exposure Compensation: -2.0 to +1.0 EV",
    "playbackmodes": "Playback View:Single frame, multi-image display (4, 9, 20, 42, 90 segmentation), display magnification (up to 16x, scrolling and quick magnification available), rotating, histogram (Y histogram, RGB histogram), bright/dark area warning, detailed information",
    "drivemodes": "Single frame, Continuous (Hi, Lo), Self-timer (12s, 2s), Remote Control (0 sec., 3 sec., continuous), Auto Bracketing (3 frames, remote control) Continuous Shooting: Approx. 5 fps, JPEG (12M / Best / Continuous Hi): up to 5 frames,, approx. 1.5 fps, JPEG (12M / Best / Continuous Lo): up to 100 frames Self-timer: Yes (12 sec, 2 sec) Remote control: Yes",
    "dimensionswxhxd": "4 x 2.3 x 1.3\" (102 x 58 x 33mm)",
    "sensor": "Type: 1/2.3\"Backlit CMOS w/ primary color filter Effective pixels: 12.4MP Total pixels: 12.76MP",
    "dynamicrangeadjustment": "Highlight and Shadow correction",
    "interfaces": "Ports: USB 2.0 (high-speed compatible) / AV output terminal, HDMI output terminal (Type D) Video out: NTSC, PAL USB Connection: MSC / PTP",
    "languagesupport": "English, French, German, Spanish, Portuguese, Italian, Dutch, Danish, Swedish, Finnish, Polish, Czech, Hungarian, Turkish, Greek, Russian, Korean, Traditional Chinese, Simplified Chinese, and Japanes",
    "meteringsystem": "Type: TTL image sensor metering, segment metering, center-weighted metering, spot metering Exposure compensation: EV1 - 17 (ISO 100, F1.9 lens), +2EV using the Electronic Shutter setting or using the built-in ND filter",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "storagemedia": "Removable memory: SD, SDHC, SDXC",
    "lcdmonitor": "Type: 3.0-inch TFT color LCD monitor, wide angle viewing LCD resolution: 460,000 dots Adjustable: Brightness and Color Field of View: approx. 100% Display info: Grid display (4x4 Grid, Golden Section, Scale display), Bright/dark area warning, Histogram",
    "fileformats": "Still: RAW (DNG), JPEG (Exif 2.3), DCF2.0 compliant Movie: MOV AVC/H.264(.mov) Sound: Built-in monaural microphone",
    "storecategoriesstorehomeentertainmentcentertelevisions": "1.888.209.5772 About me Contact Us Shipping Payments FAQ Pentax Q10 Compact Digital Camera with 27.5-83mm Lens, 12.4 MP Backlit CMOS - Red Body with Black Trim SKU: IPXQ10RD Mfr. Part: 12195 Item Includes Pentax Q10 Camera - 02 3x Standard Zoom Lens - USB Cable I-USB7 - Camera Strap O-ST131 - Lithium-ion Battery D-LI68 - Battery Charger D-BC68P - Software (CDROM) S-SW131 (Software: SILKYPIX Developer Studio 3.0) - Hot Shoe Cover FK - Body Mount Cover - Pentax 1 Year Warranty Description The Pentax Q10, barely larger than a deck of cards, is like its predecessor, the highly-regarded Pentax Q, which was introduced last year as one of the world's smallest interchangeable-lens digital cameras. The Pentax Q10 represents an expansion and refinement of this growing lineup of photographic tools. Those refinements include a new 12MP CMOS image sensor, improved performance and faster autofocus as well as a new lens and an adapter that allows Q users to mount any Pentax K-mount lens. Pentax Q10 Key Features: 12.4MP 1/2.3-inch (6.4x4.8mm) back illuminated CMOS sensor ISO range 100-6400 3-inch LCD monitor Quick Dial accesses creative visual effects Full 1080p HD H.264 format video at 30fps Simplified defocus effect control Shake Reduction reduces camera motion blur Auto Picture and 21 scene modes Program, Shutter Priority, Aperture Priority and Manual metering 5fps burst rate Let's take a closer look at the Pentax Q10's features. Image quality, performance: The Pentax Q10's 12MP sensor offers the same resolution as its predecessor, but the imaging engine has bee souped up. Pentax claims improved overall image quality, and built-in HDR has been added. An upgraded AF algorithm means the Q10's autofocus operation should be much faster than before, even in dimly lit locations or with a telephoto lens. An AF Assist Light is provided on the camera body to optimize focusing accuracy in the dark, while the Face Recognition AF function automatically detects up to 12 faces and pinpoints the focus on a main subject. Quick Dial: By assigning the creative Smart Effect function to the easy-to-access Quick Dial, positioned on the camera's front panel, the photographer can effortlessly add the desired finishing touch to an image, while previewing the effect on the camera's 3 inch LCD display. With four positions on the Quick Dial, the photographer can assign four of their favorite effects from the nine Smart Effect modes in advance. In order to customize the PENTAX Q10 to accommodate specific shooting styles and user preferences, the user can also assign other preferences - such as a custom image setting or a digital filter or an aspect ratio setting - to this dial. In addition to Custom Image function the Q10 offers 19 Digital Filter functions (Eleven filters such as Toy Camera, Invert Color and Posterization can be applied even during the shooting of still images and movie clips, while the remaining eight are applicable only during playback.) The user can even apply different filters one after another to a single image to create more unique visual effects. The Smart Effect function is used for simple dial control of finishing touches to quickly and effortlessly add a desired finishing touch to an image, while previewing the effect on the camera's LCD monitor. From nine Smart Effect modes, including Brilliant Color, which provides a high saturation finish, and Cross Process, with its dramatic unique-toned finish, the user can preselect up to four favorites to the dial in advance. Auto Picture Mode automatically selects the most appropriate shooting mode from such options as Portrait, Landscape and Macro for a given subject or scene, then optimizes all affecting parameters, such as shutter speed, aperture, white balance, saturation, contrast and sharpness. It also provides 21 Scene modes including Night Scene Portrait, Pet and Backlight Silhouette. Video: The Pentax Q10 comes equipped with a Full HD video capture function employing the H.264 recording format, allowing the user to capture high quality, extended movie clips (1920 x 1080 pixels) at a frame rate of 30 frames per second. The user can also take advantage of the advanced image processing tools like the Smart Effect modes and other in-body movie editing tools during movie shooting. Bokeh control: The Pentax Q10 offers a unique bokeh control function that allows the user to create images where their subject stands out by automatically assessing the relative distance between the in-focus subject and obtrusive objects in the field of view. This function simplifies the advanced, SLR-caliber technique of intentional defocusing. Shake Reduction: Pentax's Shake Reduction mechanism automatically shifts the CMOS image sensor to offset camera shake detected by the camera's motion sensor. Dust Removal: Since the Pentax Q10 is an interchangeable-lens camera, its sensor is prone to attracting distracting dust. The camera's DRII (Dust Removal II) mechanism is claimed to effectively prevent dust spots from degrading captured images after the user changes lenses out in the open. Its supersonic vibration mechanism vibrates the image sensor at high speed to shake the dust off its surface. Built-in auto flash with pop-up mechanism: The PENTAX Q10 comes with a built-in pop-up flash with a modest guide number of 7 at ISO 200/m). The photographer can use it at the default position, or raise it to the pop-up position with to widen its discharge angle to cover a 28mm angle of view (in the 35mm format). Features Compatible with PENTAX Q-mount lens system that includes prime, zoom, fisheye lenses, and others Exceptional image quality with a 12.4 megapixel backlit CMOS image sensor designed specifically to produce very low noise at high levels of sensitivity for both 12 bit DNG RAW and JPG files Full 1080p HD video at 30 frames per second using high quality h.264 compression for superior color and detail Large 3 inch LCD monitor features HVGA resolution with 460,000 dots, as well as wide viewing angles Sensor-shift Shake Reduction system with integrated DRII Dust Reduction for stabilized, blur and dust free images even in low lighting Built-in pop-up flash with extra-high extension covers 23 feet (at ISO 200) A built-in micro HDMI port outputs video and sound to modern HDTVs Traditional DSLR shooting modes (P, Av, Tv, M) with powerful automatic modes (Auto Picture, Scene) Capture up to 5 frames per second continuous shooting mode for fast action situations Upgraded auto focus algorithm and image sensor provides fast, more accurate autofocus Smart Effects modes enhance digital photography by applying a serie of effects to achieve high quality results Specifications Camera Type Digital HybridILC Sensor Type: 1/2.3\"Backlit CMOS w/ primary color filter Effective pixels: 12.4MP Total pixels: 12.76MP JPEG Recorded Resolution [4:3] 12M (4000x3000), 9M (3456x2592), 5M (2688x2016), 3M (1920x1440) [3:2] 10M (4000x2664), 8M (3456x2304), 5M (2688x1792), 2M (1920x1280) [16:9] 9M (4000x2248), 6M (3456x1944), 4M (2688x1512), 2M (1920x1080) [1:1] 9M (2992x2992), 6M (2592x2592), 4M (2016x2016), 2M (1440x1440 RAW Recorded Resolution [4:3] 12M (4000x3000) Movie Recorded Resolution Full HD (1920x1080, 16:9, 30fps), HD (1280x720, 16:9, 30fps), VGA (640x480, 4:3, 30fps) Quality Levels: RAW (12bit): DNG, JPEG: Best, Better, Good RAW and JPEG simultaneously recordabl LCD Monitor Type: 3.0-inch TFT color LCD monitor, wide angle viewing LCD resolution: 460,000 dots Adjustable: Brightness and Color Field of View: approx. 100% Display info: Grid display (4x4 Grid, Golden Section, Scale display), Bright/dark area warning, Histogram Focus System Type: Contrast detection AF Autofocus Method: Face Detection, Tracking, AF Select (25 Points), Select, Spot Focus Method: AF / MF Switching Brightness Range: EV1 to 18 (ISO100) AF Assist Light: Dedicated LED Lamp Manual Focus Assist: OFF/x2/x4 Flash Type: Built-in retractable P-TTL flash Guide number: approx. 4.9 (ISO100/m) / approx. 7 (ISO200/m) Angle of view: coverage: wide angle-lens, equivalent to 28mm in 35mm format Flash modes: P-TTL, Red-eye Reduction, Slow-speed Sync, Trailing Curtain Sync Sync Speed: Lens shutter: 1/2000 seconds, Electronic shutter: 1/13 seconds Flash Exposure Compensation: -2.0 to +1.0 EV Storage Media Removable memory: SD, SDHC, SDXC Interfaces Ports: USB 2.0 (high-speed compatible) / AV output terminal, HDMI output terminal (Type D) Video out: NTSC, PAL USB Connection: MSC / PTP Image Stabilization Still: Sensor shift Shake Reduction Metering System Type: TTL image sensor metering, segment metering, center-weighted metering, spot metering Exposure compensation: EV1 - 17 (ISO 100, F1.9 lens), +2EV using the Electronic Shutter setting or using the built-in ND filter ISO Sensitivity AUTO: ISO 100 to 6400 (1/3 EV steps) Bulb mode: up to ISO 1600 White Balance AutoTTL by CMOS image sensor Preset: Daylight, Shade, Cloudy, Fluorescent Light (D: Daylight Color, N: Daylight White W: Cool White, L: Warm White), Tungsten, Flash, CTE, Manual Manual: Configured on the monitor Fine Adjustment: Adjustable ±7 steps on A-B axis or G-M axis Shutter Type: Lens shutter: 1/2000 - 30 seconds (1/3EV step, 1/8000 - 30 seconds when Electronic Shutter setting is enabled), Bulb Shooting at 1/8000 - 2 seconds with Electronic Shutter and Bulb shooting are not available when using a lens that has no lens shutter. Mode Selection Auto Picture, Program, Manual, USER, Movie, Blur Correction, Av, Tv, Scene: (Portrait, Landscape, Macro, Moving Object, Night Scene Portrait, Sunset, Blue Sky, Night Scene, Night Scene HDR, Night Snap, Forest, Surf & Snow, HDR, Backlight Silhouette, Kids, Pet, Quick Macro, Food, Candlelight, Stage Lighting, Museum) Green Simplified Mode Yes Face Detection Yes Digital Filters Image Tone: (Bright, Natural, Portrait, Landscape, Vibrant, Radiant, Muted, Bleach Bypass, Reversal Film, Monochrome, Cross Processing) Dynamic Range Adjustment Highlight and Shadow correction Interval Shooting Shooting interval: 1 sec. to 24 hr., Start Interval setting: immediately from the set time. Number of shots: up to 999 image Drive Modes Single frame, Continuous (Hi, Lo), Self-timer (12s, 2s), Remote Control (0 sec., 3 sec., continuous), Auto Bracketing (3 frames, remote control) Continuous Shooting: Approx. 5 fps, JPEG (12M / Best / Continuous Hi): up to 5 frames,, approx. 1.5 fps, JPEG (12M / Best / Continuous Lo): up to 100 frames Self-timer: Yes (12 sec, 2 sec) Remote control: Yes Playback Modes Playback View:Single frame, multi-image display (4, 9, 20, 42, 90 segmentation), display magnification (up to 16x, scrolling and quick magnification available), rotating, histogram (Y histogram, RGB histogram), bright/dark area warning, detailed information Playback Filters Monochrome, Toy Camera, High Contrast, Shading, Slim, HDR, Invert Color, Extract Color, Color, Water Color, Posterization, Fish-eye, Retro, Soft, Sketch Filter, Miniature, Frame Composite, Starburst, Base Parameter Adjustment Playback RAW Developement File Format (JPEG), Aspect Ratio, Color Space, Custom Image, White Balance, Sensitivity, High-ISO NR, Shadow Correction, Distortion Correction Playback Edit Resize, Cropping (aspect ratio adjustment available), Index, Movie Editing (divide or deleteselected frames), Capturing a JPEG still picture from a movie, Red-eye Edit, Saving buffer as a RAW file File Formats Resize, Cropping (aspect ratio adjustment available), Index, Movie Editing (divide or deleteselected frames), Capturing a JPEG still picture from a movie, Red-eye Edit, Saving buffer as a RAW file File Formats Still: RAW (DNG), JPEG (Exif 2.3), DCF2.0 compliant Movie: MOV AVC/H.264(.mov) Sound: Built-in monaural microphone Computer Requirements Windows: Windows XP/Vista/7, USB port Mac: MacOS-X 10.4, 10.5, 10.6, USB port (For device connectivity. Bundled software requirements may vary) Language Support English, French, German, Spanish, Portuguese, Italian, Dutch, Danish, Swedish, Finnish, Polish, Czech, Hungarian, Turkish, Greek, Russian, Korean, Traditional Chinese, Simplified Chinese, and Japanes Body Construction Reinforced polycarbonate plastic Battery Battery: Rechargeable Lithium-ion Battery D-LI68 Number of recordable images: approx. 250 images (with 50% flash usage), approx. 270 images (without flash usage) Operating Temperature 32 to 104°F (0 to 40°C) Dimensions WxHxD 4 x 2.3 x 1.3\" (102 x 58 x 33mm) Weight 6.35 oz (180g) without battery 7 oz (200g) loaded and ready Specs for 02 Lens Focal length: 5-15mm (27.5-83.0mm equiv) Mount: Q-mount AOV: 6.0-29.0° Blades: 5 MOD: 11.8\" (entire zooming range) Max Magnification: Approx 0.06X Objective cap: Lens Front Cap O-LC40.5 Aperture ring: n/a Diaphragm control: Fully automatic Lens construction: 8 elements in 7 groups Aperture: F2.8-4.5 Minimum aperture: F8 Filter Diameter: 40.5mm Dimensions: 1.9 x 1.9\" Weight: 3.4 oz WHO WE ARE Adorama is one of the nation's largest Photographic retail and mail order suppliers. For over 35 years we have been serving professionals as well as amateurs in the photographic, video, digital imaging and telescope fields. We offer the best combination of quality services, vast selection, knowledgeable staff, and competitive pricing. Adorama Camera is your #1 source for the best and newest products in the photographic industry, and the largest inventory of items such as Digital Cameras, Digital Camera Accessories, Memory Cards, 35mm Cameras, Medium Format Cameras, Lenses, Video Cameras, TV's, MP3 Players, Binoculars, Telescopes, Scanners, Inkjet, Dye-Sub & Laser Printers, Office Fax machines, Shredders, Projectors, Inkjet Paper, Photographic Accessories, Filters, Batteries, Cases, Tripods, Flashes, Lighting & Studio Equipment, Film, Darkroom Products and Audio Video Equipment. All new equipment comes with all of the factory included accessories, including a full manufacturer's warranty, unless otherwise noted. We only post items that are in-stock and ready to ship. PAYMENT Paypal is our only method of payment. Your Paypal account must be a Verified US Paypal account. Selecting \"Immediate Pay\" is the way to go. If you select eCheck, it may take 2-8 days to clear Paypal. In an effort to comply with our Authorized Dealer contracts with the manufacturers and to best control our inventory levels we reserve the right to limit quantities or cancel orders to Resellers and Exporters. Please note: Inventory is not reserved until the item is paid for. Please include a phone number as UPS and our Trucking Companies require it. We prefer to ship to a confirmed Paypal address and whether yes or no we may still contact you for additional verification. For shipments in New York and New Jersey, we are required to collect the appropriate sales tax. INTERNATIONAL International taxes and duties: International shipments may be subject to import fees, duties and taxes, which are levied once a shipment reaches the respective country, in addition to the brokerage fees/custom clearance charges which may be imposed by the carrier. These charges must be borne by the recipient. Adorama has no control over these charges and cannot predict what they might be. Orders shipped using eBays (GSP) \"Global Shipping Platform\" have already paid their taxes and must contact eBay directly for any issues. SHIPPING Most purchases are shipped with 24 Business Hours. Adorama's eBay store ships to the 48 Contiguous United States including Military APO & FPO and Puerto Rico. We now ship to Canada, parts of Europe and Australia. We do not ship to other International locations. Items with \"free shipping\" are only shipped free to the 48 contiguous United States. Combined shipping is available by placing all adoramacamera eBay orders BEFORE making the Payment. eBay's new checkout offers you to consolidate your orders to get better shipping rates. All orders must be shipped with a printed invoice included. We can not ship orders without the invoice or a lower value invoice. Gift Invoices can be sent if you call us immediately after payment is made (if during business hours). No guarantees for emails in this matter. Shipment errors due to a bad address entered by the buyer and will not be credited for shipping charges if returned or at all if lost or abandoned by the carrier. We supply tracking information directly to your eBay account as well as via email within 24 hours after the shipment leaves our warehouse. Please make sure that our email messages don't go into spam or junk. Change requests may not be updated on eBay, please check the emails. All TV's over 50 inches or other large items will ship via special Truck Delivery. An appointment will be made by the Trucking Company 24 hours before final delivery. Therefore, you must provide a phone number. Please read this carefully before purchasing any TV from us. All TV's 50 inches or larger will ship via special truck delivery only. An appointment will be made by the Trucking Company 24 hours before final delivery. LCD, LED and Plasma TVs as well as Monitors from 20\" and above can not be returned unless damaged in transit. At time of arrival If your TV arrives by UPS or FedEx: Please inspect the box from the outside for visible damage. If the box is not in perfect condition you should refuse it. Once you sign for it or open the box, you can not claim in-transit damage. If the box looks fine, you can then sign for it & open the box for further inspection after the carrier/driver leaves. You should check your TV ASAP to make sure that it works fine. If there are any problems, please let us know. If your TV arrives by special truck delivery: Please inspect the TV for both, external damage AND make sure that it powers up before you sign for it. If there's any external damage to the box, or it doesn't power on, do not accept it or sign for it. (According to the trucking company rules, you need to test the TV at the closest power outlet to the door. They are not required to wait until you put the TV in its intended place or till you test the cable connections). After the truck leaves, you should further test the TV to make sure everything works perfectly. If there are any problems, please let us know. Damage claims must be reported within 24 hours of receipt. Returns Please click here for our FULL RETURN POLICY For the first 30 days from date of receipt of your purchase you may return the merchandise for a full money back refund, excluding any shipping charges (for items which we offer free shipping, our standard shipping charges will be deducted from any refund or credit). Returned or exchanged products must be in brand-new, mint condition. Items must be in the original, undamaged manufacturer's packaging with all packaging materials, including instruction booklets, packing inserts, and the blank warranty cards. Memory cards and any other Blister Pack items are not returnable once opened. Any merchandise missing the original Universal Product Code (UPC) cannot be returned. The manufacturer's labeled packaging must be enclosed within an additional shipping carton. Please do not place stickers or shipping labels on the original manufacturer's package. Printers, Desktop Computers, Laptops, Tablets & Notebooks are not returnable once they are booted up or the toner is installed, as per the manufacturers contracts, all service to be done through them directly. Please ship your parcel back to Adorama freight prepaid and Insured. Sorry, Adorama cannot accept COD or freight-collect shipments. Return shipping cost (the cost to send an item back to our store) is not reimbursable. Please enclose a copy of your invoice with your return and tell us whether you would like the item to be replaced, exchanged, or refunded. Returns can take up to 8 days in-house from the date we receive it to process. When returning an item, please make sure you use a shipper which provides you with Insurance and a tracking number. Items returned without a tracking number might take much longer to be processed. We do not require a RMA. Returns should be shipped to: ACC Order processing 7 Slater Drive Elizabeth, NJ 07206 If you live in New York you may bring the return to our Manhattan store for exchange or refund. Warranty Information Most products have the warranty length listed in the description. To obtain a free copy of the manufacturers warranty details for any product we carry, please write to us and be sure to include the Brand Name and Model Number. Adorama Camera, Inc. Warranty Requests 42 West 18th Street New York, NY 10011 Contact Us Got a question? click here Product Information: 800-223-2500 Customer Service: 888-209-5772 HOURS OF OPERATION Mon-Thurs: 9:00am - 5:00pm Friday: 9:00am - 12:00pm On Sep-26-14 at 16:29:39 PDT, seller added the following information: Protect It Now with a Consumer Priority Service Extended Warranty",
    "operatingtemperature": "32 to 104°F (0 to 40°C)",
    "cameratype": "Digital HybridILC",
    "shutter": "Type: Lens shutter: 1/2000 - 30 seconds (1/3EV step, 1/8000 - 30 seconds when Electronic Shutter setting is enabled), Bulb Shooting at 1/8000 - 2 seconds with Electronic Shutter and Bulb shooting are not available when using a lens that has no lens shutter.",
    "focussystem": "Type: Contrast detection AF Autofocus Method: Face Detection, Tracking, AF Select (25 Points), Select, Spot Focus Method: AF / MF Switching Brightness Range: EV1 to 18 (ISO100) AF Assist Light: Dedicated LED Lamp Manual Focus Assist: OFF/x2/x4",
    "intervalshooting": "Shooting interval: 1 sec. to 24 hr., Start Interval setting: immediately from the set time. Number of shots: up to 999 image",
    "whitebalance": "AutoTTL by CMOS image sensor Preset: Daylight, Shade, Cloudy, Fluorescent Light (D: Daylight Color, N: Daylight White W: Cool White, L: Warm White), Tungsten, Flash, CTE, Manual Manual: Configured on the monitor Fine Adjustment: Adjustable ±7 steps on A-B axis or G-M axis"
}