{
    "mirrorlockup": "Yes",
    "isosensitivity": "200 - 6400, Expandable to 12800",
    "noisereduction": "Yes",
    "focus": "Auto Manual",
    "exposurecompensation": "-3 EV to +3 EV (in 1/3 EV steps)",
    "autofocuspoints": "11",
    "liveview": "Yes",
    "continuousshootingtime": "1920 x 1080 20 min. 1280 x 720 20 min. 640 x 424 20 min.",
    "focustype": "Auto & Manual",
    "otherresolutions": "13.5MP: 4512 x 3000 @ 3:2 6.0MP: 3008 x 2000 @ 3:2",
    "mpn": "25492",
    "sensortype": "CMOS",
    "angleofview": "76° - 28°",
    "shutter": "Type: Electronic Speed: 30 - 1/4000 sec",
    "exposurecontrol": "Auto: Shutter Speed, Aperture, ISO Manual: Shutter Speed, ISO",
    "weight": "9.35 oz (265 g)",
    "memorycardtype": "SD SDHC SDXC",
    "additionalfeatures": "HDMI, Interchangeable Lenses, USB 2.0",
    "acpoweradapter": "EH-5b (Optional)",
    "category": "camera",
    "selftimer": "2 sec, 5 sec, 10 sec, 20 sec",
    "audiorecording": "With Video, Mono, Via Optional External Mic",
    "viewfindermagnification": "Approx. 0.8x",
    "focallength": "18 - 55 mm Comparable  35mm Focal Length: 27 - 82.5 mm",
    "filterthread": "Front: 52 mm",
    "bitdepth": "12-bit",
    "lensmount": "Nikon F",
    "pixels": "Actual: 24.7 Megapixel Effective: 24.2 Megapixel",
    "storecategoriesstorehomeipadtabletipadsipadminiipodmp3playersdigitalslrcamerascanonnikonsonydigitalpscameraspanasonicdigitalcameralensescanonnikonsonydigitalcameraaccessoriescameracasesmemorycardmemorycardreadermemorycardholderbatterieschargerwarrantyserviceplanslensfiltertripodsmonopodslenshoodcapslearningdvdotherstarterkitipodmp3accessoriesspeakers": "Nikon D3200 DSLR Camera +18-55mm - 3 Lens Kit + 16GB + Case + Battery + Filters Click an Image to Enlarge This item is 100% brand new. USA product sealed in original box & includes full USA warranty. 52mm Professional HD 2x Telephoto lens + Carry Case fit Nikon Canon Sony Lens 52mm Wide-Angle 45x Digital High Definition Lens with Macro fit Nikon Canon Sony 3-Piece Filter Kit 16 GB Secure Digital (SD) Memory Card High Speed External USB All in One Memory Card Reader & Writer SD SDHC CF MS XD Deluxe Soft Medium SLR Camera Case / Bag fit Canon EOS, Nikon, Sony Alpha Camera Multi Memory Card Wallet Digital Auto Slave Flash with Bracket EN-EL14 Replacement Rechargeable Li-ion Battery f/ Nikon D3100 D3200 D5100 D5200 ENEL14 Camera Battery Quick Charger f/ Nikon D3100 D3200 D5100 D5200 P7700 P7000 Full Size 50-inch Tripod With Leveler 360 adjust & Carryng Case for SLR Cameras Mini Flexible Taple Top Travel Tripod  with Pocket clip Lens Cap Keeper Deluxe Camera , Screen & Lens 5pc cleaning Kit Deluxe Screen Protector Pro Pack (Clear ) Take your photos and videos to the next level 24.2 MP DX-format CMOS sensor and EXPEED 3 Why do photos and videos shot with a Nikon HD-SLR look so good? It all starts with Nikonâ\u0080\u0099s exclusive image sensors, and the D3200 has the most powerful CMOS sensor weâ\u0080\u0099ve ever put in a HD-SLR at this level. Boasting an astounding 24.2 effective megapixels, it captures sharper, richer imagesâ\u0080\u0094even in low light. Combine that with EXPEED 3 image processing, the processing power behind the acclaimed Nikon D4, for super-fast operation, exceptional image capture, in-camera filter effects and more. Your photos and videos will amaze even you. Master the camera simply by using it Guide Mode ensures success Itâ\u0080\u0099s never been easier to create HD-SLR quality photos, thanks to the D3200â\u0080\u0099s Guide Mode. Learn the camera's key features and controls while you shoot, and even get advice and sample images to succeed in difficult shooting situations. Guide Mode is easy to access and easy to understand. Youâ\u0080\u0099re never shooting alone with the D3200. Capture the best of every scene Six Scene Modes and Scene Auto Selector Experienced photographers optimize their camera settings for the scene theyâ\u0080\u0099re shooting. With the D3200, optimizing your camera settings is as easy as turning a dial. Choose from six common Scene Modes like Portrait, Night Portrait, Landscape, Close up and more, for flawless results even in demanding circumstances. When using Live View, Scene Auto Selector automatically sets the D3200 for the most suitable Scene Mode for the situation. A highly accurate 420-pixel RGB sensor powers Nikon's Scene Recognition System, which compares scene data against an extensive database to optimize the shot accordingly. Create cinema-quality HD videos One-touch Full HD 1080p movie recording with stereo sound Nikon is committed to developing HD-SLRs that are not just superlative   still image cameras, but superlative video cameras, as well. With a   touch of a button, the D3200 starts recording Full HD 1080p video with   full-time autofocus, manual exposure control and stereo sound. Its   breathtaking 921,000-dot, ultra-high-resolution display makes it easy to   frame, monitor and review your footage. Even record in super-smooth   slow motion up to 60 fps! Unleash your inner cinematographer.* *Built-in microphone, monaural Optional external stereo mini-pin jack (3.5mm diameter) Microphone sensitivity can be adjusted Get a new view of your world Versatile AF-S Zoom-NIKKOR 18-55mm Nikonâ\u0080\u0099s renowned NIKKOR lenses have long been the choice of pros and   serious photographers. Marvels of clarity, consistency, precision and   reliability, they draw peak performance from Nikon HD-SLRs. The D3200   comes equipped with the AF-S DX Zoom-NIKKOR 18-55mm, a versatile, high   performance VR image stabilized lens. And when youâ\u0080\u0099re ready to expand   your system and extend your creativity, you'll have your choice of over   70 legendary NIKKOR lenses. Fast and accurate shooting The D3200's 11-point Autofocusing System is as fast as it is precise.   Check your focus points, track your subject or shoot carefree right from   the viewfinder. And when the action speeds up, simply aim, hold down   the shutter and fire off approx. 4 fps at 24.2 MP resolution. Wi-Fi Connectivityâ\u0080\u0094Now you can easily get GREAT pictures on your smartphone Using the WU-1a optional wireless mobile adapter you can now   automatically send great images to your smartphone and even use your   smartphone to remotely capture images from your D3200. With an easy to   use app, now, when you can't wait to share that great shot, you don't   have to. Share it to your smartphone in an instant. Compact, lightweight and durable Your D3200 is designed for comfort, intuitive use and durability. Its   compact, lightweight and rugged body puts key controls at your   fingertips. You'll never hesitate to bring along your D3200. Imaging Camera Type Digital SLR with Interchangeable lenses Lens Mount Nikon F Camera Format DX / (1.5x Crop Factor) Pixels Actual: 24.7 Megapixel Effective: 24.2 Megapixel Max Resolution 24MP: 6016 x 4000 @ 3:2 Other Resolutions 13.5MP: 4512 x 3000 @ 3:2 6.0MP: 3008 x 2000 @ 3:2 Aspect Ratio 3:2 Sensor Type / Size CMOS, 23.2 x 15.4 mm File Formats Still Images: JPEG, RAW Movies: MPEG-4 AVC/H.264, MOV Audio: Linear PCM Bit Depth 12-bit Noise Reduction Yes Memory Card Type SD SDHC SDXC Focus Control Focus Type Auto & Manual Focus Mode Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M) , Focus Lock AF Area Mode Autofocus Points 11 Viewfinder/Display Viewfinder Type Pentamirror, LCD Display Viewfinder Coverage 95% Viewfinder Magnification Approx. 0.8x Diopter Adjustment - -1.7 to +0.5 m Display Screen 3.0\" Rear Screen   LCD (921000) Screen Coverage 100% Angle of View 160° Live View Yes Exposure Control ISO Sensitivity 100-6400 (High Sensitivity Mode: 100-12800) Shutter Type: Electronic Speed: 30 - 1/4000 sec Remote Control ML-L3 (Optional) Mirror Lock-Up Yes Metering Method 3D Color Matrix Metering, Center-weighted average metering, Spot metering Exposure Modes Modes: Aperture Priority, Auto, Manual, Programmed Auto, Shutter Priority Compensation: -5 EV to +5 EV (in 1/3 EV steps) White Balance Modes Auto, Cloudy, Daylight, Flash, Fluorescent, Fluorescent (Day White), Fluorescent (Natural White), Fluorescent (White), Fluorescent H, Incandescent, Preset Manual, Shade Flash Flash Modes Auto Auto/Red-eye Reduction Off Second-curtain Sync Slow Sync Slow Sync./Red-eye Reduction Built-in Flash Yes Effective Flash Range Not Specified By Manufacturer Guide No. Not Specified By Manufacturer Max Sync Speed 1 / 200 sec Flash Compensation -3 EV to +1 EV (in 0.33 EV steps) Continuous Shooting Up to 4 fps Dedicated Flash System iTTL External Flash Connection Hot Shoe AV Recording Video Recording Yes, NTSC/PAL File Size 1920 x 1080 (Full HD) 1280 x 720 (HD) 640 x 424 (SD) Frame Rate @ 1920 x 1080: 30 fps, 25 fps, 24 fps @ 1280 x 720: 60 fps, 50 fps @ 640 x 424: 30 fps, 25 fps Exposure Control Auto: Shutter Speed, Aperture, ISO Manual: Shutter Speed, ISO ISO Sensitivity 200 - 6400, Expandable to 12800 Exposure Compensation -3 EV to +3 EV (in 1/3 EV steps) Focus Auto Manual Continuous Shooting Time 1920 x 1080 20 min. 1280 x 720 20 min. 640 x 424 20 min. Audio Recording With Video, Mono, Via Optional External Mic Performance In-Camera Image Editing Color Balance, Color Outline, Distortion Control, Edit Movie, Filter Effects, Fisheye, Image Overlay, Miniature Effect, Monochrome, NEF (RAW) Processing, Perspective Control, Quick Retouch, Red-eye Correction, Straighten, Trim Self Timer 2 sec, 5 sec, 10 sec, 20 sec Connectivity Audio Out, HDMI C (Mini), USB 2.0 Wi-Fi Capable (With Optional Transmitter) Yes Power Battery 1x  EN-EL14  Rechargeable Lithium-Ion Battery Pack, 7.4VDC, 1030mAh AC Power Adapter EH-5b (Optional) Operating/Storage Temperature Operating 32 to 104 °F (0 to 40 °C) Physical Dimensions (WxHxD) 5.0 x 3.8 x 3.1\" / 12.70 x 9.65 x 7.87 cm Weight 1.0 lb / 0.45 kg Kit Lens Focal Length 18 - 55 mm Comparable  35mm Focal Length: 27 - 82.5 mm Aperture Maximum: f/3.5 - 5.6 Minimum: f/22 Angle of View 76° - 28° Minimum Focus Distance 11\" (27.94 cm) Magnification 0.31x Maximum Reproduction Ratio 1:0.32 Groups/Elements 8/11 Diaphragm Blades 7 Autofocus Yes Image Stabilization Yes Filter Thread Front: 52 mm Dimensions (DxL) Approx. 2.87 x 3.13\" (7.29 x 7.95 cm) Weight 9.35 oz (265 g) Nikon     D3100 Digital SLR Camera body 18-55mm f/3.5-5.6G VR AF-S DX Nikkor Lens Front & Rear Lens Caps EN-EL14 Rechargeable Li-ion Battery MH-24 Battery Charger DK-5 Eyepiece Shield (Replacement) DK-20 Rubber Eyecup AN-DC3 Camera Strap (Black) BS-1 Hot-Shoe Cover BF-1B Body Cap Front & Rear Lens Caps ViewNX 2 CD-ROM Nikon Software Suite CD-ROM Professional HD 2x 52mm  telephoto lens When your camera can't get you close enough to capture the action in detail, this 2x Telephoto lens will bring the action to you! Optically multiplying the focal length of your camera's lens by a factor of 2, it more than doubles your telephoto magnification and detail without any pixelization. This is dramatically better than the \"Digital Zoom\" feature of many cameras where the magnification is obtained by merely enlarging the existing image, resulting in a loss of sharpness. This 2x telephoto attachment is perfect for all your long-distance imaging including sports, surveillance, nature and wildlife. You will also be able to utilize your camera's macro capability at over twice the usual distance, allowing for easier subject lighting with less shadows and intrusion.. High Speed Auto-Focus / Infrared Compatible (IR) Maximize day and night shots by providing maximum light and image transmission High Definition Optical Resolution Infrared Compatibility High Quality Precision Optics Glass 45x 52mm Wide-Angle Digital High Definition Lens with Maro This 0.45x Wide Angle adapter will allow you to capture it all! This attachment more than doubles your camera's wide angle field-of-view . Scenic shots will be more panoramic and you'll be able to take outstanding group photos, even in tight places. In addition, the detachable Macro Lens enables you to photograph small objects up close. Great for jewelry, coins, stamps, flowers, and more. Even if your camera already has macro capability, this macro lens will get you even closer for truly amazing close-up photos. High speed Auto-Focus/ Infrared compatible 0.45x high definition wide angle lens with macro Marco 4:1 ratio Premium Rimmed Glass Include Protective Lens Case Digital Multi Coated 52mm Glass Filter Kit (UV-CPL-FLD) 3pc Filter kit The UV filter protects your camera's lens from scratches, dust,  dirt, moisture and fingerprints, while removing unwanted ultraviolet  light.The UV filter reduces blue haze caused by UV light by absorbing  71% of UV. The CPL filter deepens and  intensifies blue skies, achieves vibrant colors and reduces glare and  reflections from non-metallic objects & glass surfaces. Great for  video. The Fluorescent Light Correction Filter gives  you the prefect solution for shooting without a flash under a  fluorescent light.This filter gives true-to-life colors and pleasing  skin tones by removing the harsh yellow-green cast created by flouriest  lightning. Lens filter set is a must-have for photographers 52mm filters improve photographs by giving photographers control over light and allowing them to emphasize certain features Filter kit features UV, CPL, and FLD filters Set comes with hard carrying case and filters UV Protector Filter protected the lens from damage 16 GB Secure Digital (SD) Memory Card Get The Best SD Card for your product When getting an SD memory card there are hundreds of options for your item this can get confusing and costly  , When purchasing one of our handpicked memory cards for your item you receive a  Memory card at the highest quality. We go to every extent to handpick cards to provide  you as a bonus with your purchase that are not only guaranteed to work with your item but have the best performance with your item. This is a Onetime purchase that will help you capture a memory for a lifetime. Our memory card offers are High performance cards that are made reliable with long life spans  created to handle real life motions and real time transfers. There will be  no delay time in transferring information from your device to this card. Get Quality at the top of its class with  SD memory. High Speed USB  All  One Card Reader Access a multitude of memory cards with this USB 2.0 All-in-One card reader! This portable memory card reader supports the most popular memory cards such as Compact Flash I/II, Secure Digital, SD, Memory Stick, Micro Drive and Multimedia Card. Deluxe Medium Camera and Video Bag The Deluxe Medium Camera and Video Bag  is the perfect compliment to hold all of your equipment. It features a shock proof nylon material and is water resistant. It has 1 removable divider, rubber feet, shoulder strap and a handle grip. Easy access closure flap Mesh pockets for accessory storage compartment with interior   mesh pockets for spare batteries, flash-memory cards, diskettes,cords,   cables and more Shoulder strap/1 re moveable divider ,rubber feet, shoulder strap and a handle grip nylon material and is water resistant Dimensions: Size: 10.8 x 6.5 x 7.5 inches Multi Memory Card Wallet Donâ\u0080\u0099t lose your lifeâ\u0080\u0099s Memories Memory Cards are the Insert that holds your lifeâ\u0080\u0099s memoryâ\u0080\u0099s. A little card that easily lost but so important to you and your family. Always keep  your memory cards together at any cost. One lost card can lose decades of Memories. A memory card wallet is someplace for you to keep these memoryâ\u0080\u0099s together. Memory Card Wallet Keeps multiple memory cards protected and organized with this durable storage wallet. Sturdy memory card wallet case holds memory cards of any type securely, keeping them from contact with other accessories and makes them easily accessible in larger luggage bags. Features Memory Card Wallet Holds up to Multi  memory Cards (SD,CF,MS) 1 Year Limited Warranty Pro Digital Auto Slave Flash with Bracket for All SLR/DSLR Digital Camera & Camcorders Every photographer knows that a quality flash unit is an essential component to taking great pictures. Built-in flashes simply don't have enough power to properly illuminate most subjects, and typically produce harsh shadows, red-eye, and other undesirable effects. An external flash offers far more power and versatility , resulting in consistently better pictures! The Flash is a high-power flash unit that works seamlessly with a wide variety of camera models and provides exceptional light coverage , at a price that doesn't break the bank! The Flash features automatic exposure control , which syncs with your camera to provide just the right amount of light. The zoom function allows you to light subjects as far away as 50 feet , and the bounce head tilts and swivels to give you full creative control. EN-EL14 Replacement rechargeable Li-ion Battery Pack for Nikon D3100, D3200 & D5100 generic Compatible Li-ion Battery for Nikon EN-EL14 *Never run out of battery power when you're about to capture the perfect moment with this Nikon EN-EL14 compatible li-ion battery *Extra power for your digital video camera / camcorder *High capacity / rechargeable li-ion battery with premium cell *Type: Generic / aftermarket *Color: Black *Voltage: 7.4V *Replacement for the original Nikon EN-EL14 battery pack *Accessory ONLY, camera not included *Compatible with: Nikon Coolpix P7000 fit for Nikon Coolpix P7000, Coolpix P7100, Coolpix P7700, D3100, D3200, D5100 & D5200 * Quantity: 1 Battery Charger For Nikon EN-EL14 D3100 D3200 D5100 NOTE: For a success and safe charge to your battery, please make sure to line up the correct polarity (positive / negative) before inserting the battery onto the charger. A/C power supply input voltage: AC100V~240V. Output voltage: DC 8.4v 600mA. Charger Compatible with Nikon EN-EL14 battery. Accessory ONLY, camera not included. Full Size 50-inch Tripod With Leveler  360 adjust & Case Want to relax and take time shooting ?  Not worry about your shots being leveled ?  adjust shots with a swivel instead of an adjustment ? If the answer to all these Questions are YES this is the item for you!! The 50-Inch Photo and Video tripod features a special carrying handle as well as a professional grip. With its  self leveling rubber leg tips  it offers a great floor grip for positioning and  built in bubble leveler to give you a leveled shot. Capability  for a 360 degree spin with its 3 way pan head doesn’t hurt for convenience. There are bracing sections to adjust Tripod size and an additional Bonus of Tripod case. What else can you ask for as a free bonus with your purchase. Features Extends to 50 Inch  and under Non slip handle Mid level bracing system for adjustable sizes Bubble leveler Tripod fitted case Compact Carry Size Mini Flexible Taple Top Travel Tripod  with Pocket clip We realized to take a quick snap shot anywhere with your camera is a hassle to keep the camera sturdy with a table top tripod you can pull it out instantly or leave attached to your product for that Quick Snap and Go picture. A focused leveled cameraâ\u0080\u0099s shot and a wobbled shot is a big difference. This handy little tripod also can keep you in the picture. Place your camera on the Tripod and use the camera's self-timer, or a remote shutter release and you are in the picture for a great crisp-sharp shot. It easy to use and it is small enough to be ideal for carry in travel. Featuring an adjustable head and hard Flexible legs, this Tripod is an ideal accessory for photographers on the run. This lightweight, yet durable tripod stands at a height of up to 5\". Perfect for most digital, video and still cameras . Features Fits all 35mm Digital and Video camera with Tripod Socket Sturdy Ultra Compact Convenient Pocket Clip Travel Sized Lens Cap Keeper Keep Your lens safe its one of the Eyes of your purchase: Its always the little things that we lose that are a pain to replace . Why go through the hassle we found the perfect solution. Your cameras lens is a vital part of the pathway that captures an image from external reality and stores it onto a memory card film device or other  Keeping this lens free of dust smudges and contact with other items is imperative. A Lens Cap holder as simple as it sounds is the solution. The  perfect way to keep track of your lens caps. A small button tapes onto the front of your lens cap and the elastic loop goes around the barrel of your lens so that your lens cap always remains attached, hanging from the lens. Lens caps can be pricey and hard to find  with this you will  Never lose a lens cap again ! Deluxe Camera , Screen & Lens 5pc cleaning Kit Be clean Be Safe use something Approved for your product : It's obvious that the cleaner the lens and camera sensor, the sharper your pictures will be. Dirt, dust, and fingerprints will degrade the image quality of even the finest optics. However, it's equally important to avoid using incorrect cleaning materials which can permanently damage your photo equipment. The 5 Piece Camera and lens Cleaning Kit. consists of soft-texture fiber cloth, 5 cotton swabs, a bottle of cleaning fluid, soft lens tissue paper, and top quality blower brush. It easily fits in your camera bag so you can take it anywhere with you easily. It is perfect for an on-the-spot camera or lens cleaning and is approved by the manufacture to use with your item Screen Camera and Lens Cleaning kit Soft Texture Fiber Cloth Five Quality Cotton Swabs Top Quality cleaning Fluid Quality Blower and Brush Full Pack Lens Cleaning Tissue Deluxe Screen Protector Pro Pack (Clear ) Be safe scratches arenâ\u0080\u0099t appealing . Save your screen it takes a second to apply and  will give you longer usage with your product Purchasing any item everyone always knows the LCD screen or glass screen is an imperative part of the electronic device always the first to get damaged. Easy solution for you !! Deluxe screen protectors are perfect for digital camera screens, cell phone screens and game player screens. screen protectors are included with  a squeegee to smooth them out and remove air bubbles. They can be cut down to size to fit any screen from 1\" to 5\". The extra clear layer on your device will not only protect it from Sun damage but will also protect from  Nail Scratches, finger smudges and many other contact damage to the screen point of your device. The Clear Quality Kit touch safes  your device. Universal Screen Guard The Greatest  Guarder for LCD Screens Multi 3pcs 3x5â\u0080\u0099â\u0080\u0099 Deluxe Screen Guard 1 Squeegee Card NIKON D3200/18-55KIT10 DD We usually ship within 1-2 business days after receiving payment. Please be aware that weekends are not business days. At our discretion; large or expensive packages may receive a free upgrade to FedEx Ground with signature confirmation.  If this applies to you, please assure that your address is able to receive FedEx packages & that an adult is available to sign for & accept the shipment. All express methods of shipment as long as verified take 1 business day to ship We ship everything professionally in our state of the art warehouse boxed and shipped with perfection. \"Free Shipping\" applies to orders shipped within the USA (48 states) We do not ship to APO or FPO address Orders shipping to PR/HI/AK Will have an additional shipping charge and a longer process time to ship order Credit Cards: We can only ship to addresses that are noted with your credit card account. We may contact you for additional verification after you check out. PayPal: We prefer to ship to confirmed addresses. We may contact you for additional verification for payments made by unconfirmed PayPal addresses. We do not accept PayPal payments from accounts outside the USA and Canada. · When necessary, we may contact you via Direct Message or telephone to obtain additional verification. We offer our customer's a 14 day return for replacement policy if item is defective other then that all sales are final . A Return Merchandise Authorization (RMA) number must be obtained for any return. To obtain an RMA number, please call us toll free at 877-254-6155 Returned packages without proper RMA demarcations will be refused by our warehouse and returned to you. Customers who refuse a delivery, will be subject to charges for return shipping to us. If the item was advertised as Free Shipping, then we will charge the amount of shipping as determined by Our Shipping Station . Defective Item An item that was discovered to be defective upon receipt can be replaced with the same model only. Return Shipping Return shipping cost (the cost to send an item back to our store) is like or comparable to your cost of driving to any store for returning an item, which is not reimbursable. Therefore, we do not reimburse any return shipping cost. If an item you received is defective, we will certainly replace the item with a new one, however we do not cover or reimburse the shipping cost for returning defective merchandise back to our store. We will ship the replacement product to you at our cost, and use every good measure to ensure that the replacement order is processed quickly. Replacement We will send a product replacement after the authorized return has completed our receiving/inspection process. The replacement will ship within four business days following our receipt of your return. Please allow additional processing time after Holidays. Although it is our goal to ship a replacement as quickly as possible, we do not send replacements before we receive and inspect the returned merchandise. All items are sold with Manufacture Warranty so there is another avenue for assistance. All returns must be packed with all contents which came with the original package including, cables, software, plastic and cardboard packaging, and unregistered warranty card. This return policy excludes Televisions, Home Theater Projectors or any Home audio Product . For further questions please call us toll free at 877-254-6155 We encourage any questions or concerns you may have for us, but we request that all communication be done through eBay messages only or over the phone. Our dedicated customer support team is available Monday-Friday 10AM - 6PM (EST) TOLL FREE: +1-877-254-6155 LOCAL: +1-908-967-5155 Click here to send us your email inquiry now through eBay messages.",
    "remotecontrol": "ML-L3 (Optional)",
    "flashmodes": "Auto Auto/Red-eye Reduction Off Second-curtain Sync Slow Sync Slow Sync./Red-eye Reduction",
    "builtinflash": "Yes",
    "displaysize": "3\"",
    "dedicatedflashsystem": "iTTL",
    "externalflashconnection": "Hot Shoe",
    "battery": "1x  EN-EL14  Rechargeable Lithium-Ion Battery Pack, 7.4VDC, 1030mAh",
    "displaytype": "LCD",
    "diaphragmblades": "7",
    "incameraimageediting": "Color Balance, Color Outline, Distortion Control, Edit Movie, Filter Effects, Fisheye, Image Overlay, Miniature Effect, Monochrome, NEF (RAW) Processing, Perspective Control, Quick Retouch, Red-eye Correction, Straighten, Trim",
    "maxsyncspeed": "1 / 200 sec",
    "lightsensitivitymax": "1006400",
    "operatingstoragetemperature": "Operating 32 to 104 °F (0 to 40 °C)",
    "fileformats": "Still Images: JPEG, RAW Movies: MPEG-4 AVC/H.264, MOV Audio: Linear PCM",
    "magnification": "0.31x",
    "filesize": "1920 x 1080 (Full HD) 1280 x 720 (HD) 640 x 424 (SD)",
    "aperture": "Maximum: f/3.5 - 5.6 Minimum: f/22",
    "meteringmethod": "3D Color Matrix Metering, Center-weighted average metering, Spot metering",
    "brand": "Nikon",
    "screensize": "3\"",
    "diopteradjustment": "- -1.7 to +0.5 m",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "displayscreen": "3.0\" Rear Screen   LCD (921000)",
    "cameratype": "Digital SLR with Interchangeable lenses",
    "framerate": "@ 1920 x 1080: 30 fps, 25 fps, 24 fps @ 1280 x 720: 60 fps, 50 fps @ 640 x 424: 30 fps, 25 fps",
    "focusmode": "Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M) , Focus Lock AF Area Mode",
    "dimensionsdxl": "Approx. 2.87 x 3.13\" (7.29 x 7.95 cm)",
    "wificapablewithoptionaltransmitter": "Yes",
    "leftbardescstart": "Left Bar Desc //End !Right Bar Desc //Start !Nikon D3200 DSLR Camera +18-55mm - 3 Lens Kit + 16GB + Case + Battery + Filters Click an Image to Enlarge This item is 100% brand new. USA product sealed in original box & includes full USA warranty. 52mm Professional HD 2x Telephoto lens + Carry Case fit Nikon Canon Sony Lens 52mm Wide-Angle 45x Digital High Definition Lens with Macro fit Nikon Canon Sony 3-Piece Filter Kit 16 GB Secure Digital (SD) Memory Card High Speed External USB All in One Memory Card Reader & Writer SD SDHC CF MS XD Deluxe Soft Medium SLR Camera Case / Bag fit Canon EOS, Nikon, Sony Alpha Camera Multi Memory Card Wallet Digital Auto Slave Flash with Bracket EN-EL14 Replacement Rechargeable Li-ion Battery f/ Nikon D3100 D3200 D5100 D5200 ENEL14 Camera Battery Quick Charger f/ Nikon D3100 D3200 D5100 D5200 P7700 P7000 Full Size 50-inch Tripod With Leveler 360 adjust & Carryng Case for SLR Cameras Mini Flexible Taple Top Travel Tripod  with Pocket clip Lens Cap Keeper Deluxe Camera , Screen & Lens 5pc cleaning Kit Deluxe Screen Protector Pro Pack (Clear ) Take your photos and videos to the next level 24.2 MP DX-format CMOS sensor and EXPEED 3 Why do photos and videos shot with a Nikon HD-SLR look so good? It all starts with Nikonâ\u0080\u0099s exclusive image sensors, and the D3200 has the most powerful CMOS sensor weâ\u0080\u0099ve ever put in a HD-SLR at this level. Boasting an astounding 24.2 effective megapixels, it captures sharper, richer imagesâ\u0080\u0094even in low light. Combine that with EXPEED 3 image processing, the processing power behind the acclaimed Nikon D4, for super-fast operation, exceptional image capture, in-camera filter effects and more. Your photos and videos will amaze even you. Master the camera simply by using it Guide Mode ensures success Itâ\u0080\u0099s never been easier to create HD-SLR quality photos, thanks to the D3200â\u0080\u0099s Guide Mode. Learn the camera's key features and controls while you shoot, and even get advice and sample images to succeed in difficult shooting situations. Guide Mode is easy to access and easy to understand. Youâ\u0080\u0099re never shooting alone with the D3200. Capture the best of every scene Six Scene Modes and Scene Auto Selector Experienced photographers optimize their camera settings for the scene theyâ\u0080\u0099re shooting. With the D3200, optimizing your camera settings is as easy as turning a dial. Choose from six common Scene Modes like Portrait, Night Portrait, Landscape, Close up and more, for flawless results even in demanding circumstances. When using Live View, Scene Auto Selector automatically sets the D3200 for the most suitable Scene Mode for the situation. A highly accurate 420-pixel RGB sensor powers Nikon's Scene Recognition System, which compares scene data against an extensive database to optimize the shot accordingly. Create cinema-quality HD videos One-touch Full HD 1080p movie recording with stereo sound Nikon is committed to developing HD-SLRs that are not just superlative   still image cameras, but superlative video cameras, as well. With a   touch of a button, the D3200 starts recording Full HD 1080p video with   full-time autofocus, manual exposure control and stereo sound. Its   breathtaking 921,000-dot, ultra-high-resolution display makes it easy to   frame, monitor and review your footage. Even record in super-smooth   slow motion up to 60 fps! Unleash your inner cinematographer.* *Built-in microphone, monaural Optional external stereo mini-pin jack (3.5mm diameter) Microphone sensitivity can be adjusted Get a new view of your world Versatile AF-S Zoom-NIKKOR 18-55mm Nikonâ\u0080\u0099s renowned NIKKOR lenses have long been the choice of pros and   serious photographers. Marvels of clarity, consistency, precision and   reliability, they draw peak performance from Nikon HD-SLRs. The D3200   comes equipped with the AF-S DX Zoom-NIKKOR 18-55mm, a versatile, high   performance VR image stabilized lens. And when youâ\u0080\u0099re ready to expand   your system and extend your creativity, you'll have your choice of over   70 legendary NIKKOR lenses. Fast and accurate shooting The D3200's 11-point Autofocusing System is as fast as it is precise.   Check your focus points, track your subject or shoot carefree right from   the viewfinder. And when the action speeds up, simply aim, hold down   the shutter and fire off approx. 4 fps at 24.2 MP resolution. Wi-Fi Connectivityâ\u0080\u0094Now you can easily get GREAT pictures on your smartphone Using the WU-1a optional wireless mobile adapter you can now   automatically send great images to your smartphone and even use your   smartphone to remotely capture images from your D3200. With an easy to   use app, now, when you can't wait to share that great shot, you don't   have to. Share it to your smartphone in an instant. Compact, lightweight and durable Your D3200 is designed for comfort, intuitive use and durability. Its   compact, lightweight and rugged body puts key controls at your   fingertips. You'll never hesitate to bring along your D3200. Imaging Camera Type Digital SLR with Interchangeable lenses Lens Mount Nikon F Camera Format DX / (1.5x Crop Factor) Pixels Actual: 24.7 Megapixel Effective: 24.2 Megapixel Max Resolution 24MP: 6016 x 4000 @ 3:2 Other Resolutions 13.5MP: 4512 x 3000 @ 3:2 6.0MP: 3008 x 2000 @ 3:2 Aspect Ratio 3:2 Sensor Type / Size CMOS, 23.2 x 15.4 mm File Formats Still Images: JPEG, RAW Movies: MPEG-4 AVC/H.264, MOV Audio: Linear PCM Bit Depth 12-bit Noise Reduction Yes Memory Card Type SD SDHC SDXC Focus Control Focus Type Auto & Manual Focus Mode Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M) , Focus Lock AF Area Mode Autofocus Points 11 Viewfinder/Display Viewfinder Type Pentamirror, LCD Display Viewfinder Coverage 95% Viewfinder Magnification Approx. 0.8x Diopter Adjustment - -1.7 to +0.5 m Display Screen 3.0\" Rear Screen   LCD (921000) Screen Coverage 100% Angle of View 160° Live View Yes Exposure Control ISO Sensitivity 100-6400 (High Sensitivity Mode: 100-12800) Shutter Type: Electronic Speed: 30 - 1/4000 sec Remote Control ML-L3 (Optional) Mirror Lock-Up Yes Metering Method 3D Color Matrix Metering, Center-weighted average metering, Spot metering Exposure Modes Modes: Aperture Priority, Auto, Manual, Programmed Auto, Shutter Priority Compensation: -5 EV to +5 EV (in 1/3 EV steps) White Balance Modes Auto, Cloudy, Daylight, Flash, Fluorescent, Fluorescent (Day White), Fluorescent (Natural White), Fluorescent (White), Fluorescent H, Incandescent, Preset Manual, Shade Flash Flash Modes Auto Auto/Red-eye Reduction Off Second-curtain Sync Slow Sync Slow Sync./Red-eye Reduction Built-in Flash Yes Effective Flash Range Not Specified By Manufacturer Guide No. Not Specified By Manufacturer Max Sync Speed 1 / 200 sec Flash Compensation -3 EV to +1 EV (in 0.33 EV steps) Continuous Shooting Up to 4 fps Dedicated Flash System iTTL External Flash Connection Hot Shoe AV Recording Video Recording Yes, NTSC/PAL File Size 1920 x 1080 (Full HD) 1280 x 720 (HD) 640 x 424 (SD) Frame Rate @ 1920 x 1080: 30 fps, 25 fps, 24 fps @ 1280 x 720: 60 fps, 50 fps @ 640 x 424: 30 fps, 25 fps Exposure Control Auto: Shutter Speed, Aperture, ISO Manual: Shutter Speed, ISO ISO Sensitivity 200 - 6400, Expandable to 12800 Exposure Compensation -3 EV to +3 EV (in 1/3 EV steps) Focus Auto Manual Continuous Shooting Time 1920 x 1080 20 min. 1280 x 720 20 min. 640 x 424 20 min. Audio Recording With Video, Mono, Via Optional External Mic Performance In-Camera Image Editing Color Balance, Color Outline, Distortion Control, Edit Movie, Filter Effects, Fisheye, Image Overlay, Miniature Effect, Monochrome, NEF (RAW) Processing, Perspective Control, Quick Retouch, Red-eye Correction, Straighten, Trim Self Timer 2 sec, 5 sec, 10 sec, 20 sec Connectivity Audio Out, HDMI C (Mini), USB 2.0 Wi-Fi Capable (With Optional Transmitter) Yes Power Battery 1x  EN-EL14  Rechargeable Lithium-Ion Battery Pack, 7.4VDC, 1030mAh AC Power Adapter EH-5b (Optional) Operating/Storage Temperature Operating 32 to 104 °F (0 to 40 °C) Physical Dimensions (WxHxD) 5.0 x 3.8 x 3.1\" / 12.70 x 9.65 x 7.87 cm Weight 1.0 lb / 0.45 kg Kit Lens Focal Length 18 - 55 mm Comparable  35mm Focal Length: 27 - 82.5 mm Aperture Maximum: f/3.5 - 5.6 Minimum: f/22 Angle of View 76° - 28° Minimum Focus Distance 11\" (27.94 cm) Magnification 0.31x Maximum Reproduction Ratio 1:0.32 Groups/Elements 8/11 Diaphragm Blades 7 Autofocus Yes Image Stabilization Yes Filter Thread Front: 52 mm Dimensions (DxL) Approx. 2.87 x 3.13\" (7.29 x 7.95 cm) Weight 9.35 oz (265 g) Nikon     D3100 Digital SLR Camera body 18-55mm f/3.5-5.6G VR AF-S DX Nikkor Lens Front & Rear Lens Caps EN-EL14 Rechargeable Li-ion Battery MH-24 Battery Charger DK-5 Eyepiece Shield (Replacement) DK-20 Rubber Eyecup AN-DC3 Camera Strap (Black) BS-1 Hot-Shoe Cover BF-1B Body Cap Front & Rear Lens Caps ViewNX 2 CD-ROM Nikon Software Suite CD-ROM Professional HD 2x 52mm  telephoto lens When your camera can't get you close enough to capture the action in detail, this 2x Telephoto lens will bring the action to you! Optically multiplying the focal length of your camera's lens by a factor of 2, it more than doubles your telephoto magnification and detail without any pixelization. This is dramatically better than the \"Digital Zoom\" feature of many cameras where the magnification is obtained by merely enlarging the existing image, resulting in a loss of sharpness. This 2x telephoto attachment is perfect for all your long-distance imaging including sports, surveillance, nature and wildlife. You will also be able to utilize your camera's macro capability at over twice the usual distance, allowing for easier subject lighting with less shadows and intrusion.. High Speed Auto-Focus / Infrared Compatible (IR) Maximize day and night shots by providing maximum light and image transmission High Definition Optical Resolution Infrared Compatibility High Quality Precision Optics Glass 45x 52mm Wide-Angle Digital High Definition Lens with Maro This 0.45x Wide Angle adapter will allow you to capture it all! This attachment more than doubles your camera's wide angle field-of-view . Scenic shots will be more panoramic and you'll be able to take outstanding group photos, even in tight places. In addition, the detachable Macro Lens enables you to photograph small objects up close. Great for jewelry, coins, stamps, flowers, and more. Even if your camera already has macro capability, this macro lens will get you even closer for truly amazing close-up photos. High speed Auto-Focus/ Infrared compatible 0.45x high definition wide angle lens with macro Marco 4:1 ratio Premium Rimmed Glass Include Protective Lens Case Digital Multi Coated 52mm Glass Filter Kit (UV-CPL-FLD) 3pc Filter kit The UV filter protects your camera's lens from scratches, dust,  dirt, moisture and fingerprints, while removing unwanted ultraviolet  light.The UV filter reduces blue haze caused by UV light by absorbing  71% of UV. The CPL filter deepens and  intensifies blue skies, achieves vibrant colors and reduces glare and  reflections from non-metallic objects & glass surfaces. Great for  video. The Fluorescent Light Correction Filter gives  you the prefect solution for shooting without a flash under a  fluorescent light.This filter gives true-to-life colors and pleasing  skin tones by removing the harsh yellow-green cast created by flouriest  lightning. Lens filter set is a must-have for photographers 52mm filters improve photographs by giving photographers control over light and allowing them to emphasize certain features Filter kit features UV, CPL, and FLD filters Set comes with hard carrying case and filters UV Protector Filter protected the lens from damage 16 GB Secure Digital (SD) Memory Card Get The Best SD Card for your product When getting an SD memory card there are hundreds of options for your item this can get confusing and costly  , When purchasing one of our handpicked memory cards for your item you receive a  Memory card at the highest quality. We go to every extent to handpick cards to provide  you as a bonus with your purchase that are not only guaranteed to work with your item but have the best performance with your item. This is a Onetime purchase that will help you capture a memory for a lifetime. Our memory card offers are High performance cards that are made reliable with long life spans  created to handle real life motions and real time transfers. There will be  no delay time in transferring information from your device to this card. Get Quality at the top of its class with  SD memory. High Speed USB  All  One Card Reader Access a multitude of memory cards with this USB 2.0 All-in-One card reader! This portable memory card reader supports the most popular memory cards such as Compact Flash I/II, Secure Digital, SD, Memory Stick, Micro Drive and Multimedia Card. Deluxe Medium Camera and Video Bag The Deluxe Medium Camera and Video Bag  is the perfect compliment to hold all of your equipment. It features a shock proof nylon material and is water resistant. It has 1 removable divider, rubber feet, shoulder strap and a handle grip. Easy access closure flap Mesh pockets for accessory storage compartment with interior   mesh pockets for spare batteries, flash-memory cards, diskettes,cords,   cables and more Shoulder strap/1 re moveable divider ,rubber feet, shoulder strap and a handle grip nylon material and is water resistant Dimensions: Size: 10.8 x 6.5 x 7.5 inches Multi Memory Card Wallet Donâ\u0080\u0099t lose your lifeâ\u0080\u0099s Memories Memory Cards are the Insert that holds your lifeâ\u0080\u0099s memoryâ\u0080\u0099s. A little card that easily lost but so important to you and your family. Always keep  your memory cards together at any cost. One lost card can lose decades of Memories. A memory card wallet is someplace for you to keep these memoryâ\u0080\u0099s together. Memory Card Wallet Keeps multiple memory cards protected and organized with this durable storage wallet. Sturdy memory card wallet case holds memory cards of any type securely, keeping them from contact with other accessories and makes them easily accessible in larger luggage bags. Features Memory Card Wallet Holds up to Multi  memory Cards (SD,CF,MS) 1 Year Limited Warranty Pro Digital Auto Slave Flash with Bracket for All SLR/DSLR Digital Camera & Camcorders Every photographer knows that a quality flash unit is an essential component to taking great pictures. Built-in flashes simply don't have enough power to properly illuminate most subjects, and typically produce harsh shadows, red-eye, and other undesirable effects. An external flash offers far more power and versatility , resulting in consistently better pictures! The Flash is a high-power flash unit that works seamlessly with a wide variety of camera models and provides exceptional light coverage , at a price that doesn't break the bank! The Flash features automatic exposure control , which syncs with your camera to provide just the right amount of light. The zoom function allows you to light subjects as far away as 50 feet , and the bounce head tilts and swivels to give you full creative control. EN-EL14 Replacement rechargeable Li-ion Battery Pack for Nikon D3100, D3200 & D5100 generic Compatible Li-ion Battery for Nikon EN-EL14 *Never run out of battery power when you're about to capture the perfect moment with this Nikon EN-EL14 compatible li-ion battery *Extra power for your digital video camera / camcorder *High capacity / rechargeable li-ion battery with premium cell *Type: Generic / aftermarket *Color: Black *Voltage: 7.4V *Replacement for the original Nikon EN-EL14 battery pack *Accessory ONLY, camera not included *Compatible with: Nikon Coolpix P7000 fit for Nikon Coolpix P7000, Coolpix P7100, Coolpix P7700, D3100, D3200, D5100 & D5200 * Quantity: 1 Battery Charger For Nikon EN-EL14 D3100 D3200 D5100 NOTE: For a success and safe charge to your battery, please make sure to line up the correct polarity (positive / negative) before inserting the battery onto the charger. A/C power supply input voltage: AC100V~240V. Output voltage: DC 8.4v 600mA. Charger Compatible with Nikon EN-EL14 battery. Accessory ONLY, camera not included. Full Size 50-inch Tripod With Leveler  360 adjust & Case Want to relax and take time shooting ?  Not worry about your shots being leveled ?  adjust shots with a swivel instead of an adjustment ? If the answer to all these Questions are YES this is the item for you!! The 50-Inch Photo and Video tripod features a special carrying handle as well as a professional grip. With its  self leveling rubber leg tips  it offers a great floor grip for positioning and  built in bubble leveler to give you a leveled shot. Capability  for a 360 degree spin with its 3 way pan head doesn’t hurt for convenience. There are bracing sections to adjust Tripod size and an additional Bonus of Tripod case. What else can you ask for as a free bonus with your purchase. Features Extends to 50 Inch  and under Non slip handle Mid level bracing system for adjustable sizes Bubble leveler Tripod fitted case Compact Carry Size Mini Flexible Taple Top Travel Tripod  with Pocket clip We realized to take a quick snap shot anywhere with your camera is a hassle to keep the camera sturdy with a table top tripod you can pull it out instantly or leave attached to your product for that Quick Snap and Go picture. A focused leveled cameraâ\u0080\u0099s shot and a wobbled shot is a big difference. This handy little tripod also can keep you in the picture. Place your camera on the Tripod and use the camera's self-timer, or a remote shutter release and you are in the picture for a great crisp-sharp shot. It easy to use and it is small enough to be ideal for carry in travel. Featuring an adjustable head and hard Flexible legs, this Tripod is an ideal accessory for photographers on the run. This lightweight, yet durable tripod stands at a height of up to 5\". Perfect for most digital, video and still cameras . Features Fits all 35mm Digital and Video camera with Tripod Socket Sturdy Ultra Compact Convenient Pocket Clip Travel Sized Lens Cap Keeper Keep Your lens safe its one of the Eyes of your purchase: Its always the little things that we lose that are a pain to replace . Why go through the hassle we found the perfect solution. Your cameras lens is a vital part of the pathway that captures an image from external reality and stores it onto a memory card film device or other  Keeping this lens free of dust smudges and contact with other items is imperative. A Lens Cap holder as simple as it sounds is the solution. The  perfect way to keep track of your lens caps. A small button tapes onto the front of your lens cap and the elastic loop goes around the barrel of your lens so that your lens cap always remains attached, hanging from the lens. Lens caps can be pricey and hard to find  with this you will  Never lose a lens cap again ! Deluxe Camera , Screen & Lens 5pc cleaning Kit Be clean Be Safe use something Approved for your product : It's obvious that the cleaner the lens and camera sensor, the sharper your pictures will be. Dirt, dust, and fingerprints will degrade the image quality of even the finest optics. However, it's equally important to avoid using incorrect cleaning materials which can permanently damage your photo equipment. The 5 Piece Camera and lens Cleaning Kit. consists of soft-texture fiber cloth, 5 cotton swabs, a bottle of cleaning fluid, soft lens tissue paper, and top quality blower brush. It easily fits in your camera bag so you can take it anywhere with you easily. It is perfect for an on-the-spot camera or lens cleaning and is approved by the manufacture to use with your item Screen Camera and Lens Cleaning kit Soft Texture Fiber Cloth Five Quality Cotton Swabs Top Quality cleaning Fluid Quality Blower and Brush Full Pack Lens Cleaning Tissue Deluxe Screen Protector Pro Pack (Clear ) Be safe scratches arenâ\u0080\u0099t appealing . Save your screen it takes a second to apply and  will give you longer usage with your product Purchasing any item everyone always knows the LCD screen or glass screen is an imperative part of the electronic device always the first to get damaged. Easy solution for you !! Deluxe screen protectors are perfect for digital camera screens, cell phone screens and game player screens. screen protectors are included with  a squeegee to smooth them out and remove air bubbles. They can be cut down to size to fit any screen from 1\" to 5\". The extra clear layer on your device will not only protect it from Sun damage but will also protect from  Nail Scratches, finger smudges and many other contact damage to the screen point of your device. The Clear Quality Kit touch safes  your device. Universal Screen Guard The Greatest  Guarder for LCD Screens Multi 3pcs 3x5â\u0080\u0099â\u0080\u0099 Deluxe Screen Guard 1 Squeegee Card NIKON D3200/18-55KIT10 DD We usually ship within 1-2 business days after receiving payment. Please be aware that weekends are not business days. At our discretion; large or expensive packages may receive a free upgrade to FedEx Ground with signature confirmation.  If this applies to you, please assure that your address is able to receive FedEx packages & that an adult is available to sign for & accept the shipment. All express methods of shipment as long as verified take 1 business day to ship We ship everything professionally in our state of the art warehouse boxed and shipped with perfection. \"Free Shipping\" applies to orders shipped within the USA (48 states) We do not ship to APO or FPO address Orders shipping to PR/HI/AK Will have an additional shipping charge and a longer process time to ship order Credit Cards: We can only ship to addresses that are noted with your credit card account. We may contact you for additional verification after you check out. PayPal: We prefer to ship to confirmed addresses. We may contact you for additional verification for payments made by unconfirmed PayPal addresses. We do not accept PayPal payments from accounts outside the USA and Canada. · When necessary, we may contact you via Direct Message or telephone to obtain additional verification. We offer our customer's a 14 day return for replacement policy if item is defective other then that all sales are final . A Return Merchandise Authorization (RMA) number must be obtained for any return. To obtain an RMA number, please call us toll free at 877-254-6155 Returned packages without proper RMA demarcations will be refused by our warehouse and returned to you. Customers who refuse a delivery, will be subject to charges for return shipping to us. If the item was advertised as Free Shipping, then we will charge the amount of shipping as determined by Our Shipping Station . Defective Item An item that was discovered to be defective upon receipt can be replaced with the same model only. Return Shipping Return shipping cost (the cost to send an item back to our store) is like or comparable to your cost of driving to any store for returning an item, which is not reimbursable. Therefore, we do not reimburse any return shipping cost. If an item you received is defective, we will certainly replace the item with a new one, however we do not cover or reimburse the shipping cost for returning defective merchandise back to our store. We will ship the replacement product to you at our cost, and use every good measure to ensure that the replacement order is processed quickly. Replacement We will send a product replacement after the authorized return has completed our receiving/inspection process. The replacement will ship within four business days following our receipt of your return. Please allow additional processing time after Holidays. Although it is our goal to ship a replacement as quickly as possible, we do not send replacements before we receive and inspect the returned merchandise. All items are sold with Manufacture Warranty so there is another avenue for assistance. All returns must be packed with all contents which came with the original package including, cables, software, plastic and cardboard packaging, and unregistered warranty card. This return policy excludes Televisions, Home Theater Projectors or any Home audio Product . For further questions please call us toll free at 877-254-6155 We encourage any questions or concerns you may have for us, but we request that all communication be done through eBay messages only or over the phone. Our dedicated customer support team is available Monday-Friday 10AM - 6PM (EST) TOLL FREE: +1-877-254-6155 LOCAL: +1-908-967-5155 Click here to send us your email inquiry now through eBay messages.Right Bar Desc //End !",
    "imagestabilization": "Yes",
    "viewfindercoverage": "95%",
    "continuousshooting": "Up to 4 fps",
    "lensforsd": "AF-S DX G VR 18-55mm",
    "dimensionswxhxd": "5.0 x 3.8 x 3.1\" / 12.70 x 9.65 x 7.87 cm",
    "autofocus": "Yes",
    "maxvideoresolution": "1920 x 1080",
    "maximumreproductionratio": "1:0.32",
    "whitebalancemodes": "Auto, Cloudy, Daylight, Flash, Fluorescent, Fluorescent (Day White), Fluorescent (Natural White), Fluorescent (White), Fluorescent H, Incandescent, Preset Manual, Shade",
    "flashcompensation": "-3 EV to +1 EV (in 0.33 EV steps)",
    "sensortypesize": "CMOS, 23.2 x 15.4 mm",
    "connectivity": "Audio Out, HDMI C (Mini), USB 2.0",
    "cameraformat": "DX / (1.5x Crop Factor)",
    "groupselements": "8/11",
    "supportedflashmemory": "SD Card, SD Memory Card, SDHC Card, SDHC Memory Card, SDXC Card, SDXC Memory Card",
    "aspectratio": "3:2",
    "guideno": "Not Specified By Manufacturer",
    "videorecording": "Yes, NTSC/PAL",
    "effectiveflashrange": "Not Specified By Manufacturer",
    "exposuremodes": "Modes: Aperture Priority, Auto, Manual, Programmed Auto, Shutter Priority Compensation: -5 EV to +5 EV (in 1/3 EV steps)",
    "minimumfocusdistance": "11\" (27.94 cm)",
    "digitalzoom": "2x",
    "sensorresolution": "24.2 MP",
    "viewfindertype": "Pentamirror, LCD Display",
    "maxresolution": "24MP: 6016 x 4000 @ 3:2",
    "model": "D3200",
    "screencoverage": "100%"
}