{
    "warranty": "(1) We provide 30 Days Warranty, that could extend to 60 Days for free, we will attached an instruction in the shipping that tell how to extend (2) if you return the item after 45 days, you need to pay us the re-shipping charge",
    "unitedkingdom": "3-7 days1-3 Days",
    "weight": "Approx. 170 g (Including Memory Card*) / Approx. 149 g (Excluding Memory Card) (CIPA Standards) *Â When using SanDisk Corporation 16GB microSDHC Memory Card.",
    "sensitivity": "(SOS*)ï¼\u009aStill Imagesï¼\u009aAuto/ISO100/ISO200/ISO400/ISO800/ISO1600/ISO3200 Moviesï¼\u009aAuto *Â SOS: Standard Output Sensitivity.",
    "focusing": "Focus Typeï¼\u009aContrast Detection Auto Focus Focus Modeï¼\u009aAuto Focus, Macro, Pan Focus, Infinity Mode AF Areaï¼\u009aSpot(Intelligent in Premium Auto Pro)",
    "australia": "3-7 Days2-3 Days",
    "itemname": "Casio EX-TR35 / EX-TR350S DIGITAL CAMERA",
    "category": "camera",
    "microphone": "Monaural",
    "dimensions": "128.9(W)Ã\u009761.6(H)Ã\u009714.9(D)mm (CIPA Standards)",
    "batterylife": "Number of Shotsï¼\u009aApprox. 260 still images (CIPA standards) Actual Movie Recording Timeï¼\u0088FHD Movieï¼\u0089ï¼\u009aApprox. 55 minutes (CIPA standards) Approximate Continuous Moving Recording Time( FHD Movie)ï¼\u009aApprox. 1 hour 30 minutes (Based on CASIO data) Continuous Movie Recording Time(HS240)ï¼\u009aApprox. 1 hour 40 minutes (Based on CASIO data)",
    "france": "7-12 Days1-3 Days",
    "selftimer": "10 seconds, 2 seconds, 2 to 10 seconds",
    "speaker": "Monaural",
    "aperture": "F2.8",
    "numberofeffectivepixels": "Approximately 12.1 megapixels (/million)",
    "monitorscreen": "3.0-inch Wide TFT color LCD ( Super Clear LCD ), 921,600 dots, Capacitance touch panel",
    "lens": "Constructionï¼\u009a5lenses in 5 groups, including aspherical lens F-numberï¼\u009aF2.8 Focal Lengthï¼\u009af=3.8mm 35mm-Film Equivalentï¼\u009aApprox. 21mm",
    "otherrecordingfunctions": "Posing Shot Triple Shot Face Detection HDR Art Shotï¼\u009a11(HDR-ART is included.) BEST SHOTï¼\u009a8(HDR is included.) Remote Capture (Requires installation of the EXILIM Remote app on your smartphone.) Motion Shutter Countdown Timer Make-up Mode(Brightening, Natural) Premium Auto Pro Multi Frame SR Zoom Slide Panorama High Speed Best Selection",
    "numberofrecordedpixels": "Still Imagesï¼\u009a12M(4000x3000), 3ï¼\u009a2(4000x2656), 5M(2560x1920), VGA(640x480) Moviesï¼\u009aFHDï¼\u009a1920x1080, HDï¼\u009a1280x720, HS240ï¼\u009a512x384",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "paymentmethod": "(1) We accepts paypal. For other payment methods, please contact us before biding on the auction. (2) If you would like to pay in your country currency, please contact us for the price in the currency.",
    "powerrequirements": "Rechargeable lithium ion battery (NP-150)",
    "exposure": "Exposure Meteringï¼\u009aMulti pattern by CMOS Exposure Controlï¼\u009aProgram AE Exposure Compensationï¼\u009a -2EV to +2EV (in 1/3EV steps)",
    "timekeepingfunctions": "Date and Timeï¼\u009aRecorded with image data With time stamp function Auto Calendarï¼\u009aTo 2049 World Timeï¼\u009a162 cities in 32 time zones, City name, date, time, summer time",
    "shuttertype": "*Â May differ according to camera settings. CMOS electronic shutter Shutter Speed*ï¼\u009aAutoï¼\u009a1/10 to 1/16000 second, Premium Auto Proï¼\u009a1 to 1/16000 second",
    "recordingmedia": "microSD Memory Card, microSDHC Memory Card, microSDXC Memory Card compatible",
    "builtinflash": "LED lightï¼\u009aYes Flash Modeï¼\u009aNone Flash Rangeï¼\u009aNone",
    "imagesensor": "1/2.3-inch high-speed CMOS (back-illuminated type) Total Pixelsï¼\u009a12.76 megapixels (/million)",
    "focusrangefromlenssurface": "Auto Focusï¼\u009aApprox. 8 cm to Infinity Macroï¼\u009aApprox. 8 cm to 50 cm Infinity Modeï¼\u009aInfinity",
    "fileformat": "Still Imagesï¼\u009aJPEG (Exif Ver2.3), DCF2.0 Moviesï¼\u009aMOV format, H.264, IMA-ADPCM (monaural)",
    "zoomratio": "4.0x digital zoom ( in conbination with Multi Frame SR zoom ) 15.9x maximum digital zoom(in conbination with HD zoom, VGA size)",
    "country": "Delivery TimeDelivery Time",
    "unitedstates": "3-7 Days2-3 Days",
    "whitebalance": "Auto WB, Daylight, Overcast, Shade, Day White Fluorescent, Daylight Fluorescent, Tungsten, Manual WB"
}