{
    "exposuremetering": "Center-weighted, Matrix",
    "acpoweradapter": "EH-69P (Included)",
    "weight": "6.9 oz / 196 g With Battery and Memory Card",
    "flashtype": "Pop-up Flash",
    "battery": "EN-EL12 Rechargeable Lithium-Ion Battery Pack",
    "exposuremodes": "Modes: Aperture Priority, Auto, Manual, Shutter PriorityCompensation: -2 EV to +2 EV (in 1/3 EV steps)",
    "isosensitivity": "100-3200",
    "height": "2.3 in.",
    "displaytype": "LCD",
    "additionalfeatures": "HDMI, Not Interchangeable Lenses, USB 2.0",
    "opticalzoom": "4.2x",
    "imagestabilization": "Optical",
    "screen": "3\" LCD Rear Screen (921,000 pixels)",
    "batteryformfactor": "Manufacturer specific",
    "maximumeffectiveflashrange": "Wide: 1.64 - 21.33' (0.5 - 6.5 m) Telephoto: 1.64 - 8.20' (0.5 - 2.5 m)",
    "maxvideoresolution": "1920 x 1080",
    "category": "camera",
    "depth": "1.22 in.",
    "specialeffects": "Fisheye, Miniature, Monochrome, Paint, Silhouette, Soft",
    "videorecording": "Yes, NTSC/PAL",
    "facedetection": "Yes",
    "lightsensitivitymax": "12800",
    "stillimageformat": "JPEG, MPO",
    "operatingstoragetemperature": "32 to 104°F (0 to 40°C)",
    "modedial": "Mode dial with manual exposure modes and user mode, where you can recall your preferred camera settings instantly.",
    "lightsensitivity": "ISO 100, ISO 12800, ISO 1600, ISO 200, ISO 3200, ISO 400, ISO 6400, ISO 800, ISO auto (100-1600), ISO auto (100-400), ISO auto (100-800)",
    "sensorsize": "1/2.3\"",
    "selftimer": "2 Sec, 10 Sec",
    "width": "4.1 in.",
    "builtinmemory": "90MB",
    "dimensionswxhxd": "2.3 x 4.1 x 1.3\" / 5.8 x 10.4 x 3.3 cm",
    "sensor": "1/2.3\" CMOS",
    "audiorecording": "With Video + Voice Memo, Stereo",
    "whitebalancemodes": "Auto, Cloudy, Daylight, Flash, Fluorescent, Incandescent, Manual",
    "autohdrmode": "Capture images with impressive tonal detail in any situation when you shoot in HDR mode. The camera combines two shots taken at different exposures during a single shutter release to create an image with wide dynamic range and rich color gradation.",
    "mpn": "26320",
    "brand": "Nikon",
    "lens": "NIKKOR, 7 elements in 6 groupsEFL: 4.3-17.9 mm (35 mm equivalent: 24-100 mm)Aperture: f/1.8 (W) - 4.9 (T)",
    "connectivity": "AV Output HDMI C (Mini) USB 2.0",
    "pixels": "16.1 Megapixel",
    "displayrotation": "Built-in",
    "focusrange": "Wide: 11.81\" (30 cm) - Infinity Telephoto: 23.62\" (60 cm) - Infinity Macro: 0.79\" (2 cm) - Infinity",
    "digitalvideoformat": "H.264, iFrame",
    "maxresolution": "16MP: 4608 x 3456",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "aspectratio": "4:3",
    "fileformats": "Still Images: JPEG, MPO Movies: MPEG-4 AVC/H.264 Audio: AAC",
    "burstrate": "Up to 5 fps at 16.1 MP for up to 7 frames",
    "integratedmemorysize": "90 MB",
    "memorycardtype": "SD SDHC SDXC",
    "builtinflash": "Yes",
    "retouchmenu": "Enhance your photos in-camera with a range of filter effects. Includes options such as selective color, which converts your image to monochrome then adds a splash of color to an area of your choice, and cross screen, which lends a starry effect to bright objects.",
    "cameratype": "Point & Shoot",
    "highspeedcontinuousshooting": "Shoot up to five full-resolution shots at 6 fps, or up to 30 full-resolution shots at 1 fps.",
    "zoom": "Optical: 4.2x Digital: 2x",
    "displaysize": "3\"",
    "shutter": "4 - 1/2000 sec",
    "flashmodes": "Auto",
    "digitalzoom": "2x",
    "sensorresolution": "16.1 MP",
    "videocliplength": "Up to 4GB or 29 Minutes",
    "leftbardescstart": "26320 Browse Our Store Store                                                                                                                         home Point & Shoot Cameras Pro. SLR Cameras Digital Camera Lenses Camcorders Projectors GPS Navigation Home audio Blu-ray / DVD PlayersLeft Bar Desc //End !Right Bar Desc //Start !Nikon COOLPIX P310 16.1 MP Digital Camera - Black Manufacturer Refurbished 16.1MP CMOS Sensor 4.2x Wide-Angle 24-100mm (Equiv) Lens Super Fast f/1.8 Lens for Low Light 3\" Hi Res 921K-Dot Display Optical VR Image Stabilization Sensitivity Up to 3200 ISO Full HD 1920x1080 Video W/Stereo Sound PSAM Full Exposure Control Ultra-Fast Start-Up, AF, Shooting High Speed Shooting to 7fps Nikon Coolpix P310 Digital Camera (Black) AN-CP19 Strap EN-EL12 Rechargeable Lithium-Ion Battery (3.7V, 1050mAh) Replacement EH-69P AC Adapter Charger UC-E6 USB Cable (4.5') EG-CP16 Nikon Audio/Video Cable Nikon ViewNX 2 Software CD Nikon COOLPIX P310 16.1 MP Digital ... SPECIFICATIONS Imaging Pixels 16.1 Megapixel Sensor 1/2.3\" CMOS File Formats Still Images: JPEG, MPO Movies: MPEG-4 AVC/H.264 Audio: AAC Max Resolution 16MP: 4608 x 3456 Aspect Ratio 4:3 Image Stabilization Optical Optics Lens NIKKOR, 7 elements in 6 groupsEFL: 4.3-17.9 mm (35 mm equivalent: 24-100 mm)Aperture: f/1.8 (W) - 4.9 (T) Zoom Optical: 4.2x Digital: 2x Focus Range Wide: 11.81\" (30 cm) - Infinity Telephoto: 23.62\" (60 cm) - Infinity Macro: 0.79\" (2 cm) - Infinity Exposure Control ISO Sensitivity 100-3200 Shutter 4 - 1/2000 sec Exposure Metering Center-weighted, Matrix Exposure Modes Modes: Aperture Priority, Auto, Manual, Shutter PriorityCompensation: -2 EV to +2 EV (in 1/3 EV steps) White Balance Modes Auto, Cloudy, Daylight, Flash, Fluorescent, Incandescent, Manual Burst Rate Up to 5 fps at 16.1 MP for up to 7 frames Self Timer 2 Sec, 10 Sec Flash Flash Modes Auto Built-in Flash Yes Maximum Effective Flash Range Wide: 1.64 - 21.33' (0.5 - 6.5 m) Telephoto: 1.64 - 8.20' (0.5 - 2.5 m) Memory Built-in Memory 90MB Memory Card Type SD SDHC SDXC Recording Video Recording Yes, NTSC/PAL Video Video Clip Length Up to 4GB or 29 Minutes Audio Recording With Video + Voice Memo, Stereo Viewfinder/Display Screen 3\" LCD Rear Screen (921,000 pixels) Connectivity/System Requirements Connectivity AV Output HDMI C (Mini) USB 2.0 Environmental Operating/Storage Temperature 32 to 104°F (0 to 40°C) Power Battery EN-EL12 Rechargeable Lithium-Ion Battery Pack AC Power Adapter EH-69P (Included) Physical Dimensions (WxHxD) 2.3 x 4.1 x 1.3\" / 5.8 x 10.4 x 3.3 cm Weight 6.9 oz / 196 g With Battery and Memory Card Back to Top NKCPP310BKRB TERMS AND CONDITIONS We usually ship within 1 business day after receiving payment. Please be aware                                                                                                                                         that weekends are not business days. All express methods of shipment still may require 1 day of processing time. Canadians and international buyers are responsible for all duties, customs                                                                                                                                         charges, and/or brokerage fees. We cannot ship as a gift, or claim as lower value. New Jersey buyers are responsible for applicable sales tax. We ship everything professionally in our state of the art warehouse. All products we sell are brand new and includes warranty coverage unless clearly                                                                                                                                         specified on the listing. \"Free Shipping\" applies to orders shipped within the continental                                                                                                                                         US. Domestic orders ship FedEx, UPS, and USPS. Our packages are insured and may require a signature. In accordance with PayPal                                                                                                                                         and eBay policies, we cannot reroute your package to a different address or hold                                                                                                                                         your shipment at the local hub for pick up, your order must be delivered to the                                                                                                                                         confirmed PayPal address received with your purchase. We cannot change your address                                                                                                                                         before the order ships. Please do not submit handling instructions in the notes                                                                                                                                         of your order requesting special handling, a specific courier or a change of address,                                                                                                                                         as we will be unable to meet these requests. We reserve the right to cancel any orders addressed to P.O. boxes, freight                                                                                                                                         forwarders, or resellers. We do not offer price protection if the price of an item                                                                                                                                         that you purchased. Prices do change frequently. We reserve the right to cancel orders placed without a registered eBay or                                                                                                                                         PayPal account. Orders placed by eBay guest checkout require additional verification                                                                                                                                         and may be delayed. Orders placed without a registered PayPal account cannot be                                                                                                                                         accepted and will be cancelled and refunded upon receipt. We offer a customer 30 day return privilege policy. A Return Merchandise Authorization                                                                                                                                             (RMA) number must be obtained for any return. To obtain an RMA number, please call                                                                                                                                             us toll free at 866-673-7187 . Returned packages without proper RMA demarcations will be refused by our warehouse                                                                                                                                             and returned to you. Customers who refuse a delivery, will be subject to charges                                                                                                                                             for return shipping to us. If the item was advertised as Free Shipping, then we                                                                                                                                             will charge the amount of shipping as determined by the FedEx shipping calculator. Some returns are subject to a restocking fee. The restocking percentage will depend                                                                                                                                             on the condition of the returned product. Defective products are eligible for exchange,                                                                                                                                             and no restock fee will apply. All returns must be packed with all contents which came with the original package                                                                                                                                             including, cables, software, plastic and cardboard packaging, and unregistered warranty                                                                                                                                             card. This return policy excludes Televisions and Home Theater Projectors. For further                                                                                                                                             questions please call us toll free at 866-673-7187 . You can also                                                                                                                                             contact us using the contact form found here . Return shipping costs are not reimbursable. International Customers: All electronic products are packaged for sale in the US with US Voltage. View International Policies Back to Top CONTACT INFO AND STORE HOURS ANY QUESTIONS? CALL US TOLL FREE: +1-866-673-7187 STORE HOURS: Monday - Friday 10:00AM to 3:00PM EST Email us anytime! Back to TopRight Bar Desc //End !",
    "sensortype": "BSI-CMOS, CMOS",
    "supportedflashmemory": "Built-in, SD Card, SD Memory Card, SDHC Card, SDHC Memory Card, SDXC Card, SDXC Memory Card",
    "model": "P310",
    "shootingprograms": "3D image, Back light, Beach, Black and white copy, Close-up, Dawn/dusk, Fireworks, Food, Landscape, Museum, Night landscape, Night portrait, Panorama assist, Party/indoor, Pet portrait, Portrait mode, Snow, Sports mode, Sunset",
    "screensize": "3\""
}