{
    "weight": "8.7oz (246.64g)",
    "battery": "Lithium-Ion Rechargeable Battery (LI-92B)",
    "isosensitivity": "ISO 100, 200, 400, 800, 1600, 3200, 6400, AUTO, HIGH",
    "imagestabilization": "Sensor-shift",
    "timelapsemovie": "Images obtained with the Interval Shooting mode can be compiled automatically in the camera into a Time Lapse Movie lasting up to 10 sec. Movie is recorded in 720p size at 10 fps.",
    "videomode": "1080p, 720p, VGA, Time-Lapse Movie (720p), High-Speed 120fps (640x480), High-Speed 240fps (432x324)",
    "category": "camera",
    "continuousshooting": "5fps / 100 images (16M); 15fps / 100 images (3M); 60fps / 100 images (3M)",
    "crushproof": "Up to 220 lbf / 100 kgf",
    "panorama": "Allows you to intuitively pan the camera across the scene; standard and full 360deg. views are available.",
    "shootingmodesmodedial": "Intelligent Auto (iAUTO), Program Auto (P), Aperture Priority (A), Microscope, Scene Modes (22), Art Filters (11), Photo Story, Custom (C)",
    "selftimer": "2 sec, 12 sec, Custom Self-Timer (1-30 sec start timer, 1-10 pictures, 1-3 sec interval)",
    "afilluminator": "Built-in AF Illuminator",
    "dimensionswxhxd": "4.4 x 2.6x 1.2\" (111.76 x 66.04 x 30.48mm)",
    "audiorecording": "Linear PCM",
    "dustproof": "Yes",
    "autoconnectusb": "USB 2.0 High-Speed (USB Mass Storage)",
    "batterylifecipadc002": "380 shots; 120 minutes continuous video shooting",
    "focallength": "4.5 - 18.0mm (35mm equivalent: 25 - 100mm)",
    "freezeproof": "Down to 14deg.F / -10deg.C",
    "removablemediacard": "SD, SDHC, SDXC, Internal Memory",
    "internalmemory": "36MB",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "imageprocessor": "TruePic VII",
    "shutterspeed": "1/2 - 1/2000 (Night Scene: Longest 4 sec)",
    "outerconnectors": "Multi-terminal (USB Connector, DC Jack, Audio/Video Output), HDMI Type D",
    "playbackediteffects": "Still Image: Resize, Crop, Red Eye Fix, Shadow Adjustment",
    "storecategoriesstorehomeentertainmentcentertelevisions": "1.888.209.5772 About me Contact Us Shipping Payments FAQ Olympus Tough TG-3 Digital Camera, 16MP, 4x Optical Zoom, 3.0\" LCD Display, 1080p Full HD Video, HDMI/USB2.0, Wi-Fi, Panorama, Waterproof, Shockproof - Red SKU: IOMTG3RD Mfr. Part: V104140BU000 Item Includes Olympus Tough TG-3 Digital Camera - Waterproof Instructions - Wrist Strap - LI-92B Rechargeable Lithium-Ion Battery - USB Cable (CB-USB8) - AC Adapter (F-2AC) - Quick Start Guide - CD-ROM with Instruction Manual and Olympus Viewer 3 Software - Olympus 1 Year Limited Warranty Description Strength and sophistication - two words that define the Olympus Tough TG-3 Digital Camera. This ultra-rugged camera's super-bright f2.0 lens delivers superb image quality in the harshest conditions. Features like Wi-Fi (remote camera operation, easy file sharing), time-interval shooting (similar to popular action cams), time-lapse movie (sunsets! starscapes!) and advanced GPS make the TG-3 Olympus's most versatile outdoor camera ever. The TG-3 is unique among outdoor cameras for its many accessories. Waterproof lens options include a fisheye converter that captures gorgeous wide-angle shots - even underwater - and a tele converter that increases zoom capability from 4x to nearly 7x. Also available are a new LED ring light for macro photography and colorful float straps, an underwater housing and sturdy cases. The Best & The Curious Quick start-up and fast autofocus - courtesy of Olympus iHS and FAST AF technology - ensure you're always ready to shoot. The TG-3 dials up the shutter speed for blur-free action images, thanks to its ultra-bright high-speed f2.0 lens. You can also reduce the ISO to shoot crisp, detailed images with minimal noise in low light, or use the Aperture priority mode to expand the focus range of the background. Connect with your smart devices The TG-3's built-in Wi-Fi and the free Olympus Image Share app turn your smart device into a remote extension of your camera. You can operate the zoom, adjust settings and AF points and trip the shutter. You can geotag photos and share files with the world. And you can apply custom signatures and stamps to your work. More ways to capture the action Mount the TG-3 on your bike, kayak or surfboard. Set up Interval Shooting - camera start-up time and intervals between shots (both from 1 second to 24 hours). Snap up to 99 frames. Compile the images automatically into a time-lapse movie lasting up to 10 seconds (720p at 10 fps). Enjoy the oohs and aahs of your friends. Get back on the beaten path If you venture a little too far off the beaten path, your TG-3 can help. Its next-generation GPS accurately locates your position within 10 seconds. Landmark information can be displayed and recorded with every shot. The built-in e.Compass offers information on direction, latitude and longitude as well as elevation and water depth...in case you push the limits to the extreme. Journey to worlds within The TG-3 offers four macro modes: Microscope, Microscope Control (maximum 44.5x magnification from 1cm), Focus Bracketing and Focus Stacking (multiple images are taken from foreground to background and the areas in focus are automatically merged into one perfect shot). Add the new LED ring light and you've got a complete portable macro set-up. Features 16MP BSI CMOS Sensor (1/2.3\") High-Speed, Ultra-Bright f2.0 Lens 4x Wide Zoom Lens (25mm) Shockproof to 7ft. Waterproof to 50ft. Crushproof to 220 lbf. Freezeproof -10°C/14°F Full 1080p HD Video System Expandability: Advanced Super Macro Features, Micro Scope Control Mode & Focus Bracketing Built-in Wi-Fi, OI.Share 3.0\" High-Res LCD Screen Art Filters & Photo Story Depth Compositing Mode GPS & e.Compass Specifications Waterproof Down to 50' / 15 m Crushproof Up to 220 lbf / 100 kgf Shockproof Up to 7' / 2.1m Freezeproof Down to 14deg.F / -10deg.C Dustproof Yes Lens Aperture Range Wide: f2.0, f2.8, f8.0 Tele: f4.9, f6.3, f18.0 Zoom 4x Optical Zoom + 2x Super Resolution Zoom + 4x Digital Zoom Focal Length 4.5 - 18.0mm (35mm equivalent: 25 - 100mm) Focus Range/Working Distance Wide/Tele: 3.9in/10cm to infinity; Super Macro Mode: 0.4in/3cm to infinity, focal length fixed to 25mm (equiv) Image Sensor 16 Megapixel - BSI CMOS 1/2.3\" Image Stabilization Sensor-shift Image Processor TruePic VII ISO Sensitivity ISO 100, 200, 400, 800, 1600, 3200, 6400, AUTO, HIGH White Balance Auto, One-touch, Cloudy, Sunny, Incandescent, Fluorescent, Underwater Shutter Speed 1/2 - 1/2000 (Night Scene: Longest 4 sec) Continuous Shooting 5fps / 100 images (16M); 15fps / 100 images (3M); 60fps / 100 images (3M) Focus Mode Face Detection AF, AF Tracking, AF Lock AF Illuminator Built-in AF Illuminator Flash Modes Auto, Red Eye Reduction, Fill-in, Off, LED Wi-Fi Yes built-in GPS & Electronic Compass GPS: Quickly locates position within 10 seconds and is more accurate than ever. Location and landmark information can be viewed and geotagged to photos. Electronic Compass: Displays information such as: 1) Latitude and longitude, 2) Atmospheric and water pressure, 3) Altitude and water depth and 4) Date and time. Self-Timer 2 sec, 12 sec, Custom Self-Timer (1-30 sec start timer, 1-10 pictures, 1-3 sec interval) Interval Shooting 1 sec - 24 hrs interval, Max 99 frames, 1 sec-24 hrs start timer Video Mode 1080p, 720p, VGA, Time-Lapse Movie (720p), High-Speed 120fps (640x480), High-Speed 240fps (432x324) Time-Lapse Movie Images obtained with the Interval Shooting mode can be compiled automatically in the camera into a Time Lapse Movie lasting up to 10 sec. Movie is recorded in 720p size at 10 fps. Audio Recording Linear PCM Shooting Modes: Mode Dial Intelligent Auto (iAUTO), Program Auto (P), Aperture Priority (A), Microscope, Scene Modes (22), Art Filters (11), Photo Story, Custom (C) Shooting Modes: Microscope Modes 1. Microscope, 2. Focus Stacking, 3. Focus Bracketing, 4. Microscope Control Shooting Modes: Scene Modes : 1. Portrait, 2. ePortrait, 3. Landscape, 4. Interval Shooting, 5. Hand-held Starlight, 6. Night Scene, 7. Night + Portrait, 8. Sport, 9. Indoor, 10. Self Portrait, 11. Sunset, 12. Fireworks, 13. Cuisine, 14. Documents, 15. Beach & Snow, 16. Under Water Snapshot, 17. Under Water Wide1, 18. Under Water Wide2, 19. Under Water Macro, 20. Snow, 21. Panorama, 22. Backlight HDR Shooting Modes: Art Filters 1. Pop Art, 2. Soft Focus, 3. Pale & Light Color, 4. Grainy Film, 5. Pin Hole, 6. Diorama, 7. Dramatic Tone, 8. Fish Eye, 9. Sparkle, 10. Reflection, 11. Fragmented Shooting Modes: Picture Modes Vivid, Natural, Muted Panorama Allows you to intuitively pan the camera across the scene; standard and full 360deg. views are available. Rear Monitor Size (Aspect Ratio) 3.0\" (3:2) Rear Monitor Resolution and Type 460K Dots LCD Image File Format Still Image: JPEG; Video: MOV/H.264, AVI/Motion JPEG (High-Speed Movie, Time-Lapse Movie) Playback Edit Effects Still Image: Resize, Crop, Red Eye Fix, Shadow Adjustment Removable Media Card SD, SDHC, SDXC, Internal Memory Internal Memory 36MB Outer Connectors Multi-terminal (USB Connector, DC Jack, Audio/Video Output), HDMI Type D Auto-Connect USB USB 2.0 High-Speed (USB Mass Storage) Language English, French, Spanish, Brazilian Portuguese, European Portuguese, German, Italian, Russian, Czech, Dutch, Danish, Polish, Swedish, Norwegian, Finnish, Croatian, Slovenian, Hungarian, Greek, Slovak, Turkish, Latvian, Estonian, Lithuanian, Ukrainian, Serbian, Korean, Simple Chinese, Traditional Chinese, Thai, Arabic, Bulgarian, Romanian, Persian, Indonesian, Hebrew, Malay, Vietnamese, Japanese Battery Lithium-Ion Rechargeable Battery (LI-92B) Battery Life (CIPA DC-002) 380 shots; 120 minutes continuous video shooting Dimensions (W x H x D) 4.4 x 2.6x 1.2\" (111.76 x 66.04 x 30.48mm) Weight 8.7oz (246.64g) WHO WE ARE Adorama is one of the nation's largest Photographic retail and mail order suppliers. For over 35 years we have been serving professionals as well as amateurs in the photographic, video, digital imaging and telescope fields. We offer the best combination of quality services, vast selection, knowledgeable staff, and competitive pricing. Adorama Camera is your #1 source for the best and newest products in the photographic industry, and the largest inventory of items such as Digital Cameras, Digital Camera Accessories, Memory Cards, 35mm Cameras, Medium Format Cameras, Lenses, Video Cameras, TV's, MP3 Players, Binoculars, Telescopes, Scanners, Inkjet, Dye-Sub & Laser Printers, Office Fax machines, Shredders, Projectors, Inkjet Paper, Photographic Accessories, Filters, Batteries, Cases, Tripods, Flashes, Lighting & Studio Equipment, Film, Darkroom Products and Audio Video Equipment. All new equipment comes with all of the factory included accessories, including a full manufacturer's warranty, unless otherwise noted. We only post items that are in-stock and ready to ship. PAYMENT Paypal is our only method of payment. Your Paypal account must be a Verified US Paypal account. Selecting \"Immediate Pay\" is the way to go. If you select eCheck, it may take 2-8 days to clear Paypal. In an effort to comply with our Authorized Dealer contracts with the manufacturers and to best control our inventory levels we reserve the right to limit quantities or cancel orders to Resellers and Exporters. Please note: Inventory is not reserved until the item is paid for. Please include a phone number as UPS and our Trucking Companies require it. We prefer to ship to a confirmed Paypal address and whether yes or no we may still contact you for additional verification. For shipments in New York and New Jersey, we are required to collect the appropriate sales tax. INTERNATIONAL International taxes and duties: International shipments may be subject to import fees, duties and taxes, which are levied once a shipment reaches the respective country, in addition to the brokerage fees/custom clearance charges which may be imposed by the carrier. These charges must be borne by the recipient. Adorama has no control over these charges and cannot predict what they might be. Orders shipped using eBays (GSP) \"Global Shipping Platform\" have already paid their taxes and must contact eBay directly for any issues. SHIPPING Most purchases are shipped with 24 Business Hours. Adorama's eBay store ships to the 48 Contiguous United States including Military APO & FPO and Puerto Rico. We now ship to Canada, parts of Europe and Australia. We do not ship to other International locations. Items with \"free shipping\" are only shipped free to the 48 contiguous United States. Combined shipping is available by placing all adoramacamera eBay orders BEFORE making the Payment. eBay's new checkout offers you to consolidate your orders to get better shipping rates. All orders must be shipped with a printed invoice included. We can not ship orders without the invoice or a lower value invoice. Gift Invoices can be sent if you call us immediately after payment is made (if during business hours). No guarantees for emails in this matter. Shipment errors due to a bad address entered by the buyer and will not be credited for shipping charges if returned or at all if lost or abandoned by the carrier. We supply tracking information directly to your eBay account as well as via email within 24 hours after the shipment leaves our warehouse. Please make sure that our email messages don't go into spam or junk. Change requests may not be updated on eBay, please check the emails. All TV's over 50 inches or other large items will ship via special Truck Delivery. An appointment will be made by the Trucking Company 24 hours before final delivery. Therefore, you must provide a phone number. Please read this carefully before purchasing any TV from us. All TV's 50 inches or larger will ship via special truck delivery only. An appointment will be made by the Trucking Company 24 hours before final delivery. LCD, LED and Plasma TVs as well as Monitors from 20\" and above can not be returned unless damaged in transit. At time of arrival If your TV arrives by UPS or FedEx: Please inspect the box from the outside for visible damage. If the box is not in perfect condition you should refuse it. Once you sign for it or open the box, you can not claim in-transit damage. If the box looks fine, you can then sign for it & open the box for further inspection after the carrier/driver leaves. You should check your TV ASAP to make sure that it works fine. If there are any problems, please let us know. If your TV arrives by special truck delivery: Please inspect the TV for both, external damage AND make sure that it powers up before you sign for it. If there's any external damage to the box, or it doesn't power on, do not accept it or sign for it. (According to the trucking company rules, you need to test the TV at the closest power outlet to the door. They are not required to wait until you put the TV in its intended place or till you test the cable connections). After the truck leaves, you should further test the TV to make sure everything works perfectly. If there are any problems, please let us know. Damage claims must be reported within 24 hours of receipt. Returns Please click here for our FULL RETURN POLICY For the first 30 days from date of receipt of your purchase you may return the merchandise for a full money back refund, excluding any shipping charges (for items which we offer free shipping, our standard shipping charges will be deducted from any refund or credit). Returned or exchanged products must be in brand-new, mint condition. Items must be in the original, undamaged manufacturer's packaging with all packaging materials, including instruction booklets, packing inserts, and the blank warranty cards. Memory cards and any other Blister Pack items are not returnable once opened. Any merchandise missing the original Universal Product Code (UPC) cannot be returned. The manufacturer's labeled packaging must be enclosed within an additional shipping carton. Please do not place stickers or shipping labels on the original manufacturer's package. Printers, Desktop Computers, Laptops, Tablets & Notebooks are not returnable once they are booted up or the toner is installed, as per the manufacturers contracts, all service to be done through them directly. Please ship your parcel back to Adorama freight prepaid and Insured. Sorry, Adorama cannot accept COD or freight-collect shipments. Return shipping cost (the cost to send an item back to our store) is not reimbursable. Please enclose a copy of your invoice with your return and tell us whether you would like the item to be replaced, exchanged, or refunded. Returns can take up to 8 days in-house from the date we receive it to process. When returning an item, please make sure you use a shipper which provides you with Insurance and a tracking number. Items returned without a tracking number might take much longer to be processed. We do not require a RMA. Returns should be shipped to: ACC Order processing 7 Slater Drive Elizabeth, NJ 07206 If you live in New York you may bring the return to our Manhattan store for exchange or refund. Warranty Information Most products have the warranty length listed in the description. To obtain a free copy of the manufacturers warranty details for any product we carry, please write to us and be sure to include the Brand Name and Model Number. Adorama Camera, Inc. Warranty Requests 42 West 18th Street New York, NY 10011 Contact Us Got a question? click here Product Information: 800-223-2500 Customer Service: 888-209-5772 HOURS OF OPERATION Mon-Thurs: 9:00am - 5:00pm Friday: 9:00am - 12:00pm On Oct-03-14 at 10:14:20 PDT, seller added the following information: Protect It Now with a Consumer Priority Service Extended Warranty",
    "language": "English, French, Spanish, Brazilian Portuguese, European Portuguese, German, Italian, Russian, Czech, Dutch, Danish, Polish, Swedish, Norwegian, Finnish, Croatian, Slovenian, Hungarian, Greek, Slovak, Turkish, Latvian, Estonian, Lithuanian, Ukrainian, Serbian, Korean, Simple Chinese, Traditional Chinese, Thai, Arabic, Bulgarian, Romanian, Persian, Indonesian, Hebrew, Malay, Vietnamese, Japanese",
    "flashmodes": "Auto, Red Eye Reduction, Fill-in, Off, LED",
    "imagesensor": "16 Megapixel - BSI CMOS 1/2.3\"",
    "wifi": "Yes built-in",
    "zoom": "4x Optical Zoom + 2x Super Resolution Zoom + 4x Digital Zoom",
    "focusmode": "Face Detection AF, AF Tracking, AF Lock",
    "imagefileformat": "Still Image: JPEG; Video: MOV/H.264, AVI/Motion JPEG (High-Speed Movie, Time-Lapse Movie)",
    "shockproof": "Up to 7' / 2.1m",
    "waterproof": "Down to 50' / 15 m",
    "intervalshooting": "1 sec - 24 hrs interval, Max 99 frames, 1 sec-24 hrs start timer",
    "whitebalance": "Auto, One-touch, Cloudy, Sunny, Incandescent, Fluorescent, Underwater"
}