{
    "exposuremetering": "Center-weighted, Face Detection, Multi, Spot",
    "externalflashconnection": "None",
    "imagestabilization": "Optical",
    "weight": "4.66 oz / 132  g Without battery and memory card",
    "flashtype": "Built-In",
    "battery": "Rechargeable Lithium-Ion Battery Pack, 3.7VDC, 880mAh",
    "isosensitivity": "Auto, 100-3200",
    "height": "0.677 in.",
    "displaytype": "AMOLED",
    "cameraflashfeatures": "Auto Flash, Fill-in Flash, Flash Off, Red-eye Reduction Flash, Slow Sync",
    "additionalfeatures": "HDMI, Not Interchangeable Lenses, Standard, USB 2.0, With Touchscreen Panel",
    "connectortypes": "USB to computer",
    "stillimagespergb": "Not Specified By Manufacturer",
    "screen": "3.31\" OLED Rear Touch Screen 2 Please Note: wVGA AMOLED flip-up display close",
    "opticalzoom": "5x",
    "softwarerequirements": "Windows: XP (SP2), Vista, 7Mac: OS X 10.5 or later",
    "category": "camera",
    "specialeffects": "Classic, Color sketch, Fisheye, Halftone Dots, Miniature, Retro, Vignetting",
    "videorecording": "Yes, NTSC/PAL",
    "burstrate": "Not Specified By Manufacturer",
    "lightsensitivitymax": "3200",
    "operatingstoragetemperature": "Operating 32 to 104 °F (0 to 40 °C)Humidity: 5 - 85%",
    "depth": "2.36 in.",
    "pixels": "Actual: 17.01 MegapixelEffective: 16.31 Megapixel",
    "selftimer": "Not Specified By Manufacturer",
    "width": "3.878 in.",
    "builtinmemory": "None",
    "screensize": "3.3\"",
    "dimensionswxhxd": "3.88 x 2.36 x 0.68\" / 9.86 x 5.99 x 1.73 cm",
    "maxvideoresolution": "1920 x 1080",
    "sensor": "1/2.3\" CMOS 1 Please Note: Backside Illuminated (BSI) CMOS sensor close",
    "audiorecording": "With Video, Mono",
    "whitebalancemodes": "Auto, Cloudy, Custom, Daylight, Fluorescent (Day White), Fluorescent H, Tungsten",
    "mpn": "EC-MV900FBPBUS",
    "brand": "Samsung",
    "leftbardescstart": "EC-MV900FBPBUS Browse Our Store Store                                                                                                                         home Point & Shoot Cameras Pro. SLR Cameras Digital Camera Lenses Camcorders Projectors GPS Navigation Home audio Blu-ray / DVD PlayersLeft Bar Desc //End !Right Bar Desc //Start !Samsung MV900 Multiview Digital Camera (Black) Brand New, Never Been Used 16Mp BSI CMOS Sensor 3.3\" WVGA AMOLED Touchscreen Full HD 1920 x 1080 Video at 60 fps Dual Capture Photo and Full HD Video Self-Portrait Features & Shooting Modes Integrated Wi-Fi & Direct Connect Button Capture Images via Gesture or Remote VF Social Media Sharing & Auto Backup Easy Photo Editing In-Camera Samsung     MV900 Multiview Digital Camera (Black) Rechargeable Battery AC Charging Adapter Micro USB Cable Samsung MV900 Multiview Digital Ca ... SPECIFICATIONS Imaging Pixels Actual: 17.01 MegapixelEffective: 16.31 Megapixel Sensor 1/2.3\" CMOS 1 Please Note: Backside Illuminated (BSI) CMOS sensor close File Formats Still Images: JPEG Movies: MPEG-4 AVC/H.264 Audio: AAC Max Resolution 16MP: 4608 x 3456 @ 4:3 Other Resolutions 14MP: 4608 x 3072 @ 3:2 12MP: 4608 x 2592 @ 16:9 10MP: 3648 x 2736 @ 4:3 5MP: 2592 x 1944 @ 4:3 3MP: 1984 x 1488 @ 4:3 2MP: 1920 x 1080 @ 16:9 0.8MP: 1024 x 768 @ 4:3 Aspect Ratio 3:2, 4:3, 16:9 Image Stabilization Optical Optics Lens EFL: 4.5 mm (35 mm equivalent: 25 mm)Aperture: f/2.5 (W) - 6.3 (T) Filter Thread None Zoom Optical: 5x Digital: 5x Advanced: 14x Focus Range Wide: 31.50\" (80 cm) - Infinity Telephoto: 98.43\" (250 cm) - Infinity Wide Macro: 1.97\" (5.0 cm) - 31.50\" (80 cm) Tele Macro: 39.37\" (100 cm) - 98.43\" (250 cm) Macro: 1.97\" (5 cm) - Macro: 39.37\" (100 cm) - Exposure Control ISO Sensitivity Auto, 100-3200 Shutter 1/8 - 1/2000 sec Type: MechanicalSpeed: 8 - 1/2000 sec in Night Scene Mode Exposure Metering Center-weighted, Face Detection, Multi, Spot Exposure Modes Modes: Auto, Program, Smart Shutter White Balance Modes Auto, Cloudy, Custom, Daylight, Fluorescent (Day White), Fluorescent H, Tungsten Burst Rate Not Specified By Manufacturer Self Timer Not Specified By Manufacturer Flash Flash Modes Auto, Auto/Red-eye Reduction, Fill-in, Off, Red-eye Reduction, Slow Sync Built-in Flash Yes Effective Flash Range Wide: 0.66 - 15.09' (0.2 - 4.6 m) Telephoto: 1.64 - 3.94' (0.5 - 1.2 m) External Flash Connection None Memory Built-in Memory None Memory Card Type SD (up to 2GB) SDHC (up to 32GB) SDXC (up to 64GB) Still Images per GB Not Specified By Manufacturer Recording Video Recording Yes, NTSC/PAL Video Video Clip Length Not Specified By Manufacturer Audio Recording With Video, Mono Viewfinder/Display Viewfinder Type LCD Display Screen 3.31\" OLED Rear Touch Screen 2 Please Note: wVGA AMOLED flip-up display close Connectivity/System Requirements Connectivity 1x USB 2.0 Software Requirements Windows: XP (SP2), Vista, 7Mac: OS X 10.5 or later Environmental Operating/Storage Temperature Operating 32 to 104 °F (0 to 40 °C)Humidity: 5 - 85% Power Battery Rechargeable Lithium-Ion Battery Pack, 3.7VDC, 880mAh AC Power Adapter Not Specified By Manufacturer Physical Dimensions (WxHxD) 3.88 x 2.36 x 0.68\" / 9.86 x 5.99 x 1.73 cm Weight 4.66 oz / 132  g Without battery and memory card Back to Top SAMV900FBK TERMS AND CONDITIONS We usually ship within 1 business day after receiving payment. Please be aware                                                                                                                                         that weekends are not business days. All express methods of shipment still may require 1 day of processing time. Canadians and international buyers are responsible for all duties, customs                                                                                                                                         charges, and/or brokerage fees. We cannot ship as a gift, or claim as lower value. New Jersey buyers are responsible for applicable sales tax. We ship everything professionally in our state of the art warehouse. All products we sell are brand new and includes warranty coverage unless clearly                                                                                                                                         specified on the listing. \"Free Shipping\" applies to orders shipped within the continental                                                                                                                                         US. Domestic orders ship FedEx, UPS, and USPS. Our packages are insured and may require a signature. In accordance with PayPal                                                                                                                                         and eBay policies, we cannot reroute your package to a different address or hold                                                                                                                                         your shipment at the local hub for pick up, your order must be delivered to the                                                                                                                                         confirmed PayPal address received with your purchase. We cannot change your address                                                                                                                                         before the order ships. Please do not submit handling instructions in the notes                                                                                                                                         of your order requesting special handling, a specific courier or a change of address,                                                                                                                                         as we will be unable to meet these requests. We reserve the right to cancel any orders addressed to P.O. boxes, freight                                                                                                                                         forwarders, or resellers. We do not offer price protection if the price of an item                                                                                                                                         that you purchased. Prices do change frequently. We reserve the right to cancel orders placed without a registered eBay or                                                                                                                                         PayPal account. Orders placed by eBay guest checkout require additional verification                                                                                                                                         and may be delayed. Orders placed without a registered PayPal account cannot be                                                                                                                                         accepted and will be cancelled and refunded upon receipt. We offer a customer 30 day return privilege policy. A Return Merchandise Authorization                                                                                                                                             (RMA) number must be obtained for any return. To obtain an RMA number, please call                                                                                                                                             us toll free at 866-673-7187 . Returned packages without proper RMA demarcations will be refused by our warehouse                                                                                                                                             and returned to you. Customers who refuse a delivery, will be subject to charges                                                                                                                                             for return shipping to us. If the item was advertised as Free Shipping, then we                                                                                                                                             will charge the amount of shipping as determined by the FedEx shipping calculator. Some returns are subject to a restocking fee. The restocking percentage will depend                                                                                                                                             on the condition of the returned product. Defective products are eligible for exchange,                                                                                                                                             and no restock fee will apply. All returns must be packed with all contents which came with the original package                                                                                                                                             including, cables, software, plastic and cardboard packaging, and unregistered warranty                                                                                                                                             card. This return policy excludes Televisions and Home Theater Projectors. For further                                                                                                                                             questions please call us toll free at 866-673-7187 . You can also                                                                                                                                             contact us using the contact form found here . Return shipping costs are not reimbursable. International Customers: All electronic products are packaged for sale in the US with US Voltage. View International Policies Back to Top CONTACT INFO AND STORE HOURS ANY QUESTIONS? CALL US TOLL FREE: +1-866-673-7187 STORE HOURS: Monday - Friday 10:00AM to 3:00PM EST Email us anytime! Back to TopRight Bar Desc //End !",
    "filterthread": "None",
    "sensortype": "CMOS",
    "connectivity": "1x USB 2.0",
    "focusrange": "Wide: 31.50\" (80 cm) - Infinity Telephoto: 98.43\" (250 cm) - Infinity Wide Macro: 1.97\" (5.0 cm) - 31.50\" (80 cm) Tele Macro: 39.37\" (100 cm) - 98.43\" (250 cm) Macro: 1.97\" (5 cm) - Macro: 39.37\" (100 cm) -",
    "maxresolution": "16MP: 4608 x 3456 @ 4:3",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "aspectratio": "3:2, 4:3, 16:9",
    "fileformats": "Still Images: JPEG Movies: MPEG-4 AVC/H.264 Audio: AAC",
    "acpoweradapter": "Not Specified By Manufacturer",
    "lens": "EFL: 4.5 mm (35 mm equivalent: 25 mm)Aperture: f/2.5 (W) - 6.3 (T)",
    "otherresolutions": "14MP: 4608 x 3072 @ 3:2 12MP: 4608 x 2592 @ 16:9 10MP: 3648 x 2736 @ 4:3 5MP: 2592 x 1944 @ 4:3 3MP: 1984 x 1488 @ 4:3 2MP: 1920 x 1080 @ 16:9 0.8MP: 1024 x 768 @ 4:3",
    "microphonetype": "With Built-in Microphone",
    "focusadjustment": "Autofocus & Fixed Focus & Manual",
    "memorycardtype": "SD (up to 2GB) SDHC (up to 32GB) SDXC (up to 64GB)",
    "flashmodes": "Auto, Auto/Red-eye Reduction, Fill-in, Off, Red-eye Reduction, Slow Sync",
    "builtinflash": "Yes",
    "cameratype": "Point & Shoot",
    "exposuremodes": "Modes: Auto, Program, Smart Shutter",
    "upc": "044701017226, 770332320908",
    "displaysize": "3.3\"",
    "shutter": "1/8 - 1/2000 sec Type: MechanicalSpeed: 8 - 1/2000 sec in Night Scene Mode",
    "digitalzoom": "5x",
    "sensorresolution": "16.3 MP",
    "viewfindertype": "LCD Display",
    "effectiveflashrange": "Wide: 0.66 - 15.09' (0.2 - 4.6 m) Telephoto: 1.64 - 3.94' (0.5 - 1.2 m)",
    "videocliplength": "Not Specified By Manufacturer",
    "supportedflashmemory": "SD Card, SDHC Card, SDXC Card, microSD Card, microSDHC Card, microSDXC Memory Card",
    "model": "MV900F",
    "operatingsystemsupported": "Microsoft Windows 7",
    "whitebalance": "Cloudy (Preset), Daylight / Sunny (Preset), Fluorescent (Preset)",
    "zoom": "Optical: 5x Digital: 5x Advanced: 14x"
}