{
    "exposuremetering": "Center-weighted, Multi, Spot",
    "externalflashconnection": "Hot Shoe",
    "viewfindercoverage": "100%",
    "imagestabilization": "Optical",
    "weight": "1.18 lb / 537  g without battery and card",
    "battery": "Rechargeable Lithium-Ion Battery Pack, 7.2VDC, 1200mAh",
    "isosensitivity": "Auto, 100-3200 (High Sensitivity Mode: 1600-6400)",
    "height": "3.41 in.",
    "memorycardtype": "SD SDHC SDXC",
    "additionalfeatures": "HDMI, Interchangeable Lenses, USB 2.0",
    "connectortypes": "USB to computer",
    "stillimagespergb": "Not Specified By Manufacturer",
    "screen": "3.0\" LCD Rear Screen (460000 pixels) 8 Please Note: 100% Wide Viewing Area close",
    "opticalzoom": "24x",
    "softwarerequirements": "Not Specified By Manufacturer",
    "category": "camera",
    "videorecording": "Yes, NTSC/PAL",
    "burstrate": "Up to 12 fps at 12.1 MP for up to 12 frames Up to 5.5 fps at 12.1 MP for up to 12 frames Up to 2 fps at 12.1 MP for up to 12 frames Up to 60 fps at 2.5 MP Up to 40 fps at 5 MP",
    "lightsensitivitymax": "100",
    "operatingstoragetemperature": "Not Specified By Manufacturer",
    "lens": "Leica DC Vario-Elmarit, 14 elements in 11 groups5 Aspheric, 3 EDEFL: 4.5-108 mm (35 mm equivalent: 25-600 mm)Aperture: f/2.8 (W) - 2.8 (T) to f/8.0 1 Please Note: 28-672mm (35mm equivalency) for Video Recording close",
    "depth": "4.34 in.",
    "selftimer": "10 Sec, 2 Sec 4 Please Note: Also: 10 seconds, 3 pictures close",
    "width": "4.93 in.",
    "builtinmemory": "70MB",
    "dimensionswxhxd": "4.93 x 3.41 x 4.34\" / 125.2 x 86.6 x 110.2 mm",
    "maxvideoresolution": "1920 x 1080",
    "sensor": "1/2.3\" MOS",
    "audiorecording": "With Video, Stereo",
    "whitebalancemodes": "Auto, Cloudy, Daylight, Flash, Fluorescent (Natural White), Fluorescent (White), Incandescent, Shade 3 Please Note: Also: Color temperature and 2-axis adjustable close",
    "mpn": "DMC-FZ200K",
    "brand": "Panasonic",
    "leftbardescstart": "DMC-FZ200K Browse Our Store Store home Point & Shoot Cameras Pro. SLR Cameras Digital Camera Lenses Camcorders Projectors GPS Navigation Home audio Blu-ray / DVD PlayersLeft Bar Desc //End !Right Bar Desc //Start !Panasonic LUMIX DMC-FZ200 12.1 MP Digital Camera - Black (Kit w/ 25-600mm Lens) New, Never Opened 12.1 MP MOS Sensor LSI Venus Engine Image Processor 25-600mm f/2.8 Leica Optical Zoom Lens 3.0\" Free Angle 460K-dot LCD Display 0.2\" Electronic View Finder w/ 100% FOV 12 fps Continuous Shooting RAW and RAW+JPEG Recording Option Full HD 60p Video Recording Improved Ergonomics Hot-shoe and Accessory Mount Panasonic     Lumix FZ200 Digital Camera Li-ion Battery Pack Battery Charger USB Cable Shoulder Strap CD-ROM Lens Cap Lens Cap String Lens Hood Panasonic Lumix FZ200 Digital Camer ... SPECIFICATIONS Imaging Resolution Effective: 12.1 Megapixel, Actual Pixels: 12.8 Megapixel Sensor 1/2.3\" MOS File Formats Still Images: JPEG, MPO, RAW Movies: MPEG-4, MPEG-4 AVCHD Audio: AAC Max Resolution 12MP: 4000 x 3000 @ 4:3 Other Resolutions 9MP: 2992 x 2992 @ 1:1 6MP: 2448 x 2448 @ 1:1 3.5MP: 1920 x 1920 @ 1:1 2.5MP: 1536 x 1536 @ 1:1 0.2MP: 480 x 480 @ 1:1 8MP: 3264 x 2448 @ 4:3 5MP: 2560 x 1920 @ 4:3 3MP: 2048 x 1536 @ 4:3 2MP: 1600 x 1200 @ 4:3 0.3MP: 640 x 480 @ 4:3 10MP: 4000 x 2672 @ 3:2 7MP: 3264 x 2176 @ 3:2 4.5MP: 2560 x 1712 @ 3:2 2.5MP: 2048 x 1360 @ 3:2 0.3MP: 640 x 424 @ 3:2 9MP: 4000 x 2248 @ 16:9 6MP: 3264 x 1840 @ 16:9 3.5MP: 2560 x 1440 @ 16:9 2MP: 1920 x 1080 @ 16:9 0.2MP: 640 x 360 1920 x 1080 Aspect Ratio 1:1, 3:2, 4:3, 16:9 Image Stabilization Optical Optics Lens Leica DC Vario-Elmarit, 14 elements in 11 groups5 Aspheric, 3 EDEFL: 4.5-108 mm (35 mm equivalent: 25-600 mm)Aperture: f/2.8 (W) - 2.8 (T) to f/8.0 1 Please Note: 28-672mm (35mm equivalency) for Video Recording close Zoom Optical: 24x Intelligent Zoom: 48x Focus Range Wide: 11.81\" (30 cm) - Infinity Telephoto: 78.74\" (200 cm) - Infinity Wide: 0.39\" (1 cm) - Infinity Telephoto: 39.37\" (100 cm) - Infinity 2 Please Note: Normal (Wide, Tele) and AF Macro, MF, iA, Motion Picture (Wide Tele)respectively close Exposure Control ISO Sensitivity Auto, 100-3200 (High Sensitivity Mode: 1600-6400) Shutter 60 - 1/4000 sec Exposure Metering Center-weighted, Multi, Spot Exposure Modes Modes: Aperture Priority, Manual, Programmed Auto, Shutter PriorityCompensation: -3 EV to +3 EV (in 1/3 EV steps) White Balance Modes Auto, Cloudy, Daylight, Flash, Fluorescent (Natural White), Fluorescent (White), Incandescent, Shade 3 Please Note: Also: Color temperature and 2-axis adjustable close Burst Rate Up to 12 fps at 12.1 MP for up to 12 frames Up to 5.5 fps at 12.1 MP for up to 12 frames Up to 2 fps at 12.1 MP for up to 12 frames Up to 60 fps at 2.5 MP Up to 40 fps at 5 MP Self Timer 10 Sec, 2 Sec 4 Please Note: Also: 10 seconds, 3 pictures close Remote Control None Flash Built-in Flash Yes: Auto, Auto/Red-eye Reduction, Forced On, Off, Second-curtain Sync, Slow Sync, Slow Sync./Red-eye Reduction Effective Flash Range Wide: 0.98 - 44.29' (0.3 - 13.5 m) Telephoto: 3.28 - 44.29' (1.0 - 13.5 m) 5 Please Note: At ISO Auto close External Flash Connection Hot Shoe Memory Built-in Memory 70MB Memory Card Type SD SDHC SDXC Still Images per GB Not Specified By Manufacturer Recording Video Recording Yes, NTSC/PAL Video Video Clip Length Up to 100 Min 6 Please Note: Actual Recordable Time at Full HD in MP4 close Audio Recording With Video, Stereo Viewfinder/Display Viewfinder Type Electronic, LCD Display 7 Please Note: 0.21\" Color Electronic View Finder close Viewfinder Coverage 100% Screen 3.0\" LCD Rear Screen (460000 pixels) 8 Please Note: 100% Wide Viewing Area close Connectivity/System Requirements Connectivity 1/8\" Microphone, AV Output, HDMI C (Mini), USB 2.0 Software Requirements Not Specified By Manufacturer Environmental Operating/Storage Temperature Not Specified By Manufacturer Waterproofing Not Specified By Manufacturer Power Battery Rechargeable Lithium-Ion Battery Pack, 7.2VDC, 1200mAh AC Power Adapter 110-240V AC (Optional) Physical Dimensions (WxHxD) 4.93 x 3.41 x 4.34\" / 125.2 x 86.6 x 110.2 mm Weight 1.18 lb / 537  g without battery and card Back to Top PANDMCFZ200K TERMS AND CONDITIONS We usually ship within 1 business day after receiving payment. Please be aware that weekends are not business days. All express methods of shipment still may require 1 day of processing time. Canadians and international buyers are responsible for all duties, customs charges, and/or brokerage fees. We cannot ship as a gift, or claim as lower value. New Jersey buyers are responsible for applicable sales tax. We ship everything professionally in our state of the art warehouse. All products we sell are brand new and includes warranty coverage unless clearly specified on the listing. \"Free Shipping\" applies to orders shipped within the continental US. Domestic orders ship FedEx, UPS, and USPS. Our packages are insured and may require a signature. In accordance with PayPal and eBay policies, we cannot reroute your package to a different address or hold your shipment at the local hub for pick up, your order must be delivered to the confirmed PayPal address received with your purchase. We cannot change your address before the order ships. Please do not submit handling instructions in the notes of your order requesting special handling, a specific courier or a change of address, as we will be unable to meet these requests. We reserve the right to cancel any orders addressed to P.O. boxes, freight forwarders, or resellers. We do not offer price protection if the price of an item that you purchased. Prices do change frequently. We reserve the right to cancel orders placed without a registered eBay or PayPal account. Orders placed by eBay guest checkout require additional verification and may be delayed. Orders placed without a registered PayPal account cannot be accepted and will be cancelled and refunded upon receipt. We offer a customer 30 day return privilege policy. A Return Merchandise Authorization (RMA) number must be obtained for any return. To obtain an RMA number, please call us toll free at 866-673-7187 . Returned packages without proper RMA demarcations will be refused by our warehouse and returned to you. Customers who refuse a delivery, will be subject to charges for return shipping to us. If the item was advertised as Free Shipping, then we will charge the amount of shipping as determined by the FedEx shipping calculator. Some returns are subject to a restocking fee. The restocking percentage will depend on the condition of the returned product. Defective products are eligible for exchange, and no restock fee will apply. All returns must be packed with all contents which came with the original package including, cables, software, plastic and cardboard packaging, and unregistered warranty card. This return policy excludes Televisions and Home Theater Projectors. For further questions please call us toll free at 866-673-7187 . You can also contact us using the contact form found here . Return shipping costs are not reimbursable. International Customers: All electronic products are packaged for sale in the US with US Voltage. View International Policies Back to Top CONTACT INFO AND STORE HOURS ANY QUESTIONS? CALL US TOLL FREE: +1-866-673-7187 STORE HOURS: Monday - Friday 10:00AM to 3:00PM EST Saturday - Sunday: Closed Email us anytime! Back to TopRight Bar Desc //End !",
    "sensortype": "MOS",
    "connectivity": "1/8\" Microphone, AV Output, HDMI C (Mini), USB 2.0",
    "focusrange": "Wide: 11.81\" (30 cm) - Infinity Telephoto: 78.74\" (200 cm) - Infinity Wide: 0.39\" (1 cm) - Infinity Telephoto: 39.37\" (100 cm) - Infinity 2 Please Note: Normal (Wide, Tele) and AF Macro, MF, iA, Motion Picture (Wide Tele)respectively close",
    "maxresolution": "12MP: 4000 x 3000 @ 4:3",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "aspectratio": "1:1, 3:2, 4:3, 16:9",
    "fileformats": "Still Images: JPEG, MPO, RAW Movies: MPEG-4, MPEG-4 AVCHD Audio: AAC",
    "acpoweradapter": "110-240V AC (Optional)",
    "integratedmemorysize": "70 MB",
    "otherresolutions": "9MP: 2992 x 2992 @ 1:1 6MP: 2448 x 2448 @ 1:1 3.5MP: 1920 x 1920 @ 1:1 2.5MP: 1536 x 1536 @ 1:1 0.2MP: 480 x 480 @ 1:1 8MP: 3264 x 2448 @ 4:3 5MP: 2560 x 1920 @ 4:3 3MP: 2048 x 1536 @ 4:3 2MP: 1600 x 1200 @ 4:3 0.3MP: 640 x 480 @ 4:3 10MP: 4000 x 2672 @ 3:2 7MP: 3264 x 2176 @ 3:2 4.5MP: 2560 x 1712 @ 3:2 2.5MP: 2048 x 1360 @ 3:2 0.3MP: 640 x 424 @ 3:2 9MP: 4000 x 2248 @ 16:9 6MP: 3264 x 1840 @ 16:9 3.5MP: 2560 x 1440 @ 16:9 2MP: 1920 x 1080 @ 16:9 0.2MP: 640 x 360 1920 x 1080",
    "remotecontrol": "None",
    "waterproofing": "Not Specified By Manufacturer",
    "focusadjustment": "Autofocus & Manual Focus",
    "displaytype": "LCD",
    "builtinflash": "Yes: Auto, Auto/Red-eye Reduction, Forced On, Off, Second-curtain Sync, Slow Sync, Slow Sync./Red-eye Reduction",
    "cameratype": "Bridge Camera",
    "exposuremodes": "Modes: Aperture Priority, Manual, Programmed Auto, Shutter PriorityCompensation: -3 EV to +3 EV (in 1/3 EV steps)",
    "zoom": "Optical: 24x Intelligent Zoom: 48x",
    "displaysize": "3\"",
    "shutter": "60 - 1/4000 sec",
    "digitalzoom": "4x",
    "sensorresolution": "12.1 MP",
    "viewfindertype": "Electronic, LCD Display 7 Please Note: 0.21\" Color Electronic View Finder close",
    "effectiveflashrange": "Wide: 0.98 - 44.29' (0.3 - 13.5 m) Telephoto: 3.28 - 44.29' (1.0 - 13.5 m) 5 Please Note: At ISO Auto close",
    "videocliplength": "Up to 100 Min 6 Please Note: Actual Recordable Time at Full HD in MP4 close",
    "supportedflashmemory": "Built-in, SD Card, SD Memory Card, SDHC Card, SDHC Memory Card, SDXC Card, SDXC Memory Card",
    "model": "DMC-FZ200",
    "resolution": "Effective: 12.1 Megapixel, Actual Pixels: 12.8 Megapixel",
    "screensize": "3\""
}