{
    "features": "Custom Functions: 16 items Mode Memory: 10 items Button/ Dial Customization: Green/Delete button: Green Button, Preview, One Push File Format, AE Lock, Enable AF Quick Dial: Smart Effect, Custom Image, Digital Filter, Aspect Ratio World Time: World Time settings for 75 cities (28 time zones)",
    "weight": "200g (loaded with battery and SD card), 180g (body only)",
    "sensitivity": "AUTO : ISO 100 to 12800 (1/3 EV steps) Bulb mode : up to ISO 1600",
    "autoexposurelock": "Can be assigned to the green/delete button from the menu. Continuous as long as the shutter release button is pressed halfway.",
    "metering": "TTL image sensor metering, segment metering, centerweighted metering, and spot metering",
    "height": "58mm",
    "interface": "Connection Port: USB 2.0 (high-speed compatible) / AV output terminal, HDMI output terminal (Type D) USB Connection: MSC/PTP Video Output Format: NTSC/PAL",
    "effectivepixels": "Approx. 12.4 MP",
    "includedsoftware": "SILKYPIX Developer Studio 3.0 LE",
    "still": "File formats: RAW (DNG), JPEG (Exif 2.3), DCF2.0 compliant JPEG [4:3]L:12M(4000x3000),M:7M(3072x2304),S:3M(1920x1440) [3:2]L:10M(4000x2664),M:6M(3072x2048),S:2M(1920x1280) [16:9]L:9M(4000x2248),M:5M(3072x1728),S:2M(1920x1080) [1:1]L:9M(2992x2992),M:5M(2304x2304),2M(1440x1440) RAW [4:3]12M(4000x3000) Quality level: RAW (12bit): DNG JPEG: â\u0098\u0085â\u0098\u0085â\u0098\u0085 (best), â\u0098\u0085â\u0098\u0085 (better),  â\u0098\u0085 (good) RAW and JPEG simultaneously recordable Color Space: sRGB, AdobeRGB",
    "speed": "Lens shutter: 1/2000 - 30 seconds (1/3EV step, 1/8000 - 30 seconds when Electronic Shutter setting is enabled), Bulb *Shooting at 1/8000 - 2 seconds with Electronic Shutter and Bulb shooting are not available when using a lens that has no lens shutter.",
    "size": "1/1.7-inch",
    "category": "camera",
    "sensorcleaning": "Image sensor cleaning using ultrasonic vibrations ‘DRII’",
    "functions": "Brightness Range: EV0 to 18ï¼\u0088ISO100) Focus mode: AF/MF switching Autofocus Method: Face Detection, Tracking, Multi-point, Select, Spot AF Assist Light: Dedicated LED AF assist light Assist: OFF/ x2/ x4 Focus Peaking: OFF/ON",
    "width": "102mm",
    "kitcontent": "USB Cable I-USB7 Strap O-ST131 Rechargeable Lithium-ion Battery D-LI68 Battery Charger D-BC68P Software (CDROM) S-SW133 Mounted on the camera: Hot shoe cover FK Body mount cover",
    "digitalfilter": "Base Parameter Adjustment, Toy Camera, High Contrast, Shading, Tone Expansion, Invert Color, Extract Color, Unicolor Bold, Water Color, Posterization, Slim, Fish-eye, Retro, Soft, Sketch Filter, Miniature, Soft, Starburst",
    "compensation": "Exposure Compensation: EV1 - 17 (ISO 100, F1.9 lens), +2EV using the Electronic Shutter setting or using the ND filter EV Compensation: ± 3EV (1/3EV step)",
    "filename": "Storage Folder: Date (100_1018, 100_1019...)/PENTX (100PENTX, 101PENTX...)",
    "pc": "Windows XP (SP3 or later, 32-bit Home/Pro), Windows Vista(32-bit, 64-bit), Windows 7 (32-bit, 64-bit), Windows 8",
    "totalpixels": "Approx. 12.76 MP",
    "angleofviewcoverage": "Wide-angle lens, equivalent to 28mm in 35mm format",
    "performance": "Number of recordable images: approx. 250 images (with 50% flash usage), approx. 260 images (without flash usage) Playback time: approx. 160 minutes * Using a new lithium-ion battery under the temperature at 23 °C, Tested in compliance with CIPA standard.",
    "type": "Built-in retractable P-TTL flash",
    "whitebalance": "Auto: TTL by CMOS image sensor Preset: Daylight, Shade, Cloudy, Fluorescent Light (D:Daylight Color, N:Daylight White, W:Cool White, L:Warm White), Tungsten, Flash, CTE, Manual Manual: Configuration using the display screen (up to 3 settings can be saved), Copying the white balance setting of a captured image Fine Adjustment: Adjustable ±7 steps on A-B axis or G-M axis",
    "mac": "Mac OS X 10.5, 10.6, or 10.7",
    "xsynchronization": "Lens shutter: 1/2000 seconds, Electronic shutter: 1/13 seconds",
    "external": "SD, SDHC, SDXC Memory Card and Eye-Fi Card",
    "shakereduction": "Sensor shift Shake reduction",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "modes": "Drive Modes Mode Selection: Single frame, Continuous (Hi, Lo), Self-timer (12s, 2s), Remote Control (0 sec., 3 sec., continuous), Exposure Bracketing (3 frames, remote control), Multi-exposure (0 sec., Self-time, remote control), Interval Shooting Continuous Shooting: Approx. 5 fps, JPEG (12M / â\u0098\u0085â\u0098\u0085â\u0098\u0085 / Continuous Hi): up to 5 frames, Approx. 1.5 fps, JPEG (12M / â\u0098\u0085â\u0098\u0085â\u0098\u0085 / Continuous Lo): up to 100 frames Capture Functions Custom Image: Bright, Natural, Portrait, Landscape, Vibrant, Radiant, Muted, Bleach Bypass, Reversal Film, Monochrome, Cross Processing Noise Reduction: High-ISO NR Dynamic Range Setting: Highlight Correction, Shadow Correction Lens Correction: Distortion Correction HDR Capture: Auto, HDR 1, HDR 2 Multi-exposure: Number of shots: 2-9, Exposure adjusted automatically Interval Shooting: Shooting interval: 3 sec. to 24 hr., Start Interval setting: immediately from the set time, Number of shots: up to 999 images Smart Effect: Brilliant Color, Unicolor Bold, Vintage Color, Cross Processing, Warm Fade, Tone Expansion, Bold Monochrome, Water Color, Vibrant Color Enhance, USER 1 to 3",
    "language": "English, French, German, Spanish, Portuguese, Italian, Dutch, Danish, Swedish, Finnish, Polish, Czech, Hungarian, Turkish, Greek, Russian, Korean, Traditional Chinese, Simplified Chinese, and Japanese",
    "exposurecompensation": "-2.0 to + 1.0 EV",
    "mount": "PENTAX bayonet Q-mount Compatible Lens: Q-mount lenses",
    "cameratype": "Lens-interchangeable SL digital-still camera",
    "exposuremodes": "Auto Picture mode: Standard, Portrait, Landscape, Macro, Night Scene Portrait, Night Scene, Blue Sky, Forest Scene Mode: Portrait, Landscape, Macro, Moving Object, Night Scene Portrait, Sunset, Blue Sky, Forest, Night Scene, Night Scene HDR*, Night Snap, HDR*, Quick Macro*, Food, Pet, Kids, Surf&Snow, Backlight Silhouette, Candlelight, Stage Lighting, Museum Program Auto Exposure, Shutter Priority, Aperture Priority, Manual Exposure, Bulb, Blur Control* * JPEG Only Aperture: From wide open to F8  *Not available when using a lens that has no lens shutter ND Filter: Off/On  *Not available when using a lens that has no lens shutter.",
    "fileformat": "RAW (DNG), JPEG (Exif 2.3), DCF2.0 compliant",
    "recording": "File Format: MPEG–4 AVC/H.264 Recorded Pixels: FullHD(1920x1080,16:9,30fps/25fps/24fps), HD(1280x720,16:9,30fps/25fps/24fps), VGA(640x480,4:3,30fps/25fps/24fps) Sound: Built-in monaural microphone Recording Time: Up to 25 minutes; automatically stops recording if the internal temperature of the camera becomes high. Custom Image: Bright, Natural, Portrait, Landscape, Vibrant, Radiant, Muted, Bleach Bypass, Reversal Film, Monochrome, Cross Processing Digital Filter: Toy Camera, High Contrast, Shading, Tone Expansion,  Invert Color, Extract Color, Unicolor Bold,  Water Color, Posterization, Slim, Fish-eye Interval Movie: Recording interval: 3 sec., 5 sec., 10 sec., 30 sec., 1 min., 5 min., 10 min., 30 min., 1 hr., Recording time: 12 sec. to 99 hr. Start Interval setting: immediately, from the set time",
    "guidenumber": "Guide number: approx. 4.9 (ISO100/m) / approx. 7 (ISO200/m)",
    "depth": "33.5mm",
    "source": "Battery Type: Rechargeable Lithium-ion Battery D-LI68 AC Adapter: AC Adapter Kit K-AC115 (optional)",
    "resolution": "460k dots",
    "options": "Playback View: Single frame, multi-image display (4, 9, 30, 56 segmentation), display magnification (up to 16x, scrolling and quick magnification available), rotating, histogram (Y histogram, RGB histogram), bright area warning, detailed inf, folder display, Date display, Slideshow Delete: Delete single image, delete all images, select & delete, delete folder, delete instant review image RAW Development: File Format (JPEG), Aspect Ratio, Color Space, Custom Image, White Balance, Sensitivity, High-ISO NR, Shadow Correction, Distortion Correction Edit: Resize, Cropping (aspect ratio adjustment available), Index, Movie Editing (divide or delete selected frames), Capturing a JPEG still picture from a movie, Red-eye Edit, Saving buffer as a RAW file"
}