{
    "exposuremetering": "Multi, Spot, TTL 256-zones 2 Please Note: Also: Average close",
    "externalflashconnection": "Hot Shoe",
    "acpoweradapter": "AC-5VX (Optional)",
    "weight": "12.3 oz / 349 g",
    "battery": "NP-50 Rechargeable Lithium-Ion Battery Pack",
    "batterydescription": "NP-50",
    "isosensitivity": "100-12800",
    "memorycardtype": "SD SDHC SDXC",
    "additionalfeatures": "Not Interchangeable Lenses, USB 2.0",
    "opticalzoom": "4x",
    "imagestabilization": "Optical",
    "viewfindercoverage": "85%",
    "category": "camera",
    "videorecording": "Yes",
    "lightsensitivitymax": "100",
    "operatingstoragetemperature": "32 to 104°F (0 to 40°C)Humidity: 10 - 80%",
    "brand": "Fujifilm",
    "pixels": "12 Megapixel",
    "selftimer": "10 Seconds, 2 Seconds",
    "dimensionswxhxd": "4.6 x 2.7 x 2.2\" / 11.7 x 6.9 x 5.6 cm",
    "otherresolutions": "10.7MP: 4000 x 2664 @ 3:2 9.0MP: 4000 x 2248 @ 16:9 9.0MP: 2992 x 2992 @ 1:1 5.9MP: 2816 x 2112 @ 4:3 5.2MP: 2816 x 1864 @ 3:2 4.5MP: 2816 x 1584 @ 16:9 4.5MP: 2112 x 2112 @ 1:1 3.1MP: 2048 x 1536 @ 4:3 2.8MP: 2048 x 1360 @ 3:2 2.1MP: 1920 x 1080 @ 16:9 2.4MP: 1536 x 1536 @ 1:1",
    "sensor": "2/3\" CMOS",
    "audiorecording": "With Video",
    "whitebalancemodes": "Auto, Fluorescent (Day White), Fluorescent (Natural White), Fluorescent (White), Incandescent, Manual, Shade, Underwater 3 Please Note: Also: Color temperature and Fine close",
    "mpn": "FujifilmX10Black",
    "screen": "2.8\" LCD Rear Screen",
    "leftbardescstart": "16190089 Browse Our Store Store                                                                                                                         home Point & Shoot Cameras Pro. SLR Cameras Digital Camera Lenses Camcorders Projectors GPS Navigation Home audio Blu-ray / DVD PlayersLeft Bar Desc //End !Right Bar Desc //Start !Fujifilm X series X10 12.0 MP Digital Camera - Black New, Open Box 12Mp Resolution 2.8\" LCD Screen 28-112mm Telephoto Manual Zoom Lens 4x Manual Optical Zoom Die-Cast Magnesium Alloy Upper Control Deck w/ Mode Dials 1080p HD Movie Recording RAW Shooting & In-Camera Processing Manual Pop-Up Flash Manual Shooting Modes: P/A/S/M Fujifilm X series X10 12.0 MP Digi ... SPECIFICATIONS Imaging Pixels 12 Megapixel Sensor 2/3\" CMOS File Formats Still Images: JPEG, RAW Movies: MPEG-4 AVC/H.264, MOV Audio: IMA-ADPCM (Stereo) 1 Please Note: Exif Ver 2.3 close Max Resolution 12MP: 4000 x 3000 @ 4:3 Other Resolutions 10.7MP: 4000 x 2664 @ 3:2 9.0MP: 4000 x 2248 @ 16:9 9.0MP: 2992 x 2992 @ 1:1 5.9MP: 2816 x 2112 @ 4:3 5.2MP: 2816 x 1864 @ 3:2 4.5MP: 2816 x 1584 @ 16:9 4.5MP: 2112 x 2112 @ 1:1 3.1MP: 2048 x 1536 @ 4:3 2.8MP: 2048 x 1360 @ 3:2 2.1MP: 1920 x 1080 @ 16:9 2.4MP: 1536 x 1536 @ 1:1 Aspect Ratio 3:2, 4:3, 16:9 Image Stabilization Optical Optics Lens 11 elements in 9 groups3 Aspheric(35 mm equivalent: 28-112 mm)Aperture: f/2.0 (W) - 2.8 (T) Zoom Optical: 4x Focus Range Normal: 1.6' (48.77 cm) - 2.6' (79.25 cm) Macro: 0.3' (9.14 cm) - 9.8' (298.70 cm) Super-Macro: 0.4\" (1.02 cm) - 3.3' (1.01 m) Exposure Control ISO Sensitivity 100-12800 Shutter 30 - 1/4000 seconds Exposure Metering Multi, Spot, TTL 256-zones 2 Please Note: Also: Average close Exposure Modes Modes: Aperture Priority, Manual, Program, Shutter PriorityCompensation: -2 EV to +2 EV (in 1/3 EV steps) White Balance Modes Auto, Fluorescent (Day White), Fluorescent (Natural White), Fluorescent (White), Incandescent, Manual, Shade, Underwater 3 Please Note: Also: Color temperature and Fine close Self Timer 10 Seconds, 2 Seconds Flash Flash Modes Auto Built-in Flash Yes Effective Flash Range Wide: 0.9 - 22.9' (0.27 - 6.98 m) Telephoto: 1.6 - 16.4' (0.49 - 5.00 m) External Flash Connection Hot Shoe Memory Memory Card Type SD SDHC SDXC Recording Video Recording Yes Video Audio Recording With Video Viewfinder/Display Viewfinder Type Optical Viewfinder Coverage 85% Screen 2.8\" LCD Rear Screen Connectivity/System Requirements Connectivity 1x HDMI C (Mini), USB 2.0 Environmental Operating/Storage Temperature 32 to 104°F (0 to 40°C)Humidity: 10 - 80% Power Battery NP-50 Rechargeable Lithium-Ion Battery Pack AC Power Adapter AC-5VX (Optional) Physical Dimensions (WxHxD) 4.6 x 2.7 x 2.2\" / 11.7 x 6.9 x 5.6 cm Weight 12.3 oz / 349 g Back to Top FJFPX10OB TERMS AND CONDITIONS We usually ship within 1 business day after receiving payment. Please be aware                                                                                                                                         that weekends are not business days. All express methods of shipment still may require 1 day of processing time. Canadians and international buyers are responsible for all duties, customs                                                                                                                                         charges, and/or brokerage fees. We cannot ship as a gift, or claim as lower value. New Jersey buyers are responsible for applicable sales tax. We ship everything professionally in our state of the art warehouse. All products we sell are brand new and includes warranty coverage unless clearly                                                                                                                                         specified on the listing. \"Free Shipping\" applies to orders shipped within the continental                                                                                                                                         US. Domestic orders ship FedEx, UPS, and USPS. Our packages are insured and may require a signature. In accordance with PayPal                                                                                                                                         and eBay policies, we cannot reroute your package to a different address or hold                                                                                                                                         your shipment at the local hub for pick up, your order must be delivered to the                                                                                                                                         confirmed PayPal address received with your purchase. We cannot change your address                                                                                                                                         before the order ships. Please do not submit handling instructions in the notes                                                                                                                                         of your order requesting special handling, a specific courier or a change of address,                                                                                                                                         as we will be unable to meet these requests. We reserve the right to cancel any orders addressed to P.O. boxes, freight                                                                                                                                         forwarders, or resellers. We do not offer price protection if the price of an item                                                                                                                                         that you purchased. Prices do change frequently. We reserve the right to cancel orders placed without a registered eBay or                                                                                                                                         PayPal account. Orders placed by eBay guest checkout require additional verification                                                                                                                                         and may be delayed. Orders placed without a registered PayPal account cannot be                                                                                                                                         accepted and will be cancelled and refunded upon receipt. We offer a customer 30 day return privilege policy. A Return Merchandise Authorization                                                                                                                                             (RMA) number must be obtained for any return. To obtain an RMA number, please call                                                                                                                                             us toll free at 866-673-7187 . Returned packages without proper RMA demarcations will be refused by our warehouse                                                                                                                                             and returned to you. Customers who refuse a delivery, will be subject to charges                                                                                                                                             for return shipping to us. If the item was advertised as Free Shipping, then we                                                                                                                                             will charge the amount of shipping as determined by the FedEx shipping calculator. Some returns are subject to a restocking fee. The restocking percentage will depend                                                                                                                                             on the condition of the returned product. Defective products are eligible for exchange,                                                                                                                                             and no restock fee will apply. All returns must be packed with all contents which came with the original package                                                                                                                                             including, cables, software, plastic and cardboard packaging, and unregistered warranty                                                                                                                                             card. This return policy excludes Televisions and Home Theater Projectors. For further                                                                                                                                             questions please call us toll free at 866-673-7187 . You can also                                                                                                                                             contact us using the contact form found here . Return shipping costs are not reimbursable. International Customers: All electronic products are packaged for sale in the US with US Voltage. View International Policies Back to Top CONTACT INFO AND STORE HOURS ANY QUESTIONS? CALL US TOLL FREE: +1-866-673-7187 STORE HOURS: Monday - Friday 10:00AM to 3:00PM EST Email us anytime! Back to TopRight Bar Desc //End !",
    "lens": "11 elements in 9 groups3 Aspheric(35 mm equivalent: 28-112 mm)Aperture: f/2.0 (W) - 2.8 (T)",
    "connectivity": "1x HDMI C (Mini), USB 2.0",
    "focusrange": "Normal: 1.6' (48.77 cm) - 2.6' (79.25 cm) Macro: 0.3' (9.14 cm) - 9.8' (298.70 cm) Super-Macro: 0.4\" (1.02 cm) - 3.3' (1.01 m)",
    "maxresolution": "12MP: 4000 x 3000 @ 4:3",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "aspectratio": "3:2, 4:3, 16:9",
    "fileformats": "Still Images: JPEG, RAW Movies: MPEG-4 AVC/H.264, MOV Audio: IMA-ADPCM (Stereo) 1 Please Note: Exif Ver 2.3 close",
    "integratedmemorysize": "26 MB",
    "focusadjustment": "Autofocus & Manual Focus",
    "displaytype": "LCD",
    "flashmodes": "Auto",
    "builtinflash": "Yes",
    "cameratype": "Point & Shoot",
    "exposuremodes": "Modes: Aperture Priority, Manual, Program, Shutter PriorityCompensation: -2 EV to +2 EV (in 1/3 EV steps)",
    "zoom": "Optical: 4x",
    "displaysize": "2.8\"",
    "shutter": "30 - 1/4000 seconds",
    "digitalzoom": "2x",
    "sensorresolution": "12.0 MP",
    "viewfindertype": "Optical",
    "effectiveflashrange": "Wide: 0.9 - 22.9' (0.27 - 6.98 m) Telephoto: 1.6 - 16.4' (0.49 - 5.00 m)",
    "sensortype": "CMOS",
    "supportedflashmemory": "SD Card, SD Memory Card, SDHC Card, SDHC Memory Card, SDXC Card, SDXC Memory Card",
    "model": "X10",
    "screensize": "2.8\""
}