{
    "weight": "6.1 Oz.",
    "creativefilters": "This setting provides easy access to special filter effects and scene modes, such as Toy Camera Effect, Poster Effect, Monochrome and more.",
    "highdynamicrange": "The camera combines three different exposures to get one evenly lit image.",
    "height": "2.34 in.",
    "displaytype": "LCD",
    "opticalzoom": "5x",
    "portrait": "The camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject â\u0080\u009cpop.â\u0080\u009d",
    "aperturepriority": "You set the aperture, controlling depth-of-field. The camera automatically selects the shutter speed.",
    "monochrome": "Choose from three single-tone effects: Black-and-White, Sepia, or Blue.",
    "nostalgic": "Create the look and feel of old photographs using sepia tones and black-and-white.",
    "landscape": "Increases depth-of-field for sharp and sweeping landscape shots.",
    "maxvideoresolution": "1920 x 1080",
    "category": "camera",
    "underwater": "Capture underwater images with reduced backscatter effect. Optional Underwater Case required .",
    "smartshutter": "The camera automatically takes the photo when people smile, wink, or get into frame.",
    "postereffect": "Poster Effect combines several similar shades into one color, turning subtle gradations into eye-catching, scene-popping contrasts.",
    "movie": "The camera takes five photos in succession, and then chooses the best one out of the bunch.",
    "snow": "Shoot clear snow scenes without darkened subjects or an unnatural bluish tint.",
    "custom": "Define and store your own settings to achieve the effects you prefer.",
    "highspeedbursthq": "Capture fast-action shots at full sensor resolution, by shooting continuously when the shutter button is held down.",
    "width": "3.9 in.",
    "program": "Access advanced exposure compensation features while shooting mostly automatically.",
    "beach": "Beach Get clear shots of people at a sunny beach without darkened faces.",
    "handheldnightscene": "Take clear and steady pictures at night without the use of a tripod.",
    "fisheyeeffect": "Add a classic photo distortion without a fisheye lens.",
    "mpn": "5244B001",
    "brand": "Canon",
    "fireworks": "Grab brilliant images of skyrocketing fireworks.",
    "smartauto": "The camera automatically selects the best shooting settings for optimal quality based on subjects and environmental factors to provide point-and-shoot simplicity.",
    "depth": "1.05 in.",
    "screensize": "3\"",
    "iframemovie": "The AppleÂ® movie format, iFrame, makes it easier and quicker to import and upload videos while retaining high image quality.",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "toycameraeffect": "Simulates photos taken with \"toy\" or pinhole cameras, darkening the image at the edges to create a vignette effect.",
    "cameratype": "Point & Shoot",
    "supervivid": "Super Vivid intensifies existing hues, saturating the scene with bright colors.",
    "manual": "You have complete control of exposure, selecting both aperture and shutter speed manually.",
    "upc": "013803137569, 018208924103, 8714574575605",
    "displaysize": "3\"",
    "superslowmotionmovie": "Record your clips in high speed (approx. 240 fps), and then watch your videos in slow motion.",
    "digitalzoom": "4x",
    "sensorresolution": "12.1 MP",
    "supportedflashmemory": "Eye-Fi card, SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "model": "S100",
    "shutterpriority": "You select the shutter speed to stop or blur action, and the camera finds the appropriate aperture. With slow exposure times, Canon's noise reduction system activates to ensure low image noise."
}