{
    "attr": "Please call or email us with any additional information that you feel may assist us in the processing of your order.",
    "weight": "10.7 oz. (303g)",
    "itemincludesprecisiondesign8sd2microsdmemorycardcasewith1yearprecisiondesignusawarranty": "Precision Design Memory Card Case Secure your memory cards and protect your digital photos. The Precision Design Memory Card Case provides protection and durability where it counts, and keeps up to 8 SecureDigital (SD) cards safe from impacts, moisture and other hazards. This tough plastic case also includes two microSD card holders (shaped like standard SD cards) that can be used to securely store these especially small memory cards.",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "effectivepixels": "10.0 megapixels",
    "powersource": "Rechargeable Li-ion Battery",
    "itemincludesfreeprintsfromyorkphotowith": "50 FREE PRINTS from York Photo Superb archival quality prints that won't fade over time York Photo is your best resource for turning great photos into lasting memories! As part of this kit, we will give you 50 4x6 digital prints , FREE when you register online as a new York Photo customer. York Photo will send you an email with a unique link to create your free account and take advantage of this special offer. Click Here for Offer Details and Additional Information Membership is free at York Photo. As a leading online provider of digital prints, books, calendars, and photo gifts, York makes superior quality products at everyday low prices. Upload your digital photos and start exploring everything that online photography has to offer! York makes it incredibly easy for you to get great prints and more. On future orders , York offers 4x6 digital prints for as low as 9Â¢ each and sends you special discounts and promotions. Plus, you can share and edit your pictures for free. York Photo... developing smiles for more than 50 years!",
    "imagesizes": "3648 x 2736 (10M)",
    "category": "camera",
    "attr8009913350": "(631) 389-2138",
    "videorecording": "Yes, built-in microphone (mono) for sound and speaker for playback",
    "paybyphoneorebaysecureonlinecheckoutorforyourconveniencewecanprocessallpaymentsincludingpaypaloverthephone": "Click here for Frequently Asked Questions ● We automatically notify the winner by email (to the address that you have registered with eBay) immediately after listing ends. ● If you have not received an email, or you are having problems emailing us, please call us to process your order. Check your junk mail filters for any missing or misdirected email. ● All shipping methods will appear as an option in checkout or over the phone. ● We supply a sales receipt with all orders. ● Manufacturer mail-in rebate forms will be provided (if applicable: rebate info will be stated in the listing). Rebate offers are valid only to orders shipped to a USA address. ● Auction/BIN price already reflects any point of sale instant rebates, if applicable. ● When your package has shipped, you will be notified by email with the tracking number. ● We leave positive feedback for all eBay customers after the order has been shipped. ● Please include your eBay item number and shipping address with all correspondence. ● Please call or email us with any additional information that you feel may assist us in the processing of your order.Cameta Camera offers fast and friendly customer service. If you have any questions, please contact us by email or phone (see hours below), and we will do our best to address any concerns as quickly as possible. Email: Ask Seller a Question Phone: Toll Free USA Local / International (800) 991-3350 (631) 389-2138 Hours: Click here for operating hours",
    "flash": "Built-in",
    "storage": "Internal memory SD / SDHC memory card up to 32GB",
    "digitalzoom": "6x",
    "attr1": "Polaroid Z2300 10MP Digital Instant Print Camera (Black)",
    "attr3": "Polaroid 2x3\" Instant Film / ZINK Paper for Z2300 Camera (30 Color Prints)",
    "itemincludesprecisiondesignuniversallcdscreenprotectorswith3lcdprotectorssqueegeecard5yearprecisiondesignusawarranty": "Precision Design Universal LCD Screen Protectors Keep your LCD screen clean and protected from scratches. This package contains 3 Universal LCD Screen Protectors that can be easily cut to size, attached and removed. Each piece protects your LCD screen from scratches and wear, and reduces glare for enhanced viewing. A squeegee card is also included to make application even easier, and to reduce air bubbles. These screen protectors can be used on a variety of electronic devices including digital cameras, camcorders, cell phones, handheld video games, and more. Key Features: Prevents scratches and wear Reduces glare Helps to maintain LCD and product warranty Can be trimmed to fit any size LCD screen (up to 5 inches diagonally)",
    "attr5": "Precision Design 50\" PD-50PVTR Compact Travel Tripod",
    "attr4": "Transcend 16GB SecureDigital Class 4 (SDHC) Card",
    "attr7": "Precision Design 8 SD / 2 MicroSD Memory Card Case",
    "attr6": "Precision Design 5-Piece Camera & Lens Cleaning Kit",
    "attr9": "Precision Design Universal LCD Screen Protectors",
    "monitortype": "LCD display (Live view)",
    "type": "Point & Shoot (self-print)",
    "email": "Ask Seller a Question",
    "dimensionswxhxd": "4.6 x 3 x 1.4 in. (11.7 x 7.6 x 3.6 cm)",
    "shippingpricecoversallshippinginsuranceandhandlingchargesimportdutiestaxeschargesarenotincludedinitempriceorshippingpricethesearethebuyersresponsibilitywecannotmarkanypackageasagiftallinternationalpackagesaremarkedebaypurchaseontheinsuranceform": "For a list of eligible countries, and current shipping rates and methods, please click eBay's \"Shipping and payments\" tab near the top of this listing.",
    "monitorsize": "3.0 in. diagonal",
    "attr3276photos10mpjpg": "240 minutes of video (9Mbps)4,000 songs (4MB MP3)",
    "pricecoversallshippinginsuranceandhandlingchargesnewyorkstaterequiresthatwecollectsalestaxonordersshippedwithinnystateallshippingoptionscanbechosenatcheckouttime": "$9.95 $25.64 $40.10",
    "hours": "Click here for operating hours",
    "phone": "Toll Free USALocal / International",
    "attr8": "ImageRecall Digital Image Recovery Software",
    "itemincludesimagerecalldigitalimagerecoverysoftwarewith1yearflashfixersusawarranty": "DigitalImage Recovery Software Recover deleted or corrupted images from your memory cards! ImageRecall is the ultimate quick and easy to use image recovery software. With this easy-to-use program, you can recover deleted or corrupt picture and video files from all types of Memory Cards and USB drives. Users can also scan memory cards for damage, make backups, securely erase cards, and burn recovered files to CD or DVD. Key Features: Easy to use -- just install the software, insert your memory card, and follow the instructions Recovers all popular file formats including RAW & JPG Works with ALL brands and types of memory cards",
    "interface": "Hi-speed USB",
    "attr2": "Polaroid Neoprene Case for Z2300 Instant Camera",
    "attr11": "Free Prints from York Photo",
    "attr10": "1-Year Subscription to Outdoor Photography Magazine Voucher Card (Mail in to activate)",
    "focusadjustment": "Focus free",
    "itemincludes1yearsubscriptiontooutdoorphotographymagazinevouchercardmailintoactivatewith": "1-Year Subscription to Outdoor Photography Magazine Your #1 Guide for Better Outdoor Photography is the premier magazine about outdoor photography. A one-year subscription is included as part of your purchase... that's Outdoor Photographer 11 issues packed with valuable tips, tricks and news about nature photography, conveniently delivered to your door! A prepaid Subscription Voucher Card will be included with your order, which will activate your subscription when mailed to Outdoor Photography. The first of your eleven issues will then be sent to your address (USA and Canadian addresses only) in about 10 weeks. One subscription per household. Outdoor Photography's technique articles are geared to helping you capture the best wildlife, travel and outdoor sports photography. Review photography tips and keep up with digital photography as applied to nature photography, and stay current with the latest in photography equipment. You can also explore readers' favorite places that offer the best in photography locations.",
    "itemincludesprecisiondesign5piececameralenscleaningkitwithlenscleaningtissuelensclothlenscleaningliquidblowerbrushcottonswabs1yearprecisiondesignusawarranty": "Precision Design 5-Piece Lens Cleaning Kit Essential items for the proper maintenance of your equipment It's obvious that the cleaner the lens, the sharper your pictures will be. Dirt, dust, and fingerprints will degrade the image quality of even the finest optics. However, it's equally important to avoid using incorrect cleaning materials which can permanently damage your photo equipment. This 5-piece cleaning kit contains everything you'll ever need to properly clean your lenses , including a bottle of cleaning solution, lens tissues, cotton swabs, a blower brush, and a microfiber cloth.",
    "opticalzoom": "n/a",
    "itemincludesprecisiondesign50pd50pvtrcompacttraveltripodwithcarryingcase1yearprecisiondesignusawarranty": "Precision Design 50\" PD-50PVTR Compact Travel Tripod Get increased performance and extraordinarily sharp pictures Lightweight and sturdy, this 50-inch Compact Digital Travel Tripod is ideal for keeping your camera steady in nearly any location, allowing you to capture crisp, clear, steady images with ease. With the use of a tripod, you can freely shoot at slow shutter speeds and extreme telephoto settings, and you can compose shots with precise control for perfect portraits and group pictures. Key Features: Extends to 50 inches tall, fold down to 17 inches 2.5 pound load capacity, weighs just over one pound 4-Section Aluminum Legs with Quick-Release leg locks and Non-Slip feet Quick-Release Photo/Video Platform 3-Way, 360-Degree Swivel Panhead Adjustable Tilt and Pan Controls Gearless Center Column Bubble Level Indicator Includes Nylon Carrying Case with Shoulder Strap"
}