{
    "externalflashconnection": "Hot Shoe, PC Terminal",
    "shutterlag": "0.075 Seconds Please Note: between SW-2 ON and exposure start; 0.15 sec between simultaneous SW-1/SW-2 ON and exposure start close",
    "acpoweradapter": "ACK-E8 (Optional)",
    "weight": "1.14 lb / 0.52 kg",
    "maxsyncspeed": "1 / 200 sec",
    "battery": "1x  LP-E8  Rechargeable Lithium-Ion Battery Pack, 7.2VDC, 1120mAh",
    "isosensitivity": "Auto, 100-12800 (High Sensitivity Mode: 100-25600) Please Note: Auto: ISO 100-6400 close",
    "noisereduction": "Yes",
    "focallengthrange": "18mm - 55mm",
    "analogvideoformat": "NTSC, PAL",
    "memorycardtype": "SD SDHC SDXC",
    "leftbardescstart": "Left Bar Desc //End !Right Bar Desc //Start !Canon Rebel T4i 650D +18-55+ 3 Lens Kit + 48GB +Flash + Battery + Case, NEW USA Click an Image to Enlarge This item is 100% brand new. USA product sealed in original box & includes full USA warranty. 58MM Professional HD 2x telephoto lens  With Free Carry Case 58mm 45x Wide-Angle Digital High Definition Lens w/ Macro 3 Piece Multi Coated Quailty Filter Kit 32 GB Secure Digital (SD) Memory Card 16 GB Secure Digital (SD) Memory Card High Speed USB 2.0 All-in-One card reade Extra Battery Extra Charger Deluxe Soft Medium SLR Camera Case / Bag fit Canon EOS, Nikon, Sony Alpha Camera Multi Memory Card Wallet Digital Auto Slave Flash with Bracket Full Size 50-inch Tripod With Leveler 360 adjust & Carryng Case for SLR Cameras Mini Flexible Taple Top Travel Tripod  with Pocket clip Lens Cap Keeper Deluxe Screen Protector Pro Pack (Clear ) Deluxe Camera , Screen & Lens 5pc cleaning Kit Canon EOS Rebel T4i Digital SLR Camera Overview Canon is proud to introduce its most sophisticated Rebel everâ\u0080\u0094the EOS Rebel T4i DSLR! Built to make advanced photography simple and fun, the new Rebel T4i delivers phenomenal image quality, high performance, and fast, intuitive operation. This EOS Rebel amps up the speed with the powerful DIGIC 5 Image Processor that helps make high-speed continuous shooting of up to 5.0 fps possibleâ\u0080\u0094great for capturing fast action. An 18.0 Megapixel CMOS sensor ensures that every image is shot in superb, high resolution; and an extended ISO range of 100-12800 gives photographers the opportunities to take the Rebel T4i into more shooting situations than ever before. A 9-point all cross-type AF system (including a high-precision dual cross f/2.8 center point) delivers improved autofocus performance, and a new Hybrid CMOS AF System increases autofocus speed when shooting photos and video in Live View. For users interested in creating impressive videos, the Rebel T4i is ready to help you create your next masterpiece. Movie Servo AF provides continuous focus of moving subjects, so you never miss a moment. A built-in stereo microphone and manual audio level adjustment helps ensure that your audio will match the stunning quality of your video. First ever for an EOS Rebel, the Rebel T4i features a Vari-angle Touch Screen 3.0-inch Clear View LCD monitor II, which allows fast and intuitive camera operation. Add compatibility with Canon's proven EF and EF-S lenses and a slew of EOS accessories, the Rebel T4i is an incredibly versatile tool for creating the images and videos you envision. 18.0 Megapixel CMOS (APS-C) sensor. The EOS Rebel T4i features Canon's amazing 18.0 Megapixel CMOS (Complementary Metal Oxide Semiconductor) sensor. Perfect for enlargements or for cropping detailed portions of the composition, the EOS Rebel T4i's sensor captures images with exceptional clarity and tonal range. This first-class sensor features many of the same new technologies used by professional Canon cameras to maximize each pixel's light-gathering efficiency and has center pixels that aid in the EOS Rebel T4i's accurate AF performance. This APS-C size sensor creates an effective 1.6x field of view (compared to 35mm format). DIGIC 5 Image Processor The Rebel T4i is the first Rebel to feature Canon's DIGIC 5 Image Processor. The DIGIC 5 Image Processor works with the camera's CMOS sensor to deliver images with incredible detail in more situations, without the need for artificial light sources. With the power of the DIGIC 5 Image Processor the Rebel T4i can achieve higher ISO sensitivity, can shoot up to 5.0 fps continuously and can even perform advanced functions like HDR Backlight Control, art filters, lens correction and much more. The brilliant \"brain\" of the camera, this imaging engine supercharges every facet of still and moving image capture. Improved autofocus performance and new Hybrid CMOS AF. The EOS Rebel T4i is equipped with AF features that ensure speedy, accurate and continuous AF every time. When shooting through the viewfinder, the EOS Rebel T4i has improved autofocus with a new 9-point, all cross-type AF system (including high-precision dual-cross f/2.8 center point) for accurate focus whether the camera is oriented in portrait or landscape position. A new AI Servo AF system achieves and maintains consistent focus with an exceptional degree of reliability. Enhanced EOS Full HD Movie Mode with Movie Servo AF. The EOS Rebel T4i offers easy to use, professional video capture without compromise. Capable of shooting in a number of recording sizes and frame rates the Rebel T4i sets a whole new standard for performance, quality and simplicity. The Rebel T4i enables easy manual control of exposure, focus and Live View features, even in-camera editing! New Movie Servo AF allows continuous autofocus tracking of moving subjects while recording video. When shooting video with one of Canon's new STM lenses, Movie Servo AF takes advantage of the lens' stepping motor for smooth and quiet continuous AF. With an STM lens attached, the EOS Rebel T4i sets a new standard for SLR moviemaking performance! Video Snapshot. With the Video Snapshot feature, the EOS Rebel T4i DSLR can capture short video clips (of 2, 4 or 8 seconds) then combine them automatically into one video file as a snapshot or highlights \"album.\" With no editing needed after shooting, the compiled video is perfect for sharing online or displaying directly on an HDTV via the camera's HDMI port. Additionally, stills can be recorded during video shooting simply by pressing the camera's shutter button. During playback, video clips in an album can now be reordered or deleted. New Vari-angle Touch Screen 3.0-inch Clear View LCD monitor II with multi-touch operation and Touch AF. The EOS Rebel T4i comes with a newly engineered, Vari-angle Touch Screen 3.0-inch Clear View LCD monitor II. Using the same capacitive technology as today's popular mobile devices, this new screen is touch-sensitive and delivers intuitive touch panel operation. Two finger touch gestures (multi-touch) can be used for zooming or changing images, menu and quick control settings can be accessed, and focus point and shutter release can be activated with the touch of a fingertip. Displaying fine detail (at approximately 1.04 million dots), this screen is perfect for composing and reviewing images. Thanks to a new, solid construction between the monitor's resin-coated cover and the liquid crystal display, reflections are minimized, and the display can be viewed, without glare, from any number of angles. The LCD's surface is treated with a smudge-resistant coating to minimize fingerprints and maintain a bright, clear image display. HDR Backlight Control mode. The EOS Rebel T4i's HDR Backlight Control mode ensures that backlit subjects are not recorded too dark. By shooting three consecutive shots at different exposures (underexposed, correctly exposed and overexposed) and then combining the images, the final result maintains detail in both the shadow and highlight areas, ensuring the backlit subject is properly exposed. Multi Shot Noise Reduction. To enhance its already admirable high ISO shooting capabilities, the EOS Rebel T4i features an intelligent Multi Shot Noise Reduction tool that reduces noise even further than the camera's sensor and the DIGIC 5 Image Processor alone. With Multi Shot Noise Reduction activated, the camera takes four consecutive shots, merges and aligns them. This eliminates more noise than the Rebel's traditional Noise Reduction filter, with little or no apparent resolution loss. Moving subjects are even optimized to minimize subject blur! Thanks to this clever new feature, high ISO shooting has never looked better. Flexible and Reliable Recording.. Compatibility with SD/SDHC/SDXC memory cards, including new Ultra High Speed cards : The EOS Rebel T4i uses popular SD, SDHC, SDXC and is even compatible with the newest Ultra High Speed (UHS-I) memory cards. Compact and available in large capacities, SD, SDHC and SDXC memory cards are a perfect complement to the EOS Rebel T4i's compact design. Additionally, the EOS Rebel T4i is compatible with Eye-Fiâ\u0088\u0097 SD cards, which are outfitted with a Wi-FiÂ® transmitter (IEEE 802.11b/g) and an internal antenna for wireless, high-speed transfer of images. With an Eye-Fi card installed, the EOS Rebel T4i can display the Eye-Fi's connection status and error notes with ease, for fully functional wireless uploading of images directly from the camera. Shooting Made Easy. EF & EF-S Lenses The EOS Rebel T4i is compatible with all Canon lenses in the EF lineup, including compact and lightweight EF-S lenses, ranging from ultra-wide angle to super telephoto lenses and including the new STM series optimized for video shooting. Canon lenses employ advanced optical expertise and micron-precision engineering to deliver outstanding performance and deliver beautiful results. Special technologies like Canon's Image Stabilizer technology help to minimize the effect of camera shake, effectively adding up to four stops of light; STM lenses even feature a stepping motor for smooth and quiet continuous autofocus while capturing video. With an array of lenses perfect for travel, sports, still life and everything in between, photographers can truly maximize the quality and performance of their EOS Rebel T4i. Camera Type Digital SLR with Interchangeable lenses Lens Mount Canon EF Camera Format Canon APS-C (1.6x Crop Factor) Resolution Effective Pixels: 18.0 Megapixels Max Resolution: 17.9 MP: 5184 x 3456 Please Note: Total pixels: Approx. 18.50 MP Pixel unit: 4.3 Âµm square close Sensor Type / Size CMOS, 22.3 x 14.9 mm File Formats Still Images: JPEG, RAW Movies: MOV Audio: Linear PCM Please Note: RAW + JPEG simultaneous recording close Bit Depth 14-bit Noise Reduction Yes Memory Card Type SD SDHC SDXC AV Recording Video Recording Yes, NTSC/PAL Aspect Ratio 3:2, 16:9 Video Clip Length Up to 8GB or 22 Min Please Note: 1 hr 32 min 640x480 close Audio Recording With Video, Stereo Focus Control Focus Type Auto & Manual Please Note: Auto: TTL-CT-SIR AF-dedicated CMOS sensor Working Range: EV -0.5 - 18 (ISO 100) close Focus Mode Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M) Autofocus Points 9 Please Note: All Cross-Type at f/5.6; Center AF point diagonal cross-type at f/2.8 close Viewfinder/Display Viewfinder Type Pentamirror Please Note: Eye Point: 19 mm at -1m-1 from lens center Fixed focus screen Quick-return half mirror, reflection 40:60 close Viewfinder Coverage 95% Viewfinder Magnification Approx. 0.85x Diopter Adjustment - 3.0 to +1.0 m Display Screen 3.0\" Rear Touchscreen   LCD (1040000) 7 Please Note: Aspect ratio: 3:2 Viewing Angle: 170Â° (vertical / horizontal) Brightness control: Auto, manual close Screen Coverage 100% Live View Yes Exposure Control ISO Sensitivity Auto, 100-12800 (High Sensitivity Mode: 100-25600) Please Note: Auto: ISO 100-6400 close Shutter Type: Electronic & Mechanical Speed: 30 - 1/4000 sec Please Note: Bulb, X-sync at 1/200 sec 1/60-1/4000, Scene Intelligent Auto, X-sync at 1/200 sec Release: Electromagnetic close Remote Control RC-1, RC-5, or RC-6 (Optional) Please Note: 2-sec delay mode: Start or stop video shooting immediately close Metering Method Spot metering, Center-weighted average metering Please Note: Evaluative, partial (9% of viewfinder) EV 1.0 - EV 20.0 (EF50mm f/1.4 USM lens, ISO 100) close Exposure Modes Modes: AE Lock, Aperture Priority, Manual, Program, Programmed Auto, Shutter Priority Compensation: -5 EV to +5 EV (in 1/3 EV steps) Please Note: Or 1/2 EV steps -/+5 for manual; -/+2 for AEB; +/-3 in 1/3-stop increments for video close White Balance Modes Auto, Cloudy, Custom, Daylight, Flash, Fluorescent (White), Kelvin, Shade, Tungsten Please Note: Custom: Approx. 2,000 - 10,000 K Blue / amber, magenta / green bias: Â±9 levels close Flash Built-in Flash Yes: Auto, FE Lock, Off Please Note: Guide Number: Approx. 43' (13 m) at ISO 100 Up to 17 mm focal length Â±2 stops in 1/3- or 1/2-stop close Max Sync Speed 1 / 200 sec Continuous Shooting Up to 5.0 fps Please Note: 8GB card: Up to 22 shots (JPEG); 6 shots (RAW); 3 shots (RAW+JPEG) UHS-I: 30 shots (JPEG); 6 shots (RAW); 3 shots (RAW+JPEG) close Dedicated Flash System eTTL Please Note: FE lock Exposure compensation: Up to Â±2 stops in 1/3 or 1/2-stop increments close External Flash Connection Hot Shoe, PC Terminal Performance Shutter Lag 0.075 Seconds Please Note: between SW-2 ON and exposure start; 0.15 sec between simultaneous SW-1/SW-2 ON and exposure start close Self Timer 10 sec, 2 sec Connectivity AV Output, HDMI C (Mini), USB 2.0 Wi-Fi Capable (With Optional Transmitter) Yes Power Battery 1x  LP-E8  Rechargeable Lithium-Ion Battery Pack, 7.2VDC, 1120mAh AC Power Adapter ACK-E8 (Optional) Operating/Storage Temperature Operating 32 to 104 Â°F (0 to 40 Â°C) Humidity: 0 - 85% Physical Dimensions (WxHxD) 5.2 x 3.9 x 3.1\" / 13.21 x 9.91 x 7.87 cm Weight 1.14 lb / 0.52 kg Kit Lens Focal Length 18 - 55 mm Please Note: 29-88 mm 35 mm equivalent close Aperture Maximum: f/3.5 - 5.6 Minimum: f/22 - 38 Please Note: f/22-38 for models with 1/2-stop increments; f/22-36 for models with 1/3-stop increments close Angle of View 74.2Â° - 27.5Â° Please Note: Diagonal; Vertical is 45.3-15.4; Horizontal is 64.3-23.2 close Minimum Focus Distance 9.8\" (24.89 cm) Please Note: Focus adjustment: AF (DC motor), with manual focus option close Magnification 0.34x Groups/Elements 9/11 Autofocus Yes Image Stabilization Yes Filter Thread Front: 58 mm Please Note: P=0.75mm / 1 filter close Dimensions (DxL) Approx. 2.7 x 3.33\" (6.86 x 8.46 cm) Weight 7.1 oz (201 g) Canon EOS Rebel T4i Digital Camera with EF-S 18-55mm f/3.5-5.6 IS II Lens Eyecup Ef for Digital Rebel Cameras R-F-3 Camera Cover EW-100DB IV Wide Strap LC-E8E Battery Charger AC Cable LP-E8 Rechargeable Lithium-Ion Battery Pack (7.2V, 1120mAh) Battery Cover 1-Year U.S.A. Limited Warranty USB Interface Cable IFC-130U EOS Digital Solution Disk v.25.1 Camera Instruction Manual Software Instruction Manual CD 1-Year Limited Warranty Professional HD 2x telephoto lens When your camera can't get you close enough to capture the action in detail, this 2x Telephoto lens will bring the action to you! Optically multiplying the focal length of your camera's lens by a factor of 2, it more than doubles your telephoto magnification and detail without any pixelization. This is dramatically better than the \"Digital Zoom\" feature of many cameras where the magnification is obtained by merely enlarging the existing image, resulting in a loss of sharpness. This 2x telephoto attachment is perfect for all your long-distance imaging including sports, candids, surveillance, nature and wildlife. You will also be able to utilize your camera's macro capability at over twice the usual distance, allowing for easier subject lighting with less shadows and intrusion.. 45x Wide-Angle Digital High Definition Lens with Maro When you've run out of room, and can't possibly fit anything else into the frame, this 0.45x Wide Angle adapter will allow you to capture it all! This attachment more than doubles your camera's wide angle field-of-view . Scenic shots will be more panoramic and you'll be able to take outstanding group photos, even in tight places. In addition, the detachable Macro Lens enables you to photograph small objects up close. Great for jewelry, coins, stamps, flowers, and more. Even if your camera already has macro capability, this macro lens will get you even closer for truly amazing close-up photos. Professional High Definition Special Element Frame Premium Rimmed Glass Infrared Compatible Include Protective Lens Case Digital Multi Coated 58mm Glass Filter Kit (UV-CPL-FLD) 3pc Filter kit The UV filter protects your camera's lens from scratches, dust,  dirt, moisture and fingerprints, while removing unwanted ultraviolet  light.The UV filter reduces blue haze caused by UV light by absorbing  71% of UV. The CPL filter deepens and  intensifies blue skies, achieves vibrant colors and reduces glare and  reflections from non-metallic objects & glass surfaces. Great for  video. The Fluorescent Light Correction Filter gives  you the prefect solution for shooting without a flash under a  fluorescent light.This filter gives true-to-life colors and pleasing  skin tones by removing the harsh yellow-green cast created by flouriest  lightning. Lens filter set is a must-have for photographers 58mm filters improve photographs by giving photographers control over light and allowing them to emphasize certain features Filter kit features UV, CPL, and FLD filters Set comes with hard carrying case and filters UV Protector Filter protected the lens from damage 32 GB Secure Digital (SD) Memory Card Get The Best SD Card for your product When getting an SD memory card there are hundreds of options for your item this can get confusing and costly  , When purchasing one of our handpicked memory cards for your item you receive a  Memory card at the highest quality. We go to every extent to handpick cards to provide  you as a bonus with your purchase that are not only guaranteed to work with your item but have the best performance with your item. This is a Onetime purchase that will help you capture a memory for a lifetime. Our memory card offers are High performance cards that are made reliable with long life spans  created to handle real life motions and real time transfers. There will be  no delay time in transferring information from your device to this card. Get Quality at the top of its class with  SD memory. 16 GB Secure Digital (SD) Memory Card Get The Best SD Card for your product When getting an SD memory card there are hundreds of options for your item this can get confusing and costly  , When purchasing one of our handpicked memory cards for your item you receive a  Memory card at the highest quality. We go to every extent to handpick cards to provide  you as a bonus with your purchase that are not only guaranteed to work with your item but have the best performance with your item. This is a Onetime purchase that will help you capture a memory for a lifetime. Our memory card offers are High performance cards that are made reliable with long life spans  created to handle real life motions and real time transfers. There will be  no delay time in transferring information from your device to this card. Get Quality at the top of its class with  SD memory. High Speed USB  All  One Card Reader Access a multitude of memory cards with this USB 2.0 All-in-One card reader! This portable memory card reader supports the most popular memory cards such as Compact Flash I/II, Secure Digital, SD, Memory Stick, Micro Drive and Multimedia Card. Replacement For CANON LP-E8 Battery The LP-E8 Rechargeable Lithium-ion Battery Pack has a capacity of 1120mAh, making it possible to shoot many photographs with your Canon EOS Rebel T2i, T3i or T4i digital camera on a single battery charge. The battery is also compact and lightweight. There is no memory effect, so you can recharge partially drained batteries without reducing performance. Replacement for the original Canon LP-E8 battery pack Never run out of battery power when you're about to capture the perfect moment Output voltage: 7.2V Capacity: 1120mAh LP-E8 RECHARGEABLE BATTERY  CHARGER This LP-E8 Battery Charger for Canon EOS Rebel  is used to recharge your digital camera battery, it is quick charge with automatic constant current control, prevents battery from overcharging, short circuit, and electronic shock. The Battery Charger can used both for home, office and car.  A/C power supply input voltage: AC100V~240V NOTE: For a success and safe charge to your battery, please make         sure to line up the correct polarity (positive / negative) before         inserting the battery onto the charger This compact battery charger set for Canon LP-E8 is the complete charging solution for digital video batteries High quality battery charger is a handy companion for digital shooting Charger is designed with a foldable A/C plug that charges your camera / camcorder battery anywhere in the world Quick charge with automatic constant current control prevents battery from overcharging, short circuit, and electronic shock Smart LED indicator shows charging status Deluxe Medium Camera and Video Bag The Deluxe Medium Camera and Video Bag  is the perfect compliment to hold all of your equipment. It features a shock proof nylon material and is water resistant. It has 1 removable divider, rubber feet, shoulder strap and a handle grip. Easy access closure flap Mesh pockets for accessory storage compartment with interior   mesh pockets for spare batteries, flash-memory cards, diskettes,cords,   cables and more Shoulder strap/1 re moveable divider ,rubber feet, shoulder strap and a handle grip nylon material and is water resistant Dimensions: Size: 10.8 x 6.5 x 7.5 inches Multi Memory Card Wallet Donâ\u0080\u0099t lose your lifeâ\u0080\u0099s Memories Memory Cards are the Insert that holds your lifeâ\u0080\u0099s memoryâ\u0080\u0099s. A little card that easily lost but so important to you and your family. Always keep  your memory cards together at any cost. One lost card can lose decades of Memories. A memory card wallet is someplace for you to keep these memoryâ\u0080\u0099s together. Memory Card Wallet Keeps multiple memory cards protected and organized with this durable storage wallet. Sturdy memory card wallet case holds memory cards of any type securely, keeping them from contact with other accessories and makes them easily accessible in larger luggage bags. Features Memory Card Wallet Holds up to Multi  memory Cards (SD,CF,MS) 1 Year Limited Warranty Pro Digital Auto Slave Flash with Bracket for All SLR/DSLR Digital Camera & Camcorders Every photographer knows that a quality flash unit is an essential component to taking great pictures. Built-in flashes simply don't have enough power to properly illuminate most subjects, and typically produce harsh shadows, red-eye, and other undesirable effects. An external flash offers far more power and versatility , resulting in consistently better pictures! The Flash is a high-power flash unit that works seamlessly with a wide variety of camera models and provides exceptional light coverage , at a price that doesn't break the bank! The Flash features automatic exposure control , which syncs with your camera to provide just the right amount of light. The zoom function allows you to light subjects as far away as 50 feet , and the bounce head tilts and swivels to give you full creative control. Full Size 50-inch Tripod With Leveler  360 adjust & Case Want to relax and take time shooting ?  Not worry about your shots being leveled ?  adjust shots with a swivel instead of an adjustment ? If the answer to all these Questions are YES this is the item for you!! The 50-Inch Photo and Video tripod features a special carrying handle as well as a professional grip. With its  self leveling rubber leg tips  it offers a great floor grip for positioning and  built in bubble leveler to give you a leveled shot. Capability  for a 360 degree spin with its 3 way pan head doesn’t hurt for convenience. There are bracing sections to adjust Tripod size and an additional Bonus of Tripod case. What else can you ask for as a free bonus with your purchase. Features Extends to 50 Inch  and under Non slip handle Mid level bracing system for adjustable sizes Bubble leveler Tripod fitted case Compact Carry Size Mini Flexible Taple Top Travel Tripod  with Pocket clip We realized to take a quick snap shot anywhere with your camera is a hassle to keep the camera sturdy with a table top tripod you can pull it out instantly or leave attached to your product for that Quick Snap and Go picture. A focused leveled cameraâ\u0080\u0099s shot and a wobbled shot is a big difference. This handy little tripod also can keep you in the picture. Place your camera on the Tripod and use the camera's self-timer, or a remote shutter release and you are in the picture for a great crisp-sharp shot. It easy to use and it is small enough to be ideal for carry in travel. Featuring an adjustable head and hard Flexible legs, this Tripod is an ideal accessory for photographers on the run. This lightweight, yet durable tripod stands at a height of up to 5\". Perfect for most digital, video and still cameras . Features Fits all 35mm Digital and Video camera with Tripod Socket Sturdy Ultra Compact Convenient Pocket Clip Travel Sized Lens Cap Keeper Keep Your lens safe its one of the Eyes of your purchase: Its always the little things that we lose that are a pain to replace . Why go through the hassle we found the perfect solution. Your cameras lens is a vital part of the pathway that captures an image from external reality and stores it onto a memory card film device or other  Keeping this lens free of dust smudges and contact with other items is imperative. A Lens Cap holder as simple as it sounds is the solution. The  perfect way to keep track of your lens caps. A small button tapes onto the front of your lens cap and the elastic loop goes around the barrel of your lens so that your lens cap always remains attached, hanging from the lens. Lens caps can be pricey and hard to find  with this you will  Never lose a lens cap again ! Deluxe Screen Protector Pro Pack (Clear ) Be safe scratches arenâ\u0080\u0099t appealing . Save your screen it takes a second to apply and  will give you longer usage with your product Purchasing any item everyone always knows the LCD screen or glass screen is an imperative part of the electronic device always the first to get damaged. Easy solution for you !! Deluxe screen protectors are perfect for digital camera screens, cell phone screens and game player screens. screen protectors are included with  a squeegee to smooth them out and remove air bubbles. They can be cut down to size to fit any screen from 1\" to 5\". The extra clear layer on your device will not only protect it from Sun damage but will also protect from  Nail Scratches, finger smudges and many other contact damage to the screen point of your device. The Clear Quality Kit touch safes  your device. Universal Screen Guard The Greatest  Guarder for LCD Screens Multi 3pcs 3x5â\u0080\u0099â\u0080\u0099 Deluxe Screen Guard 1 Squeegee Card Deluxe Camera , Screen & Lens 5pc cleaning Kit Be clean Be Safe use something Approved for your product : It's obvious that the cleaner the lens and camera sensor, the sharper your pictures will be. Dirt, dust, and fingerprints will degrade the image quality of even the finest optics. However, it's equally important to avoid using incorrect cleaning materials which can permanently damage your photo equipment. The 5 Piece Camera and lens Cleaning Kit. consists of soft-texture fiber cloth, 5 cotton swabs, a bottle of cleaning fluid, soft lens tissue paper, and top quality blower brush. It easily fits in your camera bag so you can take it anywhere with you easily. It is perfect for an on-the-spot camera or lens cleaning and is approved by the manufacture to use with your item Screen Camera and Lens Cleaning kit Soft Texture Fiber Cloth Five Quality Cotton Swabs Top Quality cleaning Fluid Quality Blower and Brush Full Pack Lens Cleaning Tissue CANON REBELT4I/18-55KIT13 We usually ship within 1-2 business days after receiving payment. Please be aware that weekends are not business days. At our discretion; large or expensive packages may receive a free upgrade to FedEx Ground with signature confirmation.  If this applies to you, please assure that your address is able to receive FedEx packages & that an adult is available to sign for & accept the shipment. All express methods of shipment as long as verified take 1 business day to ship We ship everything professionally in our state of the art warehouse boxed and shipped with perfection. \"Free Shipping\" applies to orders shipped within the USA (48 states) We do not ship to APO or FPO address Orders shipping to PR/HI/AK Will have an additional shipping charge and a longer process time to ship order Credit Cards: We can only ship to addresses that are noted with your credit card account. We may contact you for additional verification after you check out. PayPal: We prefer to ship to confirmed addresses. We may contact you for additional verification for payments made by unconfirmed PayPal addresses. We do not accept PayPal payments from accounts outside the USA and Canada. · When necessary, we may contact you via Direct Message or telephone to obtain additional verification. We offer our customer's a 14 day return for replacement policy if item is defective other then that all sales are final . A Return Merchandise Authorization (RMA) number must be obtained for any return. To obtain an RMA number, please call us toll free at 877-254-6155 Returned packages without proper RMA demarcations will be refused by our warehouse and returned to you. Customers who refuse a delivery, will be subject to charges for return shipping to us. If the item was advertised as Free Shipping, then we will charge the amount of shipping as determined by Our Shipping Station . Defective Item An item that was discovered to be defective upon receipt can be replaced with the same model only. Return Shipping Return shipping cost (the cost to send an item back to our store) is like or comparable to your cost of driving to any store for returning an item, which is not reimbursable. Therefore, we do not reimburse any return shipping cost. If an item you received is defective, we will certainly replace the item with a new one, however we do not cover or reimburse the shipping cost for returning defective merchandise back to our store. We will ship the replacement product to you at our cost, and use every good measure to ensure that the replacement order is processed quickly. Replacement We will send a product replacement after the authorized return has completed our receiving/inspection process. The replacement will ship within four business days following our receipt of your return. Please allow additional processing time after Holidays. Although it is our goal to ship a replacement as quickly as possible, we do not send replacements before we receive and inspect the returned merchandise. All items are sold with Manufacture Warranty so there is another avenue for assistance. All returns must be packed with all contents which came with the original package including, cables, software, plastic and cardboard packaging, and unregistered warranty card. This return policy excludes Televisions, Home Theater Projectors or any Home audio Product . For further questions please call us toll free at 877-254-6155 We encourage any questions or concerns you may have for us, but we request that all communication be done through eBay messages only or over the phone. Our dedicated customer support team is available Monday-Friday 10AM - 6PM (EST) TOLL FREE: +1-877-254-6155 LOCAL: +1-908-967-5155 Click here to send us your email inquiry now through eBay messages.Right Bar Desc //End !",
    "additionalfeatures": "Interchangeable Lenses, USB 2.0",
    "displaysize": "3\"",
    "imagestabilization": "Yes",
    "dimensionsdxl": "Approx. 2.7 x 3.33\" (6.86 x 8.46 cm)",
    "aspectratio": "3:2, 16:9",
    "viewfindercoverage": "95%",
    "category": "camera",
    "shutter": "Type: Electronic & Mechanical Speed: 30 - 1/4000 sec Please Note: Bulb, X-sync at 1/200 sec 1/60-1/4000, Scene Intelligent Auto, X-sync at 1/200 sec Release: Electromagnetic close",
    "bitdepth": "14-bit",
    "lightsensitivitymax": "100",
    "liveview": "Yes",
    "operatingstoragetemperature": "Operating 32 to 104 Â°F (0 to 40 Â°C) Humidity: 0 - 85%",
    "lensforsd": "EF-S IS II 18-55mm",
    "selftimer": "10 sec, 2 sec",
    "focallength": "18 - 55 mm Please Note: 29-88 mm 35 mm equivalent close",
    "magnification": "0.34x",
    "aperture": "Maximum: f/3.5 - 5.6 Minimum: f/22 - 38 Please Note: f/22-38 for models with 1/2-stop increments; f/22-36 for models with 1/3-stop increments close",
    "dimensionswxhxd": "5.2 x 3.9 x 3.1\" / 13.21 x 9.91 x 7.87 cm",
    "autofocus": "Yes",
    "continuousshooting": "Up to 5.0 fps Please Note: 8GB card: Up to 22 shots (JPEG); 6 shots (RAW); 3 shots (RAW+JPEG) UHS-I: 30 shots (JPEG); 6 shots (RAW); 3 shots (RAW+JPEG) close",
    "meteringmethod": "Spot metering, Center-weighted average metering Please Note: Evaluative, partial (9% of viewfinder) EV 1.0 - EV 20.0 (EF50mm f/1.4 USM lens, ISO 100) close",
    "audiorecording": "With Video, Stereo",
    "whitebalancemodes": "Auto, Cloudy, Custom, Daylight, Flash, Fluorescent (White), Kelvin, Shade, Tungsten Please Note: Custom: Approx. 2,000 - 10,000 K Blue / amber, magenta / green bias: Â±9 levels close",
    "viewfindermagnification": "Approx. 0.85x",
    "mpn": "6558B003",
    "brand": "Canon",
    "sensortypesize": "CMOS, 22.3 x 14.9 mm",
    "filterthread": "Front: 58 mm Please Note: P=0.75mm / 1 filter close",
    "sensortype": "CMOS",
    "connectivity": "AV Output, HDMI C (Mini), USB 2.0",
    "cameraformat": "Canon APS-C (1.6x Crop Factor)",
    "groupselements": "9/11",
    "angleofview": "74.2Â° - 27.5Â° Please Note: Diagonal; Vertical is 45.3-15.4; Horizontal is 64.3-23.2 close",
    "focustype": "Auto & Manual Please Note: Auto: TTL-CT-SIR AF-dedicated CMOS sensor Working Range: EV -0.5 - 18 (ISO 100) close",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "videorecording": "Yes, NTSC/PAL",
    "lensmount": "Canon EF",
    "displayscreen": "3.0\" Rear Touchscreen   LCD (1040000) 7 Please Note: Aspect ratio: 3:2 Viewing Angle: 170Â° (vertical / horizontal) Brightness control: Auto, manual close",
    "fileformats": "Still Images: JPEG, RAW Movies: MOV Audio: Linear PCM Please Note: RAW + JPEG simultaneous recording close",
    "screencoverage": "100%",
    "storecategoriesstorehomeipadtabletipadsipadminiipodmp3playersdigitalslrcamerascanonnikonsonydigitalpscameraspanasonicdigitalcameralensescanonnikonsonydigitalcameraaccessoriescameracasesmemorycardmemorycardreadermemorycardholderbatterieschargerwarrantyserviceplanslensfiltertripodsmonopodslenshoodcapslearningdvdotherstarterkitipodmp3accessoriesspeakers": "Canon Rebel T4i 650D +18-55+ 3 Lens Kit + 48GB +Flash + Battery + Case, NEW USA Click an Image to Enlarge This item is 100% brand new. USA product sealed in original box & includes full USA warranty. 58MM Professional HD 2x telephoto lens  With Free Carry Case 58mm 45x Wide-Angle Digital High Definition Lens w/ Macro 3 Piece Multi Coated Quailty Filter Kit 32 GB Secure Digital (SD) Memory Card 16 GB Secure Digital (SD) Memory Card High Speed USB 2.0 All-in-One card reade Extra Battery Extra Charger Deluxe Soft Medium SLR Camera Case / Bag fit Canon EOS, Nikon, Sony Alpha Camera Multi Memory Card Wallet Digital Auto Slave Flash with Bracket Full Size 50-inch Tripod With Leveler 360 adjust & Carryng Case for SLR Cameras Mini Flexible Taple Top Travel Tripod  with Pocket clip Lens Cap Keeper Deluxe Screen Protector Pro Pack (Clear ) Deluxe Camera , Screen & Lens 5pc cleaning Kit Canon EOS Rebel T4i Digital SLR Camera Overview Canon is proud to introduce its most sophisticated Rebel everâ\u0080\u0094the EOS Rebel T4i DSLR! Built to make advanced photography simple and fun, the new Rebel T4i delivers phenomenal image quality, high performance, and fast, intuitive operation. This EOS Rebel amps up the speed with the powerful DIGIC 5 Image Processor that helps make high-speed continuous shooting of up to 5.0 fps possibleâ\u0080\u0094great for capturing fast action. An 18.0 Megapixel CMOS sensor ensures that every image is shot in superb, high resolution; and an extended ISO range of 100-12800 gives photographers the opportunities to take the Rebel T4i into more shooting situations than ever before. A 9-point all cross-type AF system (including a high-precision dual cross f/2.8 center point) delivers improved autofocus performance, and a new Hybrid CMOS AF System increases autofocus speed when shooting photos and video in Live View. For users interested in creating impressive videos, the Rebel T4i is ready to help you create your next masterpiece. Movie Servo AF provides continuous focus of moving subjects, so you never miss a moment. A built-in stereo microphone and manual audio level adjustment helps ensure that your audio will match the stunning quality of your video. First ever for an EOS Rebel, the Rebel T4i features a Vari-angle Touch Screen 3.0-inch Clear View LCD monitor II, which allows fast and intuitive camera operation. Add compatibility with Canon's proven EF and EF-S lenses and a slew of EOS accessories, the Rebel T4i is an incredibly versatile tool for creating the images and videos you envision. 18.0 Megapixel CMOS (APS-C) sensor. The EOS Rebel T4i features Canon's amazing 18.0 Megapixel CMOS (Complementary Metal Oxide Semiconductor) sensor. Perfect for enlargements or for cropping detailed portions of the composition, the EOS Rebel T4i's sensor captures images with exceptional clarity and tonal range. This first-class sensor features many of the same new technologies used by professional Canon cameras to maximize each pixel's light-gathering efficiency and has center pixels that aid in the EOS Rebel T4i's accurate AF performance. This APS-C size sensor creates an effective 1.6x field of view (compared to 35mm format). DIGIC 5 Image Processor The Rebel T4i is the first Rebel to feature Canon's DIGIC 5 Image Processor. The DIGIC 5 Image Processor works with the camera's CMOS sensor to deliver images with incredible detail in more situations, without the need for artificial light sources. With the power of the DIGIC 5 Image Processor the Rebel T4i can achieve higher ISO sensitivity, can shoot up to 5.0 fps continuously and can even perform advanced functions like HDR Backlight Control, art filters, lens correction and much more. The brilliant \"brain\" of the camera, this imaging engine supercharges every facet of still and moving image capture. Improved autofocus performance and new Hybrid CMOS AF. The EOS Rebel T4i is equipped with AF features that ensure speedy, accurate and continuous AF every time. When shooting through the viewfinder, the EOS Rebel T4i has improved autofocus with a new 9-point, all cross-type AF system (including high-precision dual-cross f/2.8 center point) for accurate focus whether the camera is oriented in portrait or landscape position. A new AI Servo AF system achieves and maintains consistent focus with an exceptional degree of reliability. Enhanced EOS Full HD Movie Mode with Movie Servo AF. The EOS Rebel T4i offers easy to use, professional video capture without compromise. Capable of shooting in a number of recording sizes and frame rates the Rebel T4i sets a whole new standard for performance, quality and simplicity. The Rebel T4i enables easy manual control of exposure, focus and Live View features, even in-camera editing! New Movie Servo AF allows continuous autofocus tracking of moving subjects while recording video. When shooting video with one of Canon's new STM lenses, Movie Servo AF takes advantage of the lens' stepping motor for smooth and quiet continuous AF. With an STM lens attached, the EOS Rebel T4i sets a new standard for SLR moviemaking performance! Video Snapshot. With the Video Snapshot feature, the EOS Rebel T4i DSLR can capture short video clips (of 2, 4 or 8 seconds) then combine them automatically into one video file as a snapshot or highlights \"album.\" With no editing needed after shooting, the compiled video is perfect for sharing online or displaying directly on an HDTV via the camera's HDMI port. Additionally, stills can be recorded during video shooting simply by pressing the camera's shutter button. During playback, video clips in an album can now be reordered or deleted. New Vari-angle Touch Screen 3.0-inch Clear View LCD monitor II with multi-touch operation and Touch AF. The EOS Rebel T4i comes with a newly engineered, Vari-angle Touch Screen 3.0-inch Clear View LCD monitor II. Using the same capacitive technology as today's popular mobile devices, this new screen is touch-sensitive and delivers intuitive touch panel operation. Two finger touch gestures (multi-touch) can be used for zooming or changing images, menu and quick control settings can be accessed, and focus point and shutter release can be activated with the touch of a fingertip. Displaying fine detail (at approximately 1.04 million dots), this screen is perfect for composing and reviewing images. Thanks to a new, solid construction between the monitor's resin-coated cover and the liquid crystal display, reflections are minimized, and the display can be viewed, without glare, from any number of angles. The LCD's surface is treated with a smudge-resistant coating to minimize fingerprints and maintain a bright, clear image display. HDR Backlight Control mode. The EOS Rebel T4i's HDR Backlight Control mode ensures that backlit subjects are not recorded too dark. By shooting three consecutive shots at different exposures (underexposed, correctly exposed and overexposed) and then combining the images, the final result maintains detail in both the shadow and highlight areas, ensuring the backlit subject is properly exposed. Multi Shot Noise Reduction. To enhance its already admirable high ISO shooting capabilities, the EOS Rebel T4i features an intelligent Multi Shot Noise Reduction tool that reduces noise even further than the camera's sensor and the DIGIC 5 Image Processor alone. With Multi Shot Noise Reduction activated, the camera takes four consecutive shots, merges and aligns them. This eliminates more noise than the Rebel's traditional Noise Reduction filter, with little or no apparent resolution loss. Moving subjects are even optimized to minimize subject blur! Thanks to this clever new feature, high ISO shooting has never looked better. Flexible and Reliable Recording.. Compatibility with SD/SDHC/SDXC memory cards, including new Ultra High Speed cards : The EOS Rebel T4i uses popular SD, SDHC, SDXC and is even compatible with the newest Ultra High Speed (UHS-I) memory cards. Compact and available in large capacities, SD, SDHC and SDXC memory cards are a perfect complement to the EOS Rebel T4i's compact design. Additionally, the EOS Rebel T4i is compatible with Eye-Fiâ\u0088\u0097 SD cards, which are outfitted with a Wi-FiÂ® transmitter (IEEE 802.11b/g) and an internal antenna for wireless, high-speed transfer of images. With an Eye-Fi card installed, the EOS Rebel T4i can display the Eye-Fi's connection status and error notes with ease, for fully functional wireless uploading of images directly from the camera. Shooting Made Easy. EF & EF-S Lenses The EOS Rebel T4i is compatible with all Canon lenses in the EF lineup, including compact and lightweight EF-S lenses, ranging from ultra-wide angle to super telephoto lenses and including the new STM series optimized for video shooting. Canon lenses employ advanced optical expertise and micron-precision engineering to deliver outstanding performance and deliver beautiful results. Special technologies like Canon's Image Stabilizer technology help to minimize the effect of camera shake, effectively adding up to four stops of light; STM lenses even feature a stepping motor for smooth and quiet continuous autofocus while capturing video. With an array of lenses perfect for travel, sports, still life and everything in between, photographers can truly maximize the quality and performance of their EOS Rebel T4i. Camera Type Digital SLR with Interchangeable lenses Lens Mount Canon EF Camera Format Canon APS-C (1.6x Crop Factor) Resolution Effective Pixels: 18.0 Megapixels Max Resolution: 17.9 MP: 5184 x 3456 Please Note: Total pixels: Approx. 18.50 MP Pixel unit: 4.3 Âµm square close Sensor Type / Size CMOS, 22.3 x 14.9 mm File Formats Still Images: JPEG, RAW Movies: MOV Audio: Linear PCM Please Note: RAW + JPEG simultaneous recording close Bit Depth 14-bit Noise Reduction Yes Memory Card Type SD SDHC SDXC AV Recording Video Recording Yes, NTSC/PAL Aspect Ratio 3:2, 16:9 Video Clip Length Up to 8GB or 22 Min Please Note: 1 hr 32 min 640x480 close Audio Recording With Video, Stereo Focus Control Focus Type Auto & Manual Please Note: Auto: TTL-CT-SIR AF-dedicated CMOS sensor Working Range: EV -0.5 - 18 (ISO 100) close Focus Mode Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M) Autofocus Points 9 Please Note: All Cross-Type at f/5.6; Center AF point diagonal cross-type at f/2.8 close Viewfinder/Display Viewfinder Type Pentamirror Please Note: Eye Point: 19 mm at -1m-1 from lens center Fixed focus screen Quick-return half mirror, reflection 40:60 close Viewfinder Coverage 95% Viewfinder Magnification Approx. 0.85x Diopter Adjustment - 3.0 to +1.0 m Display Screen 3.0\" Rear Touchscreen   LCD (1040000) 7 Please Note: Aspect ratio: 3:2 Viewing Angle: 170Â° (vertical / horizontal) Brightness control: Auto, manual close Screen Coverage 100% Live View Yes Exposure Control ISO Sensitivity Auto, 100-12800 (High Sensitivity Mode: 100-25600) Please Note: Auto: ISO 100-6400 close Shutter Type: Electronic & Mechanical Speed: 30 - 1/4000 sec Please Note: Bulb, X-sync at 1/200 sec 1/60-1/4000, Scene Intelligent Auto, X-sync at 1/200 sec Release: Electromagnetic close Remote Control RC-1, RC-5, or RC-6 (Optional) Please Note: 2-sec delay mode: Start or stop video shooting immediately close Metering Method Spot metering, Center-weighted average metering Please Note: Evaluative, partial (9% of viewfinder) EV 1.0 - EV 20.0 (EF50mm f/1.4 USM lens, ISO 100) close Exposure Modes Modes: AE Lock, Aperture Priority, Manual, Program, Programmed Auto, Shutter Priority Compensation: -5 EV to +5 EV (in 1/3 EV steps) Please Note: Or 1/2 EV steps -/+5 for manual; -/+2 for AEB; +/-3 in 1/3-stop increments for video close White Balance Modes Auto, Cloudy, Custom, Daylight, Flash, Fluorescent (White), Kelvin, Shade, Tungsten Please Note: Custom: Approx. 2,000 - 10,000 K Blue / amber, magenta / green bias: Â±9 levels close Flash Built-in Flash Yes: Auto, FE Lock, Off Please Note: Guide Number: Approx. 43' (13 m) at ISO 100 Up to 17 mm focal length Â±2 stops in 1/3- or 1/2-stop close Max Sync Speed 1 / 200 sec Continuous Shooting Up to 5.0 fps Please Note: 8GB card: Up to 22 shots (JPEG); 6 shots (RAW); 3 shots (RAW+JPEG) UHS-I: 30 shots (JPEG); 6 shots (RAW); 3 shots (RAW+JPEG) close Dedicated Flash System eTTL Please Note: FE lock Exposure compensation: Up to Â±2 stops in 1/3 or 1/2-stop increments close External Flash Connection Hot Shoe, PC Terminal Performance Shutter Lag 0.075 Seconds Please Note: between SW-2 ON and exposure start; 0.15 sec between simultaneous SW-1/SW-2 ON and exposure start close Self Timer 10 sec, 2 sec Connectivity AV Output, HDMI C (Mini), USB 2.0 Wi-Fi Capable (With Optional Transmitter) Yes Power Battery 1x  LP-E8  Rechargeable Lithium-Ion Battery Pack, 7.2VDC, 1120mAh AC Power Adapter ACK-E8 (Optional) Operating/Storage Temperature Operating 32 to 104 Â°F (0 to 40 Â°C) Humidity: 0 - 85% Physical Dimensions (WxHxD) 5.2 x 3.9 x 3.1\" / 13.21 x 9.91 x 7.87 cm Weight 1.14 lb / 0.52 kg Kit Lens Focal Length 18 - 55 mm Please Note: 29-88 mm 35 mm equivalent close Aperture Maximum: f/3.5 - 5.6 Minimum: f/22 - 38 Please Note: f/22-38 for models with 1/2-stop increments; f/22-36 for models with 1/3-stop increments close Angle of View 74.2Â° - 27.5Â° Please Note: Diagonal; Vertical is 45.3-15.4; Horizontal is 64.3-23.2 close Minimum Focus Distance 9.8\" (24.89 cm) Please Note: Focus adjustment: AF (DC motor), with manual focus option close Magnification 0.34x Groups/Elements 9/11 Autofocus Yes Image Stabilization Yes Filter Thread Front: 58 mm Please Note: P=0.75mm / 1 filter close Dimensions (DxL) Approx. 2.7 x 3.33\" (6.86 x 8.46 cm) Weight 7.1 oz (201 g) Canon EOS Rebel T4i Digital Camera with EF-S 18-55mm f/3.5-5.6 IS II Lens Eyecup Ef for Digital Rebel Cameras R-F-3 Camera Cover EW-100DB IV Wide Strap LC-E8E Battery Charger AC Cable LP-E8 Rechargeable Lithium-Ion Battery Pack (7.2V, 1120mAh) Battery Cover 1-Year U.S.A. Limited Warranty USB Interface Cable IFC-130U EOS Digital Solution Disk v.25.1 Camera Instruction Manual Software Instruction Manual CD 1-Year Limited Warranty Professional HD 2x telephoto lens When your camera can't get you close enough to capture the action in detail, this 2x Telephoto lens will bring the action to you! Optically multiplying the focal length of your camera's lens by a factor of 2, it more than doubles your telephoto magnification and detail without any pixelization. This is dramatically better than the \"Digital Zoom\" feature of many cameras where the magnification is obtained by merely enlarging the existing image, resulting in a loss of sharpness. This 2x telephoto attachment is perfect for all your long-distance imaging including sports, candids, surveillance, nature and wildlife. You will also be able to utilize your camera's macro capability at over twice the usual distance, allowing for easier subject lighting with less shadows and intrusion.. 45x Wide-Angle Digital High Definition Lens with Maro When you've run out of room, and can't possibly fit anything else into the frame, this 0.45x Wide Angle adapter will allow you to capture it all! This attachment more than doubles your camera's wide angle field-of-view . Scenic shots will be more panoramic and you'll be able to take outstanding group photos, even in tight places. In addition, the detachable Macro Lens enables you to photograph small objects up close. Great for jewelry, coins, stamps, flowers, and more. Even if your camera already has macro capability, this macro lens will get you even closer for truly amazing close-up photos. Professional High Definition Special Element Frame Premium Rimmed Glass Infrared Compatible Include Protective Lens Case Digital Multi Coated 58mm Glass Filter Kit (UV-CPL-FLD) 3pc Filter kit The UV filter protects your camera's lens from scratches, dust,  dirt, moisture and fingerprints, while removing unwanted ultraviolet  light.The UV filter reduces blue haze caused by UV light by absorbing  71% of UV. The CPL filter deepens and  intensifies blue skies, achieves vibrant colors and reduces glare and  reflections from non-metallic objects & glass surfaces. Great for  video. The Fluorescent Light Correction Filter gives  you the prefect solution for shooting without a flash under a  fluorescent light.This filter gives true-to-life colors and pleasing  skin tones by removing the harsh yellow-green cast created by flouriest  lightning. Lens filter set is a must-have for photographers 58mm filters improve photographs by giving photographers control over light and allowing them to emphasize certain features Filter kit features UV, CPL, and FLD filters Set comes with hard carrying case and filters UV Protector Filter protected the lens from damage 32 GB Secure Digital (SD) Memory Card Get The Best SD Card for your product When getting an SD memory card there are hundreds of options for your item this can get confusing and costly  , When purchasing one of our handpicked memory cards for your item you receive a  Memory card at the highest quality. We go to every extent to handpick cards to provide  you as a bonus with your purchase that are not only guaranteed to work with your item but have the best performance with your item. This is a Onetime purchase that will help you capture a memory for a lifetime. Our memory card offers are High performance cards that are made reliable with long life spans  created to handle real life motions and real time transfers. There will be  no delay time in transferring information from your device to this card. Get Quality at the top of its class with  SD memory. 16 GB Secure Digital (SD) Memory Card Get The Best SD Card for your product When getting an SD memory card there are hundreds of options for your item this can get confusing and costly  , When purchasing one of our handpicked memory cards for your item you receive a  Memory card at the highest quality. We go to every extent to handpick cards to provide  you as a bonus with your purchase that are not only guaranteed to work with your item but have the best performance with your item. This is a Onetime purchase that will help you capture a memory for a lifetime. Our memory card offers are High performance cards that are made reliable with long life spans  created to handle real life motions and real time transfers. There will be  no delay time in transferring information from your device to this card. Get Quality at the top of its class with  SD memory. High Speed USB  All  One Card Reader Access a multitude of memory cards with this USB 2.0 All-in-One card reader! This portable memory card reader supports the most popular memory cards such as Compact Flash I/II, Secure Digital, SD, Memory Stick, Micro Drive and Multimedia Card. Replacement For CANON LP-E8 Battery The LP-E8 Rechargeable Lithium-ion Battery Pack has a capacity of 1120mAh, making it possible to shoot many photographs with your Canon EOS Rebel T2i, T3i or T4i digital camera on a single battery charge. The battery is also compact and lightweight. There is no memory effect, so you can recharge partially drained batteries without reducing performance. Replacement for the original Canon LP-E8 battery pack Never run out of battery power when you're about to capture the perfect moment Output voltage: 7.2V Capacity: 1120mAh LP-E8 RECHARGEABLE BATTERY  CHARGER This LP-E8 Battery Charger for Canon EOS Rebel  is used to recharge your digital camera battery, it is quick charge with automatic constant current control, prevents battery from overcharging, short circuit, and electronic shock. The Battery Charger can used both for home, office and car.  A/C power supply input voltage: AC100V~240V NOTE: For a success and safe charge to your battery, please make         sure to line up the correct polarity (positive / negative) before         inserting the battery onto the charger This compact battery charger set for Canon LP-E8 is the complete charging solution for digital video batteries High quality battery charger is a handy companion for digital shooting Charger is designed with a foldable A/C plug that charges your camera / camcorder battery anywhere in the world Quick charge with automatic constant current control prevents battery from overcharging, short circuit, and electronic shock Smart LED indicator shows charging status Deluxe Medium Camera and Video Bag The Deluxe Medium Camera and Video Bag  is the perfect compliment to hold all of your equipment. It features a shock proof nylon material and is water resistant. It has 1 removable divider, rubber feet, shoulder strap and a handle grip. Easy access closure flap Mesh pockets for accessory storage compartment with interior   mesh pockets for spare batteries, flash-memory cards, diskettes,cords,   cables and more Shoulder strap/1 re moveable divider ,rubber feet, shoulder strap and a handle grip nylon material and is water resistant Dimensions: Size: 10.8 x 6.5 x 7.5 inches Multi Memory Card Wallet Donâ\u0080\u0099t lose your lifeâ\u0080\u0099s Memories Memory Cards are the Insert that holds your lifeâ\u0080\u0099s memoryâ\u0080\u0099s. A little card that easily lost but so important to you and your family. Always keep  your memory cards together at any cost. One lost card can lose decades of Memories. A memory card wallet is someplace for you to keep these memoryâ\u0080\u0099s together. Memory Card Wallet Keeps multiple memory cards protected and organized with this durable storage wallet. Sturdy memory card wallet case holds memory cards of any type securely, keeping them from contact with other accessories and makes them easily accessible in larger luggage bags. Features Memory Card Wallet Holds up to Multi  memory Cards (SD,CF,MS) 1 Year Limited Warranty Pro Digital Auto Slave Flash with Bracket for All SLR/DSLR Digital Camera & Camcorders Every photographer knows that a quality flash unit is an essential component to taking great pictures. Built-in flashes simply don't have enough power to properly illuminate most subjects, and typically produce harsh shadows, red-eye, and other undesirable effects. An external flash offers far more power and versatility , resulting in consistently better pictures! The Flash is a high-power flash unit that works seamlessly with a wide variety of camera models and provides exceptional light coverage , at a price that doesn't break the bank! The Flash features automatic exposure control , which syncs with your camera to provide just the right amount of light. The zoom function allows you to light subjects as far away as 50 feet , and the bounce head tilts and swivels to give you full creative control. Full Size 50-inch Tripod With Leveler  360 adjust & Case Want to relax and take time shooting ?  Not worry about your shots being leveled ?  adjust shots with a swivel instead of an adjustment ? If the answer to all these Questions are YES this is the item for you!! The 50-Inch Photo and Video tripod features a special carrying handle as well as a professional grip. With its  self leveling rubber leg tips  it offers a great floor grip for positioning and  built in bubble leveler to give you a leveled shot. Capability  for a 360 degree spin with its 3 way pan head doesn’t hurt for convenience. There are bracing sections to adjust Tripod size and an additional Bonus of Tripod case. What else can you ask for as a free bonus with your purchase. Features Extends to 50 Inch  and under Non slip handle Mid level bracing system for adjustable sizes Bubble leveler Tripod fitted case Compact Carry Size Mini Flexible Taple Top Travel Tripod  with Pocket clip We realized to take a quick snap shot anywhere with your camera is a hassle to keep the camera sturdy with a table top tripod you can pull it out instantly or leave attached to your product for that Quick Snap and Go picture. A focused leveled cameraâ\u0080\u0099s shot and a wobbled shot is a big difference. This handy little tripod also can keep you in the picture. Place your camera on the Tripod and use the camera's self-timer, or a remote shutter release and you are in the picture for a great crisp-sharp shot. It easy to use and it is small enough to be ideal for carry in travel. Featuring an adjustable head and hard Flexible legs, this Tripod is an ideal accessory for photographers on the run. This lightweight, yet durable tripod stands at a height of up to 5\". Perfect for most digital, video and still cameras . Features Fits all 35mm Digital and Video camera with Tripod Socket Sturdy Ultra Compact Convenient Pocket Clip Travel Sized Lens Cap Keeper Keep Your lens safe its one of the Eyes of your purchase: Its always the little things that we lose that are a pain to replace . Why go through the hassle we found the perfect solution. Your cameras lens is a vital part of the pathway that captures an image from external reality and stores it onto a memory card film device or other  Keeping this lens free of dust smudges and contact with other items is imperative. A Lens Cap holder as simple as it sounds is the solution. The  perfect way to keep track of your lens caps. A small button tapes onto the front of your lens cap and the elastic loop goes around the barrel of your lens so that your lens cap always remains attached, hanging from the lens. Lens caps can be pricey and hard to find  with this you will  Never lose a lens cap again ! Deluxe Screen Protector Pro Pack (Clear ) Be safe scratches arenâ\u0080\u0099t appealing . Save your screen it takes a second to apply and  will give you longer usage with your product Purchasing any item everyone always knows the LCD screen or glass screen is an imperative part of the electronic device always the first to get damaged. Easy solution for you !! Deluxe screen protectors are perfect for digital camera screens, cell phone screens and game player screens. screen protectors are included with  a squeegee to smooth them out and remove air bubbles. They can be cut down to size to fit any screen from 1\" to 5\". The extra clear layer on your device will not only protect it from Sun damage but will also protect from  Nail Scratches, finger smudges and many other contact damage to the screen point of your device. The Clear Quality Kit touch safes  your device. Universal Screen Guard The Greatest  Guarder for LCD Screens Multi 3pcs 3x5â\u0080\u0099â\u0080\u0099 Deluxe Screen Guard 1 Squeegee Card Deluxe Camera , Screen & Lens 5pc cleaning Kit Be clean Be Safe use something Approved for your product : It's obvious that the cleaner the lens and camera sensor, the sharper your pictures will be. Dirt, dust, and fingerprints will degrade the image quality of even the finest optics. However, it's equally important to avoid using incorrect cleaning materials which can permanently damage your photo equipment. The 5 Piece Camera and lens Cleaning Kit. consists of soft-texture fiber cloth, 5 cotton swabs, a bottle of cleaning fluid, soft lens tissue paper, and top quality blower brush. It easily fits in your camera bag so you can take it anywhere with you easily. It is perfect for an on-the-spot camera or lens cleaning and is approved by the manufacture to use with your item Screen Camera and Lens Cleaning kit Soft Texture Fiber Cloth Five Quality Cotton Swabs Top Quality cleaning Fluid Quality Blower and Brush Full Pack Lens Cleaning Tissue CANON REBELT4I/18-55KIT13 We usually ship within 1-2 business days after receiving payment. Please be aware that weekends are not business days. At our discretion; large or expensive packages may receive a free upgrade to FedEx Ground with signature confirmation.  If this applies to you, please assure that your address is able to receive FedEx packages & that an adult is available to sign for & accept the shipment. All express methods of shipment as long as verified take 1 business day to ship We ship everything professionally in our state of the art warehouse boxed and shipped with perfection. \"Free Shipping\" applies to orders shipped within the USA (48 states) We do not ship to APO or FPO address Orders shipping to PR/HI/AK Will have an additional shipping charge and a longer process time to ship order Credit Cards: We can only ship to addresses that are noted with your credit card account. We may contact you for additional verification after you check out. PayPal: We prefer to ship to confirmed addresses. We may contact you for additional verification for payments made by unconfirmed PayPal addresses. We do not accept PayPal payments from accounts outside the USA and Canada. · When necessary, we may contact you via Direct Message or telephone to obtain additional verification. We offer our customer's a 14 day return for replacement policy if item is defective other then that all sales are final . A Return Merchandise Authorization (RMA) number must be obtained for any return. To obtain an RMA number, please call us toll free at 877-254-6155 Returned packages without proper RMA demarcations will be refused by our warehouse and returned to you. Customers who refuse a delivery, will be subject to charges for return shipping to us. If the item was advertised as Free Shipping, then we will charge the amount of shipping as determined by Our Shipping Station . Defective Item An item that was discovered to be defective upon receipt can be replaced with the same model only. Return Shipping Return shipping cost (the cost to send an item back to our store) is like or comparable to your cost of driving to any store for returning an item, which is not reimbursable. Therefore, we do not reimburse any return shipping cost. If an item you received is defective, we will certainly replace the item with a new one, however we do not cover or reimburse the shipping cost for returning defective merchandise back to our store. We will ship the replacement product to you at our cost, and use every good measure to ensure that the replacement order is processed quickly. Replacement We will send a product replacement after the authorized return has completed our receiving/inspection process. The replacement will ship within four business days following our receipt of your return. Please allow additional processing time after Holidays. Although it is our goal to ship a replacement as quickly as possible, we do not send replacements before we receive and inspect the returned merchandise. All items are sold with Manufacture Warranty so there is another avenue for assistance. All returns must be packed with all contents which came with the original package including, cables, software, plastic and cardboard packaging, and unregistered warranty card. This return policy excludes Televisions, Home Theater Projectors or any Home audio Product . For further questions please call us toll free at 877-254-6155 We encourage any questions or concerns you may have for us, but we request that all communication be done through eBay messages only or over the phone. Our dedicated customer support team is available Monday-Friday 10AM - 6PM (EST) TOLL FREE: +1-877-254-6155 LOCAL: +1-908-967-5155 Click here to send us your email inquiry now through eBay messages.",
    "remotecontrol": "RC-1, RC-5, or RC-6 (Optional) Please Note: 2-sec delay mode: Start or stop video shooting immediately close",
    "diopteradjustment": "- 3.0 to +1.0 m",
    "focusadjustment": "Autofocus & Manual Focus",
    "displaytype": "LCD",
    "builtinflash": "Yes: Auto, FE Lock, Off Please Note: Guide Number: Approx. 43' (13 m) at ISO 100 Up to 17 mm focal length Â±2 stops in 1/3- or 1/2-stop close",
    "cameratype": "Digital SLR with Interchangeable lenses",
    "exposuremodes": "Modes: AE Lock, Aperture Priority, Manual, Program, Programmed Auto, Shutter Priority Compensation: -5 EV to +5 EV (in 1/3 EV steps) Please Note: Or 1/2 EV steps -/+5 for manual; -/+2 for AEB; +/-3 in 1/3-stop increments for video close",
    "sensorresolution": "18.0 MP",
    "connectortypes": "USB to computer",
    "focusmode": "Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M)",
    "minimumfocusdistance": "9.8\" (24.89 cm) Please Note: Focus adjustment: AF (DC motor), with manual focus option close",
    "wificapablewithoptionaltransmitter": "Yes",
    "viewfindertype": "Pentamirror Please Note: Eye Point: 19 mm at -1m-1 from lens center Fixed focus screen Quick-return half mirror, reflection 40:60 close",
    "autofocuspoints": "9 Please Note: All Cross-Type at f/5.6; Center AF point diagonal cross-type at f/2.8 close",
    "dedicatedflashsystem": "eTTL Please Note: FE lock Exposure compensation: Up to Â±2 stops in 1/3 or 1/2-stop increments close",
    "supportedflashmemory": "SD Card, SD Memory Card, SDHC Card, SDHC Memory Card, SDXC Card, SDXC Memory Card",
    "model": "Rebel T4i / 650D",
    "resolution": "Effective Pixels: 18.0 Megapixels Max Resolution: 17.9 MP: 5184 x 3456 Please Note: Total pixels: Approx. 18.50 MP Pixel unit: 4.3 Âµm square close",
    "videocliplength": "Up to 8GB or 22 Min Please Note: 1 hr 32 min 640x480 close",
    "screensize": "3\""
}