{
    "weight": "30.34 oz / 860 g",
    "color": "Black",
    "series": "EOS",
    "flashmode": "Built-in Flash",
    "packagetype": "Single Lens Kit",
    "mirror": "Quick-return half mirror (transmission: reflectance ratio of 40:60)",
    "category": "camera",
    "colorfiltersystem": "RGB primary color filters",
    "grosspixels": "23.4 MP",
    "dimensions": "Approx. 6.0 x 4.6 x 3.0\" / 15.2 x 11.7 x 7.6 cm",
    "magnification": "Approx. 0.71x / Angle of view 34.1 degrees (with 50mm lens at infinity, -1 m-1 (dpt))",
    "selftimer": "10-sec. or 2-sec. delay",
    "drivemodes": "Single, High-speed continuous, Low-speed continuous, Silent Single Shooting and Self-timer (10 sec. self-timer/remote control, or 2-sec. self-timer/remote control)",
    "focusingpointselection": "Single-point AF (Manual selection) Auto selection 61-Point AF Single-point Spot AF (Manual selection) AF point expansion (Manual selection, 4 points: Up, down, left, and right) AF point expansion (Manual selection, surrounding 8 points) Zone AF (Manual zone selection)",
    "focustype": "TTL secondary image - registration, phase detection",
    "afpoints": "61-point (up to 41 cross-type points)",
    "flashexposurecompensation": "+/- 3 stops in 1/3- or 1/2-stop increments",
    "brand": "Canon",
    "dustcleaningsystem": "(1) Self Cleaning Sensor Unit - Automatic Sensor Cleaning - Removes dust adhering to the infrared- and ultraviolet-blocking glass. - Self-cleaning executed automatically when power is turned on or off. Manual execution also possible. - Low-pass filter has a fluorine coating. (2) Dust Delete Data acquisition and appending - The coordinates of the dust adhering to the infrared- and ultraviolet-blocking glass are detected by a test shot and appended to subsequent images. - The dust coordinate data appended to the image is used by the provided software to automatically erase the dust spots. (3) Manual cleaning",
    "dioptricadjustment": "-3.0 to +1.0m-1 (diopter)",
    "continuousshootingspeed": "High-speed: Maximum approx. 6 shots/sec. Low-speed: Maximum approx. 3 shots/sec. Silent continuous shooting: Maximum approx. 3 shots/sec.",
    "focusingscreen": "Fixed",
    "part": "5260B009",
    "coverage": "100%",
    "imagesensorsize": "Approx. 36 mm x 24mm (35mm Full-frame)",
    "aspectratio": "3:2 (Horizontal : Vertical)",
    "shutterspeed": "1/8000 to 1/60 sec., X-sync at 1/200 sec. 1/8000 to 30 sec., bulb (Total shutter speed range. Available range varies by shooting mode.)",
    "afassistbeam": "Enable: With an EOS-dedicated Speedlite, AF-assist beam is emitted automatically when necessary. Disable IR AF assist beam only",
    "brightnessadjustment": "Auto: Brightness adjusted automatically by the light sensor Adjustable to one of three levels: Darker, Standard, Brighter Manual: Adjustable to one of seven brightness levels",
    "externalflash": "The camera can set the following with Speedlite 600EX-RT, 580EX II, 430EX II, 320EX, 270EX II, or 270EX: (1) External flash control (2) Flash Custom Function setting",
    "eyepoint": "Approx. 21mm (At -1m-1 from the eyepiece lens center)",
    "shuttertype": "Vertical-travel, mechanical, focal-plane shutter with all speeds electronically-controlled",
    "viewfinderinformation": "AF information: AF point, focus confirmation, AF status indicator Exposure information: Shutter speed, aperture, ISO speed (always displayed), AE lock, exposure level, exposure warning Flash information: Flash ready, flash exposure compensation, high-speed sync, FE lock, red-eye reduction light Image information: Highlight tone priority (D+), maximum burst (2-digit display), card information Battery check Composition information: Grid, electronic level Warning symbol Displayed if any of the following is set: Monochrome, white balance correction, One-touch recording quality switch, expanded ISO speed, or spot metering.",
    "imagesensor": "CMOS",
    "lcdcoverage": "100%",
    "lcd": "3.2\"",
    "depthoffieldpreview": "Enabled with Depth-of-field preview button",
    "effectivepixels": "22.3 MP",
    "viewfindertype": "Eye-level pentaprism",
    "maximumburst": "JPEG Large/Fine: Approx. 65 shots (approx. 16270 shots) RAW: Approx. 13 shots (approx. 18 shots) RAW+JPEG Large/Fine: Approx. 7 shots (approx. 7 shots)",
    "model": "EOS 5D Mark III",
    "resolution": "(1) Large: Approx. 22.10 Megapixels (5760 x 3840) (2) Medium: Approx. 9.80 Megapixels (3840 x 2560) (3) S1 (Small 1): Approx. 5.50 Megapixels (2880 x 1920) (4) S2 (Small 2): Approx. 2.50 Megapixels (1920 x 1280) (5) S3 (Small 3): Approx. 350,000 Pixels (720 x 480) (6) RAW: Approx. 22.10 Megapixels (5760 x 3840) (7) M-RAW: Approx. 10.50 Megapixels (3960 x 2640) (8) S-RAW: Approx. 5.50 Megapixels (2880 x 1920) Exact file sizes depend on the subject, ISO speed, Picture Style, etc.",
    "focusingmodes": "Autofocus: - One-Shot AF - Predictive AI Servo AF: (1) For automatic AF point selection, the AF point to start the AI Servo AF operation can be selected. (2) For automatic AF point selection, the active AF point can be displayed. - AI Focus AF: (1) (Switches between One-Shot AF and AI SERVO AF automatically) (2) Automatically set in A+ Auto Mode Manual focus (MF)"
}