{
    "exposurecontrol": "Aperture-Priority (A) Auto Auto (flash off) Manual (M) Programmed Auto with flexible Program (P) Shutter-Priority Auto (S)",
    "battery": "EN-EL14a Rechargeable Li-ion Battery",
    "isosensitivity": "ISO 100 -12,800 Hi-1 (ISO 25,600)",
    "playback": "Auto Image Rotation Full-Frame and Thumbnail (4, 9, or 72 images or calendar) Highlights Histogram Display Image Comment Movie Playback Playback with Zoom Slideshow",
    "recordingmedia": "SD / SDHC /SDXC Card",
    "flashmode": "Auto Auto with red-eye reduction Auto slow sync Auto slow sync with red-eye reduction Fill-flash Rear-curtain sync Rear-curtain with slow sync Red-Eye reduction Red-Eye reduction with slow sync Slow sync Off",
    "effectivepixels": "24.2 MP",
    "focustype": "Nikon Multi-CAM 1000 autofocus sensor module with TTL phase detection",
    "mirror": "Quick-return type",
    "liveviewfunction": "Live View Shooting: Yes Live View Lens servo: Autofocus (AF): Single-servo AF (AF-S); full-time-servo AF (AF-F), Manual focus (MF) Live View AF-area mode: Face-priority AF Wide-area AF Normal-area AF Subject-tracking AF Live View Autofocus: Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected) Live View Scene Auto Selector: Auto mode Auto (flash off) mode",
    "imagetype": "Compressed 12-bit NEF (RAW) JPEG: JPEG-Baseline Compliant with fine (approx 1:4), Normal (approx 1:8) or Basic (approx 1:16) Compression NEF (RAW) + JPEG: Single Photograph Recorded in both NEF (RAW) and JPEG Formats",
    "category": "camera",
    "grosspixels": "24.7 MP",
    "usb": "Yes",
    "batterylife": "700 shots (CIPA)",
    "shutterspeed": "1/4000 to 30 sec.",
    "labor": "1 year",
    "selftimer": "2, 5, 10, 20 sec.; 1 to 9 exposures",
    "magnification": "0.85x (Approx.)",
    "parts": "1 year",
    "flashexposurecompensation": "-3 to +1 EV in increments of 1/3 EV",
    "aelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "movierecording": "HD 1,920x1,080 / 60 fps HD 1,920x1,080 / 50 fps HD 1,920x1,080 / 30 fps HD 1,920x1,080 / 25 fps HD 1,920x1,080 / 24 fps HD 1,280x720 / 60 fps HD 1,280x720 / 50 fps VGA 640x424 / 30 fps VGA 640x424 / 25 fps",
    "afpoints": "11",
    "lensspec": "AF-S DX NIKKOR 18-55mm f/3.5-5.6G VR II",
    "hdmi": "Yes",
    "dustcleaningsystem": "Image sensor cleaning",
    "focuslock": "Focus can be locked by pressing AE-L/AF-L button Focus can be locked by pressing shutter-release button halfway (single-servo AF)",
    "dioptricadjustment": "-1.7 to +0.5m-1",
    "externalflash": "Supported",
    "scenemodes": "Auto Auto [Flash Off] Child Close-up Landscape Night Portrait Portrait Sports",
    "meteringsystem": "TTL exposure metering using 420-pixel RGB sensor",
    "coverage": "95% Horizontal (Approx.)",
    "imagesensorsize": "23.2 mm x 15.4 mm",
    "flashcontrol": "TTL: i-TTL flash control using 420-pixel RGB sensor is available with built-in flash and SB-910, SB-900, SB-800, SB-700, SB-600, SB-400 or SB-300; i-TTL balanced fill-flash for digital SLR is used with matrix and center-weighted metering, standard i-TTL flash for digital SLR with spot metering",
    "lensmount": "Nikon F Bayonet Mount",
    "movieformat": "MOV",
    "eyepoint": "18mm (-1.0m-1)",
    "shuttertype": "Electronically controlled vertical-travel focal-plane",
    "compatiblelenses": "AF NIKKOR for F3AF not Supported. AF-S, AF-I: All Functions Supported. AI-P NIKKOR: All Functions Supported Except Autofocus and 3D Color Matrix Metering II. Electronic rangefinder can be used if Maximum Aperture is f/5.6 or Faster. IX NIKKOR Lenses Cannot be Used. Non-CPU: Autofocus not supported. Can be used in mode M, but exposure meter does not function. Other AF NIKKOR: All Functions Supported Except autofocus and 3D Color Matrix Metering II. Type G or D AF NIKKOR: All Functions Supported Except Autofocus. Type D PC NIKKOR: All Functions Supported Except Autofocus and some Shooting Modes.",
    "exposurecompensation": "+/-5 EV in increments of 1/3EV",
    "imagesensor": "CMOS",
    "maxrecordingresolution": "1920 x 1080",
    "focusingscreen": "Type B BriteView Clear Matte Mark VII screen",
    "fileformat": "Compliant with DCF (Design Rule for Camera File System) 2.0 DPOF (Digital Print Order Format) EXIF 2.3 (Exchangeable Image File Format for Digital Still Cameras)",
    "viewfindertype": "Eye-level Pentamirror Single-Lens Reflex viewfinder",
    "resolution": "DX-format (L) 6,000 x 4,000 (M) 4,496 x 3,000 (S) 2,992 x 2,000",
    "focusingmodes": "Auto AF-S/AF-C selection (AF-A) Continuous-servo (AF-C) Face-Priority AF available in Live View only and D-Movie only Full-time Servo (AF-A) available in Live View only Manual (M) with electronic rangefinder Normal area available in Live View and D-Movie only Predictive focus tracking activated automatically according to subject status Single-servo AF (AF-S) Wide area available in Live View and D-Movie only",
    "avout": "NTSC, PAL"
}