{
    "weight": "8.70 oz.",
    "color": "Red",
    "shutterspeeds": "1/2 - 1/2000 (Night Scene: Longest 4 sec)",
    "effectivepixels": "16MP",
    "imagestabilization": "Sensor-shift",
    "batterytype": "LI-92B",
    "videoformat": "MOV/H.264, AVI/Motion JPEG (High-Speed Movie, Time-Lapse Movie)",
    "category": "camera",
    "videorecording": "1080p, 720p, VGA, Time-Lapse Movie (720p), High-Speed 120fps (640x480), High-Speed 240fps (432x324) *When shooting 1080 60p/1080p/720p movies, use SDHC class6 (speed class)/SDXC class6 or higher for best results.",
    "dimensions": "2.60\" x 4.40\" x 1.20\" (H x W x D)",
    "batterylife": "380 shots; 120 minutes continuous video shooting",
    "feature": "Quick start-up and fast autofocus -courtesy of Olympus iHS and FAST AF technology -ensure you're always ready to shoot. The TG-3 dials up the shutter speed for blur-free action images, thanks to its ultra-bright high-speed f2.0 lens. You can also reduce the ISO to shoot crisp, detailed images with minimal noise in low light, or use the Aperture priority mode to expand the focus range of the background. The TG-3's built-in WiFi and the free Olympus Image Share app turn your smart device into a remote extension of your camera. You can operate the zoom, adjust settings and AF points, and trip the shutter. You can geotag photos and share files with the world. And you can apply custom signatures and stamps to your work. Mount the TG-3 on your bike, kayak or surfboard. Set up Interval Shooting -camera start-up time and intervals between shots (both from 1 second to 24 hours). Snap up to 99 frames. Compile the images automatically into a time-lapse movie lasting up to 10 seconds (720p at 10 fps). Enjoy the oohs and aahs of your friends. If you venture a little too far off the beaten path, your TG-3 can help. Its next-generation GPS accurately locates your position within 10 seconds. Landmark information can be displayed and recorded with every shot. The built-in e.Compass offers information on direction, latitude and longitude as well as elevation and water depth...in case you push the limits to the extreme. Pair the TG-3 with the OLYMPUS Image Track (OI.Track) smartphone app so you can transfer GPS logs and pictures from your camera to your smartphone. The TG-3 offers four macro modes: Microscope, Microscope Control (maximum 44.5x magnification from 1cm), Focus Bracketing and Focus Stacking (multiple images are taken from foreground to background, and the areas in focus are automatically merged into one perfect shot). Add the new LED light guide and you’ve got a complete portable macro set-up.",
    "selftimer": "2 sec, 12 sec, Custom Self-Timer  (1-30 sec start timer, 1-10 pictures, 1-3 sec interval)",
    "playback": "Still Image: Resize, Crop, Red Eye Fix, Shadow Adjustment",
    "aperture": "Wide:  f2.0, f2.8, f8.0 Tele:  f4.9, f6.3, f18.0",
    "brand": "OLYMPUS",
    "dustproof": "Yes",
    "hdmi": "Yes",
    "waterproof": "Submersible down to 50.00'",
    "freezeproof": "Down to 14 degrees F/ -10 degrees C",
    "imagingsensor": "BSI CMOS 1/2.3\"",
    "mediatype": "SD / SDHC / SDXC Memory Card",
    "internalmemory": "36MB",
    "scenemodes": "1. Portrait, 2. ePortrait, 3. Landscape, 4. Interval Shooting, 5. Hand-held Starlight,  6. Night Scene, 7. Night + Portrait, 8. Sport, 9. Indoor, 10. Self Portrait, 11. Sunset, 12. Fireworks, 13. Cuisine, 14. Documents, 15. Beach & Snow, 16. Under Water Snapshot, 17. Under Water Wide1, 18. Under Water Wide2, 19. Under Water Macro, 20. Snow, 21. Panorama, 22. Backlight HDR",
    "part": "V104140RU000",
    "isorange": "ISO 100, 200, 400, 800, 1600, 3200, 6400, AUTO, HIGH",
    "focusmodes": "Face Detection AF, AF Tracking, AF Lock",
    "continuousshooting": "5fps / 100 images (16M); 15fps / 100 images (3M); 60fps / 100 images (3M)",
    "usb": "Yes",
    "stillimagemode": "JPEG",
    "shootingmodes": "Mode Dial: Intelligent Auto (iAUTO), Program Auto (P), Aperture Priority (A), Microscope, Scene Modes (22), Art Filters (11), Photo Story, Custom (C) Microscope Modes: 1. Microscope, 2. Focus Stacking, 3. Focus Bracketing, 4. Microscope Control Scene Modes: 1. Portrait, 2. ePortrait, 3. Landscape, 4. Interval Shooting, 5. Hand-held Starlight, 6. Night Scene, 7. Night + Portrait, 8. Sport, 9. Indoor, 10. Self Portrait, 11. Sunset, 12. Fireworks, 13. Cuisine, 14. Documents, 15. Beach & Snow, 16. Under Water Snapshot, 17. Under Water Wide1, 18. Under Water Wide2, 19. Under Water Macro, 20. Snow, 21. Panorama, 22. Backlight HDR Art Filters: 1. Pop Art, 2. Soft Focus, 3. Pale & Light Color, 4. Grainy Film, 5. Pin Hole, 6. Diorama, 7. Dramatic Tone, 8. Fish Eye, 9. Sparkle, 10. Reflection, 11. Fragmented Picture Modes: Vivid, Natural, Muted",
    "wifi": "The built-in Wireless LAN and free Olympus Image Share (OI.Share) app enable you to: 1) Easily share files (JPEG/MOV) to iOS and Android mobile devices, 2) Geotag photos with GPS location information from iOS and Android mobile devices, 3) Remotely operate the zoom, activate the self-timer, adjust white balance and exposure (ISO, shutter speed, aperture), select the shooting and drive modes, select the AF area, and trip the shutter, all from an iOS and Android mobile device. 4) Apply custom signatures and Art Filters to photos taken and stamps to Photo Story photos.",
    "zoom": "4x Optical Zoom + 2x Super Resolution Zoom + 4x Digital Zoom",
    "whitebalance": "Auto, One-touch, Cloudy, Sunny, Incandescent, Fluorescent, Underwater",
    "shockproof": "Resists drops up to 7.00'/2.1m high",
    "model": "TOUGH TG-3",
    "gps": "Quickly locates position within 10 seconds and is more accurate than ever. Location and landmark information can be viewed and geotagged to photos.",
    "processor": "TruePic VII",
    "avout": "Yes"
}