{
    "weight": "Approx. 8.3oz (loaded and ready) Approx. 7.6oz (without battery and SD memory card)",
    "color": "Black",
    "shutterspeeds": "1/4000 - 1/4sec.(Mechanical and electronic shutter) 1/2000 - 4 sec.(Shutter Priority, Night Scene)",
    "lenstype": "RICOH lens, 9 elements in 7 groups (4 aspherical elements) 4.5 - 18mm (Approx. 25 - 100mm in 35mm format equivalent)",
    "batterytype": "Rechargeable lithium-ion battery D-LI92",
    "category": "camera",
    "videorecording": "1920, 1280",
    "dimensions": "4.90\" x 2.50\" x 1.30\"",
    "batterylife": "Still: Approx. 240 shots (using the rechargeable lithium-ion battery) Playback: Approx. 200 min. (using the rechargeable lithium-ion battery)",
    "flashrange": "Wide:approx. 0.2 - 10.4m / 0.66 - 34 ft. (ISO Auto) Tele:approx. 0.2 - 4.2m / 0.66 - 14 ft. (ISO Auto)",
    "feature": "A Backlit 16 megapixel CMOS sensor, coupled with the new-generation imaging engine delivers a top sensitivity of ISO 6400 New Shutter Priority mode and USER mode means that the WG4 and WG4 GPS are equipped with a total of 29 different shooting modes The triple shake reduction system combines an image-sensor-shift-type SR (Shake Reduction) mechanism with the digital Pixel Track and high ISO Shake Reduction modes An enhanced waterproof construction allows for a depth of 45 feet Shockproof, ruggedized design protects from drops up to 6.5 feet Crushproof construction withstands weights up to 220 LBF (pound-force) Cold-resistant to sub-freezing temperatures of 14 degrees F (minus 10 degrees C) The dustproof design protects the camera from any dry, dusty environments The optical 4X zoom lens offers a high-performance, large aperture of F2.0 Six LED Macro Lights around the circumference of the lens barrel allows for brighter, uniform macro illumination High-resolution 3.0-inch color LCD monitor with approximately 460,000 dots Capture full HD video in widescreen 1080p resolution (1920x1080) with efficient, high quality h.264 compression at 30 frames per second GPS models come equipped with a sophisticated GPS module, which automatically records position data and travel log data onto captured images, as well as offers a built-in digital compass, pressure/altitude/water depth gauge",
    "playback": "Slidshow, Image Rotation, Small Face Filter, Ink Rubbing Filter, Collage, Digital Filter(B&W/Sepica, Toy Camera, Retro, Color, Extract Color, Color Emphasis, High Contrast, Starburst, Soft, Fish-eye, Brightness, Miniature), HDR Filter, Original Frame, Movie Edit, Red-eye Edit, Resize, Cropping, Image Copy, Protect, DPOF, Start-up Screen",
    "aperture": "F2.0(W)~F4.9(T)",
    "focustype": "9-point AF, Spot AF, Auto tracking AF",
    "brand": "Ricoh",
    "dustproof": "Yes",
    "hdmi": "Yes",
    "waterproof": "Yes",
    "freezeproof": "Yes",
    "mediatype": "SD / SDHC / SDXC Memory Card",
    "internalmemory": "70MB",
    "scenemodes": "Auto Picture, Program, Shutter Priority, USER, HDR, Handheld Night Snap, Movie, Digital Microscope, Landscape, Flower, Portrait, Interval Shot, Underwater, Underwater Movie, Interval Movie, High Speed Movie, Time-Lapse Movie, 1cm-Macro Movie, Digital SR, Surf & Snow, Kids, Pet, Sport, Night Scene, Night Scene Portrait, Fireworks, Food, Report, Green",
    "part": "8542",
    "meteringsystem": "Multi-segment metering, Center-weighted metering, Spot AE metering",
    "isorange": "AUTO, Manual (ISO 125 - 6400)",
    "usb": "Yes",
    "flashmodes": "Flash-on and Flash-off modes. \"Red-eye\" compensation function employs a pre-discharge.",
    "zoom": "4X Optical",
    "shockproof": "Yes",
    "model": "WG-4 GPS",
    "whitebalance": "Auto, Daylight, Shade,Tungsten light, Fluorescent light(D:Daylight Color, N:Daylight White, W:White Light), Manual",
    "avout": "Yes"
}