{
    "weight": "Approx. 19.93 oz. (CIPA standard) Approx. 18.35 oz. (Body only)",
    "color": "Black",
    "series": "EOS",
    "packagetype": "Single Lens Kit",
    "mirror": "Quick-return half mirror (transmission: reflection ratio of 40:60)",
    "category": "camera",
    "colorfiltersystem": "RGB primary color filters",
    "grosspixels": "24.70 MP",
    "dimensions": "3.98\" x 5.20\" x 3.07\" (H x W x D)",
    "drivemodes": "Single shooting Continuous shooting Max. approx. 5.0 fps * At 1/500 sec. or faster shutter speed, and at the maximum aperture (varies depending on the lens). Silent single shooting Silent continuous shooting Max. approx. 3.0 fps 10-sec. self timer/remote control 2-sec. self-timer Continuous shooting after 10-sec. self-timer (2 to 10 shots)",
    "selftimer": "10-sec. or 2-sec. Delay",
    "magnification": "Approx. 0.85x / 23.8 degrees (50mm lens infinity, -1 m-1)",
    "focustype": "TTL secondary image-forming, phase-difference detection",
    "afpoints": "19 points All AF points are cross-type at f/5.6 Center AF point is diagonal cross-type at f/2.8",
    "brand": "Canon",
    "dustcleaningsystem": "(1) Self Cleaning Sensor Unit Removes dust adhering to the low-pass filter. Self-cleaning executed automatically (taking approx. 2 sec.) when power is turned on or off. Manual execution also possible (taking approx. 5 sec.). (2) Dust Delete Data acquisition and appending The coordinates of the dust adhering to the low-pass filter are detected by a test shot and appended to subsequent images. The dust coordinate data appended to the image is used by the provided software to automatically erase the dust spots. (3) Manual cleaning",
    "dioptricadjustment": "Adjustable from approx. -3.0 to +1.0 m-1 (dpt)",
    "continuousshootingspeed": "High-speed continuous shooting: Max. approx. 5.0 fps",
    "focusingscreen": "Fixed",
    "part": "0020C003",
    "coverage": "Approx. 95% vertically and horizontally (with Eye point approx. 19mm)",
    "imagesensorsize": "Approx. 22.3mm x 14.9mm (APS-C)",
    "aspectratio": "3:2 (Horizontal : Vertical)",
    "imageprocessor": "DIGIC 6",
    "shutterspeed": "1/4000 to 30 sec., Bulb (total shutter speed range) X-sync at 1/200 sec.",
    "afassistbeam": "Intermittent firing of built-in flash Effective range: Approx. 13.1 ft. / 4m at center, approx. 11.5 ft. / 3.5m at periphery * With an EOS-dedicated Speedlite attached, the Speedlite's AF-assist beam is emitted instead. * Compatible with AF assist-beam (intermittent firing) of 320EX, 270EX II, and 270EX flashes.",
    "brightnessadjustment": "Adjustable to one of seven levels",
    "eyepoint": "Approx. 19 mm (At -1m-1 from the eyepiece lens center)",
    "shuttertype": "Vertical-travel, mechanical, focal-plane shutter with all speeds electronically-controlled * Electronic 1st curtain and mechanical 2nd curtain",
    "viewfinderinformation": "AF information (AF points and focus confirmation light) Exposure information (Shutter speed, aperture, ISO speed (always displayed), AE lock, exposure level, spot metering circle, exposure warning) Flash information (Flash ready, flash exposure compensation, high-speed sync, FE lock, red-eye reduction light) Image information (Highlight tone priority (D+), monochrome shooting, maximum burst (1-digit display), white balance correction, SD card information)",
    "imagesensor": "CMOS",
    "lcdcoverage": "100%",
    "lcd": "3.0\" 1.04M Touch",
    "depthoffieldpreview": "Enabled with depth-of-field preview button",
    "effectivepixels": "24.20 MP",
    "viewfindertype": "Eye-level SLR (with fixed pentamirror)",
    "model": "EOS Rebel T6s",
    "focusingmodes": "(1) Autofocus One-Shot AF Predictive AI Servo AF AI Focus AF (*Switches between One-Shot AF and AI Servo AF) *Switches between One-Shot AF and AI Servo AF (2) Manual focus (MF)"
}