{
    "exposurebracketing": "2 to 9 frames in steps of 1/3, 1/2, 2/3 or 1 EV; 2 to 5 frames in steps of 2 or 3 EV",
    "exposuremode": "Auto modes (auto; auto [flash off]); scene modes (portrait; landscape; child; sports; close up; night portrait; night landscape; party/indoor; beach/snow; sunset; dusk/dawn; pet portrait; candlelight; blossom; autumn colors; food); special effects modes (night vision; color sketch; miniature effect; selective color; silhouette; high key; low key); programmed auto with flexible program (P); shutter-priority auto (S); aperture-priority auto (A); manual (M); U1 (user settings 1); U2 (user settings 2)",
    "exposurecompensation": "Can be adjusted by -5 to +5 EV in increments of 1/3 or 1/2 EV in P, S, A, M, SCENE and night vision modes",
    "reflexmirror": "Quick return",
    "speed": "1/4000 to 30 s in steps of 1/3 or 1/2 EV, bulb, time, X200",
    "monitor": "8-cm/3.2-in., approx. 1229 k-dot (VGA; 640 x RGBW x 480 = 1,228,800 dots), low-temperature polysilicon tilting TFT LCD monitor with approx. 170° viewing angle, approx. 100% frame coverage and brightness and angle adjustment",
    "totalpixels": "24.93 million",
    "diopteradjustment": "-3 to +1 m -1",
    "accessoryterminal": "Wireless remote controllers: WR-1 and WR-R10, Remote cord: MC-DC2, GPS unit: GP-1/GP-1A (all available separately)",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (single-servo AF) or by pressing AE-L/AF-L button",
    "detectionrange": "-3 to +19 EV (ISO 100, 20°C/68°F)",
    "liveviewmode": "Live view photography (still images), movie live view (movies)",
    "adlbracketing": "2 frames using selected value for one frame or 3 to 5 frames using preset values for all frames",
    "communicationsprotocols": "IEEE 802.11b: DSSS/CCK IEEE 802.11g: OFDM",
    "flashreadyindicator": "Lights when built-in flash or optional flash unit is fully charged; blinks after flash is fired at full output",
    "compatiblelenses": "Compatible with AF NIKKOR lenses, including type G, E and D lenses (some restrictions apply to PC lenses) and DX lenses (using DX (24x16) 1.5x image area), AI-P NIKKOR lenses, and non-CPU AI lenses (A and M modes only); IX-NIKKOR lenses, lenses for the F3AF, and non-AI lenses cannot be used The electronic rangefinder can be used with lenses that have a maximum aperture of f/5.6 or faster (the electronic rangefinder supports the 11 focus points with lenses that have a maximum aperture of f/8 or faster)",
    "standards": "IEEE 802.11b, IEEE 802.11g",
    "security": "Authentication: Open system, WPA2-PSK Encryption: AES",
    "audioinput": "Stereo mini-pin jack (3.5-mm diameter; plug-in power supported)",
    "accessoryshoe": "ISO 518 hot-shoe with sync and data contacts and safety lock",
    "weight": "Approx. 840 g/1 lb 13.7 oz with battery and memory card but without body cap; approx. 750 g/1 lb 10.5 oz (camera body only)",
    "flashmode": "Auto, auto with red-eye reduction, auto slow sync, auto slow sync with red-eye reduction, fill-flash, red-eye reduction, slow sync, slow sync with red-eye reduction, rear-curtain with slow sync, rear-curtain sync, off; auto FP high-speed sync supported",
    "effectivepixels": "24.3 million",
    "remotecontrolmodesmll3": "Delayed remote, quick-response remote, remote mirror-up",
    "category": "camera",
    "batterypack": "Optional MB-D16 Multi-Power Battery Pack with one EN-EL15 Rechargeable Li-ion Battery or six R6/AA-size alkaline, Ni-MH or lithium batteries",
    "isosensitivityrecommendedexposureindex": "ISO 100 to 12800 in steps of 1/3 or 1/2 EV; can also be set to approx. 0.3, 0.5, 0.7 or 1 EV (ISO 50 equivalent) below ISO 100 or to approx. 0.3, 0.5, 0.7, 1 or 2 EV (ISO 51200 equivalent) above ISO 12800; auto ISO sensitivity control available",
    "selftimer": "2 s, 5 s, 10 s, 20 s; 1 to 9 exposures at intervals of 0.5, 1, 2 or 3 s",
    "flashcontrol": "TTL: i-TTL flash control using RGB sensor with approx. 91K (91000) pixels is available with built-in flash; i-TTL balanced fill-flash for digital SLR is used with matrix, center-weighted and highlight-weighted metering, standard i-TTL flash for digital SLR with spot metering",
    "tripodsocket": "1/4 in. (ISO 1222)",
    "effectiveangleofview": "Nikon FX format",
    "lensmount": "Nikon F mount (with AF coupling and AF contacts)",
    "wirelesssetup": "Supports WPS",
    "supportedlanguages": "Arabic, Bengali, Bulgarian, Chinese (Simplified and Traditional), Czech, Danish, Dutch, English, Finnish, French, German, Greek, Hindi, Hungarian, Indonesian, Italian, Japanese, Korean, Marathi, Norwegian, Persian, Polish, Portuguese (Portugal and Brazil), Romanian, Russian, Serbian, Spanish, Swedish, Tamil, Telugu, Thai, Turkish, Ukrainian, Vietnamese",
    "builtinflash": "Auto, portrait, child, close up, night portrait, party/indoor, pet portrait, color sketch: Auto flash with auto pop-up P, S, A, M, food: Manual pop-up with button release",
    "imagesensor": "35.9 x 24.0 mm CMOS sensor",
    "suppliedaccessoriesmaydifferbycountryorarea": "EN-EL15 Rechargeable Li-ion Battery, MH-25a Battery Charger, UC-E17 USB Cable, AN-DC14 Camera Strap, BF-1B Body Cap, DK-5 Eyepiece Cap, DK-21 Rubber Eyecup, ViewNX 2 CD-ROM",
    "operatingenvironment": "Temperature: 0 to 40°C/32 to 104°F; humidity: 85% or less (no condensation)",
    "lensaperture": "Instant return, electronically controlled",
    "fileformat": "MOV",
    "battery": "One EN-EL15 Rechargeable Li-ion Battery",
    "metering": "TTL exposure metering using main image sensor",
    "depthoffieldpreview": "Pressing Pv button stops lens aperture down to value selected by user (A and M modes) or by camera (other modes)",
    "rangelineofsight": "Approx. 30 m/98 ft (assumes no interference; range may vary with signal strength and presence or absence of obstacles)",
    "operatingfrequency": "2412 to 2462 MHz (channels 1 to 11)",
    "usb": "Hi-Speed USB; connection to built-in USB port is recommended",
    "audiorecordingformat": "Linear PCM",
    "magnification": "Approx. 0.7x (50 mm f/1.4 lens at infinity, -1.0 m -1 )",
    "meteringmethod": "Matrix, center-weighted or highlight-weighted",
    "dustreductionsystem": "Image sensor cleaning, Image Dust Off reference data (optional Capture NX-D software required)",
    "releasemode": "S (single frame), CL (continuous low speed), CH (continuous high speed), Q (quiet shutter-release), QC (quiet continuous shutter-release), Self-timer, MUP (mirror up)",
    "videocompression": "H.264/MPEG-4 Advanced Video Coding",
    "focusingscreen": "Type B BriteView Clear Matte Mark III screen with AF area brackets (framing grid can be displayed)",
    "whitebalancebracketing": "2 to 3 frames in steps of 1, 2 or 3",
    "flashbracketing": "2 to 9 frames in steps of 1/3, 1/2, 2/3 or 1 EV; 2 to 5 frames in steps of 2 or 3 EV",
    "audiooutput": "Stereo mini-pin jack (3.5-mm diameter)",
    "datarate": "54 Mbps; maximum logical data rates according to IEEE standard; actual rates may differ",
    "type": "Electronically controlled vertical-travel focal-plane shutter",
    "framesizepixelsandframerate": "Actual frame rates for 60p, 50p, 30p, 25p and 24p are 59.94, 50, 29.97, 25 and 23.976 fps respectively; options support both high and normal image quality 1920 x 1080; 60p (progressive), 50p, 30p, 25p, 24p 1280 x 720; 60p, 50p",
    "viewfinder": "Eye-level pentaprism single-lens reflex viewfinder",
    "afareamode": "Face-priority AF, wide-area AF, normal-area AF, subject-tracking AF",
    "exposuremetercoupling": "Combined CPU and AI",
    "flashsyncspeed": "X=1/200 s; synchronizes with shutter at 1/250 s or slower (flash range drops at speeds between 1/200 and 1/250 s)",
    "frameadvancerate": "1 to 6 fps (CL), 6.5 fps (CH) or 3 fps (QC)",
    "maximumlength": "29 min. 59 s (10 or 20 min. depending on frame size/rate and movie quality settings)",
    "hdmioutput": "Type C HDMI connector",
    "nikoncreativelightingsystemcls": "Nikon CLS supported; commander mode option available",
    "media": "SD (Secure Digital) and UHS-I compliant SDHC and SDXC memory cards",
    "accessprotocols": "Infrastructure",
    "syncterminal": "AS-15 Sync Terminal Adapter (available separately)",
    "playback": "Full-frame and thumbnail (4, 9 or 72 images or calendar) playback with playback zoom, movie playback, photo and/or movie slide shows, histogram display, highlights, photo information, location data display and auto image rotation",
    "dimensionswxhxd": "Approx. 140.5 x 113 x 78 mm/5.6 x 4.5 x 3.1 in.",
    "autofocus": "Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected)",
    "lensservo": "Autofocus (AF): Single-servo AF (AF-S); full-time servo AF (AF-F) Manual focus (M)",
    "focuspoint": "Can be selected from 51 or 11 focus points",
    "flashcompensation": "-3 to +1 EV in increments of 1/3 or 1/2 EV",
    "picturecontrolsystem": "Standard, Neutral, Vivid, Monochrome, Portrait, Landscape, Flat; selected Picture Control can be modified; storage for custom Picture Controls",
    "imagesizepixels": "FX (36x24) image area: 6016 x 4016 [L], 4512 x 3008 [M], 3008 x 2008 [S] 1.2x (30x20) image area: 5008 x 3336 [L], 3752 x 2504 [M], 2504 x 1664 [S] DX (24x16) image area: 3936 x 2624 [L], 2944 x 1968 [M], 1968 x 1312 [S] FX-format photographs taken in movie live view: 6016 x 3376 [L], 4512 x 2528 [M], 3008 x 1688 [S] DX-format photographs taken in movie live view: 3936 x 2224 [L], 2944 x 1664 [M], 1968 x 1112 [S] Note: Photographs taken in movie live view have an aspect ratio of 16:9; the camera offers a choice of DX- and FX-based formats",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "activedlighting": "Auto, extra high, high, normal, low, off",
    "eyepoint": "21 mm (-1.0 m -1 ; from center surface of viewfinder eyepiece lens)",
    "acadapter": "EH-5b AC Adapter; requires EP-5B Power Connector (available separately)",
    "guidenumber": "Approx. 12/39, 12/39 with manual flash (m/ft, ISO 100, 20°C/68°F)",
    "rangeiso100f14lens20c68f": "Matrix, center-weighted or highlight-weighted metering: 0 to 20 EV Spot metering: 2 to 20 EV",
    "filesystem": "DCF 2.0, DPOF, Exif 2.3, PictBridge",
    "audiorecordingdevice": "Built-in or external stereo microphone; sensitivity adjustable",
    "framecoverage": "FX (36x24): Approx. 100% horizontal and 100% vertical 1.2x (30x20): Approx. 97% horizontal and 97% vertical DX (24x16): Approx. 97% horizontal and 97% vertical",
    "whitebalance": "Auto (2 types), incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual (up to 6 values can be stored, spot white balance measurement available during live view), choose color temperature (2500 K to 10000 K), all with fine-tuning"
}