{
    "exposurebracketing": "2 – 9 frames, in steps of1/3, 1/2, 2/3, or 1EV, ; 2–5 frames in steps of 2 or 3 EV",
    "isosensitivity": "Exposure modes P, S, and A: Auto ISO sensitivity control (ISO 64 to Hi 2) with selectable upper limit, Exposure mode M: Auto ISO sensitivity control (ISO 64 to Hi 2) available with selectable upper limit; manual selection (ISO 64 to 12800 in steps of 1/3, 1/2, or 1 EV) with additional options available equivalent to approximately 0.3, 0.5, 0.7, 1, or 2 EV (ISO 51200 equivalent) above ISO 12800",
    "exposurecompensation": "–5 – +5EV, in steps of1/3, 1/2, or 1EV",
    "reflexmirror": "Quick-return type",
    "speed": "1/8000–, 30s, in steps of 1/3, 1/2, or 1 EV, bulb, time, X250",
    "monitorresolution": "Approx.1229k-dot, (VGA; 640 x RGBW x 480 = 1,228,800 dots)",
    "sensorsize": "35.9mm, x24.0mm",
    "tenpinremoteterminal": "Can be used to connect optional remote control, optional WR-R10 (requires WR-A10 adapter) or WR-1 wireless remote controller, GP-1/GP-1A GPS unit, or GPS device compliant with NMEA0183 version 2.01 or 3.01 (requires optional MC-35 GPS adapter cord and cable with D-sub 9-pin connector)",
    "totalpixels": "37.09million",
    "diopteradjustment": "-3 – +1m-1",
    "cardslot": "Dual card slots: Either card can be used for primary or backup storage or for separate storage of NEF (RAW) and JPEG images; pictures can be copied between cards.",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (single-servo AF) or by pressing AE-L/AF-L button",
    "detectionrange": "–2 – +19 EV (ISO 100, 20 °C/68 °F)",
    "adlbracketing": "2 frames using selected value for one frame or 3–5 frames using preset values for all frames",
    "monitortype": "TFT monitor with 170 ° viewing angle, approx. 100% frame coverage, and brightness adjustment",
    "flashreadyindicator": "Lights when built-in flash or optional flash unit is fully charged; blinks after flash is fired at full output",
    "compatiblelenses": "Compatible with AF NIKKOR lenses, including type G, E, and D lenses (some restrictions apply to PC lenses) and DX lenses (using DX 24 x 16 1.5X image area), AI-P NIKKOR lenses, and non-CPU AI lenses (exposure modes A and M only). IX NIKKOR lenses, lenses for the F3AF, and non-AI lenses can not be used. The electronic rangefinder can be used with lenses that have a maximum aperture of f/5.6 or faster (the electronic rangefinder supports the 11 focus points with lenses that have a maximum aperture of f/8 or faster).",
    "imagesensorformat": "FX",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button ISO sensitivity (Recommended Exposure Index) ISO 64",
    "audioinput": "Stereo mini-pin jack (3.5 mm diameter; plug-in power supported)",
    "accessoryshoe": "ISO 518 hot-shoe with sync and data contacts and safety lock",
    "weight": "Approx.980g (2 lb 2.6 oz), with battery and SD memory card but without body cap; approx. 880 g/1 lb 15.1 oz (camera body only) Operating environment Operating environment Temperature: 0 °C–40 °C (+32 °F–104 °F) Humidity: 85% or less (no condensation)",
    "liveviewshooting": "Live view photography (still images), Movie live view (movies)",
    "effectivepixels": "36.3million",
    "suppliedaccessories": "Monitor Cover BM-12, Body Cap BF-1B, Rechargeable Li-ion Battery EN-EL15 with terminal cover, Battery Charger MH-25a (comes with either an AC wall adapter or power cable of a type and shape that varies with the country or region of sale), USB Cable Clip, HDMI Cable Clip, USB Cable UC-E22, Strap AN-DC12, ViewNX 2 Installer CD",
    "category": "camera",
    "batterypack": "Optional MB-D12 multi-power battery pack with one rechargeable Nikon EN-EL18a or EN-EL18 Li-ion battery (available separately), one rechargeable Nikon EN-EL15 Li-ion battery, or eight AA alkaline, Ni-MH, or lithium batteries. A BL-5 battery-chamber cover is required when using EN-EL18a or EN-EL18 batteries.",
    "picturecontrolsystem": "Standard, Neutral, Vivid, Monochrome, Portrait, Landscape, Flat, ; selected Picture Control can be modified; storage for custom Picture Controls",
    "isosensitivityrecommendedexposureindex": "ISO64–, 12800, in steps of1/3, 1/2, or 1EV, Can also be set to approx. 0.3, 0.5, 0.7, or 1 EV (ISO 32 equivalent) below ISO 64 or to approx. 0.3, 0.5, 0.7, 1, or 2 EV (ISO 51200 equivalent) above ISO 12800; auto ISO sensitivity control available",
    "autofocussystem": "Nikon Advanced Multi-CAM 3500FX autofocus sensor module with TTL phase detection, fine-tuning, 51 focus points (including 15 cross-type sensors; f/8 supported by 11 sensors), and AF-assist illuminator (range approx. 0.5–3 m/1 ft 8 in.–9 ft 10 in.)",
    "selftimer": "2 s, 5 s, 10 s, 20 s; 1–9 exposures at intervals of 0.5, 1, 2, or 3 s",
    "mode": "Front curtain sync, slow sync, rear-curtain sync, red-eye reduction, red-eye reduction with slow sync, slow rear-curtain sync, off; Auto FP High-Speed Sync supported",
    "tripodsocket": "1/4–in. (ISO 1222)",
    "lensmount": "Nikon F mount, (with AF coupling and AF contacts)",
    "supportedlanguages": "Arabic, Bengali, Bulgarian, Chinese (Simplified and Traditional), Czech, Danish, Dutch, English, Finnish, French, German, Greek, Hindi, Hungarian, Indonesian, Italian, Japanese, Korean, Marathi, Norwegian, Persian, Polish, Portuguese (Portugal and Brazil), Romanian, Russian, Serbian, Spanish, Swedish, Tamil, Telugu, Thai, Turkish, Ukrainian, Vietnamese",
    "imagesensortype": "CMOS",
    "builtinflash": "Manual pop-up with button release and a Guide Number of 12/39, 12/39 with manual flash (m/ft, ISO 100, 20 °C/68 °F)",
    "range": "(ISO 100, f/1.4 lens, 20 °C/68 °F) Matrix, center-weighted, or highlight-weighted metering: 0–20 EV Spot metering: 2–20 EV",
    "operatingenvironment": "Temperature: 0 °C–40 °C (+32 °F–104 °F) Humidity: 85% or less (no condensation)",
    "lensaperture": "Instant return, electronically controlled",
    "fileformat": "MOV",
    "battery": "One rechargeable Li-ion EN-EL15 battery",
    "metering": "TTL exposure metering using main image sensor",
    "depthoffieldpreview": "Yes, Pressing Pv button stops lens aperture down to value selected by user (A and M modes) or by camera (P and S modes)",
    "afareamode": "Face-priority AF, Wide-area AF, Normal-area AF, Subject-tracking AF",
    "usb": "SuperSpeed USB (USB 3.0 Micro-B connector), ;connection to built-in USB port is recommended",
    "audiorecordingformat": "Linear PCM",
    "magnification": "Approx.0.7x, (50 mm f/1.4 lens at infinity, –1.0 m–1)",
    "meteringmethod": "Matrix, center-weighted, or highlight-weighted",
    "dustreductionsystem": "Image sensor cleaning, Image Dust Off reference data (Capture NX-D software required)",
    "videocompression": "H.264/MPEG-4 Advanced Video Coding",
    "focusingscreen": "Type B BriteView Clear Matte Mark VIII screen with AF area brackets (framing grid can be displayed)",
    "whitebalancebracketing": "2 – 9 exposures in steps of 1, 2 or 3",
    "flashbracketing": "2 – 9 frames in steps of 1/3, 1/2, 2/3 or 1 EV, ; 2–5 frames in steps of 2 or 3 EV",
    "audiooutput": "Stereo mini-pin jack (3.5 mm diameter)",
    "type": "Electronically-controlled vertical-travel focal-plane mechanical shutter; electronic front-curtain shutter available in mirror up release mode",
    "framesizepixelsandframerate": "1920 x 1080; 60 p (progressive), 50 p, 30 p, 25 p, 24 p 1280 x 720; 60 p, 50 p Actual frame rates for 60 p, 50 p, 30 p, 25 p, and 24 p are 59.94, 50, 29.97, 25, and 23.976 fps respectively; options support both high and normal image quality",
    "otheroptions": "Index marking, time-lapse photography",
    "viewfinder": "Eye-level pentaprism single-lens reflex viewfinder",
    "control": "TTL: i-TTL flash control using RGB sensor with approximately 91K (91,000) pixels is available with built-in flash; i-TTL balanced fill-flash for digital SLR is used with matrix, center-weighted, and highlight-weighted metering, standard i-TTL flash for digital SLR with spot metering",
    "exposuremetercoupling": "CPU, AI",
    "flashsyncspeed": "X=, 1/250s, ; synchronizes with shutter at 1/320 s or slower (flash range drops at speeds between 1/250 and 1/320 s)",
    "frameadvancerate": "Approx.5fps, With EN-EL15 batteries Image area: FX/5 : 4 CL: 1–5 fps CH: 5 fps QC: 3 fps Image area: DX/1.2X CL: 1–6 fps CH: 6 fps QC: 3 fps Other power sources Image area: FX/5 : 4 CL: 1–5 fps CH: 5 fps QC: 3 fps Image area: DX CL: 1–6 fps CH: 7 fps QC: 3 fps Image area: 1.2X CL: 1–6 fps CH: 6 fps QC: 3 fps",
    "hdmioutput": "Type C HDMI connector",
    "nikoncreativelightingsystemcls": "Nikon CLS supported; commander mode option available",
    "media": "CompactFlash (CF) (Type I, UDMA compliant), SD, SDHC (UHS-I compliant), SDXC (UHS-I compliant)",
    "syncterminal": "ISO 519 sync terminal with locking thread",
    "playback": "Full-frame and thumbnail (4, 9, or 72 images) playback with playback zoom, movie playback, photo and/or movie slide shows, histogram display, highlights, photo information, location data display, and auto image rotation",
    "dimensionswxhxd": "Approx.146, x123, x81.5mm (5.8, x4.9, x3.3in.)",
    "autofocus": "Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected)",
    "lensservo": "Autofocus (AF): Single-servo AF (AF-S); full-time servo AF (AF-F) Manual focus (M)",
    "focuspoint": "Can be selected from 51 or 11 focus points",
    "flashcompensation": "-3 – +1 EV in steps of 1/3, 1/2 or 1 EV",
    "monitorsize": "8cm (3.2–in.) diagonal",
    "imagesizepixels": "FX (36 x 24) image area, (L)7360, x4912, (M)5520, x3680, (S)3680, x2456, 1.2X (30 x 20) image area, (L)6144, x4080, (M)4608, x3056, (S)3072, x2040, DX (24 x 16) image area, (L)4800, x3200, (M)3600, x2400, (S)2400, x1600, 5 : 4 (30 x 24) image area (L) 6144 x 4912 (M) 4608 x 3680 (S) 3072 x 2456 FX-format photographs taken in movie live view (L) 6720 x 3776 (M) 5040 x 2832 (S) 3360 x 1888 DX-format photographs taken in movie live view (L) 4800 x 2704 (M) 3600 x 2024 (S) 2400 x 1352 Note: Photographs taken in movie live view have an aspect ratio of 16 : 9. A DX-based format is used for photographs taken using the DX (24 x 16) 1.5X image area; an FX-based format is used for all other photographs.",
    "meteringsystem": "TTL exposure metering using RGB sensor with approximately 91K (91,000) pixels",
    "activedlighting": "Can be selected from Auto, Extra high, High, Normal, Low, or Off",
    "eyepoint": "17 mm (–1.0 m–1; from center surface of viewfinder eyepiece lens)",
    "acadapter": "EH-5b AC adapter; requires EP-5B power connector (available separately)",
    "modes": "S (single frame), CL (continuous low speed), CH (continuous high speed), Q (quiet shutter-release), Self-timer, MUP (mirror up), Qc (quiet continuous shutter-release)",
    "filesystem": "DCF 2.0, DPOF, Exif 2.3, PictBridge",
    "audiorecordingdevice": "Built-in or external stereo microphone; sensitivity adjustable",
    "framecoverage": "FX (36 x 24): Approx. 100% horizontal and 100% vertical, 1.2X (30 x 20): Approx. 97% horizontal and 97% vertical, DX (24 x 16): Approx. 97% horizontal and 97% vertical, 5:4 (30 x 24): Approx. 97% horizontal and 100% vertical",
    "whitebalance": "Auto (2 types), incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual (up to 6 values can be stored, spot white balance measurement available during live view), choose color temperature (2500 K–10000 K), all with fine-tuning"
}