{
    "nikoncreativelightingsystemcls": "Advanced Wireless Lighting supported with SB-910, SB-900, SB-800 or SB-700 as a master flash and SB-600 or SB-R200 as remotes, or SU-800 as commander; Auto FP High-Speed Sync and modeling illumination supported with all CLS-compatible flash units except SB-400 and SB-300; Flash Color Information Communication and FV lock supported with all CLS-compatible flash units",
    "accessoryshoe": "ISO 518 hot-shoe with sync and data contacts and safety lock",
    "exposurebracketing": "2 to 5 frames in steps of 1/3, 2/3, 1, 2 or 3 EV",
    "weight": "Approx. 765 g/1 lb 11 oz with battery and memory card but without body cap; approx. 710 g/1 lb 9 oz (camera body only)",
    "battery": "One EN-EL14a Rechargeable Li-ion Battery",
    "flashsyncspeed": "X=1/200 s; synchronizes with shutter at 1/250 s or slower",
    "metering": "TTL exposure metering using 2,016-pixel RGB sensor",
    "exposurecompensation": "-3 to +3 EV in increments of 1/3 EV",
    "activedlighting": "Can be selected from Auto, Extra high +2/+1, High, Normal, Low, or Off",
    "depthoffieldpreview": "Pressing Pv button stops lens aperture down to value selected by user (exposure modes A and M) or by camera (exposure modes P and S)",
    "releasemodes": "S (single frame), CL (continuous low speed), CH (continuous high speed), Q (quiet shutter-release), (self-timer), MUP (mirror up)",
    "reflexmirror": "Quick return",
    "speed": "1/4,000 to 4 s in steps of 1 EV (1/4,000 s to 30 s in steps of 1/3 EV with main command dial), X200 (with shutter-speed dial only), bulb, time",
    "hdmioutput": "Type C mini-pin HDMI connector",
    "category": "camera",
    "monitor": "8-cm (3.2-in.), approx. 921k-dot (VGA), low-temperature polysilicon TFT LCD with approx. 170° viewing angle, approx. 100% frame coverage, and brightness control",
    "exposuremetercoupling": "Combined CPU and AI (collapsible metering coupling lever)",
    "suppliedaccessoriesmaydifferbycountryorarea": "EN-EL14a Rechargeable Li-ion Battery, MH-24 Battery Charger, DK-26 Eyepiece Cap, String for eyepiece cap, UC-E6 USB Cable, AN-DC9 Camera Strap, BF-1B Body Cap, BS-1 Accessory Shoe Cover, ViewNX 2 CD-ROM",
    "isosensitivityrecommendedexposureindex": "ISO 100 to 12800 in steps of 1/3 EV; can also be set to approx. 0.3, 0.7 or 1 EV (ISO 50 equivalent) below ISO 100 or to approx. 0.3, 0.7, 1, 2, 3 or 4 EV (ISO 204800 equivalent) above ISO 12800; auto ISO sensitivity control available",
    "media": "SD (Secure Digital) and UHS-I compliant SDHC and SDXC memory cards",
    "selftimer": "2 s, 5 s, 10 s, 20 s; 1 to 9 exposures at intervals of 0.5, 1, 2 or 3 s",
    "syncterminal": "ISO 519 sync terminal with locking thread",
    "magnification": "Approx. 0.7x (50 mm f/1.4 lens at infinity, -1.0 m -1 )",
    "playback": "Full-frame and thumbnail (4, 9 or 72 images or calendar) playback with playback zoom, photo slide shows, histogram display, highlights, photo information, location data display, and auto image rotation",
    "operatingenvironment": "Temperature: 0 to 40°C/32 to 104°F; humidity: 85% or less (no condensation)",
    "totalpixels": "16.6 million",
    "dimensionswxhxd": "Approx. 143.5 x 110 x 66.5 mm/ 5.6 x 4.3 x 2.6 in.",
    "autofocus": "Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected)",
    "type": "Electronically controlled vertical-travel focal-plane shutter",
    "lensservo": "Autofocus (AF): Single-servo AF (AF-S); full-time servo AF (AF-F) Manual focus (M)",
    "accessoryterminal": "Wireless remote controllers: WR-R10 and WR-1 (available separately) Remote cord: MC-DC2 (available separately) GPS units: GP-1/GP-1A (available separately)",
    "focuspoint": "Can be selected from 39 or 11 focus points",
    "afareamodes": "Face-priority AF, wide-area AF, normal-area AF, subject-tracking AF",
    "supportedlanguages": "Arabic, Chinese (Simplified and Traditional), Czech, Danish, Dutch, English, Finnish, French, German, Greek, Hindi, Hungarian, Indonesian, Italian, Japanese, Korean, Norwegian, Polish, Portuguese (Portugal and Brazil), Romanian, Russian, Spanish, Swedish, Thai, Turkish, Ukrainian",
    "flashcompensation": "-3 to +1 EV in increments of 1/3",
    "picturecontrolsystem": "Standard, Neutral, Vivid, Monochrome, Portrait, Landscape; selected Picture Control can be modified; storage for custom Picture Controls",
    "tripodsocket": "1/4 in. (ISO 1222)",
    "imagesizepixels": "FX format (36x24): 4,928 x 3,280 [L], 3,696 x 2,456 [M], 2,464 x 1,640 [S] DX format (24x16): 3,200 x 2,128 [L], 2,400 x 1,592 [M], 1,600 x 1,064 [S]",
    "diopteradjustment": "-3 to +1 m -1",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (single-servo AF) or by pressing AE-L/AF-L button",
    "detectionrange": "-1 to +19 EV (ISO 100, 20°C/68°F)",
    "effectiveangleofview": "Nikon FX format",
    "lensaperture": "Instant return, electronically controlled",
    "focusingscreen": "Type B BriteView Clear Matte Mark VIII screen with AF area brackets (framing grid can be displayed)",
    "fileformat": "NEF (RAW): 12 or 14 bit, lossless compressed, compressed, or uncompressed TIFF (RGB) JPEG: JPEG-Baseline compliant with fine (approx. 1:4), normal (approx. 1:8) or basic (approx. 1:16) compression (Size priority); Optimal quality compression available NEF (RAW)+JPEG: Single photograph recorded in both NEF (RAW) and JPEG formats",
    "adlbracketing": "2 frames using selected value for one frame or 3 to 5 frames using preset values for all frames",
    "whitebalancebracketing": "2 to 3 frames in steps of 1, 2 or 3",
    "flashcontrol": "TTL: i-TTL flash control using 2,016-pixel RGB sensor is available with SB-910, SB-900, SB-800, SB-700, SB-600, SB-400 or SB-300; i-TTL balanced fill-flash for digital SLR is used with matrix and center-weighted metering, standard i-TTL flash for digital SLR with spot metering",
    "lensmount": "Nikon F mount (with AF coupling and AF contacts)",
    "usb": "Hi-Speed USB",
    "eyepoint": "15 mm (-1.0 m -1 ; from center surface of viewfinder eyepiece lens)",
    "acadapter": "EH-5b AC Adapter; requires EP-5A Power Connector (available separately)",
    "flashbracketing": "2 to 5 frames in steps of 1/3, 2/3, 1, 2 or 3 EV",
    "compatiblelenses": "Compatible with AF NIKKOR lenses, including type G, E, and D lenses (some restrictions apply to PC lenses) and DX lenses (using DX 24 x 16 1.5x image area), AI-P NIKKOR lenses and non-CPU lenses. IX NIKKOR lenses and lenses for the F3AF cannot be used. The electronic rangefinder can be used with lenses that have a maximum aperture of f/5.6 or faster (the electronic rangefinder supports the center 7 focus points with lenses that have a maximum aperture of f/8 or faster and the center 33 focus points with lenses that have a maximum aperture of f/7.1 or faster)",
    "meteringmethod": "Matrix: 3D color matrix metering II (type G, E and D lenses); color matrix metering II (other CPU lenses); color matrix metering available with non-CPU lenses if user provides lens data Center-weighted: Weight of 75% given to 12-mm circle in center of frame; diameter of circle can be changed to 8, 15 or 20 mm, or weighting can be based on average of entire frame (non-CPU lenses use 12-mm circle) Spot: Meters 4-mm circle (about 1.5% of frame) centered on selected focus point (on center focus point when non-CPU lens is used)",
    "imagesensor": "36.0 x 23.9 mm CMOS sensor",
    "exposuremodes": "Programmed auto with flexible program (P); shutter-priority auto (S); aperture-priority auto (A); manual (M)",
    "flashreadyindicator": "Lights when optional flash unit is fully charged; flashes after flash is fired at full output",
    "flashmodes": "Front-curtain sync, slow sync, rear-curtain sync, red-eye reduction, red-eye reduction with slow sync, slow rear-curtain sync, Auto FP High-Speed Sync supported",
    "rangeiso100f14lens20c68f": "Matrix or center-weighted metering: 0 to 20 EV Spot metering: 2 to 20 EV",
    "effectivepixels": "16.2 million",
    "filesystem": "DCF (Design Rule for Camera File System) 2.0, DPOF (Digital Print Order Format), Exif (Exchangeable Image File Format for Digital Still Cameras) 2.3, PictBridge",
    "frameadvancerate": "1 to 5 fps (CL) or 5.5 fps (CH)",
    "viewfinder": "Eye-level pentaprism single-lens reflex viewfinder",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "dustreductionsystem": "Image sensor cleaning, Image Dust Off reference data (optional Capture NX 2 software required)",
    "framecoverage": "FX (36x24): Approx. 100% horizontal and 100% vertical DX (24x16): Approx. 97% horizontal and 97% vertical",
    "whitebalance": "Auto (2 types), incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual (up to 4 values can be stored, spot white balance measurement available during live view), choose color temperature (2,500 K to 10,000 K); all with fine-tuning"
}