{
    "userprofiles": "4 Profiles, exportable",
    "exposurebracketing": "3/5 frames, 0.5 / 1 / 2 / 3 f-stops",
    "weight": "680 g (23.9 oz)",
    "powersupply": "Li-ion battery (included), 7.4V, 1800 mAh",
    "opticalviewfinder": "Large, light bright-line rangefinder with automatic parallax compensation, LED illuminated frame lines.",
    "qty": ":",
    "ourprice": ":$7,250.00",
    "exposuresetting": "Manual shutter speed setting with direct dial, A-Mode with direct dial",
    "opticalviewfinderdisplays": "In the viewfinder LED symbol for flash status (at bottom). Four-digit seven-segment LED digital display, brightness adapted to ambient conditions, for: Warning in case of exposure correction; display of automatic shutter speed in automatic mode; advisory indicating use of metering memory lock LED exposure monitor with two triangular and one central circular LED with manual exposure setting",
    "sensitivityrange": "ISO 200 â\u0080\u0093 ISO 6400, Pull 100 available, Auto ISO",
    "colorspaces": "sRGB / AdobeÂ®RGB",
    "sku": ":799429107703",
    "sensorcleaning": "Dust detection, manual cleaning function",
    "microphone": "Mono, stereo microphone adapter optional available",
    "otherfunctions": "Film Modes, Saturation, Contrast, Sharpening",
    "burstrate": "3fps",
    "imagingplatform": "Integrated imaging circuit with Leica MaestroÂ® Image processor",
    "opticalviewfinderframelines": "Framelines size matches image sensor size at 2m focusing distance",
    "flashsynchronization": "Optional triggered at first or second shutter curtain",
    "selftimer": "2s / 12s",
    "opticalviewfindercorrection": "Eyepiece adjusted to -0,5 dpt. Corrective lenses from -3 to +3 dpt. available (optional)",
    "magnification": "0.68x",
    "tripodthread": "A 1/4 (1/4\") DIN made of stainless steel in base plate",
    "filesize": "DNG approx. 20 Mbyte â\u0080\u0093 approx. 30 Mbyte (compressed)/ 48.2 MByte (uncompressed), JPEG: Resolution and image content dependent",
    "newoptionalaccessories": "Electronic Viewfinder (EVF-2), Multifunctional Handgrip M, Handgrip M, SCA Adapter Set for Multi-functional Handgrip M, Power Adapter for Multi-functional Handgrip M, Finger loop for Multi-functional Handgrip M, Size S / M / L, Leica Microphone Adapter Set, Leica M-Adapter R, Ever-Ready Case M, Li-ion Battery BP-SCL2, Battery charger BC-SCL2",
    "movierecording": "Single frame video compression (Motion JPG), Quicktime format (mov)",
    "audiorecording": "Auto level adjustment, manual level adjustment (available while recording), concert preset",
    "stock": ":Out of Stock",
    "category": "camera",
    "accessoriesincluded": "Battery, Charger with power cables for EU and USA (different in some export markets), 12V charging cable, Carrying strap, Accessory port cover, Body cap",
    "rangefindereffectivemeteringbasis": "47.1 mm (mechanical metering basis 69.25 mm x viewfinder magnification 0.68 times)",
    "hotshoe": "SCA-3502 compatible hot shoe, with center contact",
    "flashsynchtime": "1/180s",
    "material": "All-metal case made of die-cast magnesium; synthetic leather covering. Cap and base plate made of brass",
    "electronicviewfinder": "Optional available, can be used for Live View and Play functionality",
    "rangefinder": "Split or superimposed image range finder shown as a bright field in the center of the viewfinder image",
    "moviesamplingrate": "25 fps, 24 fps, 30 fps (VGA only)",
    "storagemedia": "SD / SDHC / SDXC Memory Cards",
    "lensmount": "Leica M bayonet with additional sensor for 6-bit coding",
    "lcdmonitor": "3â\u0080\u009d TFT Display with 920.000 Pixels, scratch resistant cover glass (CorningÂ®GorillaÂ®Glass)",
    "shutterspeed": "1/4000s â\u0080\u0093 60s (in Bulb), 1/180s flash synchronization",
    "flashexposuremetering": "Control with center-weighted TTL pre-flash metering (with SCA-3501/3502 adapter, or SCA-3000 standard flash unit such as Leica SF24D/Leica SF 58).",
    "dimensions": "approx. 139 x 42 x 80 mm (5.5 x 1.7 x 3.1 in.)",
    "operatingtemperature": "0Â°C â\u0080\u0093 40Â°C",
    "cameratype": "Compact digital view- and rangefinder system still and video camera",
    "imagesensor": "LEICA MAX 24 MP CMOS Sensor",
    "exposuremodes": "Automatic shutter speed (A-Mode), Manual Exposure (M-Mode)",
    "lenssystem": "Leica M lenses, Leica R lenses with optional Leica R-Adapter M",
    "whitebalance": "Auto / Daylight / Cloudy / Shadow / Tungsten / Fluorescent warm /Fluorescent cool / Flash / Manual (Greycard) / Kelvin 2000-13100",
    "shutter": "Dual type focal plane shutter for classic image exposure and Live view",
    "compensation": "-3 EV to +3 EV, 1/3 f-stops",
    "imagefileformat": "DNGâ\u0084¢ (RAW data uncompressed or lossless compressed), JPEG",
    "availablejpgresolutions": "5952px*3976px (24 MP), 4256px*2832px (12 MP)/ 2976px*1984px (6MP) / 1600px*1080px (1,7MP)",
    "horizon": "Yes",
    "menulanguages": "English, German, French, Italian, Spanish, Russian, Japanese, Traditional Chinese, Simplified Chinese",
    "exposuremetering": "In classic viewfinder mode: Through the Lens (TTL) metering, center weighted with variable aperture.  In Live View and advanced viewfinder mode: Through the Lens (TTL) metering, center weighted, spot or multifield measuring.  Center-weighted TTL metering for flash exposure with system conformant SCA-3000/2 standard flash units.",
    "numberofeffectivepixels": "24 Million Pixels",
    "focusingmethods": "Manual focus with optical rangefinder, Live View, 100% Live View Zoom, Live View focus peaking",
    "topcover": "Milled brass top cover with integrated thumb rest",
    "movieresolution": "1080p, 720p, 640*480 (VGA)"
}