{
    "userprofiles": "4 Profiles",
    "exposurebracketing": "3/5/7 frames, 0.5 / 1 / 1.5 / 2 f-stops",
    "weight": "585 g (20.6 oz)",
    "powersupply": "Li-ion battery (included), 3.7V, 1860 mAh",
    "opticalviewfinder": "Large, light bright-line rangefinder with automatic  parallax compensation, optical illumination",
    "qty": ":",
    "ourprice": ":$5,450.00",
    "exposuresetting": "Manual shutter speed setting with direct dial, AMode  with direct dial",
    "opticalviewfinderdisplays": "In the viewfinder LED symbol for flash status (at  bottom). Four-digit seven-segment LED digital  display, brightness adapted to ambient  conditions, for: Warning in case of exposure  correction; display of automatic shutter speed in  automatic mode; advisory indicating use of  metering memory lock. LED exposure monitor  with two triangular and one central circular LED  with manual exposure setting",
    "sensitivityrange": "ISO 160 â\u0080\u0093 ISO 2500, Pull 80 available, Auto ISO",
    "colorspaces": "sRGB / AdobeÂ®RGB",
    "sku": ":799429107598",
    "sensorcleaning": "Manual cleaning function",
    "otherfunctions": "Saturation, Contrast, Sharpening",
    "burstrate": "approx. 2 fps",
    "imagingplatform": "DSP based computing platform with Leica imaging algorithms",
    "opticalviewfinderframelines": "Framelines size matches image sensor size at 1m  focusing distance",
    "flashsynchronization": "Optional triggered at first or second shutter  curtain",
    "selftimer": "Off / 2s / 12s",
    "opticalviewfindercorrection": "Eyepiece adjusted to -0.5 dpt. Corrective lenses  from -3 to +3 dpt. available (optional)",
    "magnification": "0.68x",
    "tripodthread": "A 1/4 (1/4\") DIN made of stainless steel in base plate",
    "filesize": "DNG: 18 MB (compressed)/36 MB (uncompressed), JPEG: Resolution and image content dependent",
    "stock": ":Out of Stock",
    "category": "camera",
    "accessoriesincluded": "Battery, Charger with power cables for EU and  USA (different in some export markets), 12V  charging cable, Carrying strap, Body cap",
    "rangefindereffectivemeteringbasis": "47.1 mm (mechanical metering basis 69.25 mm  x viewfinder magnification 0.68 times)",
    "hotshoe": "SCA-3502 compatible hot shoe, with center  contact",
    "flashsynchtime": "1/180s",
    "material": "All-metal case made of die-cast magnesium; synthetic leather covering. Cap and base plate made of brass",
    "rangefinder": "Split or superimposed image range finder shown  as a bright field in the center of the viewfinder  image",
    "storagemedia": "SD / SDHC Memory Cards",
    "lensmount": "Leica M bayonet with additional sensor for 6-bit coding",
    "lcdmonitor": "2,5â\u0080\u009d TFT Display with 230.000 Pixels",
    "shutterspeed": "1/4000s â\u0080\u0093 240s (in Bulb), 1/180s flash synchronization",
    "flashexposuremetering": "Control with center-weighted TTL pre-flash  metering (with SCA-3501/3502 adapter, or SCA-  3000 standard flash unit such as Leica SF  24D/Leica SF 58).",
    "dimensions": "(W x D x H) approx. 139 x 37 x 80 mm  (5.5 x 1.7 x 3.1 in.)",
    "operatingtemperature": "0Â°C â\u0080\u0093 40Â°C",
    "cameratype": "Compact digital view and rangefinder system still  camera",
    "imagesensor": "KAF -18500 18 MP CCD Sensor",
    "exposuremodes": "Automatic shutter speed (A-Mode), Manual  Exposure (M-Mode)",
    "lenssystem": "Leica M lenses",
    "whitebalance": "Auto / Daylight / Cloudy / Shade /Tungsten /  Fluorescent 1 / Fluorescent 2 / Flash / Manual  / Kelvin 2000-12800",
    "shutter": "Closed type focal plane shutter for classic image exposure, with external cocking mechanics",
    "compensation": "-3 EV to +3 EV, 1/3 f-stops",
    "imagefileformat": "DNGâ\u0084¢ (RAW data uncompressed or nonlinear compressed), JPEG",
    "availablejpgresolutions": "5212 x 3472 (18 MP), 3840 x 2592 (10 MP),  2592 x 1728 (4.5 MP), 1728 x 1152 (2 MP),  1280 x 846 pixels (1 MP)",
    "menulanguages": "English, German, French, Italian, Spanish,  Russian, Japanese, Traditional Chinese, Simplified  Chinese",
    "optionalaccessories": "All accessories that are made for the Leica M9/",
    "exposuremetering": "Through the Lens (TTL) metering, centerweighted with variable aperture Center-weighted TTL metering for flash exposure with system-conformant SCA- 3000/2 standard flash units",
    "numberofeffectivepixels": "18 Million Pixels",
    "focusingmethods": "Manual focus with optical rangefinder",
    "topcover": "Milled brass top cover with classic Leica M design"
}