{
    "flashconnection": "Hot shoe with centre and control contacts",
    "weight": "20.6 oz (including battery)",
    "viewfinderprinciple": "Large size, bright, combined bright-line viewfinder / rangefinder with automatic parallax compensation",
    "powersupply": "1 rechargeable lithium-ion battery, nominal voltage 3.7 V, capacity 1900 mAh. Charge level displayed on monitor screen, when shutter locked in open position (for sensor cleaning), additional acoustic warning signal for insufficient charge.",
    "shutterspeeds": "In aperture priority automatic mode (A) continuous from 32 s to 1/4000 s. in manual mode, 8 s to 1/4000 s in half increments, B for arbitrary long exposure times (in conjunction with delayed release T function, i.e. 1st release = shutter opens, 2nd release = shutter closes, (1/180 s) fastest shutter speed for flash synchronization",
    "qty": ":",
    "sensitivityrange": "ISO 80/19Â° to ISO 2500/35Â°, selectable in 1/3 ISO increments, in aperture priority automatic mode A and manual exposure setting, optional automatic control or manual selection, automatic control in snapshot mode",
    "displaysinflashmode": "Flash ready: constant illumination of flash symbol LED in the viewfinder, flash confirmation: Constant illumination or rapid flashing of the LED after exposure, underexposure indicated by temporarily extinguished LED",
    "imagefileformats": "DNGâ\u0084¢ (RAW data), optionally uncompressed or slightly compressed (by non-linear reduction of color depth), 2 JPEG compression levels",
    "camerapoweronpoweroff": "Main switch located on the top deck, optional sleep mode for camera electronics after 2 / 5 / 10 minutes, reactivation by slight pressure to shutter release button.",
    "colorspaces": "AdobeÂ® RGB, sRGB",
    "eyepiece": "Adjusted to -0.5 dioptres Correction lenses for â\u0080\u00933 to +3 dptr. available",
    "sku": ":799429107048",
    "continuousshooting": "Approx. 2 frames/s, = 8 frames in sequence",
    "batterycharger": "Inputs: 100â\u0080\u0093240 V AC, 50/60 Hz, automatic adaptation, or 12/24 V DC Output: 4.2 V DC, 800 mA.",
    "packageincludes": "Battery charger 100â\u0080\u0093240 V with two power cords (Euro, USA, may differ for other export markets) and one car charging cable, lithium-ion battery, USB cable, carrying strap.",
    "imagefieldframing": "By projection of two bright-line frame with each lens attached: for 35 and 135 mm, or for 28 and 90 mm, or 50 and 75 mm. Automatically displayed when lens mount locks. Any of the pairs of bright-line frames can be displayed by moving the frame selection lever.",
    "operatingconditions": "0 to +40Â°C",
    "supportedresolutions": "DNGâ\u0084¢: 5212 Ã\u0097 3472 (18 MP) JPEG: 5212 Ã\u0097 3472 (18 MP), 3840 Ã\u0097 2592 (10 MP),    2592 Ã\u00971728 (4.5 MP), 1728 Ã\u00971152 (2 MP), 1280 x 846 pixels (1 MP).",
    "tripodthread": "A 1/4 (1/4 â\u0080\u009c) DIN, stainless steel, integrated in base plate",
    "flashmeteringcell": "2 silicon photodiodes with condenser lens in camera base",
    "stock": ":Out of Stock",
    "category": "camera",
    "displaysontheback": "2.5\" monitor (colour TFT-LCD) with 230,000 pixels",
    "filesizes": "DNGâ\u0084¢: 18 MB (compressed) 36 MB (uncompressed) JPEG: approx. 2 to 10 MB, (depending on image content)",
    "longbaserangefinder": "Bright rectangular spot (RF spot) with coincident and superimposed rangefinder in the center of the viewfinder",
    "shutterrelease": "Three steps: activation of metering â\u0080\u0093 store metering values (in aperture priority automatic mode) â\u0080\u0093 shutter release. Standard internal threading for remote release.",
    "interface": "5-pin Mini-USB 2.0 high-speed socket for fast data transfer",
    "storagemedia": "SD cards up to 2 GB / SDHC cards up to 32 GB",
    "lensmount": "Leica M bayonet with additional sensor for 6-bit coding.",
    "compatibility": "WindowsÂ® XP/VistaÂ®; MacÂ® OS X (10.5)",
    "manufacturer": ":Leica",
    "viewfinderdisplays": "(Lower edge) LED symbol for flash status; four-digit, seven-segment digital LED display with dots above and below, display brightness adjusted for ambient light, for exposure correction warnings, display of automatically determined shutter speed in aperture priority automatic mode, exposure value lock indicator, out of metering range warning in aperture priority automatic mode and countdown display for shutter speeds longer than 2 s. LED light balance with two triangular and one round, central LED in manual exposure mode. The triangular LEDs show the required directions for turning the aperture ring or the shutter speed dial to correct the exposure setting. They also warn of light levels that are above or below the metering range.",
    "cameratype": "Compact digital rangefinder system camera",
    "effectiverangefinderbase": "47.1 mm (actual base length 69.25 mm Ã\u0097 viewfinder magnification 0.68Ã\u0097)",
    "exposuremodes": "Optional automatic determination of shutter speeds with preselected apertures â\u0080\u0093 aperture priority automatic mode A â\u0080\u0093 with corresponding digital display, or manual selection of shutter speed and aperture and balance by means of an LED light balance with correct exposure display, or over exposure /  camera shake trend prevention (snapshot mode only)",
    "lenssystem": "Leica M lenses from 16 to 135 mm.",
    "flashexposurecorrection": "Â±3 1/3 EV in 1/3 EV increments, adjustable on SCA-3501/3502 adapter Settings in computer mode for LEICA SF 24D, Â±3 EV in 1/3 EV increments, or from 0 to â\u0080\u00933 EV in 1 EV increments / adjustable in all modes for LEICA SF 58, Â±3 EV in 1/3 EV increments",
    "ourprice": ":$6,995.00",
    "shutter": "Microprocessor-controlled, particularly low-noise, metal-leaf, vertical focal-plane shutter",
    "camerabody": "Full-metal body in die cast magnesium alloy with cataphoretic paint finish and artificial leather trim; Brass top deck and base plate, black or steel-grey finish.",
    "exposuremetering": "Through-the-lens (TTL) metering, center-weighted at working aperture Center-weighted TTL metering for flash exposure with dedicated SCA-3000/2 standard flash units.",
    "menulanguages": "German, English, French, Spanish, Italian, Japanese, traditional Chinese, simplified Chinese, Russian",
    "whitebalance": "Automatic, manual, 7 presets, direct color temperature selection"
}