{
    "meteringrange": "With aperture 1.0 / ISO 320/26Â°: EV 1 to 21  Flashing of the left-hand triangular LED in the viewfinder indicates  that the brightness reflected is below the metering range.",
    "viewfinderprinciple": "Large, light bright-line rangefinder with automatic parallax  compensation.",
    "powersupply": "One lithium-ion rechargeable battery, rated voltage 3.7 V, capacity  1900 mAh. Capacity display in monitor; with shutter held open (for  sensor cleaning) additional acoustic warning of low capacity.",
    "shutterspeeds": "In automatic mode (A) steplessly from 32 s to 1/4000 s. Using  manual setting 8 s to 1/4000 s in half steps, B for long exposures  up to max. 240 s 1/180 s fastest shutter speed for flash  synchronization.",
    "qty": ":",
    "displaysinflashmode": "Ready: By the flash symbol LED in the viewfinder being constantly  lit; confirmation of success: By the LED remaining lit or flashing  rapidly for a while after taking the picture; underexposure display  by the LED going out for a while.",
    "sensitivityrange": "ISO 320/26Â° to ISO 10000/41Â°, adjustable in 1/3-ISO stages, with  automatic timer (A) and manual exposure setting, optionally  automatic control or manual adjustment. ISO 160 additionally  available as pull function.",
    "resolutions": "Adjustable, DNGâ\u0084¢: 5212 x 3468 (18 megapixels), JPEG: 5216 x  3472 (18 megapixels), 3840 x 2592 (10 megapixels), 2592 x 1728  (4.5 megapixels), 1728 x 1152 (2 megapixels), 1280 x 864 (1  megapixel).",
    "colorspaces": "sRGB preset",
    "eyepiece": "Adjusted to -0.5 dpt. Corrective lenses from -3 to +3 dpt. available.",
    "sku": ":799429107604",
    "selftimer": "Delay optionally 2 (aperture priority and manual exposure setting)  or 12 s (menu setting), indicated by flashing LED on front of  camera and corresponding display on the monitor.",
    "batterycharger": "Inputs: 100-240 V AC, 50/60 Hz, automatic switching, or 12/24V  DC; Output: 4.2 V DC, 800 mA.",
    "operatingconditions": "0 to +40Â°C",
    "magnification": "(With all lenses) 0.68 times.",
    "tripodthread": "A 1/4 (1/4 â\u0080\u009c) DIN, stainless steel, integrated in base plate",
    "flashexposuremetering": "Control with center-weighted TTL pre-flash metering (with SCA-  3501/3502 adapter, or SCA-3000 standard flash unit such as  Leica SF 24D/Leica SF 58).",
    "flashexposurecompensation": "Â±3 1/3-EV in 1/3-EV stages adjustable at SCA-3501/3502 adapter.  On the Leica SF 24D with computer control it is possible to  program Â±3 EV in 1/3-EV stages, or from 0 to -3 EV in 1-EV  stages; on the Leica SF 58 Â±3 EV can be programmed in 1/3-EV  stages in all modes.",
    "dimensionswxdxh": "Approx. 139 x 37 x 80 mm (5.5â\u0080\u009d x 1.5â\u0080\u009d x 3.2â\u0080\u009d)",
    "stock": ":Out of Stock",
    "category": "camera",
    "displaysontheback": "2.5\" monitor (color TFT LCD) with 230,000 pixels",
    "filesizes": "DNGâ\u0084¢: 18 MB (compressed), 36 MB (uncompressed), JPEG:  approx. 2â\u0080\u009310 MB.",
    "shutterrelease": "Three-stage: Exposure metering on â\u0080\u0093 Metering memory lock (in  aperture priority mode) â\u0080\u0093 Shutter release. Integrated standard  cable release thread.",
    "interface": "5-pin Mini-USB 2.0 high-speed port for fast data transfer",
    "storagemedia": "SD cards up to 2 GB, SDHC cards up to 32 GB.",
    "lensmount": "Leica M bayonet with additional sensor for 6-bit coding.",
    "compatibility": "WindowsÂ® 7 SP1, WindowsÂ® VistaÂ® SP2, Windows XP SP2,  MacÂ® OS X 10.6.8 (Snow Leopard) or higher.",
    "manufacturer": ":Leica",
    "cameratype": "Compact digital rangefinder system camera with black-and-white sensor",
    "imagesensor": "Active area approx. 23.9 x 35.8 mm, 5212 x 3468 pixels (18  megapixels). Infrared filter for non-visible spectrum over 700nm,  no low-pass filter",
    "exposuremodes": "Automatic timer (A) / Manual (M)",
    "lenssystem": "Leica M lenses from 16 to 135 mm.",
    "shutter": "Microprocessor-controlled, ultra-quiet metal leaf slotted shutter with vertical movement.",
    "menulanguages": "German, English, French, Spanish, Italian, Japanese, Traditional  Chinese, Simplified Chinese, Russian.",
    "packagecontents": "100 - 240 V charger with two power cables (EU, USA; some export  markets differ) and one vehicle charging cable; lithium-ion battery;  USB cable; real-leather carrying strap; original Leica Monochrom  print of a campaign motif; user manual; information material for  registration and software downloading",
    "exposuremetering": "Through the Lens (TTL) metering, center-weighted with variable  aperture. Center-weighted TTL metering for flash exposure with  system-conformant SCA-3000/2 standard flash units.",
    "ourprice": ":$7,950.00"
}