{
    "category": "camera",
    "angleofview": "24°",
    "weight": "1.38 lb (625 g)",
    "minimumfocusdistance": "1' (30.48 cm)",
    "dimensionsdxl": "Approx. 3.06 x 4.84\" (7.77 x 12.29 cm)",
    "focallength": "100 mm",
    "filterthread": "67 mm",
    "formatcompatibility": "35mm Film / Full-Frame Digital Sensor Canon (APS-C)",
    "magnification": "1x",
    "diaphragmblades": "9",
    "groupselements": "12/15",
    "imagestabilization": "Yes",
    "leftbardescstart": "3554B005 Browse Our Store Store home Point & Shoot Cameras Pro. SLR Cameras Digital Camera Lenses Camcorders Projectors GPS Navigation Home audio Blu-ray / DVD PlayersLeft Bar Desc //End !Right Bar Desc //Start !Canon EF 100mm f/2.8L Macro IS USM Lens New, Never Opened Convenient Tele-Macro Focal Length Life-Size (1:1) Magnification Ultrasonic Motor (USM) L-Series Quality Optical Image Stabilization (IS) Compatible with all Canon EOS Cameras Canon             EF 100mm f/2.8L Macro IS USM Lens Front & Rear Lens Caps Lens Hood Lens Pouch Canon EF 100mm f/2.8L Macro IS USM ... SPECIFICATIONS Performance Focal Length 100 mm Aperture Maximum: f/2.8Minimum: f/32 Camera Mount Type Canon EF Format Compatibility 35mm Film / Full-Frame Digital Sensor Canon (APS-C) Angle of View 24° Minimum Focus Distance 1' (30.48 cm) Magnification 1x Maximum Reproduction Ratio 1:1 Groups/Elements 12/15 Diaphragm Blades 9 Features Image Stabilization Yes Autofocus Yes Tripod Collar Optional Physical Filter Thread 67 mm Dimensions (DxL) Approx. 3.06 x 4.84\" (7.77 x 12.29 cm) Weight 1.38 lb (625 g) Back to Top CN10028LUSMIS TERMS AND CONDITIONS We usually ship within 1 business day after receiving payment. Please be aware that weekends are not business days. All express methods of shipment still may require 1 day of processing time. Canadians and international buyers are responsible for all duties, customs charges, and/or brokerage fees. We cannot ship as a gift, or claim as lower value. New Jersey buyers are responsible for applicable sales tax. We ship everything professionally in our state of the art warehouse. All products we sell are brand new and includes warranty coverage unless clearly specified on the listing. \"Free Shipping\" applies to orders shipped within the continental US. Domestic orders ship FedEx, UPS, and USPS. Our packages are insured and may require a signature. In accordance with PayPal and eBay policies, we cannot reroute your package to a different address or hold your shipment at the local hub for pick up, your order must be delivered to the confirmed PayPal address received with your purchase. We cannot change your address before the order ships. Please do not submit handling instructions in the notes of your order requesting special handling, a specific courier or a change of address, as we will be unable to meet these requests. We reserve the right to cancel any orders addressed to P.O. boxes, freight forwarders, or resellers. We do not offer price protection if the price of an item that you purchased. Prices do change frequently. We reserve the right to cancel orders placed without a registered eBay or PayPal account. Orders placed by eBay guest checkout require additional verification and may be delayed. Orders placed without a registered PayPal account cannot be accepted and will be cancelled and refunded upon receipt. We offer a customer 30 day return privilege policy. A Return Merchandise Authorization (RMA) number must be obtained for any return. To obtain an RMA number, please call us toll free at 866-673-7187 . Returned packages without proper RMA demarcations will be refused by our warehouse and returned to you. Customers who refuse a delivery, will be subject to charges for return shipping to us. If the item was advertised as Free Shipping, then we will charge the amount of shipping as determined by the FedEx shipping calculator. Some returns are subject to a restocking fee. The restocking percentage will depend on the condition of the returned product. Defective products are eligible for exchange, and no restock fee will apply. All returns must be packed with all contents which came with the original package including, cables, software, plastic and cardboard packaging, and unregistered warranty card. This return policy excludes Televisions and Home Theater Projectors. For further questions please call us toll free at 866-673-7187 . You can also contact us using the contact form found  here. Return shipping costs are not reimbursable. International Customers: All electronic products are packaged for sale in the US with US Voltage. View International Policies Back to Top CONTACT INFO AND STORE HOURS ANY QUESTIONS? CALL US TOLL FREE: +1-866-673-7187 STORE HOURS: Monday - Friday 10:00AM to 3:00PM EST Saturday - Sunday: Closed Email us anytime! Back to TopRight Bar Desc //End !",
    "aperture": "Maximum: f/2.8Minimum: f/32",
    "autofocus": "Yes",
    "cameramounttype": "Canon EF",
    "maximumreproductionratio": "1:1",
    "tripodcollar": "Optional"
}