{
    "flashtype": "Pop-up flash",
    "color": "Black",
    "compatibilitynotes": "Android Jelly Bean (v4.3): Do more than ever with the Android-powered GALAXY Camera 2, now upgraded with the latest version of Jelly Bean: 4.3. Powered by a 1.6GHz quad-core processor—and featuring numerous camera and social networking apps—it does what conventional cameras and smartphones cannot. Like capturing brilliant images, even in low-lit settings, and saving photos to your PC and smartphone without having to use an SD card. Plus you can edit right on the display, and wirelessly upload to Facebook and Instagram. 4.8” HD Super Clear Touch Display: Now you don’t have to wait until you get back home to properly review and edit your photos. The GALAXY Camera 2’s 121.2mm (4.8\") HD Super Clear Touch Display is what a camera display was meant to be, with an ultra sharp 308 pixels per inch and the full spectrum of glorious colors. And with the new White Magic Technology, you can even double the brightness without worrying about battery consumption. And why not view your HD movies at a golden 16:9 ratio- Perfect. 21x Optical Super Long Zoom: Save the digital zoom for editing afterwards. GALAXY Camera 2’s 21x Super Long Zoom is 100 percent optical. With the intuitive Pinch Zoom, you can zoom in and out by simply pinching two fingers on the screen. Both the 21x Super Long Zoom and Pinch Zoom help get you as close as possible to your subject while maintaining the same crystal-clear image sharpness you experience with subjects nearer to the camera. Smart Mode: top being jealous of the pros with their big cameras, and start taking great shots. Like the perfect trails of light at night on a busy intersection full of red taillights. Or instantly capture a high-speed scene with Action Freeze. A quick tap of Smart Mode, and you’re set with various special modes. Just choose the one you want and shoot perfection. Smart Mode Suggest: Stop worrying about settings, and start taking professional-quality artistic shots. A quick tap of the Smart Mode button gives you access to a wide range of special modes. Use Drama Shot to merge continuous shots of moving objects into a single composed image, or Action Freeze to instantly capture high-speed action. Using Light Trace, unleash your inner Picasso and have your subject draw with a handheld light to capture prolonged exposure effects. Multi Exposure shot lets you blend two shots into a single beautifully composed image. You can also record sound to your photo to relive the moment exactly how it happened with Sound & Shot. Just choose the mode you want and go. Photo Beam: When a friend wants a copy of that really great shot you took of her, now you can share it right away. Samsung Photo Beam lets you send photos to anybody with just the touch of your camera. Simply tap your SMART CAMERA on any NFC-compatible smartphone to automatically share whichever image you’re currently viewing. It’s that simple. AutoShare: Save every photo you take with your smartphone. After you set it up, Samsung AutoShare will automatically send every snap instantly to your smartphone or tablet via Wi-Fi that is powered by NFC technology. Using your smartphone, AutoShare also GPS-tags your photos. Sharing your treasured memories couldn’t be any faster—or easier. Remote View Finder: Control your camera by using your smartphone as the viewfinder. The NFC-enabled Remote Viewfinder lets you preview photos, adjust camera settings, zoom in and out, and frame each scene—all from your phone wirelessly. Available for select smartphones, this feature also GPS-tags your photos using your smartphone. Mobile Link: Now you can select and send photos or albums directly to a smartphone or tablet with Samsung Mobile Link. No Wi-Fi hotspot is required; the wireless connection is enabled by NFC technology. You don't even have to send the photos as a text message or an email. With Mobile Link, you can control the album on your phone and the changes will be saved to your camera, too. Group Share: From family brunches to nights out with friends, you can take the shots that all your friends and family members want copies of with your Samsung SMART CAMERA. Use Group Share to send images to up to four people simultaneously. Since Group Share eliminates the frustration of having to repeat the sharing process over and over again, you have more time for taking share-worthy snaps. Wi-Fi Social Sharing: Show off a fabulous selfie with the rest of the world in no time flat. As long as you have a Wi-Fi connection, you can post images and videos directly to Facebook, YouTube, and now Flickr. Tag and add comments, too. You can also upload photos right to your blog, or email them to your family. Feel free to keep shooting, because your SMART CAMERA also comes with 2GB of free Dropbox web storage or 50GB if you have a GALAXY smartphone. PC Auto Backup: Wirelessly transfer photos and movies to your PC or Mac. Simply select PC Auto Backup and you're all set. All your photos and videos are wirelessly transferred and safely stored on your computer. Feel free to delete photos from your camera knowing there's a duplicate set on your computer. Samsung Link: Effortlessly save every moment you’ve captured. Samsung Link instantly and wirelessly streams your photos your PC or favorite web storage service such as Dropbox. No more waiting to go home to manually upload images. With one touch, you can show off photos and videos on your Smart TV or send them to any compatible smartphone. Sharing has never been this easy. Selfie Alarm: You are the star of your selfie. So why use a smartphone camera when you can snap a high-resolution 20MP self-portrait with the GALAXY Camera 2 instead- It’s easier than you’d expect, thanks to the Selfie Alarm feature. Simply hold up the camera and face it, and Selfie Alarm automatically shoots five images in a row. Choose your fave of the batch and make it your Facebook profile picture. Story Album: Timeless memories: now available in real time. The GALAXY Camera 2’s Story Album function lets you create, display and print photo albums of family gatherings, vacations, sporting events or any other experience that’s worth sharing. Story Album organizes photos into timelines, and reframes and resizes them to create digital photo books that you can display on your camera’s screen—or send anywhere for recipients to view on their own devices.",
    "opticalzoom": "21 X",
    "contents": "camera, battery, hand strap, USB power adapter, USB cable, documentation",
    "portsconnectors": "(1) HDMI (1) USB 2.0",
    "category": "camera",
    "specialeffects": "Sepia",
    "returnspolicy": "This product is subject to our return policy.  Please see our complete return policy for details.",
    "physicaldimensions": "2.8\"h x 5.2\"w x 0.8\"d",
    "opticalsensortype": "CMOS",
    "attr35mmequivalentfocallengthmin": "23 mm",
    "memorynotes": "8GB RAM",
    "storagecapacity": "8 GB",
    "focallengthmax": "86.1 mm",
    "displayformfactor": "Built-in",
    "warrantylabor": "1 Year",
    "shutterspeed": "1/2000 - 16",
    "warrantyparts": "1 Year",
    "displaytechnology": "LCD",
    "cameratype": "Point & Shoot camera",
    "shootingmodes": "Burst/Continuous",
    "megapixels": "16.3 megapixel(s)",
    "batterytechnology": "Lithium ion",
    "displaysize": "4.8 in",
    "focallengthmin": "4.1 mm",
    "actualweight": "10.00 oz",
    "opticalsensorsize": "1/2.3\"",
    "attr35mmequivalentfocallengthmax": "483 mm"
}