{
    "category": "camera",
    "opticalviewfindertype": "Fixed eye-level pentamirror",
    "warrantyparts": "1 Year",
    "powernotes": "Battery: LP-E12 Lithium-Ion",
    "returnspolicy": "This product is subject to our return policy.  Please see our complete return policy for details.",
    "cameratype": "SLR camera",
    "shootingmodes": "Handheld night shot",
    "megapixels": "18 megapixel(s)",
    "displaysize": "3 in",
    "compatibilitynotes": "World's smallest and lightest digital SLR camera featuring a newly-developed 18.0 Megapixel CMOS (APS-C) sensor, ISO 100-12800 (expandable to H: 25600) for stills and ISO 100-6400 (expandable to H: 12800) for videos for shooting from bright to dim light, and high performance DIGIC 5 Image Processor for exceptional image quality and speed. High-speed continuous shooting up to 4.0 fps allows you to capture the action. EOS Full HD Movie mode with Movie Servo AF for continuous focus tracking of moving subjects, manual exposure control and multiple frame rates (1080: 30p (29.97) / 24p (23.976) / 25p, 720: 60p (59.94) / 50p, 480: 30p (29.97) / 25p), built-in monaural microphone, manual audio level adjustment, and Video Snapshot with editing for expanded movie shooting options. Touch Screen Wide 3.0-inch Clear View LCD monitor II (approximately 1, 040, 000 dots) with smudge-resistant coating features multi-touch operation with direct access to functions for setting changes and Touch AF for an easy, intuitive experience and clear viewing when outdoors; an Optical Viewfinder with approx. 0.87x magnification makes subjects easier to see. 9-point AF system (including a high-precision cross-type f/2.8 center point) for exceptional autofocus performance when shooting with the viewfinder; new Hybrid CMOS AF II, which combines the advantages of high-speed phase-detection AF and high-precision contrast AF, provides a widened AF area for increased autofocus speed and accuracy when shooting photos and movies in Live View. Scene Intelligent Auto Mode delivers expertly optimized photos and offers improved scene detection for amazing results when shooting at night, ideal even for users without advanced photography knowledge or experience. Expand your creativity with advanced imaging features like Effect Shot mode, Background Simulation and advanced Creative Filters that can be displayed in real time during Live View shooting. New Special Scene Modes including Kids, Food and Candlelight give you advanced presets to ensure the best possible photos under difficult shooting conditions. Compatibility with SD/SDHC/SDXC memory cards, including Ultra High Speed (UHS-I) cards. Compatible with the full line of Canon EF and EF-S lenses. Lens Aberration Correction: The EOS Rebel SL1 features lens correction tools that compensate for lens characteristics that can affect overall image quality. The EOS Rebel SL1's Peripheral Illumination Correction feature corrects light falloff in the corner of the image according to the characteristics of the lens being used. It even has correction data for a number of popular lenses stored in its memory. With the EOS Rebel SL1's chromatic aberration correction tool, distracting color fringing can be corrected at the time of shooting. Feature Guide: To help explain the specific function of features found on the EOS Rebel SL1, the Feature Guide displays a simple description helpful in determining the applicability for the situation at hand. It is displayed in each shooting mode, during mode dial operations, and for Quick Control screen functions. It appears automatically when a function is selected – a lifesaver when trying to determine the best mode or function for the next picture. The feature guide works automatically by default, and can be disabled easily through the camera's menu. GPS Compatible: With the optional GPS Receiver GP-E2 attached to the hot shoe or the digital terminal, the EOS Rebel SL1 can record location, including latitude, longitude and altitude, and has the ability to track the trajectory of movement with its logging function. An electric compass records the camera's orientation during each shot, and world time information is recorded through GPS syncing. JPEG Resizing: To create images suitable for sharing by email or online, the EOS Rebel SL1 can resize JPEG files, in-camera, of varying pixels (aspect ratio cannot be changed, only the image size can be decreased) while leaving the original image untouched. Photobook Set-up: Photographers can share their images in book form with the EOS Rebel SL1's convenient Photobook Set-up feature. Users can easily choose specific images, images in a folder and even all images, then specify their sequence and layout. The results can be printed in book form with ease. Image Rating: To help organize images recorded to the camera's storage, the EOS Rebel SL1 makes it simple to rate individual images from one star to five. Therefore, image browsing, printing and slide shows can be based upon those ratings. Cropping: Eliminating the need to post-process in the computer, photographers can easily crop their photos right in the EOS Rebel SL1. Perfect for direct connection to a printer, or in situations when it wasn't possible to zoom in enough with a zoom lens, cropping is a viable solution thanks to the camera's excellent 18.0-megapixel resolution. Users can choose vertical or horizontal images, and 3:2, 4:3, 16:9, even 1:1 aspect ratios.",
    "physicaldimensions": "3.6\"h x 4.6\"w x 2.7\"d",
    "actualweight": "13.10 oz",
    "opticalsensorsize": "14.9 x 22.3mm",
    "opticalsensortype": "CMOS",
    "warrantylabor": "1 Year",
    "flashtype": "Pop-up flash",
    "contents": "Camera, 18-55mm Lens, battery, charger, camera cover, eyecup Ef, 58mm lens cap, lens dust cap (rear), strap, interface cable, documentation",
    "portsconnectors": "(1) HDMI mini (1) USB 2.0 (1) AV out"
}