{
    "isosensitivity": "Auto: 125-6400 auto range adjustable Manual: 125-6400",
    "powersupply": "Power source: Rechargeable Li-Ion battery D-LI92 Recordable images: Approx. 240 Playback time: Approx. 200 min Movie recording time: Approx. 65 min Audio recording time: Approx. 270 min AC adapter available: Yes (optional)",
    "displaytype": "LCD",
    "opticalzoom": "4x",
    "imagestabilization": "Still: Sensor-Shift-Type (SR : Shake Reduction), Dual (SR & Pixel Track SR), High-sensitivity anti-shake mode (Digital SR) Movie: Movie SR (Maximum effect of Sensor-Shift-Type SR = approx. 3 stops)",
    "maxvideoresolution": "1920 x 1080",
    "category": "camera",
    "shutter": "Type: Programmed AE mechanical and electronic shutter mechanism. Shutter speed: 1/4000 to 1/4 sec (up to 4 sec in Night Scene mode).",
    "flash": "Type: Built-in series control auto flash Flash modes: Auto, Flash Off, Flash On, Auto + Redeye, On + Redeye Effective range: 34â\u0080\u0099 (wide, auto ISO), 14â\u0080\u0099 (tele, auto ISO)",
    "playbackmodes": "Mode selection: One Shot, Index (6 or 12 thumbnails), Magnification (up to 10X, scrollable), Movie Playback, Histogram, Folder Display, Select & Delete, Calendar Mode pallet: Slideshow, Image Rotation, Small Face Filter, Ink Rubbing Filter, Collage, Digital Filter(B&W/Sepia, Toy Camera, Retro, Color, Extract Color, Color Emphasis, High Contrast, Starburst, Soft, Fish-eye, Digital filters (playback): (B&W, Sepia, Toy Camera, Retro, Color, Color Extract, Color Emphasis, High Contrast, Starburst, Soft, Fisheye, Brightness, Miniature), HDR Filter, Original Frame, Movie Edit, Red-Eye Edit, Resize, Cropping, Image Copy, Protect, DPOF, Start-up Screen Movie edit: Save as Still Image, Movie Divide, Title Picture",
    "drivemodes": "Mode selection: One Shot, Self-Timer (10s, 2s), Continuous, Burst Shooting, Remote Control (3s, 0s), Auto Bracketing Continuous FPS: approx. 1.5 fps, 16M(4:3): up to approx. 60 frames, approx. 1.7 fps, 12M(16:9): up to approx. 78 frames Burst approx. 12 fps, 5M(4:3): up to 30 frames, approx. 14 fps, 4M(16:9): up to 30 frames Multi-exposure: n/a Interval: Interval Shot, Interval Movie, High Speed Movie (120 FPS capture, 30 FPS playback) HDR: Yes. Capture Mode (3 captured images combined to create single image with wide dynamic range) or as a Playback filter (single image processed to have HDR â\u0080\u009clookâ\u0080\u009d)",
    "type": "Compact Digital Camera",
    "brand": "Pentax",
    "mpn": "12683",
    "interfaces": "Ports: USB 2.0 hi-speed, USB / AV out, HDMI (Micro, Type-D) Video out: NTSC, PAL, HD (HDMI supports HD Auto, 1080i, 720p, 480p) Printer interfaces: n/a",
    "languagesupport": "English, French, German, Spanish, Portuguese, Italian, Dutch, Danish, Swedish, Finnish, Polish, Czech, Hungarian, Turkish, Greek, Russian",
    "lens": "Type/construction: PENTAX zoom lens, 9 elements, 7 groups (4 aspheric elements), protective cover w SP coating Optical zoom: 4X Focal length (equiv.): 4.5-18mm (25-100mm) Digital zoom: 7.2X Combined zoom: 28.8X Intelligent zoom: Approx. 6X at 7M to 28.8X at VGA Aperture: F2-4.9",
    "meteringsystem": "Type: TTL Multi-segment: Yes Center weighted: Yes Spot: Yes Exposure compensation: +/- 2 EV (1/3 steps)",
    "screensize": "3\"",
    "supportedflashmemory": "SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "storagemedia": "Internal memory: 70 MB Removable memory: SD, SDHC, SDXC",
    "lcdmonitor": "LCD screen: 3â\u0080\u009d widescreen TFT color LCD w anti-reflective coating on cover LCD resolution: HVGA 460,000 dots Wide angle viewable: Yes (approx. 170Â° horizontal/vertical)",
    "fileformats": "Still: JPG (EXIF 2.3), DCF 2.0, DPOF, PIM III Movie (compression): MP4 (AVC h.264) Sound: WAV (PCM), 32KHz, 16bit stereo, High Speed Movieã\u0080\u00918KHz, 16bit, stereo",
    "integratedmemorysize": "70 MB",
    "capturemodes": "Mode selection: Auto Picture, Program, HDR, Night Scene, Handheld Night Snap (ISO 125-1600), Movie, Underwater, Underwater Movie, Digital Microscope (2M), Landscape, Flower, Portrait, Interval Shot, Interval Movie, High Speed Movie (VGA, 120 FPS capture, 30 FPS playback), Time-Lapse Movie, 1CM Macro Movie, Digital SR, Surf & Snow, Kids, Pet, Sport, Fireworks, Night Scene Portrait, Food, Digital Wide (5M), Digital Panorama (2M per frame), Report (1280x960, ISO 125-1600), Green (ISO 125-1600) Auto Picture modes: Landscape, Portrait, Night Scene, Night Scene Portrait, Standard, Flower, Sport, Candlelight, Blue Sky, Sunset, Text, Group Photo, Pet, Portrait x Blue Sky, Portrait x Sunset, Portrait x Backlight Custom Image Tone: Bright, Natural, Monochrome Green simplified mode available: Yes (ISO 125-1600) Face detection available: Yes (up to 32 faces), Smile Capture, Blink Detection, Self Portrait Assist, Self Portrait Assist + Smile Capture, Pet Recognition (1 face detect PASMB: P Date stamp: Yes, date, date-time, time (not available in Green mode) Digital filters (capture): n/a Dynamic Range Adjustment: Yes (highlight and shadow correction) File/Folder customization: Folder name (date, PENTX, custom), file name (IMGP, custom) Electronic level: Yes",
    "cameratype": "Point & Shoot",
    "sensor": "Type: Backlit CMOS w primary color filter Size: 1/2.3â\u0080\u009d Effective pixels: 16 Total pixels: 16.79 Recorded resolutions Still: 16M (4608x3456), 12M (1:1, 3456x3456), 12M (16:9, 4608x2592), 7M (3072x2304), 5M (16:9, 3072x1728), 5M (2592x1944), 4M (16:9, 2592x1464), 3M (2048x1536), 2M (16:9, 1920x1080), 1024 (1024x768), VGA (640x480) Movie: HD (1920x1080p30, 1280x720p60/30) Quality levels: Still: *** best, ** better, * good, Movie: fixed",
    "upc": "027075228153, 689466667653, 689466667660",
    "displaysize": "3\"",
    "physicalspecs": "Dimensions (W x H x D): 4.9â\u0080\u009d x 2.5â\u0080\u009d x 1.3â\u0080\u009d Weight: Without battery or removable memory: 7.4 oz Loaded and ready: 8.1 oz Construction material(s): Reinforced polycarbonate plastic w aluminum accents Operating temperature: 14-104Â°F (coldproof) Ruggedized features: Waterproof (45.9â\u0080\u0099), Shockproof (6.5â\u0080\u0099), Crushproof (220 LBF), Coldproof (-10Â°C), Dustproof (JIS 6)",
    "digitalzoom": "7.2x",
    "sensorresolution": "16.0 MP",
    "focussystem": "Type: TTL contrast detection autofocus, AF assist lamp, Macro Illuminating LEDs Focus modes: 9 point AF, Spot AF, Auto Tracking AF, Macro, 1CM Macro, Infinity Landscape, Pan Focus, Manual Focus Manual focus: Yes Macro focus: Yes, Macro and 1CM Macro available Focus lock: Yes, by pressing the shutter release button half way Focus range Normal: 1.31â\u0080\u0099 to infinity Macro: 0.33â\u0080\u0099 to 1.64â\u0080\u0099 Super Macro: 0.03 (1cm) to 0.98â\u0080\u0099 (at mid-zoom, set automatically)",
    "viewfinder": "Viewfinder: n/a",
    "model": "WG-3",
    "whitebalance": "Auto, Daylight, Shade, Tungsten Light, Fluorescent Light (D: Daylight Color, N: Daylight White, W: White Light), Manual"
}