{
    "category": "camera",
    "aboutus": "Product Display Description YONGNUO YN560 III YN-560III Wrieless Trigger & Universal Speedlite Flash for Camera Latest Flash Model!! S uppo rt RF-603, RF602 GN58, 105mm Metal Hot Shoe What is different in YN560lll? The major upgraded for YN-560 III is that it comes with , which means you can use RF-602 and RF-603 2.4G compatible radio receivers built-in to the unit YN-560 III as a receiver off camera, and it can be used together with RF-602 / RF-603 transmitters on the camera, pressing the button of transmitter or the shutter release button of camera, YN-560 III can be fired. You can not only use YN-560 III as a flash , but also a flash receiver , you can use those two functions synchronously. Video Reference for YN560 II I to RF-603: We had tested YN5 60 III compatible with RF603 Main features Global free FSK 2.4GHz wireless channel. Within capacious areas, the remote control distance may reach to 100m. Fully support RF-603, RF-602 wireless flash trigger transceiver up to 16 channels using RF-602/RF-603 2.4G ultra-long-range wireless flash system Adopted by global users trust the allways RF-602/RF-603 wireless flash system. Support 2.4G ultra-long-range wireless flash, the lead flashing distances up to 100 meters above. Large LCD panel Power zoom function covered focal length range from 24 to 105mm GN58 @ ISO100, 105mm supporting multi modes Providing charging socket for external power pack PC port supported Sound prompt system High speed of charging recycle only 3 seconds in charging after full power output. Automatic setting saving Metal hotshoe stand speeding call back system Full light output recycling time of just three seconds, even without using the new battery, but also to get the speed of call back experience, only 4 to 5 seconds; You can also use external charging box call back again accelerated. Specification Guide number of 58 (at 105mm) Power control down to 1/128 3 second recycle time at full power 16-channel radio receiver, compatible with RF-602, RF-603 Hotshoe, PC port and dual-mode optical slave (alternative options to radio triggering) Fresnel head zooms from 24mm to 105mm focal lengths, plus flip-down diffuser panel Stroboscopic “Multi” flash mode for creative effects External high voltage battery input socket, to speed up recycle times and increase endurance User-configurable ready beep Compatible: Suit for any DSLR/ SLR Camera with standard hotshoe, such as Canon, Nikon, Pentax, Olympus. (Except Sony & Minolta, adapter needed for conversion) Package including: Yongnuo YN560-III Manual Flash Light Protecting Bag Mini Stand User Manual Note:YN560lll only with built in trigger but no actual trigger come with the parcel (RF-602 and RF-603 are not include, YN-560III only act as a receiver only) More Yongnuo Products Flash Flash Trigger Shipping Payment Payment: We accepted PayPal Payment Only. Make sure you have valid / confirmed PayPal account prior purchase / bidding. Terms & Conditions: Unless the product is defective, buyer should responsible for the return shipping fees. Pictures or video may requested. Defective item must be returned not more than 7 days after you received the item, we will send out the replacement unit or parts once received your return Please contact us if you are not receiving the item after the expected schedule and we will investigate it. In order to well understand what you are purchasing, we are willing to answer any related questions, please do not hesitate to contact us! Feedback & Contact us: 1. We are always working hard for maintain high standards of excellence and strive for 100% customer satisfaction. So your feedback is very important to us. We are kindly request you to contact us immediately when you have problem or if you want to give us neutral or negative feedback, If you give this to us, It will so that we can collect your idea to make our service better and better, and welcome you back to our store again. 2. As a responsible eBay Seller, we will try our best to solve every problem. Please communicate with us before you are going to leave us a NETURAL or NEGATIVE feedback. 3. We greatly appreciate your positive feedback and we will promptly do the same to you. 4. Wholesaler, Retailer and distributor are welcome. Please feel free to contact us and we are able to arrange drop shipment to end user! 5. Please contact us through ebay message instead of our email mailbox, We can't receive your message!! 6. Office Hour: Mon- Fri 9:30AM-6:30PM(GMT+8), Sat 9:30AM-1:30PM (GMT+8) 7. Contact No. 852-35680601 Customer Service You can contact us by leaving us an eBay message, or email us. If you have any further question you can contact us. we will reply your questions within 48 hours. Our working hours is: HK timing:Monday to Friday 10:00am-7:00pm, Saturday:10:30am-3:30pm, We close on Weekend and Public Holidays."
}