{
    "category": "camera",
    "aboutus": "Product Display Description Yongnuo YN-565EX Flash Speedlite i-TTL Remote for Nikon Camera The  brand-new YN-565EX is the first wireless TTL supporting flash by  Yongnuo. This Chinese company has already been prooven to produce  good  quality with a reasonable price marked with the extremely successful  YN-460, YN-560 and their TTL flashes. Features Highlights Wireless TTL Slave: Use  the comfort of TTL wirelessly with Canon eTTL and Nikon i-TTL! The  YN-565EX serves as a wireless TTL slave which is triggered by a  compatible master flash like the Canon 580 EX II or Nikon SB-900, a  camera with commander function like Canon 60D or wireless commander like  ST-E2. If there is no commander function or master flash it still can  be used with TTL on top of a compatible camera. In TTL slave mode 3  groups A, B, C and 4 channels are supported. Please note that the  YN-565EX cannot serve as a wireless TTL master and does not support  HSS. Flash Mode Manual, S1, S2: Many  photographers like the manual mode in strobist photography, because it  gives them most freedom in composing their pictures. You can adjust the  power level from 1/128 to 1/1 in 1/3EV steps. Also you can use the  optical slave modes S1 and S2. Which allow optical triggering by other  flashes without need of an additional trigger. The S2 mode supresses the  TTL metering flash. Multi Mode: In  this mode a sequence of rapid flashes is fired and give interesting  effects. You can adjust the number and frequency of flashes. Big LCD with advanced settings: The  big back-lit LCD is quite comfortable and for newer Canon cameras all  information is also available in the camera menu and can be set there as  well. Settings can be saved to a hot key which makes it  fast  accessible right if you need it. The last settings are automatically  saved. Auto Zoom Head, Wide Angle Diffuser and Bounce Card: The  flash head zooms automatically or manually to the focal length  transmitted by the camera in steps of 24, 28, 35, 50, 70, 80, 105mm. The  zoom range can be extended to 18mm by the diffuser. Also the head can  be rotated horizontally and vertically in wide angles. High Output Power of GN58: The high output power of GN58 at ISO 100 and 35mm is suitable for most shooting situations. Modeling Light and Test Flash: The  YN-565EX fires for 1 second if the depth of field button of the camera  is pressed. Also a test flash is fired if the pilot button is pressed. The Read Beep informs if the flash is ready to fire after charging. An Overheat Protection pauses the flash for 30 seconds in case of overheating to prevent damaging. A quite handy feature is the Configurable Power Saving Mode . For longer strobist sessions the Socket for an External Battery Pack can be useful to extend the time of shooting. Also a PC Sync Socked is build-in for the use with flash triggers or PC sync cables. Further features are Flash Exposure Compensation (FEC) of -5EV in 1/3EV steps. Flash Exposure Bracketing (FEB) for 3 pictures in a row and Rear-Curtain Sync . FE lock for Canon and FV lock for Nikon are locking the flash exposure before you are recomposing the image and taking the final picture. Specification Wireless (infrared) eTTL slave for Canon and i-TTL slave for Nikon Longest  rage for wireless TTL connection indoors up to 25m and outdoors 15m,  the slave flash needs optical contact to the master, bright sunlight can  disturb the connection GN 58 at ISO 100 and 105mm Modes: TTL, Manual, Muli Optical slave modes S1 and S2, S2 suppresses the TTL metering flash Modeling light function for 1s if cameras depth of field button is pressed PC port for triggering by cable or by non hot shoe triggers Fast recycle time of approximately only 3 seconds after firing on full power (AA alkaline cell used) Read beep if charging has finished, can be turned off Metal foot Bounce card build in Rear-curtain sync FEC - flash exposure compensation -5EV in 1/3 EV steps FEB - flash exposure bracketing for 3 pictures in a row FE  lock (Canon) and FV lock (Nikon) supported for locking the flash  exposure before recomposing the image and taking the final picture Slave groups: 3 (A, B, and C) Channels: 4 Auto and manual zoom: 24, 28, 35, 50, 70, 80, 105mm, compatible with full size and crop size sensors Wide angle diffuser for supporting focal length shorter 24mm to 18mm Vertical rotation angle: -7~90 degrees Horizontal rotation angle: 0~270 degrees Power supply: 4 x AA size batteries (Alkaline or Ni-MH are usable) Connector for an external battery pack e.g. Yongnuo SF-18C, SF-17C Color temperature: 5600k Flash time: 1/200s~1/20000s Flash control: 8 levels of output control (1/128~1/1), 22 levels of fine tuning Dimensions: 60×190×78mm (Extended state) Net weight: 380g Package Included: 1 x YN-565EX for Nikon 1 x Mini stand 1 x Manual in English and Chinese 1 x Protection bag More Yongnuo Products Flash Flash Trigger Shipping Payment Payment: We accepted PayPal Payment Only. Make sure you have valid / confirmed PayPal account prior purchase / bidding. Terms & Conditions: All Sales are FINAL . Unless the product is defective, buyer should responsible for the return shipping fees. Pictures or video may requested. Defective item must be returned not more than 7 days after you received the item, we will send out the replacement unit or parts once received your return Please contact us if you are not receiving the item after the expected schedule and we will investigate it. In order to well understand what you are purchasing, we are willing to answer any related questions, please do not hesitate to contact us! Feedback & Contact us: 1. We are always working hard for maintain high standards of excellence and strive for 100% customer satisfaction. So your feedback is very important to us. We are kindly request you to contact us immediately when you have problem or if you want to give us neutral or negative feedback, If you give this to us, It will so that we can collect your idea to make our service better and better, and welcome you back to our store again. 2. As a responsible eBay Seller, we will try our best to solve every problem. Please communicate with us before you are going to leave us a NETURAL or NEGATIVE feedback. 3. We greatly appreciate your positive feedback and we will promptly do the same to you. 4. Wholesaler, Retailer and distributor are welcome. Please feel free to contact us and we are able to arrange drop shipment to end user! 5. Please contact us through ebay message instead of our email mailbox, We can't receive your message!! 6. Office Hour: Mon- Fri 9:30AM-6:30PM(GMT+8), Sat 9:30AM-1:30PM (GMT+8) 7. Contact No. 852-35680601 Customer Service You can contact us by leaving us an eBay message, or email us. If you have any further question you can contact us. we will reply your questions within 48 hours. Our working hours is: HK timing:Monday to Friday 10:00am-7:00pm, Saturday:10:30am-3:30pm, We close on Weekend and Public Holidays."
}