{
    "category": "camera",
    "aboutus": "Product Display Description Yongnuo YN-560EX Wireless Slave TTL Flash Speedlight for Nikon Canon Camera AU The YN-560EX is Yongnuo's new slave only TTL flash. It has been renamed from YN-EX600 flash to YN-560EX. This flash is a perfect companion for a modern camera with integrated TTL flash trigger, a ST-E2 or a TTL master flash providing infrared signals. An additional TTL trigger is not required. Because the flash is equipped with a manual hot shoe, one cannot use TTL if mounted on camera or with an additional radio flash trigger. Specification: YN-560EX is a flash speedlite with hybrid combination between and a a manual-mode flash in the hot shoe . dedicated digital TTL slave flash when used wireless When you use it on hot shoe camera , you can use it as YN-560 II, it works with Canon, Nikon, Pentax, Olympus DSLR Camera. When you use it off camera wireless TTL Slave mode , you can use it as YN-565EX , it can be triggered by Canon and Nikon camera. Feature Yongnuo YN-560EX Wireless Slave TTL modes E-TTL II (Canon), i-TTL (Nikon) Hot shoe TTL NO Hot shoe flash modes M, multi mode (strobo) Optical slave modes (non-TTL) S1, S2 Max guide number (meters) 58 ( ISO 100, 105mm ) Zoom range (mm) 24 – 105 Features: ALL SUPPORTED FOR Nikon and Canon’s system: The YN-560EX can be triggered by 580EX II, SB-900/800/700, 7D/60D/600D, Nikon c-command and ST-E3, and flashes as TTL mode as well as M/Multi mode. To enjoy wireless TTL lighting, ratio control, as well as remote control of output level, you may only take a camera with built-in commander mode, and the YN-560EX. A brand new appearance: The brand new design looks generous, original, solid and reliable Large LCD panel: Large LCD panel, you can look into and set the functions on the LCD panel clearly and directly Multi flash supported: Yongnuo new manual speedilite, supporting Multi flash GN58 @ ISO100, 105mm: Yongnuo new large guide number manual speedlite, supporting remote TTL and M, Multi modes Multiple trigger mode supported: The YN-560EX can be triggered by hot-shoe, flash command slave mode, optical S1 and S2 (pre-flash-cancelled mode). Supports motor zooming (24-105mm): The YN-560EX covers a focal length range of 24-105mm by operating the zooming buttons Supports remote TTL functions: In the case of remote mode, FEC, FEB, Rear curtain sync, FE lock is supported Super speed of charging recycle: It only takes 3 seconds to finish a charging cycle after a full level output. Even without new batteries, you can get super charging speed that is only needs 4 to 5 seconds. 2.5mm type PC port provided: YN-560EX provides 2.5mm type PC port, you can make the flash synchronously by connecting to the PC port. Sound prompt system: Turn on the sound prompt function, different sounds indicate working situations help you focus on shooting Advanced settings on flash : The YN-560EX supports advanced settings; you can customize the unit according to your shooting preferences Automatic settings saving: YN-560EX can save the current settings automatically Functions: â\u0097\u008fHot shoe manual mode â\u0097\u008fGuide Number 58 (ISO 100, 105mm) â\u0097\u008fFlash Modes:M, Multi Mode â\u0097\u008fModeling Light â\u0097\u008fAuto Zooming Head 24-105mm ( Wireless Slave TTL mode ) â\u0097\u008fManual Zooming Head 24 – 105mm â\u0097\u008fAuto Zoom for Sensor Size â\u0097\u008f2.5mm Sync Port â\u0097\u008f3 Seconds Recycle TimeCons Parameters Circuit design Insulated Gate Bipolar Transistor (IGBT) Guide No. 58 meters (ISO 100, 105mm) Flash mode M, Multi,Sc,Sn,S1, S2 Zoom range 24, 28, 35, 50, 70, 80, 105mm Vertical rotation angle -7~90 degrees Horizontal rotation angle 0~270 degrees Power supply 4×AAsize batteries (Alkaline or Ni-MH are usable) Lighting times 100~1500 times (AA alkaline cell used) Recycle time approx 3s (AA alkaline cell used) Color temperature 5600k Flash time 1/200s~1/20000s Flash control 8 levels of output control (1/128~1/1), 29 levels of fine tuning External interface hot shoe, PC port Wireless triggering distance 20~25m indoor, 10~15m outdoor Additional features The electronic flash head zooming, sound signal, automatically saving setting, PC port, power saving mode and over heat protection Dimensions 60×190×78mm (Extended state) Net weight 350g Suitable for: 1)  Work with Hot Shoe Cameras 2)  Wireless Remote Trigger Studio 3)  Wireless Hot Shoe Flash Remote Slave Trigger Sensor 4)  Work with flash units using universal hot shoe like CANON, Nikon,  Sigma, Olympus ***TTL function only can apply to Slave mode*** Package includes: •   1 x Yongnuo YN-560EX Wireless Manual Flash Speedlight • 1 x Mini stand • 1 x English manual • 1 x Black Protector bag • Original Manufactory Package More Yongnuo Products Flash Flash Trigger Shipping Payment Payment: We accepted PayPal Payment Only. Make sure you have valid / confirmed PayPal account prior purchase / bidding. Terms & Conditions: Unless the product is defective, buyer should responsible for the return shipping fees. Pictures or video may requested. Defective item must be returned not more than 7 days after you received the item, we will send out the replacement unit or parts once received your return Please contact us if you are not receiving the item after the expected schedule and we will investigate it. In order to well understand what you are purchasing, we are willing to answer any related questions, please do not hesitate to contact us! Feedback & Contact us: 1. We are always working hard for maintain high standards of excellence and strive for 100% customer satisfaction. So your feedback is very important to us. We are kindly request you to contact us immediately when you have problem or if you want to give us neutral or negative feedback, If you give this to us, It will so that we can collect your idea to make our service better and better, and welcome you back to our store again. 2. As a responsible eBay Seller, we will try our best to solve every problem. Please communicate with us before you are going to leave us a NETURAL or NEGATIVE feedback. 3. We greatly appreciate your positive feedback and we will promptly do the same to you. 4. Wholesaler, Retailer and distributor are welcome. Please feel free to contact us and we are able to arrange drop shipment to end user! 5. Please contact us through ebay message instead of our email mailbox, We can't receive your message!! 6. Office Hour: Mon- Fri 9:30AM-6:30PM(GMT+8), Sat 9:30AM-1:30PM (GMT+8) 7. Contact No. 852-35680601 Customer Service You can contact us by leaving us an eBay message, or email us. If you have any further question you can contact us. we will reply your questions within 48 hours. Our working hours is: HK timing:Monday to Friday 10:00am-7:00pm, Saturday:10:30am-3:30pm, We close on Weekend and Public Holidays.",
    "netweight": "350g",
    "dimensions": "60×190×78mm (Extended state)",
    "powersupply": "4×AAsize batteries (Alkaline or Ni-MH are usable)",
    "feature": "Yongnuo YN-560EX",
    "colortemperature": "5600k",
    "flashmode": "M, Multi,Sc,Sn,S1, S2",
    "externalinterface": "hot shoe, PC port",
    "additionalfeatures": "The electronic flash head zooming, sound signal, automatically saving setting, PC port, power saving mode and over heat protection",
    "flashcontrol": "8 levels of output control (1/128~1/1), 29 levels of fine tuning",
    "guideno": "58 meters (ISO 100, 105mm)",
    "recycletime": "approx 3s (AA alkaline cell used)"
}