{
    "category": "camera",
    "netweight": "350g",
    "dimensions": "60×190×78mm (Extended state)",
    "powersupply": "4×AAsize batteries (Alkaline or Ni-MH   are usable)",
    "colortemperature": "5600k",
    "flashmode": "M, S1, S2, Multi",
    "externalinterface": "hot shoe, PC port and eternal charging   port",
    "aboutus": "Product Display Description NEW Yongnuo YN560 II Flash Speedlite w LCD Screen For Canon/Nikon This new designed  flash YN-560 II is compatible with any camera with the standard hot shoe, the  function is similar to the YN-560, but we designed some new LCD Screen and  upgraded the function. What's more, it used the Unsalted gate bipolar transistor circuit design, and Metal Hot shoe ,it's  more beautiful, creditable and professional. Function New Power zoom function You can push the button on the flash and make it covered focal length   range from 24mm to 105mm LARGE LCD PANEL Large LCD panel, you can look into and set the functions on the LCD panel clearly and directly. THE HIGH SENSITIVITY WIRELESS TRIGGERING SENSOR The high sensitivity wireless triggering sensor inherits from YN560, which makes the S1 and S2 mode can be used in outdoor environment and the wireless triggering distance is as long as 15m, as well as 25m indoors. Guide number: 58 at ISO100, 105MM Slave function ( S1, S2 mode) You  just can use YN-460 and YN-460 II in indoor and at a very weak light,  but  for YN-560, you can use it in outdoor environment, and the wireless   triggering distance is as around 15m Sound Indicator When the charging process is finished, the flash will give a tich sound, so   you may concentrate on the creation process. ( The sound can be closed ) New Charging  socket for external power pack You can charge this YN-560 II to meet the higher demand for charging   recycle, you can use SF-18 for Canon version and SF-17 for Canon  version  to charge it. New PC synchronous  port YN560-II provides PC portï¼\u008cyou can make the flash synchronously by connecting to the PC port. Super speed of charging recycle It only takes 3 seconds in charging after full power output. Even without   new batteries, you can get the super charging speed that it only needs 4-5   seconds, you can completely get rid of the nightmare of anxious waiting for   charging. In addition, you can use the external power pack to accelerate  the  charging speed once more. Supporting high speed continuous shooting Under the output level of 1/8 or below, YN-560 II can support the 8FPS  high speed continuous shooting The Improved power saving mode In the power saving mode, the flash keep sidle for 3 minutes and then it   will step into the dormancy state in order to save power. and it will   automatically shutdown after keeping idle for 15 minutes. If you disabled   the power saving mode, the power saving indicator will be on, the flash   won't step into the dormancy state after being stopped. It will be   automatically shut down after 30 minutes The  more fine output control 1/1, 1/2, 1/4,  1/8, 1/16,  1/32, 1/64, 1/128, there are 8 levels of put and each level has  8 ine tuning  stalls The adjustment range of YN-560 output level is The  automatic setting saving It can automatically save your  current setting. IMPROVED BUTTONS DESIGN It is sensitivity and better feeling to control. Overheating protection If it is used too frequently, its overheating protection function will be   triggered, the red and green lights of the charging indicator will blink   alternatively, and it will be locked. in such case, please wait for about 3   minutes to cancel the protection before continuing the using. M), Manually set the zooming position: ã\u0080\u0080 The covered  focal length of the flash will  switch in circle of 14 / 28 / 35 / 50 / 70 /  80 / 105mm by pressing the  button. Advanced  Application Multi-Lamp Lighting Application Exposure Bracketing ( FEB) Use  Wide-angle Diffuser Rear-curtain Sync FE   Lock ( This function can only be available when your camera  supports  it, for the setting of FE lick, refer to your camera  manual) Exposure Compensation Reflection Flash Use  Reflection Board to take photo Circuit design Insulated Gate Bipolar Transistor   (IGBT) Guide No. 58 meters (ISO 100, 105mm) Flash mode M, S1, S2, Multi Zoom range 24, 28, 35, 50, 70, 80, 105mm Vertical rotation angle -7~90 degrees Horizontal rotation angle 0~270 degrees Power supply 4×AAsize batteries (Alkaline or Ni-MH   are usable) Lighting times 100~1500 times (AA alkaline cell used) Recycle time approx 3s (AA alkaline cell used) Color temperature 5600k Flash time 1/200s~1/20000s Flash control 8 levels of output control   (1/128~1/1), 29 levels of fine tuning External interface hot shoe, PC port and eternal charging   port Wireless triggering distance 20~25m indoor, 10~15m outdoor Additional features The electronic flash head zooming,   sound signal, automatically saving setting, PC port, power saving mode and   over heat protection Dimensions 60×190×78mm (Extended state) Net weight 350g Compatible: Work with flash units using universal hot shoe CANON/Nikon model Package Include: 1 X YN-560II Manual Flash Light (Not support TTL function) 1 X Mini Stand 1 X Carry Case 1 X User Manual More Yongnuo Products Flash Flash Trigger Shutter Realease & Remote Control Shipping Shipping : Item will be shipped within 2-3 working days after we received clear payment. Please make sure your shipping address before purchase, item will send to paypal address ONLY. All items will check carefully before sending out. Shipping & Handling fee is non-refundable in all circumstances. Our prices do NOT include any custom duty or tax. Item ship on weekdays only and we cannot offer Saturday, Sunday or holiday delivery. Do not ship to PO Box Note that delivery times may vary, particularly during peak periods or unexpected weather conditions. Payment Payment: We accepted PayPal Payment Only. Make sure you have valid / confirmed PayPal account prior purchase / bidding. Terms & Conditions: Unless the product is defective, buyer should responsible for the return shipping fees. Pictures or video may requested. Defective item must be returned not more than 7 days after you received the item, we will send out the replacement unit or parts once received your return Please contact us if you are not receiving the item after the expected schedule and we will investigate it. In order to well understand what you are purchasing, we are willing to answer any related questions, please do not hesitate to contact us! Feedback & Contact us: 1. We are always working hard for maintain high standards of excellence and strive for 100% customer satisfaction. So your feedback is very important to us. We are kindly request you to contact us immediately when you have problem or if you want to give us neutral or negative feedback, If you give this to us, It will so that we can collect your idea to make our service better and better, and welcome you back to our store again. 2. As a responsible eBay Seller, we will try our best to solve every problem. Please communicate with us before you are going to leave us a NETURAL or NEGATIVE feedback. 3. We greatly appreciate your positive feedback and we will promptly do the same to you. 4. Wholesaler, Retailer and distributor are welcome. Please feel free to contact us and we are able to arrange drop shipment to end user! 5. Please contact us through ebay message instead of our email mailbox, We can't receive your message!! 6. Office Hour: Mon- Fri 9:30AM-6:30PM(GMT+8), Sat 9:30AM-1:30PM (GMT+8) 7. Contact No. 852-35680601 Customer Service You can contact us by leaving us an eBay message, or email us. If you have any further question you can contact us. we will reply your questions within 48 hours. Our working hours is: HK timing:Monday to Friday 10:00am-7:00pm, Saturday:10:30am-3:30pm, We close on Weekend and Public Holidays.",
    "flashcontrol": "8 levels of output control   (1/128~1/1), 29 levels of fine tuning",
    "additionalfeatures": "The electronic flash head zooming,   sound signal, automatically saving setting, PC port, power saving mode and   over heat protection",
    "guideno": "58 meters (ISO 100, 105mm)",
    "recycletime": "approx 3s (AA alkaline cell used)"
}