{
    "producttype": "Digital camera - compact",
    "minfocusdistance": "5 cm",
    "weight": "124 g",
    "facedetectiontechnology": "Face Detection technology detects up to eight individual faces and adjusts focus, exposure, and white balance to help deliver crisp, properly lit images of family and friends.",
    "softskinmode": "Portrait subjects will love the results. Soft skin mode recognizes skin tones and reduces the appearance of blemishes and wrinkles without affecting the rest of the shot.",
    "antiblinkfunction": "It's frustrating to capture the perfect shot, only to review it later and discover subjects blinked during the photo. The anti-blink function works to help counter blinking and squinting. When the camera is set to soft snap, the anti-blink function captures two images, recording only the photo with less squinting. If a blink is detected in other shooting modes, a warning will be displayed after you take the shot.",
    "naturalflash": "Conventional point-and-shoot camera flash shots just don't capture colors the way the eye sees them. Natural flash controls the white balance of both the background and main subjects.",
    "maxvideoresolution": "1280 x 720",
    "category": "camera",
    "avinterfaces": "Composite video/audio",
    "memorycardslot": "Memory Stick Duo card, SD card",
    "dimensionswxdxh": "9.4 cm x 2.2 cm x 5.6 cm",
    "productdescription": "Sony Cyber-shot DSC-W690 - digital camera",
    "imagestabiliser": "Optical (Steady Shot with Active Mode)",
    "imageprocessor": "BIONZ",
    "focusadjustment": "Automatic",
    "colour": "Black",
    "lenssystem": "10 x zoom lens - 4.45 - 44.5 mm - f/3.3-5.9 G",
    "cameraflash": "Built-in flash",
    "intelligentscenerecognitionmode": "Intelligent Scene Recognition (iSCN) mode automatically detects 33 different types of scenes and selects the appropriate camera settings. iSCN has two modes: auto and advanced. In auto mode, the camera takes a single shot using the optimal settings. In advanced mode, the camera takes a photo with the optimal settings and, if in difficult lighting (low light or back light) immediately takes a second photo with another optimized setting so you can choose which to keep.",
    "pictureeffect": "Picture effect adds a new level of expression to photos, making ordinary landscapes and portraits come to life by heightening mood and emphasizing certain attributes. Select camera models have up to nine different effects.",
    "digitalzoom": "40 x",
    "sensorresolution": "16.1 Megapixel",
    "supportedbattery": "1 x Li-ion rechargeable battery - 630 mAh ( included )",
    "smileshuttertechnology": "Smile Shutter technology captures a smile the moment it happens. Simply press the Smile Shutter button and the camera does the rest. You can also select adult and child priority and indicate the degree of smile detection sensitivity. Intelligent scene recognition can be used together with Smile Shutter mode when the intelligent auto mode is on. This means that beautiful smiles can be captured with settings optimized for the particular scene, even in difficult conditions such as twilight and backlighting.",
    "opticalsteadyshotimagestabilization": "Optical SteadyShot image stabilization uses a built-in gyro sensor to detect camera shake and automatically shifts the lens to help prevent blur without sacrificing image quality.",
    "display": "LCD display - 3\""
}