{
    "weight": "Approx. 18.2 oz. / 515g (body only)",
    "battery": "Battery Pack LP-E8 x 1",
    "autowhitebalance": "Auto white balance with the image sensor",
    "recordingmedia": "SD/SDHC/SDXC card, via external media (USB v.2.0 hard drive, or via Wireless LAN (Eye-Fi card))",
    "effectivepixels": "Approx. 18.0 megapixels",
    "lensmount": "Canon EF mount",
    "category": "camera",
    "colorfiltersystem": "RGB primary color filters",
    "startuptime": "Approx. 0.1 sec. (Based on CIPA testing standards)",
    "recordingformat": "Design rule for Camera File System 2.0 and 2.30",
    "erase": "Erase single image, erase selected images, erase all images on folder, erase all images in a card, or erase only unprotected images",
    "filesize": "Large: Approx. 17.90 Megapixels (5,184 x 3,456) Medium: Approx. 8.00 Megapixels (3,456 x 2,304) Small: Approx. 4.50 Megapixels (2,592 x 1,728) S2: Approx. 2.50 Megapixels (1,920 x 1,280) S3: Approx. 0.35 Megapixels (720 x 480) RAW: Appr",
    "totalpixels": "Approx. 18.70 megapixels",
    "dimensionswxhxd": "Approx. 5.2 x 3.9 x 3.1 in./133.1 x 99.5 x 79.7mm",
    "workingtemperaturerange": "32-104 deg.F/0-40 deg.C",
    "type": "Digital, AF/AE single-lens reflex, camera with built-in flash",
    "workinghumidityrange": "85% or less",
    "printableimages": "JPEG images complying to Design rule for Camera File System RAW images printable Movies cannot be printed",
    "filenumbering": "Consecutive numbering, auto reset, manual reset",
    "sensortype": "High-sensitivity, high-resolution, large single-plate CMOS sensor",
    "protection": "Erase protection can be applied/canceled for a single image, all images in a folder, or all images in the card",
    "imageformat": "22.3 x 14.9 mm (APS-C size)",
    "batterycheck": "Automatic battery level check when power is turned ON Battery level indicated in one of four levels on LCD monitor",
    "aspectratio": "3:2 (Horizontal: Vertical)",
    "picturestyle": "Auto, Standard, Portrait, Landscape, Neutral, Faithful, Monochrome, User Defined 1-3",
    "lowpassfilter": "Fixed position in front of the CMOS sensor",
    "compatibleprinters": "PictBridge-compatible printers",
    "rawjpegsimultaneousrecording": "RAW and Large JPEG images are recorded simultaneously",
    "compatiblelenses": "Canon EF lenses including EF-S lenses (35mm-equivalent focal length is approx.1.6x the lens focal length)",
    "settings": "Auto, Daylight, Shade, Cloudy, Tungsten Light, White Fluorescent Light, Flash, Custom",
    "colorspace": "sRGB, Adobe RGB",
    "colortemperaturecompensation": "White balance correction: Blue/amber bias: FlexShopper Newsletter Get info about new products, exclusive promotions and company news. Thank you for subscribing! Invalid email address Subscribe Safe & Secure © 2014 FlexShopper LLC. All Rights Reserved. Overview Apply today My account FAQs FlexShopper About us Privacy Policy Website Services Agreement Mobile App Services Agreement Contact Us Merchants Become an Affiliate * This is an estimated weekly payment, rounded to the nearest dollar for the merchandise shown if you were to acquire ownership after making 52 weekly payments. The actual weekly payment may vary depending on your spending limit and how much you spend; the actual weekly payment will be in your lease. Ownership is optional and you may purchase or return the merchandise at any time after the initial payment has been paid, the minimum lease period has been met and provided proper notice is given to FlexShopper per your lease. See your lease for more information regarding ownership and minimum term. ** You will be given a credit for one weekly payment. This credit will be applied to the second weekly payment due, provided your first payment clears. This credit will be removed from your account if your first weekly payment fails. All other terms and conditions of your Lease Agreement remain in effect. This credit is only valid for online orders and for a single lease per individual. † The cash price is the amount you would have paid online or at a store to buy the item(s). If you pay the cash price plus $50 within ninety days of the Lease’s effective date you will own the item(s). 1 Free delivery offer applies to scheduled delivery on select major appliances, furniture, treadmills, ellipticals, exercise cycles, home gyms and outdoor grills. Major appliances include standard size or larger refrigerators, washers & dryers, ranges & ovens, microwaves and dishwashers. Limited metro delivery areas. Additional parts, extensive labor and installation charges are extra. The transit time will vary by delivery address. × Close Enter the promo code you heard here: Submit close Continue Shopping View cart & checkout",
    "recordingfunctions": "Images record directly to the memory card",
    "powersaving": "Power turns off after the set time of non-operation elapses",
    "datetimebattery": "Built-in secondary battery. When fully-charged, the date/time can be maintained for about three months"
}