{
    "pasmb": "P, A, S, M, B (extended modes Sv, TAv)",
    "usablelenses": "PENTAX KAF3, KAF2, KAF, and KA (K mount, 35mm screw-mount, 645/67 med format lenses useable with adapter and/or restrictions)",
    "filefoldercustomization": "Folder name (standard, date), create new folder, embed copyright",
    "videocaptureimagefileinformation": "Recorded resolutions/FPS: 1920x1080p30/25/24, 1280x720p60/50/30/25/24, 640x480p30/25/24 Quality levels: Best, Better, Good File formats (compression): MOV MPEG-4 AVC (h.264) Sound: Audio gain adj",
    "isosensitivity": "Auto: 100-51200 (1, 1/2, 1/3 steps), auto range selectable Manual: 100-51200 (1, 1/2, 1/3 steps)",
    "playbackdigitalfilters": "Monochrome, Extract Color, Toy Camera, Retro, High Contrast, Shading, Invert Color, Color, Tone Expansion, Sketch Filter, Water Color, Pastel, Posterization, Miniature, Soft, Starburst, Fish-eye, Slim, Base Parameter Adjustment",
    "playbackmodeselection": "Single frame, Multi-image display (4, 9, 16, 36, 81 segmentation), Display magnification (up to 16x, scrolling and quick magnification available), rotating, histogram, bright/dark area warning, copyright display, calendar filmstrip, display, folder displa",
    "drivemodescontinuousfps": "Continuous Hi: approx. 6.0 FPS (30 JPG, 8 RAW) Continuous Lo: approx. 3.0 FPS (unlimited JPG, 10 RAW)",
    "effectivepixels": "16.3 MP",
    "dustremoval": "Sensor movement with SP coating on low pass filter",
    "customfunctions": "22",
    "datestamp": "n/a",
    "videocapturemodescont": "Interval movie: 3 sec., 5 sec., 10 sec., 30 sec., 1 min., 5min., 10 min., 30 min., 1 hr. Recording time: 4 sec. to 99 hr., Start Interval setting: immediately, from the set time, Motion JPEG(AVI) Movie editing functions: Movie Divide, Delete Sel",
    "focuspointadjustment": "Auto 11 pt., Auto 5 pt., User-Selectable (with Expanded Area AF), Center",
    "digitallevel": "Viewfinder (horizontal), LCD (horizontal, vertical), SR auto-level function",
    "category": "camera",
    "shutter": "Type: Electronically controlled, vertical-run, focal plane shutter Shutter speed: Auto: 1/6000 to 30 sec., Manual: 1/6000 to 30 sec. (1/3EV steps or 1/2EV steps), Bulb",
    "autopicturemodes": "Standard, Portrait, Landscape, Macro, Moving Object, Night Scene Portrait, Night Scene, Blue Sky, Forest",
    "primaryconstructionmaterials": "Reinforced polycarbonate over stainless steel chassis",
    "facedetectionavailable": "Yes",
    "othermodes": "Multi-exposure: 2-9 shots, auto exposure adjustment Interval: 999 shots, 3 sec to 24 hr interval, time delay HDR: Auto, HDR 1, HDR 2, HDR 3, pixel alignment, exposure bracket +/- 1-3 EV (1/1 steps) Cable switch: Yes CS-205 (sold separately)",
    "sdmfunction": "Yes",
    "sensorsize": "23.7 x 15.7mm (APS-C)",
    "imagefile": "Recorded resolutions: 16M (4928x3264), 12M (4224x2816), 8M (3456x2304), 5M (2688x1792) RAW (4928x3264) Quality levels: Best, Better, Good File formats: RAW (DNG), JPG (EXIF 2.3), DCF 2.0 compliant, DPOF, PIM III Color space: sRGB, AdobeRGB",
    "liveview": "Type: TTL by CMOS image sensor Field Of View: 100% Display Modes: Magnification (2-6X), Grid Overlay (4x4, Golden Ratio, Scale), Bright/Dark Indication, Histogram",
    "modeselection": "Hyper Program (P), Sensitivity Priority (Sv), Shutter Priority (Tv), Aperture Priority (Av), Shutter & Aperture Priority (TAv), Hyper Manual (M), Bulb (B), User (U1, U2), Scene (SCN), Auto Picture (AUTO), Movie",
    "totalpixels": "16.5 MP",
    "focustype": "SAFOX IXi+ TTL phase-detection 11 point (9 cross) wide autofocus system with light wavelength sensor and diffraction lens",
    "playbackmodepallet": "Image Rotation, Digital Filter, Resize, Cropping, Index Print, Protect, Slideshow, Save as Manual WB, Save Cross Processing, RAW Development, Movie Edit, DPOF",
    "sensorcolordepth": "8 bits/channel JPG, 12 bits/channel RAW",
    "focuspeaking": "Yes (n/a during active video recording)",
    "videocapturemodes": "Custom Image modes: Bright, Natural, Portrait, Landscape, Vibrant, Radiant, Muted, Bleach Bypass,Reversal Film, Monochrome, Cross Processing Digital filters (capture): Extract Color, Toy Camera, Retro, High Contrast, Shading, Invert Color, Color",
    "powerzoomfunction": "n/a",
    "dynamicrangeadjustment": "Highlight, shadow",
    "interfaces": "Ports: USB 2.0 hi-speed, AV out USB Connection: MSC / PTP Video out: NTSC, PAL Microphone: Built-in monaural",
    "afassist": "Yes via dedicated LED AF assist lamp",
    "pixelmapping": "Yes",
    "sensortype": "CMOS with primary color filter, integrated Shake/Dust Reduction sensor movement system",
    "scenemodes": "Portrait, Landscape, Macro, Moving Object, Night Scene Portrait, Sunset, Blue Sky, Forest,Night Scene, Night Scene HDR (JPG), Night Snap, Food, Pet, Kids, Surf & Snow, Backlight Silhouette, Candlelight, Stage Lighting, Museum",
    "meteringsystem": "Type: TTL open aperture 77 segment metering Sensitivity range: EV 0 to 22 (ISO 100, 50mm F1.4) Metering patterns (multi, center, spot): Multi 77, Center, Spot Exposure compensation: +/- 5 EV (1/3 and 1/2 steps) Exposure lock: Yes Ex",
    "imagestabilizationshakereduction": "Sensor-shift SR with rotational compensation (3 stops avg CIPA, 4 stops max)",
    "focusmodes": "AF.A (auto), AF.S (single, w focus lock, focus/shutter priority selectable), AF.C (continuous, w focus/FPS priority selectable), Manual",
    "storagemedia": "Internal memory: n/a Removable memory: SD, SDHC, SDXC, (Eye-Fi Card compatible)",
    "lensmount": "PENTAX KAF2 bayonet stainless steel mount",
    "lcdmonitor": "Type: 3.0\" TFT color LCD w brightness/color adjustment Resolution: 921,000 dots Wide angle viewable: Yes",
    "digitalfilterscapture": "Extract Color, Toy Camera, Retro, High Contrast, Shading, Invert Color, Color",
    "externalflash": "Type: Hotshoe (P-TTL), high speed sync and wireless with PENTAX dedicated flash Synchronization speed: 1/180 sec",
    "filestoragebasedon4gbmemory": "Still 16MP (3:2) RAW: 150 images Still 16MP (3:2) Best Image Quality: 421 Video 1080p30 Best Image Quality: 0:16:21 Video 1080p24 Best Image Quality: 0:20:21 Video 720p60 Best Image Quality: 0:16:21 Video 720p30 Best Image Quality:",
    "languagesupport": "English, French, German, Spanish, Portuguese, Italian, Dutch, Danish, Swedish, Finnish, Polish, Czech, Hungarian, Turkish, Greek, Russian",
    "operatingtemperature": "14-104 FlexShopper Newsletter Get info about new products, exclusive promotions and company news. Thank you for subscribing! Invalid email address Subscribe Safe & Secure © 2014 FlexShopper LLC. All Rights Reserved. Overview Apply today My account FAQs FlexShopper About us Privacy Policy Website Services Agreement Mobile App Services Agreement Contact Us Merchants Become an Affiliate * This is an estimated weekly payment, rounded to the nearest dollar for the merchandise shown if you were to acquire ownership after making 52 weekly payments. The actual weekly payment may vary depending on your spending limit and how much you spend; the actual weekly payment will be in your lease. Ownership is optional and you may purchase or return the merchandise at any time after the initial payment has been paid, the minimum lease period has been met and provided proper notice is given to FlexShopper per your lease. See your lease for more information regarding ownership and minimum term. ** You will be given a credit for one weekly payment. This credit will be applied to the second weekly payment due, provided your first payment clears. This credit will be removed from your account if your first weekly payment fails. All other terms and conditions of your Lease Agreement remain in effect. This credit is only valid for online orders and for a single lease per individual. † The cash price is the amount you would have paid online or at a store to buy the item(s). If you pay the cash price plus $50 within ninety days of the Lease’s effective date you will own the item(s). 1 Free delivery offer applies to scheduled delivery on select major appliances, furniture, treadmills, ellipticals, exercise cycles, home gyms and outdoor grills. Major appliances include standard size or larger refrigerators, washers & dryers, ranges & ovens, microwaves and dishwashers. Limited metro delivery areas. Additional parts, extensive labor and installation charges are extra. The transit time will vary by delivery address. × Close Enter the promo code you heard here: Submit close Continue Shopping View cart & checkout",
    "sensitivityrange": "EV -1 to 18 (ISO 100)",
    "builtinflash": "Type: Retractable P-TTL pop-up flash Guide number: 12m (ISO 100) Coverage: 28mm wide angle equivalent Flash modes: P-TTL, Red-eye Reduction, Slow-speed Sync, Trailing Curtain Sync Flash exposure compensation: -2 to +1 EV (1/3 steps)",
    "drivemodesmodeselection": "Single, Continuous (Hi, Lo), Self-Timer (12s, 2s), Remote (0s, 3s), Exposure Bracketing (3 frames)",
    "customimagemodes": "Bright, Natural, Portrait, Landscape, Vibrant, Radiant, Muted, Bleach Bypass, Reversal Film, Monochrome, Cross Processing",
    "systemrequirements": "Windows: Windows XP(SP3 or later 32-bit Home/Pro), Vista (32-bit,64-bit), Win 7 (32-bit, 64-bit) Win 8, (can be run as a 32-bit application on any 64-bit edition of Windows). Mac: MacOS X, 10.5, 10.6, 10.7, 10.8",
    "viewfinder": "Type: Pentaprism Coverage (field of view): 100% Magnification: 0.92X (w 50mm F1.4 at infinity) Standard focusing screen: Natural-Bright-Matte III (interchangeable) Diopter adjustment: -2.5m to +1.5m Depth of field preview: Optical (",
    "greensimplifiedmodeavailable": "n/a",
    "whitebalance": "Type: Image sensor detection with light wavelength sensor detection Auto preset modes: Auto, Daylight, Shade, Cloudy, (D: Daylight Color, N: Daylight White, W: Cool White, L: Warm White), Tungsten, Flash, CTE Manual mode(s): a) 3 manual settings can"
}