{
    "meteringrange": "Real-time Evaluative metering with the image sensor: Metering range: EV 0 to EV 20 at 23° C (73° F) 50mm f/1.4 lens, ISO 100 AE lock possible The active metering time can be changed.",
    "isospeedrange": "For Stills: ISO 100-25600 (in 1/3-stop or whole-stop increments) ISO speed expansion possible to ISO 50, 51200, and 102400 For [Highlight tone priority], the settable ISO speed range will be 200-25600 Shooting Mode ISO Settings A+ 100 - 12800 P / T / Av / M 100 - 25600 B ISO 400 Fixed With Flash ISO 400 Fixed* * If fill flash will overexpose, minimum ISO 100 is set. * For bounce flash, ISO 400-1600 is set automatically based on the light level. ISO Speed Upper and Lower Limits: (1) Manual Setting Range - ISO speed expansion is set with this option. (2) Auto ISO Range - ISO speed expansion not settable. Shutter speed and automatic ISO speed control in P and Av Modes: In the P and Av shooting modes with Auto ISO set, the ISO speed is set automatically so that a shutter speed slower than the one set with [Minimum shutter speed] (1/250, 1/125, 1/60, 1/30, 1/15, 1/8, 1/4, 0\"5, 1\") is not set.",
    "shutterspeeds": "1/8000 to 1/60 second, X-sync at 1/200 second 1/8000 to 30 seconds, Bulb - Total shutter speed range. Available range varies by shooting mode. Shutter speed's control range can be set with a Custom Function.",
    "afpointselection": "(1) Single-point AF (Manual selection) (2) Auto selection 61-Point AF (3) Single-point Spot AF (Manual selection) (4) AF point expansion (Manual selection, 4 points: Up, down, left, and right) (5) AF point expansion (Manual selection, surrounding 8 points) (6) Zone AF (Manual zone selection)",
    "maximummagnification": "0.23x at 105mm",
    "colorfiltersystem": "RGB primary color filter",
    "viewfindershooting": "LP-E6 x1(Same as Chart above)",
    "afworkingrange": "EV -2 to 18 at 23°° C / 73° F and ISO 100, based on Canon's testing standards",
    "drivemodes": "Single, High-speed continuous, Low-speed continuous, Silent Single Shooting and Self-timer (10 sec. self-timer/remote control, or 2-sec. self-timer/remote control)",
    "flashexposurecompensation": "±3 Stops in 1/3 or 1/2 stop increments",
    "batterycheck": "Automatic battery level check when power is turned on. Displayed in 6 levels: Battery level displayed on LCD panel and in viewfinder. Battery info can be checked with the [Battery info.] menu If Battery Grip BG-E11 is used with size AA/LR6 batteries; the battery level is displayed in four levels instead.",
    "externalflashsettings": "The camera can set the following with Speedlite 600EX-RT, 580EX II, 430EX II, 320EX, 270EX II, or 270EX: (1) External flash control - Flash mode, sync setting, FEB (not possible with 270EX II/270EX), flash exposure compensation, E-TTL II, zoom, wireless master flash (not possible with 430EX II/ 270EX), and clear settings. With the Speedlite 600EX-RT, radio wireless control is possible. (2) Flash Custom Function setting",
    "workinghumidityrange": "85% RH or less",
    "afactuator": "Ring USM with Mechanical full-time manual focusing",
    "builtindioptricadjustment": "Adjustable from ~ -3.0 to +1.0m -1 (dpt)",
    "diagonalangleofview": "84 to 23° 20'",
    "ipbrecordtime": "32 min. at 1920 x 1080",
    "shootingmethod": "BatteryTemperaturePossible Shots",
    "picturestyle": "Auto - Scene Intelligent Auto will set Auto automatically, Standard, Portrait, Landscape, Neutral, Faithful, Monochrome, User Defined 1, 2, 3",
    "compatibleprinters": "PictBridge&reg; compatible printers",
    "rawjpegsimultaneousrecording": "The image-recording quality can be selected in any combination of the three RAW and eight JPEG recording quality settings.",
    "compatiblelenses": "Canon EF Lenses (excluding EF-S Lenses)",
    "settings": "Auto (AWB), Daylight, Shade, Cloudy, Tungsten Light, White Fluorescent Light, Flash, Custom (Custom WB) and Color Temperature - With an EX-series Speedlite having the color temperature information transmission feature, the color temperature setting changes to match the color temperature when the flash is fired.",
    "felock": "Provided",
    "recordingfunctions": "(1) Standard - Records to either the CF card or SD card. (2) Auto switch card -  When the current card becomes full, the camera switches to the other card automatically. (3) Record separately - The CF card and SD card record the same image at a different image recording quality (L, M, S1, S2, S3, RAW, M-RAW, S-RAW)    (4) Record to multiple - Both the CF card and SD card record the same image at the same image recording quality. (Also applies to RAW+JPEG, M+JPEG, and SRAW+JPEG)",
    "griddisplay": "3 Grid display provided",
    "exposurecontrol": "(1) Program AE for movie shooting - For shooting modes other than manual exposure and bulb. Shutter speed (1/30 - 1/4000 sec., signal accumulation time), aperture, and ISO speed automatically set. (2) Manual exposure - For manual exposure. Shutter speed (signal accumulation time), aperture, and ISO speed (auto/manual) manually set. The shutter speed (signal accumulation time) is limited to 1/4000 sec. at the maximum and to 1/30 sec. at the minimum for 24/25/30 fps or 1/60 sec. or higher for 50/60 fps.",
    "weight": "515g (1.1 lb) Body only 670g (1.5 lb) Lens only 1,185g (2.6 lb) Body and Lens",
    "numberofdiaphragmblades": "8",
    "liveviewshooting": "LP-E6 x1(Same as Chart above)",
    "erase": "Erase: single image, selected images, all images on folder, all images in a card, or erase only unprotected images",
    "mirror": "Quick-return Half Mirror: Reflectance ratio 40:60",
    "category": "camera",
    "afassistbeam": "(1) Enable - With an EOS-dedicated Speedlite, AF-assist beam is emitted automatically when necessary. (2) Disable (3) IR AF assist beam only - No AF-assist beam with flash bursts.",
    "distanceinformation": "Yes",
    "colortemperatureinformationtransmission": "Provided",
    "selftimer": "10-second or 2-second delay",
    "focallengthmaximumaperture": "24 to 105mm                 f/4",
    "allirecordtime": "11 min. at 1920 x 1080",
    "aelock": "(1) Auto AE Lock - In the One-Shot AF mode with evaluative metering, AE lock takes effect when focus is achieved (2) Manual AE Lock - With AE lock button. AE lock is updated each time you press the button, enabled in all metering modes.",
    "minimumaperture": "f22",
    "shootingmode": "ISO Settings",
    "backuprecording": "Images recorded in a card can be copied to the other card",
    "brightnesscontrol": "Auto: Brightness adjusted automatically by the light sensor Adjustable to one of three levels: Darker, Standard, Brighter Manual: Adjustable to one of seven brightness levels",
    "colortemperaturecompensation": "White Balance Correction: - Blue / Amber bias: ±9 levels -Magenta / Green bias: ±9 levels Corrected in reference to the current WB mode's color temperature.",
    "highlightalert": "With single-image display (Information) and single-image display, overexposed highlight areas will blink",
    "datetimebattery": "CR1616 Lithium Battery",
    "lensmount": "Canon EF Mount",
    "pixels": "~1,040,000 dots",
    "remotecontrol": "(1) The EOS Rebel T3i has a remote control terminal for Remote Switch RS-60E3. (2) Compatible with Remote Controller RC-6, RC-1 and RC-5.",
    "pcterminal": "Provided (no polarity)",
    "maximumrecordtime": "29 min. 59 sec.",
    "shootingmodes": "Still photo shooting and video recording",
    "range": "ISO Range:         P, Av, and Bulb: Automatically set within ISO 100 - 12800, expandable to H (equivalent to ISO 25600) A+ and Tv: Automatically set within ISO 100 - 12800 M: Auto ISO (automatically set within ISO 100 - 12800), ISO 100 - 12800 set manually (in 1/3- or whole-stop increments), expandable to H (equivalent to ISO 16000/20000/25600) If Highlight tone priority is set to enable, the settable ISO speed range will be ISO 200 - 12800.",
    "protection": "Erase protection can be applied or canceled for a single image, all images in a folder, or all images in the card.",
    "camerausersettings": "Current camera settings can be registered to C1, C2 and C3 on the Mode Dial - Automatic registration update is possible",
    "fileformat": "MPEG-4 AVC / H.264 - Variable (averaged) bit rate",
    "powersaving": "Power turns off after the set time (1, 2, 4, 8, 15 or 30 minutes) of non-operation elapses",
    "interfacelanguages": "25 (English, German, French, Dutch, Danish, Portuguese, Finnish, Italian, Norwegian, Swedish, Spanish, Greek, Russian, Polish, Hungarian, Czech, Romanian, Ukraine, Turkish, Arabic, Thai, Simplified and Traditional Chinese, Korean and Japanese)",
    "battery": "Battery Pack LP-E6 x 1, AC power can be supplied with the AC Adapter Kit ACK-E6",
    "compatibleimages": "JPEG and RAW images and movie. For RAW+JPEG, only the RAW or JPEG image or both images can be transferred",
    "recordingmedia": "CF Cards (Type I); Compatible with UDMA CF cards; SD, SDHC, and SDXC Memory Cards",
    "depthoffieldpreview": "Enabled with depth-of-field preview button",
    "framerates": "[1920 x 1080]: 30 fps / 25 fps / 24 fps [1280 x 720]: 60 fps / 50 fps [640 x 480]: 30 fps / 25 fps",
    "customfunctions": "13 Custom Functions settable with the camera",
    "silentshooting": "Provided (Mode 1 and 2)",
    "magnification": "~0.71x / Angle of View 34.1° (with 50mm lens at infinity, -1 m -1 (dpt)",
    "recordingformat": "Design rule for Camera File System 2.0 and Exif 2.3",
    "filesize": "(1) Large: ~ 22.10 Megapixels (5760 x 3840) (2) Medium: ~ 9.80 Megapixels (3840 x 2560) (3) S1 (Small 1): ~ 5.50 Megapixels (2880 x 1920) (4) S2 (Small 2): ~ 2.50 Megapixels (1920 x 1280) (5) S3 (Small 3): ~ 350,000 Pixels (720 x 480) (6) RAW: ~ 22.10 Megapixels (5760 x 3840) (7) M-RAW: ~ 10.50 Megapixels (3960 x 2640) (8) S-RAW: ~ 5.50 Megapixels (2880 x 1920) Exact file sizes depend on the subject, ISO speed, Picture Style, etc.",
    "imagesensorsize": "36 mm x 24mm (35mm Full-frame)",
    "eosdedicatedspeedlite": "E-TTL II autoflash with all EX Series Speedlites",
    "workingtemperaturerange": "0 - 40° C (32 - 104° F)",
    "type": "TFT color, liquid crystal monitor",
    "exposuresimulation": "Provided",
    "sizeaalr6alkalinebatteries": "23° C-",
    "filenumbering": "The following three types of file numbers can be set: (1) Continuous Numbering - The continuous numbering of captured images will continue even after you replace the camera's card. (The numbering continues even when the folder changes.) (2) Auto Reset - When you replace the camera's card, the numbering will be reset to start from 0001. If the new card already contains images, the numbering will continue from the last recorded image in the card. (3) Manual Reset - Resets the file number to 0001, and creates a new folder automatically.",
    "closestfocusingdistance": "0.45m (17.8\")",
    "focusingscreen": "Fixed",
    "shutterrelease": "Soft-touch Electromagnetic Release",
    "focusing": "(1) Autofocus One-Shot AF Live mode One-point, contrast AF. Switching to another AF point possible Face detection Live mode Face detection, contrast AF. Face selectable Quick mode 61-point, phase-difference AF, same as normal shooting (2) Manual Focus - Magnify the image by 5x or 10x and focus manually.",
    "dustdeletionfeature": "(1) Self Cleaning Sensor Unit - Automatic Sensor Cleaning - Removes dust adhering to the infrared- and ultraviolet-blocking glass. - Self-cleaning executed automatically when power is turned on or off. Manual execution also possible. - Low-pass filter has a fluorine coating. (2) Dust Delete Data Acquisition and Appending - The coordinates of the dust adhering to the infrared- and ultraviolet-blocking glass are detected by a test shot and appended to subsequent images. - The dust coordinate data appended to the image is used by the provided software to automatically erase the dust spots. (3) Manual Cleaning",
    "zoomsystem": "5-group helical zoom - front group moves 32.5mm (1.28\")",
    "b": "ISO 400 Fixed",
    "afpoints": "61 points with up to 41 cross-type points. One to five cross-type AF points at f/2.8, 10 to 20 cross-type AF points at f/4, and 15 to 21 cross-type AF points at f/5.6. (The number of cross-type AF points depends on the lens.)",
    "colorspace": "sRGB, Adobe RGB",
    "filtersize": "77mm",
    "focusingmodes": "(1) Autofocus - One-Shot AF - Predictive AI Servo AF - For automatic AF point selection, the AF point to start the AI Servo AF operation can be selected. For automatic AF point selection, the active AF point can be displayed. - AI Focus AF - Switches between One-Shot AF and AI SERVO AF automatically. Automatically set in A+ Auto Mode    (2) Manual focus (MF)",
    "withflash": "ISO 400 Fixed*",
    "exposurecompensation": "Up to ±3 stops in 1/3-stop increments - For movies, even if exposure compensation has been set beyond ±3 stops, exposure compensation up to only ±3 stops will be applied. For still photos, exposure compensation up to ±5 stops can be applied.",
    "autowhitebalance": "Auto White Balance with the Image Sensor",
    "imagestabilization": "3 Stops",
    "selectedafpointdisplay": "Displayed in viewfinder with transparent LCD and on LCD panel",
    "startuptime": "~0.1 second",
    "meteringmodes": "Real-time Evaluative metering with the image sensor.",
    "lpe6x2": "23° CTBA",
    "printableimages": "RAW & JPEG images complying to Design rule for Camera File System",
    "monitorsize": "76mm (3.0\") Screen aspect ratio of 3:2",
    "lensconstruction": "18 elements in 13 groups",
    "continuousshootingspeed": "High-speed: Maximum ~ 6 shots/second Low-speed: Maximum ~ 3 shots/second Silent continuous shooting: Maximum ~3 shots/second",
    "coverage": "~100% Viewing Angle: 170°",
    "aspectratio": "3:2 (Horizontal:Vertical)",
    "a": "100 - 12800",
    "lowpassfilter": "Fixed position in front of the image sensor",
    "eyepoint": "~21mm (At -1m -1 from the eyepiece lens center)",
    "viewfinderinformation": "(1) AF Information, focus confirmation, AF Status Indicator (2) Exposure Information: Shutter Speed, Aperture, ISO Speed, AE lock, exposure level, exposure warning) (3) Flash Information: Flash Ready, Flash Exposure Compensation, High Speed Sync, FE Lock, Red Eye Reduction Light (4) Image Information: Highlight Tone Priority (D+), Maximum Burst, Card Information) (5) Composition Information: Grid, Electronic Level (6) Warning Symbol: Displayed if any of the following is set: Monochrome, White Balance Correction, One-Touch Recording Quality Switch, Expanded ISO Speed, or Spot Metering",
    "displayformat": "Single image, Single image + Image-recording quality/shooting information, Histogram, 4 or 9 Image index, Magnified view (~ 1.5x to 10x), Rotated image (auto/manual,) Image jump (by 10/100 images, index screen, by shooting date, by folder), Two image comparative display, Slide show (all images/selected by date/folder), Star rating",
    "zoomingtomatchfocallength": "Provided",
    "maximumburst": "JPEG (Large/Fine): ~65 shots RAW: ~13 shots RAW+JPEG (Large/Fine): ~7 shots Based on Canon's testing standards (ISO 100 and Standard Picture Style) and a 8 GB card. JPEG (Large/Fine): ~16,270 shots RAW: ~18 shots RAW+JPEG (Large/Fine): ~7 shots Based on UDMA mode 7, 128 GB card based on Canon's testing standards.",
    "dimensionslxwxh": "76 x 152 x 116mm (3.0 x 6.0 x 4.6\") Body only 107 x 84 x 84mm (4.2 x 3.3 x 3.3\") Lens only 180 x 152 x 116mm (7.1 x 6.0 x 4.6\") Body and Lens",
    "videoresolution": "1920 x 1080 (Full HD), 1280 x 720 and 640 x 480"
}