{
    "meteringrange": "EV 0-20 at 23° C (73° F) with EF 50mm f/1.4 lens, ISO 100",
    "isospeedrange": "For Stills: For Stills: Manual setting range of ISO 100-25,600 (expansion possible to ISO 50, ISO 51,200 and 102,400) in 1/3-stop or whole-stop increments) Shooting Mode ISO Settings Auto 1 100 - 12800 Handheld Night Scene mode 100 - 25600 Landscape ISO 100–1600 P, TV, Av, M ISO–25600 2 B ISO 400 Fixed 2 With Flash ISO 400 Fixed 3 1.  Auto Mode includes: Scene Intelligent Auto, Creative Auto, Close-up, Macro, Sports, Night Portrait and HDR Backlight Control mode. 2. It depends on [Minimum] and [Maximum] of auto ISO setting 3. It depends on [Minimum] and [Maximum] of auto ISO setting. If overexposure would occur with fill flash, the minimum ISO speed is ISO 100. Scene Intelligent Auto, Night Portrait and Handheld Night Scene modes are excluded. For bounced external flash when Creative Auto, Close-up, Landscape, Macro, Sports / P is set, automatically set between ISO 400 – 1,600.",
    "shutterspeeds": "1/4000 to 30 seconds, X-sync at 1/180 second Total shutter speed range. Available range varies by shooting mode",
    "afpointselection": "1) Automatic selection 2) Manual selection",
    "colorfiltersystem": "RGB primary color filters",
    "viewfindershooting": "LP-E6 x1(Same as Chart above)",
    "afworkingrange": "EV -3 to 18 at 23°° C (73° F) and ISO 100",
    "drivemodes": "Single Continuous Silent Single Shooting 10 second self-timer/remote control 2 second self-timer",
    "flashexposurecompensation": "1) Single shooting 2) Continuous shooting 3) Silent single shooting 4) Silent continuous shooting 5) 10-sec. self-timer/Remote control 6) 2-sec. self-timer",
    "batterycheck": "Automatic battery level check when power is turned on. Displayed in 6 levels: Battery level displayed on LCD panel and in viewfinder. Battery information can be checked with the [Battery info.] menu. If Battery Grip BG-E13 is used with size-AA/LR6 batteries, the battery level is displayed in four levels instead.",
    "handheldnightscenemode": "100 - 25600",
    "shootingmethod": "BatteryTemperaturePossible Shots",
    "picturestyle": "Auto,       Standard, Portrait, Landscape, Neutral, Faithful, Monochrome, User Defined 1, 2, 3",
    "compatibleprinters": "PictBridge® compatible printers",
    "rawjpegsimultaneousrecording": "Large RAW and JPEG images are recorded simultaneously",
    "workinghumidity": "85% RH or less",
    "compatiblelenses": "Canon EF Lenses (excluding EF-S  and EF-M Lenses)",
    "settings": "Auto, Preset (Daylight, Shade, Cloudy, Tungsten Light, White Fluorescent Light, Flash), Custom (~ 2,000° - 10,000° K), Color Temperature (~ 2,500° - 10,000° K), White Balance Correction, and White Balance Bracketing",
    "felock": "Provided",
    "recordingfunctions": "1) Standard - Records to either the CF card or SD card. 2) Auto switch card -  When the current card becomes full, the camera switches to the other card automatically. 3) Record separately - The CF card and SD card record the same image at a different image recording quality (L, M, S1, S2, S3, RAW, M-RAW, S-RAW) 4) Record to multiple - Both the CF card and SD card record the same image at the same image recording quality. (Also applies to RAW+JPEG, M+JPEG, and SRAW+JPEG)",
    "griddisplay": "3 Grid displays provided",
    "exposurecontrol": "(1) Program AE for movie shooting - For shooting modes other than manual exposure and bulb. Shutter speed (1/30 - 1/4000 sec., signal accumulation time), aperture, and ISO speed automatically set. (2) Manual exposure - For manual exposure. Shutter speed (signal accumulation time), aperture, and ISO speed (auto/manual) manually set. The shutter speed (signal accumulation time) is limited to 1/4000 sec. at the maximum and to 1/30 sec. at the minimum for 24/25/30 fps or 1/60 sec. or higher for 50/60 fps depending on the frame rate.",
    "weight": "680g (1.50 lb) Body only",
    "liveviewshooting": "LP-E6 x1(Same as Chart above)",
    "erase": "Erase: single image, selected images, all images on folder, all images in a card, or erase only unprotected images",
    "mirror": "Quick-return Half Mirror: Reflectance ratio 40:60",
    "category": "camera",
    "afassistbeam": "1) Enable: With an EOS-dedicated Speedlite attached, AF-assist beam is emitted automatically when necessary 2) Disable 3) IR AF-assist beam only: Not used with flash bursts",
    "shutterlagtime": "1) During SW-1 ON, time lag between SW-2 ON and start of exposure: \u009e 0.060 second 2) Time lag between simultaneous SW-1/SW-2 ON and start of exposure: ~0.144 second Time lag with the aperture stopped down by 3.5 stops or less (Excludes AF operation time).",
    "selftimer": "10  or 2 second delay",
    "aelock": "Possible. During movie shooting, press the \"*\" button for AE lock and press the button to cancel AE lock (not automatically cancelled). AE lock (cancelled automatically when metering timer is turned off) possible before movie shooting. Movie shooting can start while AE lock is set.",
    "shootingmode": "ISO Settings",
    "backuprecording": "Images recorded in a card can be copied to the other card",
    "brightnesscontrol": "Manually adjustable to 7 levels",
    "mymenuregistration": "Up to six top-tier menu options and Custom Function settings can be registered Interface",
    "protection": "Erase protection can be applied or canceled for a single image, all images in a folder, or all images in the card.",
    "highlightalert": "With single-image display (Information) and single-image display, overexposed highlight areas will blink",
    "datetimebattery": "Built-in secondary battery. When battery is fully charged, the date/time can be maintained for 3 months. Requires about 8 hours to fully recharge the backup battery.",
    "lensmount": "Canon EF Mount",
    "pixels": "1,040,000 dots",
    "pcterminal": "Provided",
    "shootingmodes": "Still photo shooting and video recording",
    "items": "When you press the Quick Control function button under the following conditions, you can set the functions below: *The settable functions depend on the shooting mode 1) With Viewfinder Shooting: Shutter speed, aperture, ISO speed, exposure compensation, AEB, flash exposure compensation, Wi-Fi®, Picture Style, white balance, white balance correction, Auto Lighting Optimizer, Custom Controls, AF operation, AF point selection, Drive mode, metering mode, and image recording quality 2) During Playback: Image protect, image rotate, rating, RAW image processing, resize, highlight alert, AF point, and image jump with mode dial.",
    "range": "Full Range",
    "colortemperaturecompensation": "Blue / Amber bias: ±9 levels Magenta / Green bias: ±9 levels Corrected in reference to the current WB mode's color temperature.",
    "fileformat": "MPEG-4 AVC / H.264 Audio: Linear PCM (Stereo)",
    "powersaving": "Power turns off after the set time (1, 2, 4, 8, 15 or 30 minutes or disabled) of non-operation",
    "interfacelanguages": "25 (English, German, French, Dutch, Danish, Portuguese, Finnish, Italian, Norwegian, Swedish, Spanish, Greek, Russian, Polish, Hungarian, Czech, Romanian, Ukraine, Turkish, Arabic, Thai, Simplified and Traditional Chinese, Korean and Japanese)",
    "battery": "Battery Pack LP-E6 x 1 Optional: With Battery Grip BG-E13, two battery packs (LP-E6) can be used, or six AA-sized/LR6 batteries can be used",
    "compatibleimages": "N/A",
    "recordingmedia": "SD card, SDHC card, SDXC memory card. Compatible with Ultra High-Speed (UHS-I) memory cards.",
    "depthoffieldpreview": "Enabled with depth-of-field preview button",
    "framerates": "[1920 x 1080]: 30 fps / 25 fps / 24 fps [1280 x 720]: 60 fps / 50 fps [640 x 480]: 30 fps / 25 fps",
    "customfunctions": "20 Custom Functions",
    "landscape": "ISO 100–1600",
    "silentshooting": "Provided (Mode 1 and 2)",
    "batterylife": "Camera Body Only: Shooting Method Temperature Possible Shots Viewfinder Shooting 23° C ~1,090 Shots 0° C ~980 Shots Live View Shooting 23° C ~220 Shots 0° C ~190 Shots With Battery Grip BG-E13 Installed: Chart data from CIPA (Camera & Imaging Products Assoc.) testing standards, with fully charged batteries. Shooting Method Battery Temperature Possible Shots Viewfinder Shooting LP-E6 x1 (Same as Chart above) LP-E6 x2 23° C ~2,130 0° C ~1,900 Size AA / LR6 Alkaline Batteries 23° C ~480 0° C ~140 Live View Shooting LP-E6 x1 (Same as Chart above) LP-E6 x2 23° C ~420 0° C ~360 Size AA / LR6 Alkaline Batteries 23° C ~110 0° C ~24",
    "magnification": "~0.71x / Angle of View 33.3°",
    "recordingformat": "Complies with design rule for Camera File System 2.0 and Exif 2.30",
    "filesize": "1) Large: ~20.0 megapixels (5,472 x 3,648) 2) Medium: ~8.9 megapixels (3,648 x 2,432) 3) Small 1: ~5.0 megapixels (2,736 x 1,824) 4) Small 2: ~2.5 megapixels (1920 x 1280) 5) Small 3: ~350,000 pixels (720 x 480) 6) RAW: ~ 20.0 megapixels (5,472 x 3,648) M RAW: ~ 11.0 megapixels (4,104 x 2,736) S RAW: ~ 5.0 megapixels (2,736 x 1,824)",
    "imagesensorsize": "35.8 mm x 23.9mm (35mm Full-frame)",
    "type": "TFT color, liquid crystal monitor",
    "exposuresimulation": "Provided",
    "sizeaalr6alkalinebatteries": "23° C~110",
    "autowhitebalance": "Auto White Balance with the Image Sensor",
    "filenumbering": "The following three types of file numbers can be set: (1) Continuous Numbering - The continuous numbering of captured images will continue even after you replace the camera's card. (The numbering continues even when the folder changes.) (2) Auto Reset - When you replace the camera's card, the numbering will be reset to start from 0001. If the new card already contains images, the numbering will continue from the last recorded image in the card. (3) Manual Reset - Resets the file number to 0001, and creates a new folder automatically.",
    "histogram": "Brightness and RGB can be displayed",
    "focusingscreen": "Eg-A II provided. Interchangeable with Eg-D and Eg-S. Incompatible with Eg-A.",
    "shutterrelease": "Soft-touch Electromagnetic Release",
    "imageformat": "Still: JPEG, RAW (14-bit, Canon original), RAW+JPEG Video: MOV (Image data: H.264, Audio: Linear PCM)",
    "focusing": "1) Autofocus: FlexiZone - Single: One-point, contrast AF. Switching to another AF point is possible Face Detection Live mode: Face detection, contrast AF. Face is selectable Quick Mode AF: Phase-difference AF with 11 AF points. 2) Manual Focus Magnified view is not possible during video shooting.",
    "dustdeletionfeature": "1) Self Cleaning Sensor Unit - Removes dust adhering to the low-pass filter - Self-cleaning executed automatically (taking 2 sec.) when power is turned on or off. Manual execution also possible (taking 8.0 sec.). 2) Dust Delete Data acquisition and appending - The coordinates of the dust adhering to the low-pass filter are detected by a test shot and appended to subsequent images. -The dust coordinate data appended to the image is used by the provided software to automatically erase the dust spots. 3) Manual cleaning of sensor",
    "b": "ISO 400 Fixed 2",
    "afpoints": "11 points Center: cross-type at f/5.6; vertical line-sensitive at f/2.8 Upper and lower AF points: vertical line-sensitive AF at f/5.6 Other AF points: Horizontal line-sensitive AF at f/5.6.",
    "colorspace": "sRGB, Adobe RGB",
    "focusingmodes": "1) Autofocus - One-Shot AF - AI Servo AF - AI Focus AF 2) Manual Focus",
    "withflash": "ISO 400 Fixed 3",
    "usbterminal": "For personal computer communication and direct printing (USB 2.0 Hi-Speed)",
    "exposurecompensation": "Up to ±3 stops in 1/3-stop increments. For movies, even if exposure compensation has been set beyond ±3 stops, exposure compensation up to only ±3 stops will be applied.",
    "coating": "Resin cover and anti-reflection AR coating",
    "ptvavm": "ISO–25600 2",
    "selectedafpointdisplay": "Displayed or indicated by superimposed display in the viewfinder and on the LCD monitor",
    "startuptime": "~0.1 second (Based on CIPA testing standards)",
    "continuousshooting": "Maximum: ~4.5 fps Silent: ~3.0 fps",
    "videooutterminal": "1) AV stereo OUT terminal: NTSC/PAL selectable 2) Mini-HDMI OUT terminal (Type C)",
    "meteringmodes": "Real-time Evaluative metering with the image sensor: 1) Evaluative metering (315 zones) 2) Partial metering (\u009e 11% of Live View screen) 3) Spot metering (\u009e 3% of Live View screen) 4) Center-weighted average metering",
    "workingtemperature": "0 - 40° C (32 - 104° F)",
    "lpe6x2": "23° C~420",
    "flashmetering": "E-TTL II autoflash (evaluative flash metering and average flash metering)",
    "printableimages": "RAW & JPEG images complying to Design rule for Camera File System",
    "monitorsize": "76mm (3.0\") Screen aspect ratio of 3:2",
    "coverage": "~100%",
    "aspectratio": "3:2 (Horizontal:Vertical)",
    "lowpassfilter": "Fixed position in front of the image sensor",
    "eyepoint": "~21mm (At -1m -1 from the eyepiece lens center)",
    "viewfinderinformation": "AF information: AF points and focus confirmation Exposure information: Shutter speed, aperture, ISO speed (always displayed), AE lock, exposure level, exposure warning Flash information: Flash ready, flash exposure compensation, high-speed sync, FE lock Image information: Highlight tone priority (D+), maximum burst (2-digit display), card information Battery check Composition information: Electronic level Warning Symbol: Displayed if any of the following is set; Monochrome, white balance correction, expanded ISO speed, or spot metering",
    "customcontrols": "The following camera controls can be customized by assigning the desired function: Shutter button halfway pressing, AF-ON button, AE lock button, Depth-of-field preview button, Lens AF Stop button, SET button, Main Dial, Quick Control Dial, and Multi-controller",
    "displayformat": "Single Image Display: Two types of single-image full display w/     Two types of shooting information.     Index display 4 and 9 image index. Jump Display: Jump 1, 10 or 100 images, Shooting Date, Folder, Movies, Stills, or Rating Two-image comparative display is not provided.",
    "dpof": "Digital Print Order Format Version 1.1 compatible",
    "builtindioptricadjustment": "Adjustable from ~ -3.0 to +1.0m -1 (diopter)",
    "maximumburst": "Based on 8GB memory Card: JPEG Large/Fine: ~ 73 Shots RAW: ~ 14 Shots RAW+JPEG Large/Fine: 7 Shots Based on 8GB UHS-I memory card:    JPEG Large/Fine: ~ 1250 Shots RAW: ~ 17 Shots RAW + JPEG Large/Fine: 8 Shots (Figures are based on Canon's testing standards: ISO 100 and Standard Picture Style)",
    "dimensionslxwxh": "71 x 145 x 112mm (2.8 x 5.7 x 4.4\") Body only",
    "model": "EOS 6D Camera Body"
}