{
    "attr": "Samsung WB30F 16 Megapixel Digital Camera - Plum£weeks Interest free 0% APR£ per week",
    "wirelessconnection": "Wireless LAN",
    "minfocusdistance": "80 cm",
    "weight": "131 g",
    "wificonnectivity": "Experience the wireless advantages of the SMART CAMERA's Wi-Fi connectivity and truly intelligent features. You can quickly connect to Wi-Fi networks, while AutoShare, Social Sharing, Cloud, email, AllShare Play and PC Auto Backup let you share memories with friends and family around the world. Features including, Software Upgrade Notifier, the Samsung SMART CAMERA App, MobileLink and Remote Viewfinder make it easy to connect to your smartphone and tablet.",
    "livepanorama": "With Live Panorama, you can capture a seemingly endless procession of gondolas gliding past a magnificent Venetian palace with an astounding 180Âº panoramic image. And you can preview the image on the LCD before you even snap it. Just hold the shutter button, sweep across the scene and see what you're going to get before you get it.",
    "autoshare": "Simultaneously send every picture you take to your mobile phone via Wi-Fi connection - to make backing up and sharing your high-quality photos super easy. Set up AutoShare once and the camera saves it as the default setting. AutoShare also GPS tags your photos with your Smart Phone.",
    "producttype": "Digital camera - compact",
    "remoteviewfinder": "Control your camera by using your smartphone as the viewfinder. Remote Viewfinder lets you preview images, adjust the camera settings, zoom in and out and frame each scene - all from your phone, wirelessly. This feature is available for select smartphones.",
    "attr20weeks": "interest free available on all items",
    "maxvideoresolution": "1280 x 720",
    "category": "camera",
    "avinterfaces": "Composite video/audio",
    "magicframe": "Make a portrait look like an antique, or put your face on the moon - Magic Frame's 12 background templates offer lots of picture-taking enjoyment. You can also put images on a 1.950's TV set or a movie. There are so many possibilities for fun - especially when you share the poster-quality results!More fun, more creative",
    "memorycardslot": "microSD card",
    "attr1": "Services: £This service charge will be due in full on your next statement.",
    "dimensionswxdxh": "9.8 cm x 1.65 cm x 5.79 cm",
    "productdescription": "Samsung SMART Camera WB30F - digital camera",
    "imagestabiliser": "Optical",
    "smartauto": "Smart Auto (Still & Movie) instantly analyzes key elements of your composition then automatically adjusts to capture the perfect shot with multitude of different photo modes and movie modes.",
    "mobilelink": "Now you can select and send an image or album directly to an Android smartphone, iPhone or tablet with the Samsung MobileLink. You don't even have to send the image as a text message or as an email. With MobileLink, you can control the album on your phone and the changes will be saved to your camera, too.",
    "focusadjustment": "Automatic, manual",
    "colour": "Purple",
    "lenssystem": "10 x zoom lens - 4.3 - 43 mm - f/3.2-6.3",
    "cameraflash": "Built-in flash",
    "digitalzoom": "5 x",
    "sensorresolution": "16.2 Megapixel",
    "supportedbattery": "1 x Samsung BP-70A Li-ion rechargeable battery - 700 mAh ( included )",
    "smartfilter": "Boost creative fun with Samsung's Smart Filter lens and color effects - right on the display! Cartoon Filter makes any photo look like an animated film scene while Cross Filter makes light sources appear to have several points of light. There's also Zooming Shot, Ink Painting, Oil Painting, Half-tone Dot - and many more ways for you to express your creative side!See what you are going to get",
    "attr52weeks": "interest free available on items over£100.00",
    "display": "LCD display - 3\""
}