{
    "category": "camera",
    "shutter": "Type Electronic first curtain and mechanical second curtain shutter Speed 30-1/4000 sec (1/2 or 1/3 stop increments), Bulb (Total shutter speed range. Available range varies by shooting mode)",
    "shooting": "Modes Scene Intelligent Auto mode Still mode (Creative Auto, Portrait, Landscape, Close-up, Sports, Night Portrait, Handheld Night Scene, HDR Backlight Control, Program AE , Shutter priority AE, Aperture priority AE, Manual)Movie mode (Auto exposure mode, Manual exposure mode) Picture Styles Auto, Standard, Portrait, Landscape, Neutral, Faithful, Monochrome, User Defined (x3) Colour Space sRGB and Adobe RGB Image Processing Highlight Tone Priority Auto Lighting Optimizer (4 settings) Long exposure noise reduction High ISO speed noise reduction (4 settings) Multi Shot Noise Reduction Auto Correction of Lens Peripheral illumination and Chromatic aberration Basic+ (Shoot by ambience selection, Shoot by lighting or scene type) Creative filters (Art Bold, Water painting, Grainy B/W, Soft focus, Toy camera, Miniature effect, Fish-eye) Drive Modes Single, Continuous, Self timer (2s, 10s+remote, 10s + continuous shots 2-10) Continuous Shooting Max. Approx. 4.3fps for approx. 17 JPEG images¹, 6 images RAW",
    "lcdmonitor": "Type Touch screen 7.7cm (3.0\") 3:2 Clear View LCD II, approx. 1040K dots Coverage Approx. 100% Viewing Angle (Horizontally/Vertically) Approx 170° Coating Anti smudge Brightness Adjustment Adjustable to one of seven levels Display Options (1) Quick Control Screen (2) Liveview image no information (3) Liveview image full info (4) Liveview image basic info",
    "dimensions": "108.6 x 66.5 x 32.3 mm",
    "weight": "300g",
    "color": "Black",
    "imagesensor": "Type 22.3 x 14.9mm CMOS Effective Pixels Approx. 18.0 megapixels Total Pixels Approx. 18.5 megapixels Aspect Ratio 3:2 Low-Pass Filter Built-in/Fixed Sensor Cleaning EOS integrated cleaning system Colour Filter Type Primary Colour",
    "flash": "Built-in Flash GN (ISO 100, meters) None X-Sync 1/200sec Flash Exposure Compensation '+/- 2EV in 1/2 or 1/3 increments Flash Exposure Bracketing Yes, with compatible External Flash Flash Exposure Lock Yes Second Curtain Synchronisation Yes HotShoe/ PC Terminal Yes/ No External Flash Compatibility E-TTL II with EX series Speedlites, wireless multi-flash support External Flash Control Via camera menu screen",
    "memorycard": "SD, SDHC or SDXC (UHS-I)card",
    "lens": "ens Mount EF-M (EF and EF-S lenses compatible via Mount adapter EF-EOS M). Canon EF-M 18-55mm f/3.5-5.6 IS STM; Canon Mount Adapter EF-EOS M.",
    "focusing": "Type Hybrid CMOS AF System. Phase detection pixels built onto imaging sensor AF System/ Points 31 AF points (Maximum) AF Working Range EV 1-18 (at 23°C & ISO 100) AF Modes One-Shot AF and Servo AF AF Point Selection Automatic selection (Face detection and Tracking AF, FlexiZone-Multi, FlexiZone-Single), Manual selection Selected AF Point Display Indicated on LCD monitor Predictive AF - AF Lock Locked when shutter button is pressed half way AF Assist Beam Yes LED Manual Focus Select on camera menu AF (Auto), MF (Manual), or AF+MF (Manual focus after One-Shot)",
    "powersupply": "Batteries 1 x Rechargeable Li-ion Battery LP-E12 Battery Life Approx. 230 (at 23°C, AE 50%, FE 50%)¹ Approx. 200 (at 0°C, AE 50%, FE 50%) Battery Indicator 4 levels Power Saving LCD monitor turns off after 15 sec, 30sec or 1, 3, 5, 10 or 30mins. Power turns off after 0, 30sec or 1, 3, 5, 10mins and disabled Power Supply & Battery Chargers AC Adapter Kit ACK-E12, Battery charger LC-E12",
    "accessories": "Case EH23-CJ Wireless File Transmitter Compatible with Eye-Fi cards Lenses EF-M (EF and EF-S lenses compatible via Mount adapter EF-EOS M) Flash Canon Speedlites (90EX, 220EX, 270EX, 270EX II, 320EX, 420EX, 430EX, 430EX II, 550EX, 580EX, 580EX II, 600EX, 600EX-RT, Macro-Ring-Lite, MR-14EX, Macro Twin Lite MT-24EX, Speedlite Transmitter ST-E2, Speedlite Transmitter ST-E3-RT) Remote Controller/ Switch Remote Controller RC-6 Other GP-E2",
    "imageprocessor": "DIGIC 5",
    "interface": "Computer Hi-Speed USB Other Video output (PAL/ NTSC) (integrated with USB terminal), HDMI mini output (HDMI-CEC compatible), External microphone (3.5mm Stereo mini jack)",
    "whitebalance": "Type Auto white balance with the imaging sensor Settings AWB, Daylight, Shade, Cloudy, Tungsten, White Fluorescent light, Flash, Custom. White balance compensation: 1. Blue/Amber +/-9 2. Magenta/ Green +/-9. Custom White Balance Yes, 1 setting can be registered WB Bracketing '+/-3 levels in single level increments 3 bracketed images per shutter release. Selectable Blue/Amber bias or Magenta/ Green bias.",
    "exposurecontrol": "Metering Modes Real-time metering from the image sensor (1) Evaluative metering (2) Partial metering at center (3) Spot metering (4) Center weighted average metering Metering Range EV 1-20 (at 23°C with EF-M 22mm f/2 STM ISO100) AE Lock Auto: In One-shot AF mode with evaluative metering exposure is locked when focus is achieved. Manual: By AE lock button in creative zone modes. Exposure Compensation '+/-3 EV in 1/3 or 1/2 stop increments (can be combined with AEB). AEB '3 shots +/- 2 EV, 1/2 or 1/3-stop increments ISO Sensitivity* AUTO(100-6400), 100-12800 in 1-stop increments ISO can be expandable to H: 25600)"
}