{
    "features": "Ultra-fast autofocus so you won’t miss a shot Easy handling via touch screen Ten creative Art Filters",
    "weight": "369g",
    "color": "Black",
    "filetype": "RAW 12bit RAW & JPEG Yes parallel recording JPEG Yes Aspect ratio 4:3 / 3:2 / 16:9 / 6:6 / 3:4 MPO (3D) Yes",
    "interface": "Media SD Memory Card (SDHC, SDXC, UHS-I compatible) Class 6 is recommended for Movie shooting HDMI™ Yes Mini connector (type C) * USB 2.0 High Speed Yes Combined V & USB output Yes NTSC or PAL selectable * \"HDMI\", the HDMI logo and \"High-Definition Multimedia Interface\" are trademarks or registered trademarks of HDMI Licensing LLC. Connection Accessory Port 2 Wireless connectivity Eye-Fi Card compatible Bluetooth®",
    "shooting": "Speed (H) Approx. 3fps Max. number of frames 11 frames (RAW) Up to card capacity (JPG / Large Normal mode) Conditions Memory card: Toshiba SDXC UHS-I card R95 W80 model Premiugate series \"Class 10\" 8GB Note: Depending on shooting conditions, the sequential shooting speed may reduce speed during shooting.",
    "exposurecontrol": "Modes Programme automatic i-Auto Aperture priority Shutter priority Manual Scene Modes Art Filter Exposure compensation +/- 3EV ( 1, 1/2, 1/3 steps ) Exposure bracketing 2 / 3 / 5 frames ( +/- 1/3, 2/3, 1 EV steps ) 7 frames ( +/- 1/3, 1/2, 2/3 EV steps ) ISO bracketing 5 frames ( 1/3, 1/2, 1 EV steps ) AE lock Yes (Fn1/Rec button) My Mode 4 settings storable Enhancement function Shadow Adjustment Technology",
    "category": "camera",
    "imageprocessor": "Colour space sRGB / AdobeRGB Sharpness + Contrast 5 levels Contrast 5 levels Saturation 5 levels Black & White filter Yellow, Orange, Red, Green Black & White toning Sepia, Blue, Purple or Green in Black & White mode Picture mode i-Enhance, Vivid, Natural, Portrait, Muted, Monotone, Art Filter Gradation 4levels (auto, high key, normal, low key) Engine TruePic VI Art Filter bracketing Available Tele converter effect 2x",
    "dimensions": "122.0 x 69.1 x 34.3mm",
    "flash": "Internal Flash Modes AUTO Manual Manual (Full, 1/4, 1/16, 1/64) Red-eye reduction Slow synchronisation with red-eye reduction Slow synchronisation Slow synchronisation 2nd curtain Fill-in Off Type pop-up Flash compensation +/- 3 EV ( 1/3, 1/2, 1 EV steps ) Guide number 10 (ISO 200) Manual settings Full, 1/2, 1/4, 1/8, 1/16, 1/32, 1/64 X-sync speed 1/180s; External Flash Control X-sync speed 1/180s / 1/4000s (Super FP Mode) Type TTL AUTO, AUTO, MANUAL, FP TTL AUTO, FP MANUAL Modes Auto Red-eye reduction Slow synchronisation 2nd curtain and slow synchronisation Fill-in for exclusive flash Manual Intensity +/- 3 EV ( 1/3, 1/2, 1 EV steps ) Note: Some functions are only available if they are supported by the external flash.",
    "powersupply": "Battery Lithium-Ion Battery Sleep mode 1, 3, 5, 10 min. and off selectable. Live View shooting 330images (100% with Live View)",
    "lens": "M.ZUIKO DIGITAL 14-42mm 1:3.5-5.6 II R Boasting a brand new, optimised overall design, the latest generation of the M.ZUIKO DIGITAL 14-42mm 1:3.5-5.6 II R (35mm equivalent focal length: 28-84mm) has now arrived. This ultra-compact zoom lens delivers magnificent 3x zoom performance as small as before in a renewed design. It is also equipped with MSC technology for superb videos and still pictures - with extremely high-speed, practically silent auto focusing and great movie sound even when zooming in and out. However fast your subject and however far away, this lens has the specialist capabilities to rise to challenge and deliver stunning visual results and complete with interchangeable decoration rings it perfectly matches the colour of different PEN cameras.",
    "focusing": "Method Contrast Detection AF system (when non high-speed contrast AF compatible lens is used, it works as MF assist) Focus areas 35 points / Automatic and manual selection AF lock Yes , Locked by first position of shutter release button in single AF mode, AE/AF lock button (customised) Modes Manual focus Single AF Continuous AF Single AF + MF AF Tracking AF illuminator Yes Face Detection extension Eye Detect AF: Off Left side priority Near side priority Right side priority Full time AF Yes Manual focus Yes , With enlarged focusing area",
    "lcdmonitor": "Colour balance +/- 3 levels Vivid (default) / Natural Monitor type OLED - Touch Panel Monitor size 7.6cm / 3.0'' (3:2) Resolution 610000 dots Brightness adjustment +/- 2 levels",
    "memorycard": "SD Memory Card (SDHC, SDXC, UHS-I compatible) Class 6 is recommended for Movie shooting",
    "imagesensor": "Type 4/3'' Live MOS sensor Effective pixels 12.3 Megapixels Filter array Primary colour filter (RGB) Aspect ratio & area 4:3 / 17.3 x 13.0mm Full resolution 13.1 Megapixels",
    "shutter": "Shutter type Computerised focal-plane shutter Self timer 2s / 12s",
    "audio": "Internal microphone Stereo External microphone Optional Recording format Dolby Digital (AVCHD) Stereo PCM/16bit, 48kHz, Wave Format Base (Motion-JPEG) Image footage 30s Speaker Yes",
    "whitebalance": "White Balance AUTO WB system Advanced detection system with Live MOS sensor Manual White balance (One-Touch) Yes White balance bracketing 3 frames / +/- 2, 4, 6mired steps One-touch white balance 2 custom settings can be registered Custom WB 1 setting can be registered at Kelvin temperature (2000K - 14000K) Preset values Tungsten Flourescent 1 Sunlight Flash Overcast Shade Auto Flash adjustment Off / Auto WB / Flash Keep warm colour On / Off"
}