{
    "features": "Give your photographic passions an adrenaline injection with the exceptionally powerful D7100. Surprisingly light and compact for a feature-packed and durable body, it delivers superior DX performance to take your photography to the next level. By not employing an optical low pass filter (OLPF), the D7100 makes the most of its 24.1-megapixel DX-format CMOS sensor to sharply capture even the finest textures in crisp high resolution. Its 51-point autofocus (AF) system offers you rapid and ultra accurate image capture at professional level. Weather and dust resistant, with magnesium alloy top and rear covers, this high-spec D-SLR shoots continuously at 6 fps, gives an extra telephoto effect with innovative 1.3x crop function and has ISO sensitivity of 100-6400, bringing superb results in poorly-lit environments or fast-moving action. Shoot with viewfinder or Live View, apply special effects in real time for stills or Full HD movies, and send images wirelessly* to your smart device for sharing on social media – the D7100 puts exceptional control in your hands, wherever you go, whatever you do.",
    "weight": "765g",
    "color": "Black",
    "filetype": "NEF (RAW): 12 or 14 bit, lossless compressed or compressed; JPEG: JPEG-Baseline compliant with fine (approx. 1 : 4), normal (approx. 1 : 8), or basic (approx. 1 : 16) compression (Size priority); Optimal quality compression available; NEF (RAW) + JPEG: Single photograph recorded in both NEF (RAW) and JPEG formats",
    "interface": "Interface - USB Hi-Speed USB HDMI output HDMI mini connector (Type C) Accessory terminal Wireless remote controller: WR-1 and WR-R10 (available separately) Remote cord: MC-DC2 (available separately) GPS unit: GP-1 (available separately) Audio input Stereo mini-pin jack (3.5 mm diameter; plug-in power supported) Audio output Stereo mini-pin jack (3.5 mm diameter)",
    "packagecontent": "Supplied accessories EN-EL15 rechargeable Li-ion battery (with terminal cover), MH-25 battery charger, DK-5 eyepiece cap, AN-DC1 strap, UC-E6 USB cable, BS-1 accessory shoe cover, DK-23 rubber eyecup, BF-1B body cap, ViewNX 2 CD, User's Manual",
    "exposurecontrol": "Exposure compensation Can be adjusted by -5 - +5 EV in increments of 1/3 or 1/2 EV in P, S, A, and M modes Exposure bracketing 2 - 5 frames in steps of 1/3, 1/2, 2/3, 1, 2, or 3 EV Flash bracketing 2 - 5 frames in steps of 1/3, 1/2, 2/3, 1, 2, or 3 EV White balance bracketing 2 - 5 frames in steps of 1, 2, or 3 ADL bracketing 2 frames using selected value for one frame or 3 frames using preset values for all frames Exposure lock Luminosity locked at detected value with AE-L/AF-L button",
    "category": "camera",
    "lcdmonitor": "8-cm/3.2-in., approx. 1229 k-dot (VGA; 640 x 4 x 480 = 1,228,800 dots), TFT monitor with approx. 170° viewing angle, approx. 100% frame coverage, and brightness adjustment",
    "dimensions": "135.5 x 106.5 x 76 mm",
    "flash": "Flash - Built-in flash Auto, portrait, child, close up, night portrait, party/indoor, pet portrait, color sketch: Auto flash with auto pop-up P, S, A, M, food: Manual pop-up with button release Flash - Guide Number Approx. 12/39, 12/39 with manual flash (m/ft, ISO 100, 20 °C/68 °F) Flash control TTL: i-TTL flash control using 2016-pixel RGB sensor is available with built-in flash and SB-910, SB-900, SB-800, SB-700, SB-600, or SB-400; i-TTL balanced fill-flash for digital SLR is used with matrix and center-weighted metering, standard i-TTL flash for digital SLR with spot metering Flash mode Auto, auto with red-eye reduction, auto slow sync, auto slow sync with red-eye reduction, fill-flash, red-eye reduction, slow sync, slow sync with red-eye reduction, rear-curtain with slow sync, rear-curtain sync, off; Auto FP High-Speed Sync supported Flash compensation -3 - +1 EV in increments of 1/3 or 1/2 EV Flash-ready indicator Lights when built-in flash or optional flash unit is fully charged; flashes after flash is fired at full output Flash - Accessory shoe ISO 518 hot-shoe with sync and data contacts and safety lock",
    "powersupply": "One rechargeable Li-ion EN-EL15 battery",
    "lens": "Lens mount Nikon F mount (with AF coupling and AF contacts): Focal length 18-105mm Maximum aperture f/3.5-5.6 Minimum aperture f/22-38 Lens construction 15 elements in 11 groups (with one ED glass element and one aspherical lens) Picture angle 76° - 15°20’ Closest focus distance Closest focus distance Maximum reproduction ratio 0.2x (1/5) No. of diaphragm blades 7 (rounded) Filter attachment size 67mm Diameter x length (extension from lens mount) Approx. 76 x 89 mm/3.0 x 3.5 in. Weight Approx. 420 g/14.8 oz.",
    "focusing": "Focus - Autofocus Nikon Advanced Multi-CAM 3500DX autofocus sensor module with TTL phase detection, fine-tuning, 51 focus points (including 15 cross-type sensors; the center focus point is available at apertures slower than f/5.6 and faster than f/8 or at f/8), and AF-assist illuminator (range approx. 0.5 - 3m/1 ft 8 in. - 9 ft 10 in.) Focus - Detection range -2 - +19 EV (ISO 100, 20 °C/68 °F) Focus - Lens servo Autofocus (AF): Single-servo AF (AF-S); continuous-servo AF (AF-C); auto AF-S/AF-C selection (AF-A); predictive focus tracking activated automatically according to subject status Manual focus (M): Electronic rangefinder can be used Focus point Can be selected from 51 or 11 focus points AF-area mode Single-point AF; 9-, 21-, or 51-point dynamic-area AF, 3D-tracking, auto-area AF Focus lock Focus can be locked by pressing shutter-release button halfway (single-servo AF) or by pressing AE-L/AF-L button",
    "imageprocessor": "EXPEED 2",
    "memorycard": "SD (Secure Digital) and UHS-I compliant SDHC and SDXC memory cards",
    "imagesensor": "23.5 x 15.6 mm CMOS sensor",
    "shutter": "Shutter type Electronically-controlled vertical-travel focal-plane shutter Shutter speed 1/8000 - 30 s in steps of 1/3 or 1/2 EV, bulb, time, X250",
    "viewfinder": "Viewfinder Eye-level pentaprism single-lens reflex viewfinder Frame coverage Approx. 100% horizontal and 100% vertical Magnification Approx. 0.94x (50 mm f/1.4 lens at infinity, -1.0 m-1) Eyepoint 19.5 mm (-1.0 m-1; from center surface of viewfinder eyepiece lens) Diopter adjustment -2 - +1 m-1 Focusing screen Type B BriteView Clear Matte Mark II screen with AF area brackets (framing grid can be displayed)",
    "whitebalance": "Auto (2 types), incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual (up to 6 values can be stored, spot white balance measurement available during live view), choose color temperature (2500 K - 10000 K), all with fine-tuning"
}