{
    "memorycard": "SD (Secure Digital) and UHS-I compliant SDHC and SDXC memory cards",
    "shutter": "Shutter type Electronically-controlled vertical-travel focal-plane shutter Shutter speed 1/4000 - 30 s in steps of 1/3 or 1/2 EV; Bulb; Time (requires optional ML-L3 remote control)",
    "whitebalance": "Auto, incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual, all except preset manual with fine-tuning.",
    "dimensions": "129.0 x 98.0 x 78.0 mm",
    "weight": "55g",
    "exposurecontrol": "Exposure lock Luminosity locked at detected value with AE-L/AF-L button ISO sensitivity (Recommended Exposure Index) ISO 100 - 6400 in steps of 1/3 EV. Can also be set to approx. 0.3, 0.7, 1, or 2 EV (ISO 25600 equivalent) above ISO 6400; auto ISO sensitivity control available Active D-Lighting Auto, extra high, high, normal, low, off",
    "color": "Black",
    "imagesensor": "23.5 x 15.6 mm CMOS sensor",
    "flash": "Built-in flash Auto, portrait, child, close up, night portrait, party/indoor, pet portrait, color sketch: Auto flash with auto pop-up P, S, A, M, food: Manual pop-up with button release Guide Number Approx. 12/39, 13/43 with manual flash (m/ft, ISO 100, 20 °C/68 °F) Flash control TTL: i-TTL flash control using 2016-pixel RGB sensor is available with built-in flash and SB-910, SB-900, SB-800, SB-700, SB-600, or SB-400; i-TTL balanced fill-flash for digital SLR is used with matrix and center-weighted metering, standard i-TTL flash for digital SLR with spot metering Flash mode Auto, auto with red-eye reduction, auto slow sync, auto slow sync with red-eye reduction, fill-flash, red-eye reduction, slow sync, slow sync with red-eye reduction, rear-curtain with slow sync, rear-curtain sync, off Flash compensation -3 - +1 EV in increments of 1/3 or 1/2 EV Flash-ready indicator Lights when built-in flash or optional flash unit is fully charged; flashes after flash is fired at full output",
    "powersupply": "Battery One rechargeable Li-ion EN-EL14 battery AC adapter EH-5b AC adapter; requires EP-5A power connector (available separately)",
    "lens": "Lens mount Nikon F mount (with AF contacts); Focal length 18-105mm Maximum aperture f/3.5-5.6 Minimum aperture f/22-38 Lens construction 15 elements in 11 groups (with one ED glass element and one aspherical lens) Picture angle 76° - 15°20’ Closest focus distance Closest focus distance Maximum reproduction ratio 0.2x (1/5) No. of diaphragm blades 7 (rounded) Filter attachment size 67mm Diameter x length (extension from lens mount) Approx. 76 x 89 mm/3.0 x 3.5 in. Weight Approx. 420 g/14.8 oz.",
    "packagecontent": "Supplied accessories EN-EL14 rechargeable Li-ion battery (with terminal cover), MH-24 battery charger, AN-DC3 strap, UC-E17 USB cable, EG-CP16 audio/video cable, DK-5 eyepiece cap, BS-1 accessory shoe cover, DK-20 rubber eyecup, BF-1B body cap, ViewNX 2 CD-ROM, User's Manual",
    "focusing": "Autofocus Nikon Multi-CAM 4800DX autofocus sensor module with TTL phase detection, 39 focus points (including 9 cross-type sensor), and AF-assist illuminator (range approx. 0.5-3 m/1 ft 8 in.-9 ft 10 in.) Detection range -1 - +19 EV (ISO 100, 20 °C/68 °F) Lens servo Autofocus (AF): Single-servo AF (AF-S); continuous-servo AF (AF-C); auto AF-S/AF-C selection (AF-A); predictive focus tracking activated automatically according to subject status Manual focus (MF): Electronic rangefinder can be used Focus point Can be selected from 39 or 11 focus points AF-area mode Single-point AF, 9-, 21-, or 39- point dynamic-area AF, 3D-tracking, auto-area AF Focus lock Focus can be locked by pressing shutter-release button halfway (single-servo AF) or by pressing AE-L/AF-L button",
    "viewfinder": "Eye-level pentamirror single-lens reflex viewfinder",
    "category": "camera",
    "interface": "USB Hi-Speed USB Video output NTSC, PAL HDMI output Type C mini-pin HDMI connector Accessory terminal Wireless remote controller: WR-R10 wireless remote controller (available separately) Remote cord: MC-DC2 (available separately) GPS unit: GP-1 (available separately) Audio input Stereo mini-pin jack (3.5mm diameter)",
    "filetype": "NEF (RAW): 14 bit, compressed JPEG: JPEG-Baseline compliant with fine (approx. 1 : 4), normal (approx. 1 : 8), or basic (approx. 1 : 16) compression NEF (RAW)+JPEG: Single photograph recorded in both NEF (RAW) and JPEG formats",
    "features": "24.1-MP DX-format CMOS sensor: capture beautifully detailed photos and movies. You can crop images without losing any detail, and big prints of your photographs look superb. Vari-angle monitor: flip it, tilt it, turn it—explore your creativity with this versatile swivel monitor. Capture unique shots, including great self-portraits, from any angle. Inspire yourself with D-Movie: record finely detailed Full HD video clips you'll want to share. Take advantage of smooth recording (up to 60i) and a built-in stereo microphone. Wireless Mobile Adapter WU-1a: share images directly from the D5200 to a smartphone or tablet that runs on Android or iOS*, or control the camera remotely via your device. EXPEED 3: Nikon's fast and powerful image processing engine provides high-speed operation, remarkably clear images with excellent color reproduction, and enhanced movie recording. High ISO (100-6400, extendable to 25600 equivalent): enjoy the freedom that great low-light performance brings. Capture detailed images in dark situations and clear shots of fast-moving subjects. 39-point AF system: with 39 focus points for superior accuracy. Advanced 3D subject tracking maintains focus on even the smallest subjects, however unpredictable their movements may be. 2,016-pixel RGB metering sensor: delivers precise metering for exact exposures and sends data to the Scene Recognition System, which optimizes auto exposure, autofocus, and auto white balance. Effects mode: create distinctive photos and movies using a range of special effects, including Selective Color and Miniature. You can view your chosen effect in real time as you shoot. 5 fps continuous shooting: shoot action at a swift five frames-per-second and capture fleeting movements or expressions at exactly the right moment. D-Movie AF modes: Live view autofocus works as you shoot movie clips. Keep subjects in sharp focus with full-time servo AF (AF-F). Relax and let the camera keep track of your subject with subject-tracking AF or face-priority AF. HDR (High Dynamic Range): capture more detail when you shoot in high-contrast lighting conditions. Ideal for stationary subjects, the camera takes two shots at different exposures during a single shutter release, and then combines them into one stunning image with natural contrast. Active D-Lighting: retain the details in both dark and bright areas when you shoot images in strong light, or in backlit situations. Ideal for photos of moving subjects. 16 scene modes: capture great shots just by selecting the mode that matches the subject or situation you're shooting. Scene modes optimize settings like shutter speed, ISO, and aperture, which is ideal if you want to quickly capture perfect shots or are new to D-SLR photography. High-resolution LCD: see every detail of your photos and movies thanks to the high-resolution 7.5 cm (3.0-in.), 921k-dot vari-angle LCD monitor with wide-viewing angle and high contrast ratio. Compose shots or apply special effects with clarity whether you're shooting indoors or out. Intelligent design: the small, lightweight body and superior ergonomics make this camera a pleasure to shoot with. A secure grip ensures a comfortable hold. Clear menus and one-touch buttons for frequently used functions like D-Movie and Live View make operation quick and intuitive. Wireless remote control: Nikon's WR-R10 and WR-T10 wireless remote control devices are optional accessories that let you control key camera functions from a distance, even if there are obstacles between yourself and the camera. Ideal for shooting self-portraits, these devices can help prevent camera shake during shutter release. NIKKOR lenses: take advantage of Nikon's legendary NIKKOR lenses and make the most of the camera's 24-megapixel resolution. Capture photos with vivid color and striking contrast. Shoot movies with crisp detail or experiment with cinematic effects."
}