{
    "audioinput": "Stereo mini-pin jack (3.5-mm diameter; plug-in power supported)",
    "accessoryshoe": "ISO 518 hot-shoe with sync and data contacts and safety lock",
    "nikoncreativelightingsystemcls": "Advanced Wireless Lighting supported with built-in flash, SB-910, SB-900, SB-800 or SB-700 as a master flash and SB-600 or SB-R200 as remotes, or SU-800 as commander; built-in flash can serve as master flash in commander mode; auto FP high-speed sync and modeling illumination supported with all CLS-compatible flash units except SB-400; Flash Color Information Communication and FV lock supported with all CLS-compatible flash units",
    "exposurebracketing": "2 to 3 frames in steps of 1/3, 1/2, 2/3, 1, 2 or 3 EV",
    "weight": "Approx. 850 g/1 lb 14.0 oz with battery and memory card but without body cap; approx. 760 g/1 lb 10.8 oz (camera body only)",
    "battery": "One EN-EL15 Rechargeable Li-ion Battery",
    "flashsyncspeed": "X=1/200 s; synchronizes with shutter at 1/250 s or slower (flash range drops at speeds between 1/200 and 1/250 s)",
    "metering": "TTL exposure metering using main image sensor",
    "modes": "Live view photography (still images), movie live view (movies)",
    "exposurecompensation": "Can be adjusted by -5 to +5 EV in increments of 1/3 or 1/2 EV in P, S, A and M modes",
    "activedlighting": "Auto, Extra high, High, Normal, Low, Off",
    "maximumlength": "Approx. 29 min. 59 s (20 min. depending on frame size/rate and movie quality settings)",
    "releasemodes": "S (single frame), CL (continuous low speed), CH (continuous high speed), Q (quiet shutter-release), QC (quiet continuous shutter-release), (self-timer), (remote control), MUP (mirror up)",
    "reflexmirror": "Quick return",
    "frameadvancerate": "Approx. 1 to 5 fps (CL), approx. 6 fps (CH) or 3 fps (QC)",
    "speed": "1/4,000 to 30 s in steps of 1/3 or 1/2 EV, bulb, time (requires optional ML-L3 Remote Control), X200",
    "hdmioutput": "Type C mini-pin HDMI connector",
    "category": "camera",
    "batterypack": "Optional MB-D14 Multi-Power Battery Pack with one EN-EL15 Rechargeable Li-ion Battery or six AA alkaline, Ni-MH, or lithium batteries",
    "usb": "Hi-Speed USB",
    "audiorecordingformat": "Linear PCM",
    "suppliedaccessoriesmaydifferbycountryorarea": "EN-EL15 Rechargeable Li-ion Battery, MH-25 Battery Charger, DK-5 Eyepiece Cap, DK-21 Rubber Eyecup, UC-E15 USB Cable, AN-DC10 Camera Strap, BM-14 LCD Monitor Cover, BF-1B Body Cap, BS-1 Accessory Shoe Cover, ViewNX 2 CD-ROM",
    "isosensitivityrecommendedexposureindex": "ISO 100 to 6400 in steps of 1/3 or 1/2 EV; can also be set to approx. 0.3, 0.5, 0.7 or 1 EV (ISO 50 equivalent) below ISO 100 or to approx. 0.3, 0.5, 0.7, 1 or 2 EV (ISO 25600 equivalent) above ISO 6400; auto ISO sensitivity control available",
    "media": "SD (Secure Digital) and UHS-I compliant SDHC and SDXC memory cards",
    "otheroptions": "Index marking, time-lapse photography",
    "selftimer": "2 s, 5 s, 10 s, 20 s; 1 to 9 exposures at intervals of 0.5, 1, 2 or 3 s",
    "syncterminal": "AS-15 Sync Terminal Adapter (available separately)",
    "magnification": "Approx. 0.7x (50 mm f/1.4 lens at infinity, -1.0 m -1 )",
    "playback": "Full-frame and thumbnail (4, 9, 72 images or calendar) playback with playback zoom, movie playback, photo and/or movie slide shows, histogram display, highlights, photo information, GPS data display and auto image rotation",
    "operatingenvironment": "Temperature: 0 to 40°C/32 to 104°F; humidity: 85% or less (no condensation)",
    "totalpixels": "24.7 million",
    "dimensionswxhxd": "Approx. 141 x 113 x 82 mm/ 5.6 x 4.4 x 3.2 in.",
    "autofocus": "Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected)",
    "meteringmethod": "Matrix",
    "lensservo": "Autofocus (AF): Single-servo AF (AF-S); full-time servo AF (AF-F) Manual focus (M)",
    "accessoryterminal": "Remote cord: MC-DC2 (available separately) GPS unit: GP-1/GP-1A (available separately)",
    "focuspoint": "Can be selected from 39 or 11 focus points",
    "afareamodes": "Face-priority AF, wide-area AF, normal-area AF, subject-tracking AF",
    "supportedlanguages": "Arabic, Chinese (Simplified and Traditional), Czech, Danish, Dutch, English, Finnish, French, German, Greek, Hindi, Hungarian, Indonesian, Italian, Japanese, Korean, Norwegian, Polish, Portuguese (Portugal and Brazil), Romanian, Russian, Spanish, Swedish, Thai, Turkish, Ukrainian",
    "flashcompensation": "-3 to +1 EV in increments of 1/3 or 1/2 EV",
    "picturecontrolsystem": "Standard, Neutral, Vivid, Monochrome, Portrait, Landscape; selected Picture Control can be modified; storage for custom Picture Controls",
    "tripodsocket": "1/4 in. (ISO 1222)",
    "imagesizepixels": "FX format (36x24): 6,016 x 4,016 (L), 4,512 x 3,008 (M), 3,008 x 2,008 (S) DX format (24x16): 3,936 x 2,624 (L), 2,944 x 1,968 (M), 1,968 x 1,312 (S) FX-format photographs taken in movie live view: 6,016 x 3,376 (L), 4,512 x 2,528 (M), 3,008 x 1,688 (S) DX-format photographs taken in movie live view: 3,936 x 2,224 (L), 2,944 x 1,664 (M), 1,968 x 1,112 (S)",
    "remotereleasemodes": "Delayed remote, quick-response remote, remote mirror-up",
    "diopteradjustment": "-3 to +1 m -1",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (single-servo AF) or by pressing AE-L/AF-L button",
    "detectionrange": "-1 to +19 EV (ISO 100, 20°C/68°F)",
    "videocompression": "H.264/MPEG-4 Advanced Video Coding",
    "focusingscreen": "Type B BriteView Clear Matte Mark VIII screen with AF area brackets (framing grid can be displayed)",
    "fileformat": "MOV",
    "adlbracketing": "2 frames using selected value for one frame or 3 frames using preset values for all frames",
    "guidenumber": "Approx. 12/39, 12/39 with manual flash (m/ft, ISO 100, 20°C/68°F)",
    "whitebalancebracketing": "2 to 3 frames in steps of 1, 2 or 3",
    "flashcontrol": "TTL: i-TTL flash control using 2,016-pixel RGB sensor is available with built-in flash and SB-910, SB-900, SB-800, SB-700, SB-600, SB-400 or SB-300; i-TTL balanced fill-flash for digital SLR is used with matrix and center-weighted metering, standard i-TTL flash for digital SLR with spot metering",
    "lensmount": "Nikon F mount (with AF coupling and AF contacts)",
    "dualcardslots": "Slot 2 can be used for overflow or backup storage or for separate storage of copies created using NEF+JPEG; pictures can be copied between cards",
    "rangeiso100f14lens20c68f": "Matrix or center-weighted metering: 0 to 20 EV Spot metering: 2 to 20 EV",
    "monitor": "Monitor 8-cm (3.2-in.), approx. 921k-dot (VGA), low-temperature polysilicon TFT LCD with approx. 170° viewing angle, approx. 100% frame coverage, and automatic monitor brightness control using ambient brightness sensor",
    "audiooutput": "Stereo mini-pin jack (3.5-mm diameter)",
    "eyepoint": "21 mm (-1.0 m -1 ; from center surface of viewfinder eyepiece lens)",
    "acadapter": "EH-5b AC Adapter; requires EP-5B Power Connector (available separately)",
    "flashbracketing": "2 to 3 frames in steps of 1/3, 1/2, 2/3, 1, 2 or 3 EV",
    "compatiblelenses": "Compatible with AF NIKKOR lenses, including type G,E and D lenses (some restrictions apply to PC lenses), DX lenses [using DX (24x16) image area], AI-P NIKKOR lenses, and non-CPU AI lenses (A and M modes only); IX-NIKKOR lenses, lenses for the F3AF, and non-AI lenses cannot be used The electronic rangefinder can be used with lenses that have a maximum aperture of f/5.6 or faster (the electronic rangefinder supports the center 7 focus points with lenses that have a maximum aperture of f/8 or faster and the center 33 focus points with lenses that have a maximum aperture of f/6.8 or faster)",
    "filesystem": "DCF (Design Rule for Camera File System) 2.0, DPOF (Digital Print Order Format), Exif (Exchangeable Image File Format for Digital Still Cameras) 2.3, PictBridge",
    "flashmodes": "Auto, auto with red-eye reduction, auto slow sync, auto slow sync with red-eye reduction, fill-flash, red-eye reduction, slow sync, slow sync with red-eye reduction, rear-curtain with slow sync, rear-curtain sync, off; auto FP high-speed sync supported",
    "type": "Electronically-controlled vertical-travel focal-plane shutter",
    "imagesensor": "35.9 x 24.0 mm CMOS sensor (Nikon FX format)",
    "exposuremodes": "Auto ( auto; auto [flash off]), scene ( portrait, landscape, child, sports, close up, night portrait, night landscape, party/indoor, beach/snow, sunset, dusk/dawn, pet portrait, candlelight, blossom, autumn colors, food, silhouette, high key, low key), programmed auto with flexible program (P), shutter-priority auto (S), aperture-priority auto (A), manual (M), U1 (user settings 1), U2 (user settings 2)",
    "flashreadyindicator": "Lights when built-in flash or optional flash unit is fully charged; flashes after flash is fired at full output",
    "depthoffieldpreview": "Pressing depth-of-field preview button stops lens aperture down to value selected by user (A and M modes) or by camera (other modes)",
    "framesizepixelsandframerate": "1,920 x 1,080; 30p (progressive), 25p, 24p 1,280 x 720; 60p, 50p, 30p, 25p Actual frame rates for 60p, 50p, 30p, 25p, and 24p are 59.94, 50, 29.97, 25, and 23.976 fps respectively; options support both ★ high and normal image quality",
    "effectivepixels": "24.3 million",
    "builtinflash": ", , , , , , : Auto flash with auto pop-up P, S, A, M, : Manual pop-up with button release",
    "lensaperture": "Instant return, electronically controlled",
    "audiorecordingdevice": "Built-in monaural or external stereo microphone; sensitivity adjustable",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "dustreductionsystem": "Image sensor cleaning, Image Dust Off reference data (optional Capture NX 2 software required)",
    "framecoverage": "FX (36x24): Approx. 100% horizontal and 100% vertical DX (24x16): Approx. 97% horizontal and 97% vertical",
    "whitebalance": "Auto (2 types), incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual (up to 4 values can be stored), choose color temperature (2,500 K to 10,000 K); all with fine-tuning",
    "exposuremetercoupling": "Combined CPU and AI",
    "viewfinder": "Eye-level pentaprism single-lens reflex viewfinder"
}