{
    "category": "camera",
    "shutter": "Maximum 1/2000th sec. Slow 1/2 sec.",
    "lcdmonitor": "Screen size 8.8cm (3.5\") Organic LED touch screen, 100% view Pixels 1.23 million dots Touchscreen YES - Capacitive type Organic LED panel Manual adjustment Brightness",
    "dimensions": "115 x 84 x 231mm (with lens hood)",
    "minillumination": "Minimum Lux. 1 lux Night Mode Low Light (0.1 lux) Auto Gain Control limit adjustment YES",
    "imagesensor": "Type 1/2.84 type advanced HD CMOS PRO Total pixels 3.09 megapixel Effective Pixels: Movie 2.91 megapixels Effective Pixels: Still 2.07 megapixels (16:9) Filter Bayer pattern filter",
    "audio": "System Dolby Digital 2ch (AC-3 2ch); 5.1ch surround sound (via Optional SM-V1 microphone) Audio Scene Select YES Zoom Microphone YES (customisable frequency response and directionality) Manual Rec. level control YES",
    "memorycard": "Multi Media Card NO Secure Digital Card SD / SDHC / SDXC Movie Recording YES Internal Data Transfer MOVIE: Yes (card A to B) STILLS: Yes (card A to B)",
    "weight": "900g",
    "lens": "Advanced Zoom NO Optical Zoom 20x Digital Zoom 400x Focal length 3.67 - 73.4mm 35mm Equivalent Focal Length 26.8 - 576mm (35mm equivalent without Dynamic IS/28.8-576mm with Dynamic IS) Maximum aperture f1.8 to f2.8 (8 Blade Circular Aperture) Minimum focusing distance 10mm Image Stabilizer Optical Image Stabiliser  Intelligent IS with advanced dynamic mode Filter diameter 58mm Wide Attachment YES (optional WA-H58)",
    "interface": "Headphone YES Microphone YES USB YES (Mini-B, Hi-Speed USB - Output Only ) DV NO Direct Print NO Analogue-in NO AV YES (output only) Component YES (output only) HDMI YES (HDMI™ Mini Connector Output Only) Built-in charger YES",
    "focusing": "Auto/Manual YES / YES Control AUTO: Face Detection AF/Face Only AF/Instant AF/Medium AF/TV AF MANUAL: Lens ring, Touchscreen LED, Focus Preset Manual Focus Assist YES (Magnification, Peaking)",
    "viewfinder": "Screen size 0.61cm (0.24\"), 100% view Pixels 1.56 million dots",
    "imageprocessor": "Image Processor DIGIC DV 4 Face Detection Technology YES",
    "batterytype": "Type Lithium Ion Intelligent Battery System YES Battery included in the kit BP-820 Max recording time (included battery) 3hrs 10mins Long life Battery BP-828 Longer recording time** 4hrs 55mins¹",
    "whitebalance": "Type FAWB Auto YES Set/Preset YES: Set 1, Set 2, Daylight, Shade, Cloudy, Tungsten, Fluorescent, Fluorescent H, Colour Temperature",
    "features": "Canon LEGRIA HF G30 Capture the action like a pro with the Canon LEGRIA HF G30 The flagship LEGRIA HF G30 camcorder packs high-specification optics, sensor and stabiliser plus Wi-Fi connectivity into a compact body, ideal for enthusiasts who want to match their creativity with professional quality videos. 20x zoom, 26.8mm wide-angle lens; 8 blade circular aperture Control settings remotely and share with Wi-Fi Simultaneous recording of AVCHD and MP4 Canon HD CMOS PRO sensor, DIGIC DV 4 Optical Intelligent IS Full manual control Instant AF; Face Detection 8.8cm OLED touch screen"
}