{
    "category": "camera",
    "whitebalance": "Auto, incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual, all except preset manual with fine-tuning.",
    "features": "New to D-SLR photography? Guide Mode uses sample images and clear instructions to show you how to take great photos in a few simple steps. 24.2-MP DX-format CMOS sensor: capture sharp, detailed images with the 24.2-megapixel CMOS sensor. Big prints look superb and you can crop images without losing any detail. Go cinematic: make movies you’ll want to share with D-movie. With the camera’s large image sensor and high ISO, you can record sharp Full HD (1080p) video clips in any light. High ISO (100–6400): take great images in low light or sharp shots of fast-moving subjects. Features an Auto ISO setting, and ISO is extendable up to 12800. Razor-sharp 11-point autofocus system: enjoy fast and precise autofocus coverage throughout the frame whether your subject is off-center, moving fast or completely unpredictable. Wireless Mobile Adapter: use the optional WU-1a to share images directly from the D3200 to a smartphone or tablet, or to control the camera remotely via your smart device*. EXPEED 3: Nikon’s fast and powerful image processing engine provides high-speed operation, remarkably clear images with excellent color reproduction, and enhanced movie recording. Scene Recognition System: let the D3200 help you capture superior images. Nikon’s Scene Recognition System will meticulously analyze the scene you’re shooting and adjust the focus, exposure and white balance for optimum results. 4 fps continuous shooting: shoot action at a swift four frames per second and capture fleeting movements or expressions at exactly the right moment. Photo retouch menu: enhance your photos in-camera with a range of tools and effects. Retouch tools include Resize, Quick Retouch and Straighten. Effects include Selective Color, Color Sketch, and Miniature Effect, which makes distant subjects look like scale models. Active D-Lighting: capture more detail in high-contrast lighting conditions. Nikon’s Active D-Lighting automatically captures the details in both dark and bright areas for stunning images with natural contrast. Smart autofocus for movies: enjoy continuous autofocus (AF) when you shoot D-movies. Full-time servo AF (AF-F) and subject-tracking AF maintain the focus when you shoot moving subjects. Face-priority AF is ideal for filming events where you want to relax and let the camera focus on faces. Extensive movie options: you can record Full HD (1080p) movies in 30p, 25p and 24p, and the camera supports use of Nikon’s ME-1 stereo microphone. In-camera edit functions let you perform tasks such as setting the start and end point of your movie. A mini HDMI output enables playback on an HDTV. NIKKOR lenses: take advantage of Nikon’s legendary NIKKOR lenses to capture images with vivid color, striking contrast and crisp detail, or to experiment with cinematic effects. Use fast prime lenses for stunning portraits, micro lenses for life-size close-ups or telephoto lenses for distant subjects. A joy to use: the D3200 lightweight body and superior ergonomics make it a pleasure to shoot with. A secure grip makes the camera comfortable to hold. Dedicated one-touch buttons for frequently used functions like D-Movie, or live view, make it easy to operate.",
    "weight": "505g",
    "exposurecontrol": "Exposure meter coupling CPU Mode Auto modes (auto; auto (flash off)); scene modes (portrait; landscape; child; sports; close up; night portrait); programmed auto with flexible program (P); shutter-priority auto (S); aperture-priority auto (A); manual (M) Exposure compensation -5 - +5 EV in increments of 1/3 EV Exposure lock Luminosity locked at detected value with AE-L/AF-L button",
    "color": "Black",
    "imagesensor": "23.2 x 15.4 mm CMOS sensor",
    "flash": "Built-in-flash Auto, portrait, child, close up, night portrait: Auto flash with auto pop-up P, S, A, M: Manual pop-up with button release",
    "memorycard": "SD (Secure Digital) and UHS-I compliant SDHC and SDXC memory cards",
    "shutter": "Shutter Type Electronically-controlled vertical-travel focal-plane shutter Shutter Speed 1/4000 - 30 s in steps of 1/3 EV; Bulb; Time (requires optional ML-L3 remote control) Shutter - Flash sync speed X=1/200 s; synchronizes with shutter at 1/200 s or slower",
    "powersupply": "Battery One rechargeable Li-ion EN-EL14 battery AC adapter EH-5b AC adapter; requires EP-5A power connector (available separately)",
    "accessories": "Supplied accessories EN-EL14 rechargeable Li-ion battery (with terminal cover), MH-24 battery charger, AN-DC3 strap, EG-CP14 audio/video cable, UC-E17 USB cable, DK-5 eyepiece cap, BS-1 accessory shoe cover, DK-20 rubber eyecup, BF-1B body cap, ViewNX 2 CD-ROM, Reference CD",
    "viewfinder": "Eye-level pentamirror single-lens reflex viewfinder",
    "lcdmonitor": "7.5-cm/3-in., approx. 921k-dot (VGA) TFT LCD with 160 ° viewing angle, approx. 100% frame coverage, and brightness adjustment",
    "interface": "USB Hi-Speed USB Video output NTSC, PAL HDMI output Type C mini-pin HDMI connector Accessory terminal Remote cord: MC-DC2 (available separately) GPS unit: GP-1 (available separately) Audio input Stereo mini-pin jack (3.5mm diameter)",
    "filetype": "NEF (RAW): 12 bit, compressed JPEG: JPEG-Baseline compliant with fine (approx. 1 : 4), normal (approx. 1 : 8), or basic (approx. 1 : 16) compression NEF (RAW)+JPEG: Single photograph recorded in both NEF (RAW) and JPEG formats",
    "dimensions": "Approx. 125 x 96 x 76.5 mm"
}