{
    "memorycard": "CF Cards (Type I); Compatible with UDMA CF cards; SD, SDHC, and SDXC Memory Cards",
    "shutter": "Type Vertical-travel, mechanical, focal-plane shutter with all speeds electronically-controlled Shutter Speeds 1/8000 to 1/60 sec., X-sync at 1/200 sec. 1/8000 to 30 sec., bulb (Total shutter speed range. Available range varies by shooting mode.) * Shutter speed's control range can be set with a Custom Function. Shutter Release Soft-touch electromagnetic release Self Timer 10-sec. or 2-sec. delay",
    "lcdmonitor": "Type TFT color, liquid-crystal monitor Monitor Size 3.2-inches Pixels Approx. 1.04 million dots Coverage Approx. 100% Approx. 170° vertically and horizontally Brightness Control Auto: Brightness adjusted automatically by the light sensor",
    "dimensions": "152.0 x 116.4 x 76.4 mm",
    "weight": "860g (Body only)",
    "imagesensor": "Type High-sensitivity, high-resolution, large single-plate CMOS sensor Pixels Effective pixels: Approx. 22.3 megapixels Total Pixels Total pixels: 23.4 megapixels Aspect Ratio 3:2 (Horizontal: Vertical) Color Filter System RGB primary color filters Low Pass Filter Fixed position in front of the image sensor Dust Deletion Feature (1) Self Cleaning Sensor Unit",
    "flash": "EOS Dedicated Speedlite E-TTL II autoflash with all EX Series Speedlites Zooming to Match Focal Length Provided Flash Exposure Compensation ±3 stops in 1/3- or 1/2-stop increments FE Lock Provided External Flash Settings The camera can set the following with Speedlite 600EX-RT, 580EX II, 430EX II, 320EX, 270EX II, or 270EX:",
    "powersupply": "One Battery Pack LP-E6 AC power can be supplied with the AC Adapter Kit ACK-E6",
    "lens": "Focal Length & Maximum Aperture 24-105mm f/4 Lens Construction 18 elements in 13 groups Diagonal Angle of View 84° - 23° 20' (with full-frame camera) Focus Adjustment Inner focusing system with focusing cam Closest Focusing Distance 1.48 ft./0.45m Zoom System 5-group helical zoom (front group moves: 32.5mm) Filter Size 77mm Max. Diameter x Length, Weight 3.3 in. x 4.2 in., 23.6 oz. / 83.5mm x 107mm, 670g (lens only)",
    "other": "Color Black",
    "directprint": "Compatible Printers PictBridge-compatible printers Printable Images RAW and JPEG images complying to Design rule for Camera File System",
    "focusing": "Type TTL secondary image - registration, phase detection AF Points 61-point (up to 41 cross-type points) * One to five cross-type AF points at f/2.8, 10 to 20 cross-type AF points at f/4, and 15 to 21 cross-type AF points at f/5.6. (The number of cross-type AF points will differ depending on the lens.) AF Working Range EV -2 - 18 (at 73°F/23°C and ISO 100) Focusing Modes (1) Autofocus ·One-Shot AF ·Predictive AI Servo AF -For automatic AF point selection, the AF point to start the AI Servo AF operation can be selected. -For automatic AF point selection, the active AF point can be displayed. ·AI Focus AF -(Switches between One-Shot AF and AI SERVO AF automatically) -Automatically set in A+ Auto Mode (2) Manual focus (MF) AF Point Selection 1. Single-point AF (Manual selection) 2. Auto selection 61-Point AF 3. Single-point Spot AF (Manual selection) 4. AF point expansion (Manual selection, 4 points: Up, down, left, and right) 5. AF point expansion (Manual selection, surrounding 8 points) 6. Zone AF (Manual zone selection) Selected AF Point Display Displayed in viewfinder with transparent LCD and on LCD panel Active AF Point Indicator AF area used in horizontal/vertical (grip up or down) shooting and the manually-selected AF point position can be set separately AF Assist Beam (1) Enable With an EOS-dedicated Speedlite, AF-assist beam is emitted automatically when necessary. (2) Disable (3) IR AF assist beam only * No AF-assist beam with flash bursts.",
    "viewfinder": "Type Eye-level pentaprism Coverage Approx. 100% vertically and horizontally (At approx. 21mm eyepoint) Magnification Approx. 0.71x / Angle of view 34.1° (with 50mm lens at infinity, -1 m-1 (dpt)) Eye Point Approx. 21mm (At -1m-1 from the eyepiece lens center) Dioptric Adjustment Correction -3.0 to +1.0m-1 (diopter) Focusing Screen Fixed Mirror Quick-return half mirror (transmission: reflectance ratio of 40:60) Viewfinder Information ·AF information",
    "shooting": "Drive Modes Single, High-speed continuous, Low-speed continuous, Silent Single Shooting and Self-timer (10 sec. self-timer/remote control, or 2-sec. self-timer/remote control) Continuous Shooting Speed High-speed: Maximum approx. 6 shots/sec. Low-speed: Maximum approx. 3 shots/sec. Silent continuous shooting: Maximum approx. 3 shots/sec. Maximum Burst ·JPEG Large/Fine: Approx. 65 shots (approx. 16270 shots) ·RAW: Approx. 13 shots (approx. 18 shots) ·RAW+JPEG Large/Fine: Approx. 7 shots (approx. 7 shots)",
    "whitebalance": "Settings (1) Auto (AWB) (2) Daylight (3) Shade (4) Cloudy (5) Tungsten light (6) White fluorescent light (7) Flash (8) Custom (Custom WB) (9) Color temperature Auto White Balance Auto white balance with the image sensor Color Temperature Compensation Blue/amber bias: ±9 levels",
    "category": "camera",
    "exposurecontrol": "Metering Modes Max. aperture TTL metering with 63-zone SPC with the following selectable modes: (1) Evaluative metering (linked to all AF points) (2) Partial metering (center, approx. 7.2% of viewfinder) (3) Spot metering (center, approx. 1.5% of viewfinder) ·AF point-linked spot metering not provided. (4) Center-weighted average metering a. The selectable metering modes can be limited with a Custom Function. Metering Range EV 1-20 (at 73°F / 23°C with 50mm f/1.4 lens at ISO 100) Exposure Control Systems (1) Scene Intelligent Auto (2) Program AE (shiftable) (3) Shutter-priority AE (Safety shift possible) (4) Aperture-priority AE (Safety shift possible) (5) Manual exposure * The metering mode can be specified with a Custom Function. (6) Bulb (7) E-TTL II autoflash program AE * Evaluative metering, Averaged metering"
}