{
    "memorycard": "SD, SDHC or SDXC (UHS-I)card",
    "shutter": "Type Electronically-controlled focal-plane shutter Speed 30-1/8000 sec (1/2 or 1/3 stop increments), Bulb (Total shutter speed range. Available range varies by shooting mode)",
    "shooting": "Modes Scene Intelligent Auto (Stills and Movie), No Flash, Creative Auto, SCN(Portrait, Landscape, Close-up, Sports, Night Portrait, Handheld Night Scene, HDR Backlight Control), Program AE, Shutter priority AE, Aperture priority AE, Manual (Stills and Movie), Bulb, Custom Picture Styles Auto, Standard, Portrait, Landscape, Neutral, Faithful, Monochrome, User Defined (x3) Colour Space sRGB and Adobe RGB Image Processing Highlight Tone Priority Auto Lighting Optimizer (4 settings) Long exposure noise reduction High ISO speed noise reduction (4 settings) Multi Shot Noise Reduction Auto Correction of Lens Peripheral illumination and Chromatic aberration correction Basic+ (Shoot by ambience selection, Shoot by lighting or scene type) Creative filters (Art Bold, Water painting, Grainy B/W, Soft focus, Toy camera, Miniature effect, Fish-eye) RAW image processing - during image Playback only Resize to M or S1, S2, S3 Drive Modes Single, Continuous L, Continuous H, Self timer (2s+remote, 10s +remote), Silent single shooting, Silent continous shooting Continuous Shooting Max. Approx. 7fps. (speed maintained for up to 65 images (JPEG)¹³(with UHS-I card), 16 images (RAW))",
    "lcdmonitor": "Type Vari angle 7.7cm (3.0\") 3:2 Clear View II TFT, approx. 1040K dots Coverage Approx. 100% Viewing Angle (Horizontally/Vertically) Approx 170° Coating Anti-reflection, Solid Structure and Anti smudge Brightness Adjustment Adjustable to one of seven levels Display Options (1) Quick Control Screen (2) Camera settings (3) Electronic Level",
    "dimensions": "139.0 x 104.3 x 78.5mm",
    "weight": "755g",
    "exposurecontrol": "Metering Modes TTL full aperture metering with 63 zone Dual Layer SPC (1) Evaluative metering (linked to all AF points) (2) Partial metering (approx. 7.7% of viewfinder at centre) (3) Spot metering (approx. 3.0% viewfinder at centre) (4) Centre weighted average metering Metering Range EV 1-20 (at 23°C with 50mm f/1.4 lens ISO100) AE Lock Auto: In One-shot AF mode with evaluative metering exposure is locked when focus is achieved. Manual: By AE lock button in creative zone modes. Exposure Compensation +/-5 EV in 1/3 or 1/2 stop increments (can be combined with AEB). AEB 2, 3, 5 or 7 Shots +/-3 EV 1/3 or 1/2 stop increments ISO Sensitivity* Auto (100-12800), 100-12800 (in 1/3-stop or whole stop increments) ISO can be expanded to H: 25600 During Movie shooting: Auto (100-6400), 100-6400 (in 1/3-stop or whole stop increments) ISO can be expanded to H: 12800",
    "color": "Black",
    "imagesensor": "Type 22.5mm x 15.0mm CMOS Effective Pixels Approx. 20.20 megapixels Total Pixels Approx. 20.90 megapixels Aspect Ratio 3:2 Low-Pass Filter Built-in/Fixed with fluorine coating Sensor Cleaning EOS integrated cleaning system Colour Filter Type Primary Colour",
    "flash": "Built-in Flash GN (ISO 100, meters) 12 Built-in Flash Coverage up to 17mm focal length (35mm equivalent: 28mm) Built-in Flash Recycle Time Approx. 3 seconds Modes Auto, Manual flash, Integrated Speedlite Transmitter Red-Eye Reduction Yes - with red-eye reduction lamp X-Sync 1/250sec Flash Exposure Compensation +/- 3EV in 1/2 or 1/3 increments Flash Exposure Bracketing Yes, with compatible External Flash Flash Exposure Lock Yes Second Curtain Synchronisation Yes HotShoe/ PC Terminal Yes/ No External Flash Compatibility E-TTL II with EX series Speedlites, wireless multi-flash support External Flash Control via camera menu screen",
    "powersupply": "Batteries Rechargeable Li-ion Battery LP-E6 (supplied), built in for date & settings Battery Life Approx. 920 (at 23°C, AE 50%, FE 50%)¹ Approx. 850 (at 0°C, AE 50%, FE 50%) Battery Indicator 6 levels + percentage Power Saving Power turns off after 1, 2, 4, 8, 15 or 30mins. Power Supply & Battery Chargers AC Adapter Kit ACK-E6, Battery charger LC-E6, Car Battery charger CBC-E6",
    "lens": "Lens Mount EF/EF-S Focal Length Equivalent to 1.6x the focal length of the lens;Focal Length & Maximum Aperture 18-135mm, 1:3.5-5.6 Lens Construction 16 elements in 12 groups Diagonal Angle of View 11° 30' - 74° 20' Focus Adjustment Inner focusing system Closest Focusing Distance 1.3 ft./0.39m Zoom System Rotating Type Filter Size 67mm Max. Diameter x Length, Weight 3.1 x 3.8 inch, 16.9 oz. / 76.6 x 96.0mm, 480g",
    "focusing": "Type TTL-CT-SIR with a CMOS sensor AF System/ Points 19 cross-type AF points (extra sensitivity at f/2.8 at centre)¹ AF Working Range EV -0.5 - 18 (at 23°C & ISO100) AF Modes AI Focus One Shot AI Servo AF Point Selection Automatic selection: 19 point AF Manual selection: Single point AF Manual selection: Zone AF AF points can be selected separately for vertical and horizontal shooting Selected AF Point Display Indicated by a transmissive LCD in viewfinder and on top LCD panel and Quick Control screen Predictive AF Yes, up to 8m¹ AF Lock Locked when shutter button is pressed half way in One Shot AF mode or AF-ON button is pressed. AF Assist Beam Intermittent firing of built-in flash or emitted by optional dedicated Speedlite Manual Focus Selected on lens AF Microadjustment C.Fn II-13 +/- 20 steps (wide and tele setting for Zooms) Adjust all lenses by same amount Adjust up to 40 lenses individually Adjustments remembered for lens by serial number",
    "viewfinder": "Type Pentaprism Coverage (Vertical/Horizontal) Approx. 98% Magnification Approx. 0.95x¹ Eyepoint Approx. 22mm (from eyepiece lens centre) Dioptre Correction -3 to +1 m-1 (dioptre) Focusing Screen Fixed (Transmissive LCD screen) Mirror Quick-return half mirror (Transmission: reflection ratio of 40:60, no mirror cut-off with EF 600mm f/4 IS USM or shorter) Viewfinder Information AF information: AF points, focus confirmation, AF area selection mode Exposure information: Shutter speed, aperture value, ISO speed (always displayed), AE lock, exposure level/compensation, spot metering circle, exposure warning, AEB. Flash information: Flash ready, high-speed sync, FE lock, flash exposure compensation, red-eye reduction light. Image information: Card information, maximum burst (2 digit display), Highlight tone priority (D+). Composition information: Grid, Electronic level (2 methods) Other information: Battery check, Alert symbol Depth of Field Preview Yes, with Depth of Field preview button. Eyepiece Shutter On strap",
    "imageprocessor": "DIGIC 5+",
    "interface": "Computer Hi-Speed USB Other Video output (PAL/ NTSC) (integrated with USB terminal), HDMI mini output (HDMI-CEC compatible), External microphone (3.5mm Stereo mini jack)",
    "whitebalance": "Type Auto white balance with the imaging sensor Settings AWB, Daylight, Shade, Cloudy, Tungsten, White Fluorescent light, Flash, Custom, Colour Temperature Setting. White balance compensation: 1. Blue/Amber +/-9 2. Magenta/ Green +/-9. Custom White Balance Yes, 1 setting can be registered WB Bracketing +/-3 levels in single level increments 3 bracketed images per shutter release. Selectable Blue/Amber bias or Magenta/ Green bias.",
    "category": "camera",
    "features": "Canon EOS 70D Capture the moment at seven frames per second Capture the moment in stunning stills and Full-HD movies with the high performance EOS 70D, featuring 7fps full resolution shooting, an advanced 19-point AF system and Canon’s unique Dual Pixel CMOS AF technology. Benefits Capture every detail with a 20.2 megapixel APS-C CMOS sensor and DIGIC 5+ processor Follow the action with a 19 cross-type point AF system and 7 fps continuous shooting at full resolution Shoot stunning Full-HD movies with fast, smooth, accurate autofocus thanks to Canon’s Dual Pixel CMOS AF technology Control your camera remotely and instantly review your images with Wi-Fi* Keep shooting when light levels fall thanks to ISO 12800 (H:25600) Take control of your camera and frame your subjects from multiple angles with a Vari-angle touch screen"
}