{
    "category": "camera",
    "whitebalance": "Type Auto white balance with the imaging sensor Settings AWB, Daylight, Shade, Cloudy, Tungsten, White Fluorescent light, Flash, Custom. White balance compensation: 1. Blue/Amber +/-9 2. Magenta/ Green +/-9. Custom White Balance Yes, 1 setting can be registered WB Bracketing '+/-3 levels in single level increments 3 bracketed images per shutter release. Selectable Blue/Amber bias or Magenta/ Green bias.",
    "imageprocessor": "DIGIC 5",
    "lcdmonitor": "Type Touch screen vari angle 7.7cm (3.0\") 3:2 Clear View II TFT, approx. 1040K dots Coverage Approx. 100% Viewing Angle (Horizontally/Vertically) Approx 170° Coating Anti smudge Brightness Adjustment Adjustable to one of seven levels Display Options (1) Quick Control Screen (2) Camera settings",
    "dimensions": "133.1 x 99.8 x 78.8 mm",
    "weight": "575g",
    "exposurecontrol": "Metering Modes TTL full aperture metering with 63-zone SPC (1) Evaluative metering (linked to all AF points) (2) Partial metering at center (approx. 9% of viewfinder) (3) Spot metering (approx. 4% of viewfinder at center) (4) Center weighted average metering Metering Range EV 1-20 (at 23°C with 50mm f/1.4 lens ISO100) AE Lock Auto: In One-shot AF mode with evaluative metering exposure is locked when focus is achieved. Manual: By AE lock button in creative zone modes. Exposure Compensation '+/-5 EV in 1/3 or 1/2 stop increments (can be combined with AEB). AEB '3 shots +/- 2 EV, 1/2 or 1/3-stop increments ISO Sensitivity* AUTO(100-6400), 100-12800 in 1-stop increments ISO can be expandable to H: 25600)",
    "color": "Black",
    "imagesensor": "Type 22.3 x 14.9mm CMOS Effective Pixels Approx. 18.0 megapixels Total Pixels Approx. 18.5 megapixels Aspect Ratio 3:2 Low-Pass Filter Built-in/Fixed Sensor Cleaning EOS integrated cleaning system Colour Filter Type Primary Colour",
    "flash": "Built-in Flash GN (ISO 100, meters) 13 Built-in Flash Coverage up to 17mm focal length (35mm equivalent: 28mm) Built-in Flash Recycle Time Approx. 3 seconds Modes Auto, Manual flash, Integrated Speedlite Transmitter Red-Eye Reduction Yes - with red eye reduction lamp X-Sync 1/200sec Flash Exposure Compensation '+/- 2EV in 1/2 or 1/3 increments Flash Exposure Bracketing Yes, with compatible External Flash Flash Exposure Lock Yes Second Curtain Synchronisation Yes HotShoe/ PC Terminal Yes/ No External Flash Compatibility E-TTL II with EX series Speedlites, wireless multi-flash support External Flash Control via camera menu screen",
    "powersupply": "Batteries 1 x Rechargeable Li-ion Battery LP-E8 Battery Life Approx. 440 (at 23°C, AE 50%, FE 50%)¹ Approx. 400 (at 0°C, AE 50%, FE 50%) Battery Indicator 4 levels Power Saving Power turns off after 30sec or 1, 2, 4, 8 or 15mins. Power Supply & Battery Chargers AC Adapter Kit ACK-E8, Battery charger LC-E8, LC-E8E",
    "shutter": "Type Electronically-controlled focal-plane shutter Speed 30-1/4000 sec (1/2 or 1/3 stop increments), Bulb (Total shutter speed range. Available range varies by shooting mode)",
    "memorycard": "SD, SDHC or SDXC (UHS-I)card",
    "focusing": "Type TTL secondary image forming, phase difference detection with AF dedicated CMOS sensor AF System/ Points 9 cross-type AF points (f/2.8 at centre) AF Working Range EV -0.5 -18 (at 23°C & ISO100) AF Modes AI Focus One Shot AI Servo AF Point Selection Automatic selection, Manual selection Selected AF Point Display Superimposed in viewfinder and indicated on LCD monitor Predictive AF Yes, up to 10m¹ AF Lock Locked when shutter button is pressed half way AF Assist Beam Intermittent firing of built-in flash or emitted by optional dedicated Speedlite Manual Focus Selected on lens",
    "viewfinder": "Type Pentamirror Coverage (Vertical/Horizontal) Approx. 95% Magnification Approx. 0.85x ¹ Eyepoint Approx. 19mm (from eyepiece lens centre) Dioptre Correction '-3 to +1 m-1 (dioptre) Focusing Screen Fixed Mirror Quick-return half mirror (Transmission: reflection ratio of 40:60, no mirror cut-off with EF600mm f/4 or shorter) Viewfinder Information AF information: AF points, focus confirmation light Exposure information: Shutter speed, aperture value, ISO speed (always displayed), AE lock, exposure level/compensation, spot metering circle, exposure warning, AEB Flash information: Flash ready, high-speed sync, FE lock, flash exposure compensation, red-eye reduction light Image information: Highlight tone priority (D+), monochrome shooting, maximum burst (1 digit display), White balance correction, SD card information Depth of Field Preview Yes, with Depth of Field preview button. Eyepiece Shutter On strap",
    "shooting": "Modes Scene Intelligent Auto, No Flash, Creative Auto, Portrait, Landscape, Close-up, Sports, Night Portrait, Handheld Night Scene, HDR Backlight Control, Program AE , Shutter priority AE, Aperture priority AE, Manual Picture Styles Auto, Standard, Portrait, Landscape, Neutral, Faithful, Monochrome, User Defined (x3) Colour Space sRGB and Adobe RGB Image Processing Highlight Tone Priority Auto Lighting Optimizer (4 settings) Long exposure noise reduction High ISO speed noise reduction (4 settings) Multi Shot Noise Reduction Auto Correction of Lens Peripheral illumination Basic+ (Shoot by ambience selection, Shoot by lighting or scene type) Creative filters (Art Bold, Water painting, Grainy B/W, Soft focus, Toy camera, Miniature effect, Fish-eye) - during image Playback only Drive Modes Single, Continuous, Self timer (2s, 10s+remote, 10s + continuous shots 2-10) Continuous Shooting Max. Approx. 5fps for approx. 22 JPEG images¹, 6 images RAW² ³",
    "interface": "Computer Hi-Speed USB Other Video output (PAL/ NTSC) (integrated with USB terminal), HDMI mini output (HDMI-CEC compatible), External microphone (3.5mm Stereo mini jack)",
    "filetype": "Still Image Type JPEG: Fine, Normal (Exif 2.30 compliant) / Design rule for Camera File system (2.0), RAW: RAW (14bit, Canon original RAW 2nd edition), Digital Print Order Format [DPOF] Version 1.1 compliant RAW+JPEG Simultaneous Recording Yes, RAW + Large JPEG Image Size JPEG 3:2: (L) 5184x3456, (M) 3456x2304, (S1) 2592x1728, (S2) 1920x1280, (S3) 720x480 JPEG 4:3: (L) 4608x3456, (M) 3072x2304, (S1) 2304x1728, (S2) 1696x1280, (S3) 640x480 JPEG 16:9: (L) 5184x2912, (M) 3456x1944, (S1) 2592x1456 (S2) 1920x1080, (S3) 720x400 JPEG 1:1: (L) 3456x3456, (M) 2304x2304, (S1) 1728x1728, (S2) 1280x1280, (S3) 480x480 RAW: (RAW) 5184x3456, (M-RAW) 3888x2592, (S-RAW) 2592x1728 Movie Type MOV (Video: H.264, Sound: Linear PCM, recording level can be manually adjusted by user) Movie Size 1920 x 1080 (29.97, 25, 23.976 fps) 1280 x 720 (59.94, 50 fps) 640 x 480 (30, 25 fps) Movie Length Max duration 29min 59sec, Max file size 4GB Folders New folders can be manually created and selected File Numbering (1) Consecutive numbering (2) Auto reset (3) Manual reset",
    "features": "Canon EOS 650D High-quality, entry-level EOS. First choice for those starting their DSLR adventures. An ideal entry to the world of EOS imaging. The EOS 650D’s 18.0-megapixel sensor is superb for both still images and Full HD movies. A Vari-angle Clear View LCD II Touch screen makes shooting simple. Benefits 18.0 MP APS-C CMOS sensor Full-HD movies with manual controls and continuous AF 5 fps continuous shooting Vari-angle Clear View LCD II Touch screen ISO 100-12,800 sensitivity, extendable to ISO 25,600 9-point wide-area AF Integrated Speedlite Transmitter"
}