{
    "features": "Full-frame 20.2-megapixel sensor Tough, lightweight construction Max ISO 25,600 (expandable to ISO 102,400) 11-point AF sensitive down to -3EV GPS* records your location Wi-Fi** file transfer and remote control Full-HD video",
    "weight": "755g",
    "color": "Black",
    "filetype": "Still Image Type JPEG: Fine, Normal (Exif 2.21 [Exif Print] compliant) / Design rule for Camera File system (2.0), RAW: RAW, M-RAW, S-RAW (14bit, Canon original RAW 2nd edition), Digital Print Order Format [DPOF] Version 1.1 compliant RAW+JPEG Simultaneous Recording Yes, any combination of RAW + JPEG, M-RAW + JPEG, S-RAW + JPEG possible. Image Size JPEG: (L) 5472x3648, (M) 3468x2432, (S1) 2736x1824, (S2) 1920x1280, (S3) 720x480 RAW: (RAW) 5472x3648, (M-RAW) 4104x2736, (S-RAW) 2736x1824 Movie Type MOV (Video: H.264 Intra frame / inter frame, Sound: Linear PCM, recording level can be manually adjusted by user) Movie Size 1920 x 1080 (29.97, 25, 23.976 fps) intra or inter frame 1280 x 720 (59.94, 50 fps) intra or inter frame 640 x 480 (59.94, 50 fps) inter frame Movie Length Max duration 29min 59sec Folders New folders can be manually created and selected File Numbering (1) Consecutive numbering (2) Auto reset (3) Manual reset",
    "interface": "Computer Hi-Speed USB Other HDMI mini output, Video output (PAL/ NTSC), External microphone (Stereo mini jack)",
    "shooting": "Modes Scene Intelligent Auto, No Flash, Creative Auto, Portrait, Landscape, Close-up, Sports, Night Portrait, Handheld Night Scene, HDR Backlight Control, Program AE , Shutter priority AE, Aperture priority AE, Manual Picture Styles Auto, Standard, Portrait, Landscape, Neutral, Faithful, Monochrome, User Defined (x3) Colour Space sRGB and Adobe RGB Image Processing Highlight Tone Priority Auto Lighting Optimizer (4 settings) Long exposure noise reduction High ISO speed noise reduction (4 settings) Multi Shot Noise Reduction Auto Correction of Lens Peripheral illumination Chromatic aberration correction Resize to M, S1, S2 or S3 RAW image processing - during image Playback only Multiple exposure HDR images Drive Modes Single, Continuous, Self timer (2s+remote, 10s +remote), Silent single shooting, Silent continous shooting Continuous Shooting Max. Approx. 4.5fps. (speed maintained for up to 1250 images (JPEG)¹²or 17 images (RAW))³ (with UHS-I card)²",
    "exposurecontrol": "Metering Modes TTL full aperture metering with 63 zone Dual Layer SPC (1) Evaluative metering (linked to All AF point) (2) Partial metering (approx. 8% of viewfinder at centre) (3) Spot metering (approx. 3.5% viewfinder at centre) (4) Centre weighted average metering Metering Range EV 1 - 20 (at 23°C with 50mm f/1.4 lens ISO100) AE Lock Auto: In 1-shot AF mode with evaluative metering exposure is locked when focus is achieved. Manual: By AE lock button in creative zone modes. Exposure Compensation '+/-5 EV in 1/3 or 1/2 stop increments (can be combined with AEB). AEB 2, 3, 5 or 7 Shots +/-3 EV 1/3 or 1/2 stop increments ISO Sensitivity* Auto (100-25600), 100-25600 (in 1/3-stop or whole stop increments) ISO can be expanded to L: 50, H1: 51200, H2: 102400 During Movie shooting: Auto (100-12800), 100-12800 (in 1/3-stop or whole stop increments) ISO can be expanded to H: 25600",
    "category": "camera",
    "imageprocessor": "DIGIC 5+",
    "dimensions": "144.5 x 110.5 x 71.2",
    "flash": "Modes E-TTL II Auto Flash, Metered Manual X-Sync 1/180sec Flash Exposure Compensation '+/- 3EV in 1/2 or 1/3 increments Flash Exposure Bracketing Yes, with compatible External Flash Flash Exposure Lock Yes Second Curtain Synchronisation Yes HotShoe/ PC Terminal Yes/ No External Flash Compatibility E-TTL II with EX series Speedlites, wireless multi-flash support (with optional accessory) External Flash Control via camera menu screen",
    "powersupply": "Batteries Rechargeable Li-ion Battery LP-E6 (supplied) Battery Life Approx. 1090 (at 23°C, AE 50%, FE 50%)¹ Approx. 980 (at 0°C, AE 50%, FE 50%) Battery Indicator 6 levels + percentage Power Saving Power turns off after 1, 2, 4, 8, 15 or 30mins. Power Supply & Battery Chargers AC Adapter Kit ACK-E6, Battery charger LC-E6, Car Battery charger CBC-E6",
    "directprint": "Canon Printers Canon Compact Photo Printers and PIXMA Printers supporting PictBridge PictBridge Yes, PictBridge compliant (USB and Wireless LAN)",
    "accessories": "Viewfinder Eyecup Eb, E-series Dioptric Adjustment Lens with Rubber Frame Eb, Eyepiece Extender EP-EX15, Focusing Screens Eg (with Grid Eg-D, Super Precision Matte Eg-S), Angle Finder C Wireless File Transmitter Built in Lenses All EF lenses Flash Canon Speedlites (90EX, 220EX, 270EX, 270EX II, 320EX, 420EX, 430EX, 430EX II, 550EX, 580EX, 580EX II, 600EX, 600EX-RT, Macro-Ring-Lite, MR-14EX, Macro Twin Lite MT-24EX, Speedlite Transmitter ST-E2, Speedlite Transmitter ST-E3-RT) Battery Grip BG-E13 Remote Controller/ Switch Remote control with N3 type contact, Wireless Controller LC-5, Remote Controller RC-6 Other Hand Strap E2, GP-E2",
    "memorycard": "SD, SDHC or SDXC (UHS-I)card",
    "lens": "Lens Mount EF (excludes EF-S lenses) Focal Length Equivalent to 1.0x the focal length of the lens",
    "focusing": "Type TTL-CT-SIR with a dedicated CMOS sensor AF System/ Points 11 points (f/5.6 cross type at centre, extra sensitivity at f/2.8) AF Working Range EV -3 - 18 (at 23°C & ISO100) AF Modes AI Focus One Shot AI Servo AF Point Selection Automatic selection Manual selection AF points can be selected separately for vertical and horizontal shooting Selected AF Point Display Superimposed in viewfinder and indicated on top LCD panel and Quick Control screen AF Lock Locked when shutter button is pressed half way in One Shot AF mode or AF-ON button is pressed. AF Assist Beam Emitted by an optional dedicated Speedlite Manual Focus Selected on lens AF Microadjustment C.Fn II-9 +/- 20 steps ( wide and tele setting for Zooms) Adjust all lenses by same amount Adjust up to 40 lenses individually Adjustments remembered for lens by serial number",
    "lcdmonitor": "Type 7.7cm (3.0\") Clear View TFT, approx. 1040K dots Coverage Approx. 100% Viewing Angle (Horizontally/Vertically) Approx 170° Coating Dual Anti-reflection Brightness Adjustment Adjustable to one of seven levels Display Options (1) Quick Control Screen (2) Camera settings (3) Electronic Level",
    "imagesensor": "Type 36 x 24 mm CMOS Effective Pixels Approx. 20.2 megapixels Total Pixels Approx. 20.6 megapixels Aspect Ratio 3:2 Low-Pass Filter Built-in/Fixed with fluorine coating Sensor Cleaning EOS integrated cleaning system Colour Filter Type Primary Colour",
    "shutter": "Type Electronically-controlled focal-plane shutter Speed 30-1/4000 sec (1/2 or 1/3 stop increments), Bulb (Total shutter speed range. Available range varies by shooting mode)",
    "viewfinder": "Type Pentaprism Coverage (Vertical/Horizontal) Approx. 97% Magnification Approx. 0.71x¹ Eyepoint Approx. 21mm (from eyepiece lens centre) Dioptre Correction '-3 to +1 m-1 (dioptre) Focusing Screen Interchangeable (3 types, optional). Standard Focusing Screen Precision Matte Eg-A II Mirror Quick-return half mirror (Transmission: reflection ratio of 40:60, no mirror cut-off with EF600mm f/4 or shorter) Viewfinder Information AF information: AF points, focus confirmation light. Exposure information: Shutter speed, aperture value, ISO speed (always displayed), AE lock, exposure level/compensation, spot metering circle, exposure warning, AEB. Flash information: Flash ready, high-speed sync, FE lock, flash exposure compensation. Image information: Highlight tone priority (D+), maximum burst (2-digit display), card information Battery check: Composition information Electronic level Warning symbol: Displayed if any of the following is set: Monochrome, white balance correction, expanded ISO speed, or spot metering. Depth of Field Preview Yes, with Depth of Field preview button. Eyepiece Shutter On strap",
    "whitebalance": "Type Auto white balance with the imaging sensor Settings AWB, Daylight, Shade, Cloudy, Tungsten, White Fluorescent light, Flash, Custom, Colour Temperature Setting. White balance compensation: 1. Blue/Amber +/-9 2. Magenta/ Green +/-9. Custom White Balance Yes, 1 setting can be registered WB Bracketing '+/-3 levels in single level increments 3 bracketed images per shutter release. Selectable Blue/Amber bias or Magenta/ Green bias."
}