{
    "category": "camera",
    "creditcard": "Accepted",
    "shopcategoriesshophomecanoncashbackitemscrumplerexdemofujifilmlowepromanfrottonikonolympuspentaxsonytamractamronusedusedvelbonother": "cameracentreuk store Sony BC-TRW Features BC-TRW Quickly charge your Cyber-shotâ\u0084¢ battery -                                             charge your digital camera  battery faster than re-charging the main camera body, so you won't miss  shooting opportunities Flexibility to charge more devices -                                             use the USB charge function  and supplied micro USB cable to power up HandycamÂ® camcorders and  Compact System Cameras (NEX) too Check the status indicator to see power levels -                                             see how long it will be  before you are back shooting by tracking approximate % charging status  on the indicator lamp THESE ITEMS ARE BRAND NEW SONY UK STOCK, AND COME SUPPLIED WITH A FULL 12 MONTH WARRANTY VALID ANYWHERE IN EUROPE. IF YOU WOULD LIKE ANY MORE INFORMATION ABOUT THIS ITEM, OR ANY OF OUR OTHER ITEMS IN OUR EBAY STORE, OR IF YOU WOULD LIKE TO PAY WITH CREDIT/DEBIT CARD THEN PLEASE FEEL FREE CALL ONE OF OUR STORES ON: NEWPORT:  01633 262738. CARDIFF: 02920 394182 **RETURNS** IF FOR ANY REASON YOU WISH TO RETURN ANY ITEM THAT YOU BUY FROM CAMERA CENTRE UK THEN PLEASE INCLUDE A COPY OF YOUR ORIGINAL RECEIPT AND A COVER NOT EXPLAINING THE REASON FOR THE RETURN. THIS WILL INSURE THAT YOUR REQUEST IS PROCESSED QUICKLY AND EFFICIENTLY WITHOUT DELAY. RETURNS MUST BE WITHIN 7 DAYS OF RECEIVING YOUR ITEM. WE ENDEVOUR TO SORT ANY ISSUES OUT AS SOON AS THEY ARISE, BUT IN SOME CASES THERE MAY BE A SMALL DELAY. **BID BY MISTAKE** THIS IS NOT A HUGE PROBLEM IF YOU BID AND CHANGE YOUR MIND, OR JUST BID BY MISTAKE, BUT PLEASE - IF YOU WISH TO CANCEL YOUR BID - LET US KNOW ATLEAST 24 HOURS PRIOR TO THE LISTING ENDING, THIS WILL INSURE THAT NO EBAY CASES ARE OPENED AND THAT OTHERS CAN HAVE THE CHANCE TO PURCHASE THE ITEM WITHOUT HAVING TO WAIT WHILE THE ITEM IS RELISTED. **POSTAGE** IN SOME CASES POSTAGE MAY BE A LITTLE MORE TO SOME AREAS OF THE WORLD. IF YOU ARE UNSURE OF THE COST TO YOUR AREA PLEASE FEEL FREE TO EMAIL AND ASK AND WE WILL GET BACK TO YOU AS SOON AS POSSIBLE. THIS WILL INSURE THAT YOUR ORDER IS PROCESSED THANK YOU FOR LOOKING Posted with eBay Mobile FINANCE AVAILABLE ON ALL NEW PRODUCTS OVER Â£300 PLEASE CALL US ON 01633 262738 OR 02920 394182 FOR DETAILS",
    "paymentmethod": "Preferred/Accepted"
}