{
    "liveview": "Yes",
    "weight": "407 gr",
    "flashtype": "Pop-up Flash",
    "flashsyncspeed": "1/200 sec",
    "lensforsd": "Body only",
    "isomax": "25600",
    "flashguidenumber": "9.4",
    "size": "116.8 x 90.7 x 69.4mm",
    "category": "camera",
    "displayrotation": "Built-in",
    "facedetection": "Yes",
    "lightsensitivitymax": "25600",
    "shutterspeedslow": "30 sec",
    "stillimageformat": "JPEG, RAW, RAW + JPEG",
    "autofocuspoints": "9",
    "redeyereduction": "Yes",
    "lightsensitivity": "ISO 100-12800, ISO 25600, ISO auto (100-6400)",
    "sensorsize": "14.9 x 22.3mm",
    "width": "11.7 cm",
    "framespersecond": "4",
    "batterymodel": "LP-E12",
    "isomin": "100",
    "aspectratio": "3:2",
    "flashmetering": "Auto, Manual Flash",
    "autofocussystem": "9 AF points (f/5.6 cross type at centre, extra sensitivity at f/2.8)",
    "mpn": "8576B015",
    "brand": "Canon",
    "sensortype": "CMOS",
    "connectivity": "Hi-Speed USB, HDMI mini output, Video output (PAL / NTSC), External microphone (Stereo mini jack)",
    "meteringsystem": "63-zone TTL",
    "cardformat": "SD/SDHC/SDXC UHS-I",
    "digitalvideoformat": "H.264, MOV",
    "supportedflashmemory": "SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "screenresolution": "1040000",
    "height": "9.1 cm",
    "microphoneoperationmode": "Mono",
    "weightg": "407",
    "fileformats": "JPEG, RAW, RAW+JPEG",
    "screensizeinches": "3.0",
    "cameratype": "Digital SLR",
    "lensmount": "Canon EF/EF-S mount",
    "resolution": "5184x3456",
    "hdmoviemode": "1080p",
    "megapixels": "18.0",
    "exposuremodes": "Program AE , Shutter priority AE, Aperture priority AE, Manual and 14 Exposure Modes",
    "displaysize": "3\"",
    "shopcategoriesshophomecanoncashbackitemscrumplerexdemofujifilmlowepromanfrottonikonolympuspentaxsonytamractamronusedusedvelbonother": "The Canon EOS 100D Digital SLR Camera with 18-55mm IS STM Lens is the worldâ\u0080\u0099s  smallest and lightest DSLR to date (21.03.2013) and is the optimal fusion of  performance and portability. The Canon 100D is aimed at enthusiasts and shares  similar features to the EOS M, such as an 18MP sensor, DIGIC 5 processor, 3.0â\u0080\u009d  touchscreen and full HD 1080p video capability (at a rate of 30, 25 and 24fps),  with continuous focusing. The EOS 100D is a responsive, easy-to-use camera with  Scene Intelligent Auto, which analyses the conditions and picks the optical  camera settings to ensure you get the best image. Accommodating all of the  technology essential to DSLR photography but in a feather weight body of 407g,  the Canon EOS 100D is the ideal choice for on-the-go photographers who require  both quality and convenience. The key features of the Canon EOS 100D Digital SLR Camera Create superb 18 megapixel images with a fully-featured, responsive DSLR  thatâ\u0080\u0099s small enough to take everywhere Easy to use: Scene Intelligent Auto analyses the conditions and picks the  optimal camera settings Compose using an optical viewfinder or a large Clear View LCD II Touch  screen Continuous focusing when shooting Full-HD movies with Hybrid CMOS AF II.  Create edited clip sequences in camera using Video Snapshot Be artistic with Creative filters. Extra Effect Shot captures a filtered and  unfiltered shot simultaneously Built-in Feature Guide for instant help when shooting Lens compatibility: As this camera features a cropped APS-C  sensor you can use both Canonâ\u0080\u0099s EF-S and EF lenses. The Canon EOS 100D will also  take Sigmaâ\u0080\u0099s DC/DG and Tamronâ\u0080\u0099s Di/Di II lenses. A DSLR youâ\u0080\u0099ll never want to leave behind The EOS 100D is  a fully-featured, responsive DSLR that is also small and light enough to take  everywhere. The ideal camera to document your lifestyle. Shoot 18-megapixel  photos and Full HD movies everywhere you go and enjoy great performance even in  poor light: a maximum ISO sensitivity of 12800 (extendable to ISO 25600) allows  you to shoot images that are low in noise but full of atmosphere. Easy and enjoyable to use Compose your photos using a  bright, responsive optical viewfinder or use the 1,040,000-dot 7.7cm (3.0â\u0080\u009d) 3:2  Clear View II TFT Touch screen to control the camera. Navigate menus, review  pictures and even focus and shoot by tapping, swiping and pinching. Simple operation â\u0080\u0093 fantastic results Canonâ\u0080\u0099s Scene  Intelligent Auto technology analyses the scene and sets the most appropriate  cameras settings automatically. And as your photography develops a built-in  Feature Guide will teach you how to get the most from the camera. Capture Full HD movies Shoot high-quality video at  resolutions up to Full-HD (1080p). Take control of exposure, focusing, sound and  more, or use the Video Snapshot mode to capture edited movie sequences  in-camera. Hybrid CMOS AF II provides continuous focusing while shooting, ideal  for keeping moving subjects sharp. Capture the action Track and shoot fast moving subjects  at 4 fps and take advantage of nine AF points to focus swiftly and accurately,  even with off-centre subjects. Taking your next creative steps Express your creative  side with one of the EOS 100Dâ\u0080\u0099s Creative filters. Extra Effect Shot captures a  filtered and unfiltered shot simultaneously. Choose from Grainy Black &  White, Toy Camera, Miniature Effect and more, and preview the effect of each  filter before you shoot. A mode for whatever you are shooting Theme-based Scene  modes automatically choose the right camera settings for the subject youâ\u0080\u0099re  shooting. Choose from Portrait, Landscape, Sports, Kids, Food and more. And when  youâ\u0080\u0099re ready, progress to Creative Auto mode for more control over factors like  background blur, via an intuitive interface. Welcome to the EOS System Take advantage of the extensive  range of lenses, accessories and flashes that make up the EOS System. SPECIFICATIONS Megapixels 18.0 Sensor type CMOS Sensor size 22.3 x 14.9mm (APS-C) Resolution 5184x3456 Autofocus points 9 Autofocus system 9 AF points (f/5.6 cross type at centre, extra sensitivity at f/2.8) Lens mount Canon EF/EF-S mount Frames per second 4 ISO min 100 ISO max 25600 Card format SD/SDHC/SDXC UHS-I Weight (g) 407 Size 116.8 x 90.7 x 69.4mm Aspect ratio 3:2 Battery model LP-E12 File formats JPEG, RAW, RAW+JPEG Shutter speed fast 1/4000 sec Shutter speed slow 30 sec HD Movie mode 1080p Screen size (inches) 3.0 Screen resolution 1040000 Live view Yes VF coverage 95% Metering system 63-zone TTL Exposure modes Program AE , Shutter priority AE, Aperture priority AE, Manual and 14 Exposure Modes Flash guide number 9.4 Flash metering Auto, Manual Flash Flash sync speed 1/200 sec Connectivity Hi-Speed USB, HDMI mini output, Video output (PAL / NTSC), External microphone (Stereo mini jack) Optional flashgun Canon Speedlites (90EX, 220EX, 270EX, 270EX II, 320EX, 420EX, 430EX, 430EX II, 550EX, 580EX, 580EX II, 600EX, 600EX-RT, Macro-Ring-Lite, MR-14EX, Macro Twin Lite MT-24EX, Speedlite Transmitter ST-E2, Speedlite Transmitter ST-E3-RT Other optional accessories Hand Strap E2, GPS Receiver GP-E2, Remote Controller RC-6, Remote Switch RS-60E3, Semi-Hard Case EH25-L, Eyecup Ef, E-series Dioptric Adjustment Lens with Rubber Frame Ef, Eyepiece Extender EP-EX15II, Angle Finder C Vertical grip None BODY ONLY NO LENS IS INCLUDED CANON UK STOCK. NEW SUPPLIED WITH A FULL 12 MONTH WARRANTY VALID ANYWHERE IN EUROPE. IF YOU WOULD LIKE ANY MORE INFORMATION ABOUT THIS ITEM, OR ANY  OTHER ITEMS IN OUR EBAY STORE, OR IF YOU WOULD LIKE TO PAY WITH CREDIT/DEBIT CARD THEN PLEASE FEEL FREE TO CALL ONE OF OUR STORES ON: CARDIFF: 02920 394182 NEWPORT: 01633 262738 **RETURNS** UNDER THE DISTANCE SELLERS ACT YOU ARE ENTITLED TO CANCEL AND RETURN YOUR ORDER LESS THE COST OF POSTAGE THAT IT HAS COST US TO POST THE ITEM TO YOU. THIS ONLY COVERS YOU FOR BUY IT NOW ITEMS NOT AUCTION STYLE PURCHASES. IF FOR ANY REASON YOU WISH TO RETURN ANY ITEM THAT YOU BUY FROM CAMERA CENTRE UK THEN PLEASE INCLUDE A COPY OF YOUR ORIGINAL RECEIPT AND A COVER NOTE EXPLAINING THE REASON FOR THE RETURN. THIS WILL INSURE THAT YOUR REQUEST IS PROCESSED QUICKLY AND EFFICIENTLY WITHOUT DELAY. RETURNS MUST BE WITHIN 7 DAYS OF RECEIVING YOUR ITEM. THE MAXIMUM RETURNS POSTAGE WE WILL PAY IS Â£7.90 FOR UK .PLEASE DO NOT SEND THE ITEM BACK SPECIAL DELIVERY AS WE WILL ONLY COVER UP TO THIS MUCH. WE ENDEVOUR TO SORT ANY ISSUES OUT AS SOON AS THEY ARISE, BUT IN SOME CASES THERE MAY BE A SMALL DELAY. THIS IS NOT A HUGE PROBLEM IF YOU BID AND CHANGE YOUR MIND, OR JUST BID BY MISTAKE, BUT PLEASE - IF YOU WISH TO CANCEL YOUR BID - LET US KNOW ATLEAST 24 HOURS PRIOR TO THE LISTING ENDING, THIS WILL INSURE THAT NO EBAY CASES ARE OPENED AND THAT OTHERS CAN HAVE THE CHANCE TO PURCHASE THE ITEM WITHOUT HAVING TO WAIT WHILE THE ITEM IS RELISTED. **POSTAGE** IN SOME CASES POSTAGE MAY BE A LITTLE MORE TO SOME AREAS OF THE WORLD. IF YOU ARE UNSURE OF THE COST TO YOUR AREA PLEASE FEEL FREE TO EMAIL AND ASK AND WE WILL GET BACK TO YOU AS SOON AS POSSIBLE. THIS WILL INSURE THAT YOUR ORDER IS PROCESSED THANK YOU FOR LOOKING ** PLEASE NOTE ** WE DO NOT DELIVER TO SOUTH AMERICA, AFRICA OR SOUTHERN ASIA. IF YOU ARE UNSURE PLEASE ASK. ALL ORDERS OVER Â£300 ARE SENT SPECIAL NEXT DAY DELIVERY. ** Please Note ** All item that are returned to us in perfect unopened and unused condition will receive a full refund. Any item that has been opened or used will incur a 10% restocking/repackaging fee. This includes software packs, neck straps etc.. We are unable to accept returns of consumables that have been opened, this includes batteries,memory cards etc.. Russian Customers We are only able to ship to business addresses in Russia. If you do not supply us with a business address then we will not be able to send your items to you. Further note Minimum delivery charge to Russia is Â£29.99 FINANCE AVAILABLE ON ALL NEW PRODUCTS OVER Â£300 PLEASE CALL US ON 01633 262738 OR 02920 394182 FOR DETAILS",
    "vfcoverage": "95%",
    "depth": "6.9 cm",
    "sensorresolution": "18.0 MP",
    "viewfindertype": "Optical",
    "batteryformfactor": "Manufacturer specific",
    "model": "100D",
    "shootingprograms": "Backlight correction HDR, Candle, Close-up, Food, Handheld night shot, Kids, Landscape, Night portrait, Portrait mode, Sports mode",
    "shutterspeedfast": "1/4000 sec",
    "screensize": "3\""
}