{
    "sensorsizeheight": "15.6mm",
    "backtohomepage": "| Listed in category:Cameras & Photography > Digital Cameras",
    "weight": "480g",
    "isosensitivity": "100 - 25600",
    "metering": "Centre-weighted - Average Spot Multi Pattern",
    "height": "98mm",
    "exposurecomp": "+/-5",
    "videofps": "60p, 50p, 30p, 25p, 24p",
    "shopcategoriesshophomelaptopscamerasgraphicscardtabletsapplemacnetworkingsmartphonescanonlenses": "Nikon D5300 Digital SLR Black (24.2 MP) 3.2 inch LCD Nikon D5300 Digital SLR with 18-55mm VR II Compact Lens Kit - Red (24.2 MP) 3.2 inch LCD Product Description Optimised for creativity and streamlined for flexibility, the Nikon D5300 is an upper entry-level D-SLR designed to inspire spectacular photos and videos. Boasting built-in Wi-Fi and GPS, this impressive 24.2 megapixel DX-format camera lets you capture and share the magic of your world in incredible detail. With the perfect combination of a powerful image sensor, incredibly fast image-processing engine, Picture Control technology and supreme NIKKOR lenses, the D5300 takes image quality to a whole new level. Ideal for anyone with a passion for photography, the D5300 is intelligently designed with every button and dial carefully placed for comfortable, efficient operatioAt the core of the D5300 is a 24.2 megapixel DX-format CMOS sensor that has been designed without an optical low-pass filter (OLPF) to capture maximum image detail. Achieving amazingly rich colours and smooth, natural skin tones A New Level of Connectivity As the first Nikon D-SLR to be equipped with built-in Wi-Fi, the D5300 makes it easy to share great shots while they’re still fresh. In a few simple steps you can send photos directly to any iOS or Android smart device ready to upload to Facebook, Instagram and other social networking sites[1]. The Wi-Fi function also makes it possible to control the camera remotely and preview the scene you’re shooting using the connected smart device. Enriching your sharing experience still further you can add location information to photos using the built-in GPS function, another first for a Nikon D-SLR. Recording latitude, longitude and altitude as Exif data, the clever tracking tool can also log your route, even when the camera is turned off. Experience outstanding D-SLR image quality with 24.2 effective megapixels Nikon makes outstanding image quality possible with the perfect combination of technological advances: a newly developed Nikon DX-format CMOS image sensor, Nikon's exclusive new EXPEED 4 image-processing engine, Picture Control, and the uncompromising optical quality of NIKKOR lenses. Connect immediately with smart devices With the D5300's built-in Wi-Fi® feature, your pictures are ready to send immediately to smart devices for online sharing with just a few simple steps. Now is the time for amazing pictures. Now is the moment to broadcast your story. A Photographic Powerhouse At the core of the D5300 is a 24.2 megapixel DX-format CMOS sensor that has been designed without an optical low-pass filter (OLPF) to capture maximum image detail. Achieving amazingly rich colours and smooth, natural skin tones, fine detail like hair or feathers are captured perfectly, especially when paired with a NIKKOR lens. Such high-quality, high resolution images also ensure you can enlarge or crop your photos without losing any of the striking contrast and detail. High Speed Performance Working to an exceptional standard in all light conditions, High ISO capability (100-12800 and extendable up to 25600) delivers brilliant shots and sharp images of fast moving subjects even in poorly lit environments. Equipped with Nikon’s new EXPEED 4 image-processing engine, this unique system runs through countless operations at lightning-fast speeds to produce enhanced movie recordings and images with less noise and superb tonal gradation. With continuous shooting available at up to 5fps that fast-moving action shot is there for the taking. Nikon D5300 Key Features 24.2 megapixel APS-C CMOS sensor No OLPF (Optical Low Pass Filter) Optical viewfinder, with increased magnification (approx. 0.82x) 3.2 inch tilting vari-angle screen, 1037k dots Wi-Fi connectivity GPS / A-GPS built in ISO100 - ISO12800, extends to 25600 EXPEED 4 image processor 39-point AF, 9-cross type AF 5fps continuous shooting 2,016-pixel RGB metering sensor with Nikon’s Scene Recognition System Full HD movies at 1080/60p, 50p, 25p, 24p HDMI output supported Built-in stereo microphone and compatibility with Nikon’s ME-1 Stereo Microphone HDR and Active D-Lighting Special effects for still images and movies 16 Scene Modes 14-bit RAW recording cal user interface for clearer menus Handling The Nikon D5300 has an impressively clear and bright 3.2inch screen with very good viewing angles, and despite the reduction in body size, Nikon has still managed to include a larger screen than the previous model. The screen can be tilted for viewing from in front of the camera, or for shooting at awkward angles. The camera uses a 39-point AF system, with 9 cross-type sensors, and the focus area is shown in the optical viewfinder clearly with red sections, although the viewfinder isn't the largest, it is much quicker to use the camera with the optical viewfinder.  With a smaller body than the D5200, Nikon says that the camera has an improved grip, however we found the space between the grip and the lens quite tight (even when using the standard 18-55mm VR kit lens), meaning that anyone with quite large hands may find it a little small.  The body is said to be made from a monocoque design, which enables the camera to be smaller, and while Nikon wouldn't disclose what the body was made from, it feels solid and well built, with a number of premium touches such as a stylish finish on the mode dial. The top of the camera also features a stereo microphone, and video recording has been improved. Wi-Fi - The Nikon WirelessMobileUtility (all one word) app is available in the Android or iOS app store, and lets you browse photos or remotely control the camera. You can set the focus point with the touch screen on the smartphone, - Battery life Battery life is rated at 600 shots according to Nikon / CIPA test results, and the camera comes with a higher power EN-EL14a battery with 1230mAh rating compared to the 1030mAh rating of the EN-EL14. Speed - We took a number of shots to test the camera's responsiveness, from switch on to first photo, shot to shot, focusing speed etc. We take a number of shots and then use the average to ensure accurate and consistent tests, making it easy to compare with other camera s Proformance Digital Filters The camera doesn't feature a built in panoramic mode, instead you will need to do this manually on your computer. Effects on the mode dial let you shoot with a number of different effects applied. The effects available are: Night vision, colour sketch, miniature, selective colour, silhouette, high key and low key. A number of additional effects can be applied in playback. Picture control lets you choose from standard, neutral, vivid, monochrome, portrait or landscape and these can be customised letting you adjust sharpening, contrast, brightness, saturation and hue. The retouch menu is worth highlighting as there is a large number of options available including: D-Lighting, Red-eye correction, Trim, Monochrome, Filter effects, Colour balance, Resize, Image overlay, RAW processing, Quick retouch, Straighten, Distortion control, Fisheye, Colour outline, Perspective control. s Capture Fleeting Moments The Nikon D5300 shares an AF system, metering sensor and scene recognition with the Nikon D7000 series, giving this camera a new level of performance and image quality. The superior accuracy of the 39-point AF system with nine cross-type sensors delivers razor sharp images by maintaining focus on even the smallest subjects however unpredictable their movements may be. Meanwhile, the 2016-pixel RGB metering sensor delivers precise metering for exact exposures and sends data to the camera’s Scene Recognition System to optimise auto exposure, focus and auto white balance immediately before the shutter is released. For closer control you can apply one of 16 scene modes, like Sports , Beach , or Snow . Selecting the mode that matches the subject or situation you’re shooting, the camera will automatically optimise shutter speed, ISO, and aperture for superior results. Perfect Images with Ease A variety of practical and innovative in-camera tools help to make the most of every shooting opportunity and ensure your pictures are captured to perfection. When facing extremely high-contrast lighting beyond the camera’s dynamic range, Nikon’s exclusive Active D-Lighting helps maintain details in the highlights without losing them in the shadows. In the most challenging conditions HDR (High Dynamic Range) simultaneously controls overexposure and underexposure to ensure well-balanced, low-noise, natural images with an extensive range of tones. After shooting you can enhance your photos still further with a range of clever retouch editing functions including the new Portrait subjects mode of the D-Lighting feature, which adjusts the exposure of human subjects while still retaining the natural ambience of a low-lit background. Creative Images from Any Angle Simply flip, tilt, or turn, and explore your creativity with the versatile high-resolution 8.1cm (3.2 inch), 1,037k-dot vari-angle LCD monitor. This swivel monitor gives you the ultimate freedom and flexibility to take great shots and movies from virtually any position or point of view including great self-portraits. Applying special effects like colour sketch or HDR painting to create distinctive photos and movies is made so much easier thanks to the large LCD screen. Preview your chosen effect on the high resolution monitor and adjust its intensity as you shoot. Lights, Camera, Action For those who want to take their creative vision to video, Nikon’s D-Movie function gives you great compositional freedom. Recording in Full HD (1080p) at frame rates up to 50/60p, this versatile camera offers superior performance. A wide range of movie applications and convenient custom controls, including Live View operation with subject-tracking AF or face-priority AF, ensure large format movie shooting at its best, even when the action speeds up. With the Nikon D5300 movies can sound as good as they look too. Thanks to the camera’s built-in stereo microphone and compatibility with Nikon’s external ME-1 Stereo Microphone, it’s easy to capture footage with crisp, clear sound. When it comes to sharing your latest creation, the HDMI output lets you connect the camera directly to an HDTV to enjoy your movies and photos in superb high-definition[2]. Uncompromising Quality Built for photographers on the go, a new internal design structure makes the durable D5300 even more compact and lightweight than it’s predecessor. An improved grip ensures a steady hold for both Live View and viewfinder shooting, and with a newly designed pentamirror the viewfinder magnification has been increased to approximately 0.82x, making accurate composition of your shots even easier. Nikon’s superior ergonomics, clear menus, and one-touch buttons for frequently used functions make operation quick and intuitive. Uncompromising Quality Built for photographers on the go, a new internal design structure makes the durable D5300 even more compact and lightweight than it’s predecessor. An improved grip ensures a steady hold for both Live View and viewfinder shooting, and with a newly designed pentamirror the viewfinder magnification has been increased to approximately 0.82x, making accurate composition of your shots even easier. Nikon’s superior ergonomics, clear menus, and one-touch buttons for frequently used functions make operation quick and intuitive. Lens Kits – The Right Choices With outstanding Nikon technologies behind every lens kit, you can feel confident that you will take amazing, high-quality photos. The D5300 is compatible with the full range of DX-format NIKKOR lenses and is available separately or in a lens-kit with the small retractable NIKKOR 18–55mm f/3.5–5.6G VR II lens[3]. Whether you’re shooting fast action, taking a wide-angle group portrait in low light, or zooming in to capture distant subjects, Vibration Reduction (VR II) stabilisation enables up to 4 stops (16 times) faster shooting, helping ensure clear, blur-free images Product Specifications Manufacturer Nikon Lens Effective Magnification 1.5x Image Sensor CCD pixels 24.1Mp (Megapixels) Pixels (W) 6000 Pixels (H) 4000 Sensor Type CMOS Sensor Size APS-C Sensor Size (width) 23.5mm Sensor Size (height) 15.6mm Aspect Ratio 3:2 LCD Monitor LCD Monitor 3.2in Screen resolution 1037k Touch Screen No Focusing Focusing modes Autofocus Manual Spot AF Tracking Multi Exposure Control Shutter speeds shortest 1/4000sec Shutter speeds longest 30sec Exp modes Program Aperture-Priority Shutter-Priority Manual Scene modes Program Variable Metering Centre-weighted - Average Spot Multi Pattern ISO sensitivity 100 - 25600 White balance Auto Manual Outdoors/Daylight Cloudy Incandescent Fluorescent Shade Flash Exposure Comp +/-5 Shooting Options Continuous shooting 5fps Video Movie mode Yes Video Resolution 1920x1080 Video FPS 60p, 50p, 30p, 25p, 24p Stereo Sound Yes Optical Zoom with Video Yes Other Features Image Stabilisation No Interface HDMI Yes USB USB 2 Storage Card Type SD SDHC SDXC File Type RAW JPG RAW + JPG Power Source Battery Type EN-EL14a Lithium Ion CIPA Rating 600 Dimensions Weight 480g Width 125mm Height 98mm Depth 76mm",
    "batterytype": "EN-EL14a Lithium Ion",
    "aspectratio": "3:2",
    "category": "camera",
    "pixelsw": "6000",
    "continuousshooting": "5fps",
    "usb": "USB 2",
    "cardtype": "SD SDHC SDXC",
    "sensorsize": "APS-C",
    "width": "125mm",
    "stereosound": "Yes",
    "manufacturer": "Nikon",
    "filetype": "RAW JPG RAW + JPG",
    "pixelsh": "4000",
    "ccdpixels": "24.1Mp (Megapixels)",
    "opticalzoomwithvideo": "Yes",
    "touchscreen": "No",
    "sensorsizewidth": "23.5mm",
    "hdmi": "Yes",
    "shutterspeedsshortest": "1/4000sec",
    "attr999": "Column 2Â£3.99United KingdomExpress Delivery (Other 24 Hour Courier)Column 5Estimated by Tue. 14 Oct.Column 6",
    "sensortype": "CMOS",
    "imagestabilisation": "No",
    "ciparating": "600",
    "postageandpackaging": "Each additional itemToServiceDelivery*",
    "screenresolution": "1037k",
    "lcdmonitor": "3.2in",
    "shutterspeedslongest": "30sec",
    "expmodes": "Program Aperture-Priority Shutter-Priority Manual Scene modes Program Variable",
    "moviemode": "Yes",
    "freepp": "Column 2FreeUnited KingdomEconomy Delivery (Royal Mail 48)Column 5Estimated between Wed. 15 Oct.  and Thu. 16 Oct.Column 6",
    "whitebalance": "Auto Manual Outdoors/Daylight Cloudy Incandescent Fluorescent Shade Flash",
    "depth": "76mm",
    "videoresolution": "1920x1080",
    "focusingmodes": "Autofocus Manual Spot AF Tracking Multi"
}