{
    "minimumfocusingdistance": "1:48 \"(45 cm)",
    "colorspace": "sRGB and Adobe RGB",
    "externalflashcompatibility": "E-TTL II with EX series Speedlites, support wireless multi-flash wireless",
    "weight": "1.47 pounds (670 g)",
    "exposurecompensation": "+/- 5 EV in 1/3 or 1/2 levels of (can be combined with AEB).",
    "diaphragmblades": "8",
    "coverageverticalhorizontal": "Approx. 100%",
    "customfunctions": "13 Custom Functions with 47 settings",
    "coating": "Anti-reflective and solid structure",
    "afpointselection": "Automatic selection: 61 point AF Manual selection: single point AF (61, 41 cross type only, 15 or 9 points selectable) Manual selection: Spot AF Manual selection: AF point Expansion 4 points (up, down, left, right) Selection Manual: AF point Expansion surrounding 8 points Manual selection: Zone AF AF points can be selected separately for vertical shooting and horizontal",
    "effectivepixels": "Approx. 22.3 megapixels",
    "tiltshift": "No",
    "mirror": "Rapid return half mirror (Transmission: reflection ratio of 40:60, no mirror cut-off with EF 600mm f / 4 or less)",
    "coverage": "Approx. 100% (horizontally and vertically)",
    "shopcategoriesshophomelaptopscamerasgraphicscardtabletsapplemacnetworkingsmartphonescanonlenses": "Canon EOS 5D Mark III 22.3 MP Full Frame CMOS Digital SLR Camera with EF 24-105 mm zoom f / 4 L IS USM Black Canon EOS 5D Mark III 22.3 MP Full Frame CMOS Digital SLR Camera with EF   24-105 mm zoom f / 4 L IS USM Black The EOS 5D Mk II was something of a breakthrough camera for Canon,   providing full frame 35mm, HD 1080p video recording to a broad   audience. Now the 5D Mark III is here, and although it looks great on   the outside, there have been significant improvements to the   interior. The twins are the flagship features 22 megapixel CMOS sensor   full frame, and the ability to record video at 1080p HD. Other new and   improved features include a 61-point autofocus system, metering system   63-zone, enhanced sealing time, an ISO range of 50 to 102.400, high-rate   video compression options, large 3.2-inch LCD dual CF and SD memory   card slots and shooting continuously at 6 frames per second. 22.3 megapixel CMOS sensor full frame The EOS 5D Mark III has a full-frame Canon CMOS   sensor newly developed 22.3 million pixel that is designed from scratch   to create high resolution, perfectly detailed with a speed and   unprecedented clarity images. A full 24 x 36 mm, the sensor captures   5784 x 3861 large individual 6.25 micron pixels and has a much improved S   / N resulting in better images from the start. Specification Type 36 x 24 mm CMOS Effective Pixels Approx. 22.3 megapixels Total Pixels Approx. 23.4 megapixels Aspect Ratio 3: 2 Low-pass filter Integrated / fixed with fluorine coating Sensor Cleaning EOS Integrated Cleaning System Colour Filter Type Primary colors Focal length 24 - 105mm comparable APS-C 1.6x focal length: 38.4 to 168 mm Opening Maximum: f / 4 Minimum f / 22 Camera Type Mount Canon EF Format Compatibility 35mm Film / Full-Frame Digital Sensor Canon (APS-C) Perspective 84 ° - 23 ° 20 ' Tilt / Shift No Minimum Focusing Distance 1:48 \"(45 cm) Magnification 0.23x Max. Reproduction report 1.4 Groups / 18/13 diaphragm blades 8 Image Stabilizer Yes I am Autofocus Yes I am screen wire Front: 77 mm Dimensions (W x L) Approximately 3.3 x 4.2 \"(10.67 x 8.38 cm) Weight 1.47 pounds (670 g) Type TTL-CT-SIR with a dedicated CMOS sensor AF System / Points / 4 point cross-type 61/41 f AF points inc 5 dual cross type f / 2.8 The number of cross-type AF points varies depending on the lens. AF Working Range EV -2 to 18 (23 ° C to ISO 100) AF modes AI Focus One Shot AI Servo of AF point selection Automatic selection: 61 point AF Manual selection: single point AF (61, 41 cross type only, 15 or 9 points selectable) Manual selection: Spot AF Manual selection: AF point Expansion 4 points (up, down, left, right) Selection Manual: AF point Expansion surrounding 8 points Manual selection: Zone AF AF points can be selected separately for vertical shooting and horizontal Displaying dot areas In the viewfinder and indicated on top LCD panel and Quick Control screen AF Lock Locked when shutter button is pressed half way in One Shot AF mode or AF-ON button is pressed. AF illuminator Applied by an optional dedicated Speedlite Manual Focus Selected on lens, default in Live View mode AF Micro AF Menu +/- 20 steps (wide and tele setting for Zooms) Adjust all lenses by same amount adjust up to 40 lenses individually Adjustments remembered for lens by serial number Measurement modes TTL full aperture metering with 63 zone Dual Layer SPC (1) Evaluative metering (linked to all AF points) (2) Partial metering (approx. 6.2% of viewfinder at center) (3) Spot metering (approx. 1.5 % of viewfinder at center) (4) Centre weighted average metering Measuring range EV 1-20 (at 23 ° C with 50 mm f / 1.4 lens ISO 100) AE lock Auto :. In One Shot AF mode with evaluative metering when focus is achieved Manual: By AE lock button in creative zone modes. Exposure Compensation +/- 5 EV in 1/3 or 1/2 levels of (can be combined with AEB). AEB 2, 3, 5 or 7 shots +/- 3 EV increments third or half stop ISO * Auto (100-12800) 100-25600 (in 1/3 stop increments or integers) can be extended to ISO L: 50, H1: 51200, H2 102400 Type Auto white balance with the image sensor Settings Auto, Daylight, Shade, Cloudy, Tungsten, White Fluorescent light, Flash, Custom, adjustable color temperature. White balance compensation: 1. : Blue / amber +/- 9 2 Magenta / Green +/- 9. White Balance Yes, 1 setting can be registered Bracketing +/- 3 levels in single increments 3 bracketed images per shutter release. bias selectable: blue / amber or magenta / green. Type Electronically controlled focal plane Speed 30-1 / 8000 sec (1/2 or 1/3 increments of) + bulb (range Available shutter speeds vary depending on shooting mode) Type Pentaprism Coverage (vertical / horizontal) Approx. 100% Magnification Approx. 0.71x¹ Eye Relief Approx. 21mm (from eyepiece lens center) Diopter At -3 +1 m-1 (diopter) Focusing Fixed (Transmissive LCD screen) Mirror Rapid return half mirror (Transmission: reflection ratio of 40:60, no mirror cut-off with EF 600mm f / 4 or less) Viewfinder Information AF information: AF points, focus confirmation¹, AF status indicator Exposure information: Shutter speed, aperture, ISO (always displayed), AE lock, exposure level, exposure warning information flash: ready, flash exposure compensation, high-speed sync, FE lock, red-eye reduction light Image information: Highlight tone priority (D +), maximum burst (2 digit display) map of information, check the battery information composition grid, electronic level, warning symbol appears if any of these conditions shall be: Monochrome, white balance correction, switch recording quality one button, the ISO speed range or spot metering Depth of Field Yes, with Depth of Field preview button. Eyepiece cover The bracelet Type 8.11cm (3.2 \") Clear View II TFT, approx. 1040K dots Coverage Approx. 100% Viewing angle (horizontal / vertical) Approx. 170 ° Coating Anti-reflective and solid structure Adjusting the brightness Adjustable to one of seven levels Display options (1) Quick Control Screen (2) Camera settings dual electronic axial level (3) Methods E-TTL II auto flash, manual meter X-Sync 1 / 200sec (EX series Speedlites only) Flash exposure compensation +/- 3EV to half or one-third increments Flash bracket Yes, with external flash enabled On the Flash Exposure Lock Yes I am Second curtain synchronization Yes I am Claw / PC Terminal Yes / Yes External Flash Compatibility E-TTL II with EX series Speedlites, support wireless multi-flash wireless External Flash Control Via the menu screen of the camera Methods + Auto, Program, Shutter priority, Aperture priority, Manual (Stills and video), Custom (x3) Picture Styles Auto, Standard, Portrait, Landscape, Neutral, Faithful, Monochrome, User Defined (x3) Color Space sRGB and Adobe RGB Image Processing Highlight tone priority Auto Lighting Optimizer (4 settings) noise reduction for long exposures Noise Reduction High ISO (4 settings) Auto Correction of lens peripheral illumination correction of chromatic aberration distortion correction Resize to M1 , M2 or S RAW image processing - playing the single image multiple exposure HDR images 5 presets Drive Modes Single, Continuous L, Continuous H, Self timer (2s + remote, 10s + remote), silent single shooting, continuous shooting silent Gust Max. Approx. 6fps. (Cadence maintained up to 16 270 images (JPEG) or 18 frames ¹² (RAW)) (with UDMA card) ² Type Electronic viewfinder with image sensor Coverage Approx. 100% (horizontally and vertically) Frame Rate 30 fps Concentration Manual Focus (Magnify the image 5x or 10x at any point on screen) Autofocus: Quick mode, Live mode, Face detection mode live Measure Real-time evaluative metering with image sensor Active metering time can be changed Display options Grid overlay (x3), histogram, the aspect ratios, dual axis electronic level Picture Type JPEG: Fine, Normal (Exif 2.3 [Exif Print] compliant) / Design of the apparatus (2.0) file, RAW: RAW, sRAW1, sRAW2 (14bit, Canon original RAW 2nd edition), Digital Print Order Format [ DPOF] Version 1.1 compliant RAW + JPEG simultaneous recording Yes, any combination of RAW + JPEG possible separate formats to separate cards possible Image Size JPEG: (L) 5760 x 3840 (H) 3840 x 2560 (S1) 2880 x 1920 (S2) 1920 x 1280 (S 3) 720 x 480 RAW (RAW) 5760 x 3840 (M-RAW) 3960 x 2640 (S-RAW) 2880 x 1920 Type of film MOV (Video: H.264 Intra frame / inter frame, Sound: Linear PCM) 8bit uncompressed via HDMI 4.2.2 Video Size 1920 x 1080 (29.97, 25, 23.976 fps) within or between 1280 x 720 (59.94, 50 fps) frame within or between 640 x 480 (59.94, 50 fps) Chassis Video Length Max duration 29min 59sec, Max 4GB single file Records New folders can be manually created and selected File No. (1) Consecutive numbering (2) Auto reset (3) Manual reset Custom Functions 13 Custom Functions with 47 settings Metadata tag copyright information of the user (can be set in camera) Image rating (0-5 stars) LCD / panel lighting Yes / Yes Water / dust resistance Yes (equal to EOS-1N) ¹ Voice Memo No Intelligent Orientation sensor Yes I am Playback Zoom 1.5x - 10x Display Formats (1) Single image with information (2 levels) (2) Single image (3) 4 image index (4) 9 image index (5) enlarged view (6) 2 image comparison of display (7) Film edit Slideshow Image selection: All images, by date, by folder, movies, Stills, Rating Playback time: 1/2/3/5/10 or 20 seconds Repeat: On / Off Histogram Brightness: Yes RGB: Yes Highlight alert Yes I am Image Erase / Protection Delete: single image, all images in the folder selected, unprotected images images Protection: Erase protection of one image at a time Menu categories (1) Shooting menu (x4) (2) Menu AF (x5) (3) of the playback menu (x3) (4) of the setup menu (x4) (5) of the Custom Function menu (x4) (6 ) My Menu Menu Languages 25 languages ​​English, German, French, Dutch, Danish,   Portuguese, Finnish, Italian, Norwegian, Swedish, Spanish, Greek,   Russian, Polish, Czech, Hungarian, Romanian, Ukrainian, Turkish, Arabic,   Thai, Simplified Chinese, Traditional Chinese, Korean and Japanese Firmware Update Update possible by the user.",
    "videosize": "1920 x 1080 (29.97, 25, 23.976 fps) within or between 1280 x 720 (59.94, 50 fps) frame within or between 640 x 480 (59.94, 50 fps) Chassis",
    "speed": "30-1 / 8000 sec (1/2 or 1/3 increments of) + bulb (range Available shutter speeds vary depending on shooting mode)",
    "manualfocus": "Selected on lens, default in Live View mode",
    "imageprocessing": "Highlight tone priority Auto Lighting Optimizer (4 settings) noise reduction for long exposures Noise Reduction High ISO (4 settings) Auto Correction of lens peripheral illumination correction of chromatic aberration distortion correction Resize to M1 , M2 or S RAW image processing - playing the single image multiple exposure HDR images 5 presets",
    "category": "camera",
    "sensorcleaning": "EOS Integrated Cleaning System",
    "type": "Electronic viewfinder with image sensor",
    "aspectratio": "3: 2",
    "afsystempoints": "/ 4 point cross-type 61/41 f AF points inc 5 dual cross type f / 2.8 The number of cross-type AF points varies depending on the lens.",
    "imagesize": "JPEG: (L) 5760 x 3840 (H) 3840 x 2560 (S1) 2880 x 1920 (S2) 1920 x 1280 (S 3) 720 x 480 RAW (RAW) 5760 x 3840 (M-RAW) 3960 x 2640 (S-RAW) 2880 x 1920",
    "afworkingrange": "EV -2 to 18 (23 ° C to ISO 100)",
    "formatcompatibility": "35mm Film / Full-Frame Digital Sensor Canon (APS-C)",
    "drivemodes": "Single, Continuous L, Continuous H, Self timer (2s + remote, 10s + remote), silent single shooting, continuous shooting silent",
    "displayoptions": "Grid overlay (x3), histogram, the aspect ratios, dual axis electronic level",
    "flashexposurecompensation": "+/- 3EV to half or one-third increments",
    "menucategories": "(1) Shooting menu (x4) (2) Menu AF (x5) (3) of the playback menu (x3) (4) of the setup menu (x4) (5) of the Custom Function menu (x4) (6 ) My Menu",
    "afilluminator": "Applied by an optional dedicated Speedlite",
    "aelock": "Auto :. In One Shot AF mode with evaluative metering when focus is achieved Manual: By AE lock button in creative zone modes.",
    "autofocus": "Yes I am",
    "externalflashcontrol": "Via the menu screen of the camera",
    "bracketing": "+/- 3 levels in single increments 3 bracketed images per shutter release. bias selectable: blue / amber or magenta / green.",
    "displayformats": "(1) Single image with information (2 levels) (2) Single image (3) 4 image index (4) 9 image index (5) enlarged view (6) 2 image comparison of display (7) Film edit",
    "postageandpackaging": "Each additional itemToServiceDelivery*",
    "totalpixels": "Approx. 23.4 megapixels",
    "focallength": "24 - 105mm comparable APS-C 1.6x focal length: 38.4 to 168 mm",
    "imagestabilizer": "Yes I am",
    "attr999": "Column 2£3.99United KingdomExpress Delivery (Other 24 Hour Courier)Column 5Estimated by Tue. 14 Oct.Column 6",
    "slideshow": "Image selection: All images, by date, by folder, movies, Stills, Rating Playback time: 1/2/3/5/10 or 20 seconds Repeat: On / Off",
    "histogram": "Brightness: Yes RGB: Yes",
    "eyerelief": "Approx. 21mm (from eyepiece lens center)",
    "highlightalert": "Yes I am",
    "groups": "18/13",
    "intelligentorientationsensor": "Yes I am",
    "focusing": "Fixed (Transmissive LCD screen)",
    "xsync": "1 / 200sec (EX series Speedlites only)",
    "metadatatag": "copyright information of the user (can be set in camera) Image rating (0-5 stars)",
    "imageeraseprotection": "Delete: single image, all images in the folder selected, unprotected images images Protection: Erase protection of one image at a time",
    "rawjpegsimultaneousrecording": "Yes, any combination of RAW + JPEG possible separate formats to separate cards possible",
    "viewfinderinformation": "AF information: AF points, focus confirmation¹, AF status indicator Exposure information: Shutter speed, aperture, ISO (always displayed), AE lock, exposure level, exposure warning information flash: ready, flash exposure compensation, high-speed sync, FE lock, red-eye reduction light Image information: Highlight tone priority (D +), maximum burst (2 digit display) map of information, check the battery information composition grid, electronic level, warning symbol appears if any of these conditions shall be: Monochrome, white balance correction, switch recording quality one button, the ISO speed range or spot metering",
    "settings": "Auto, Daylight, Shade, Cloudy, Tungsten, White Fluorescent light, Flash, Custom, adjustable color temperature. White balance compensation: 1. : Blue / amber +/- 9 2 Magenta / Green +/- 9.",
    "afmodes": "AI Focus One Shot AI Servo of",
    "magnification": "Approx. 0.71x¹",
    "framerate": "30 fps",
    "playbackzoom": "1.5x - 10x",
    "whitebalance": "Yes, 1 setting can be registered",
    "lowpassfilter": "Integrated / fixed with fluorine coating",
    "colourfiltertype": "Primary colors",
    "aeb": "2, 3, 5 or 7 shots +/- 3 EV increments third or half stop",
    "iso": "Auto (100-12800) 100-25600 (in 1/3 stop increments or integers) can be extended to ISO L: 50, H1: 51200, H2 102400",
    "aflock": "Locked when shutter button is pressed half way in One Shot AF mode or AF-ON button is pressed.",
    "firmwareupdate": "Update possible by the user.",
    "menulanguages": "25 languages ​​English, German, French, Dutch, Danish,   Portuguese, Finnish, Italian, Norwegian, Swedish, Spanish, Greek,   Russian, Polish, Czech, Hungarian, Romanian, Ukrainian, Turkish, Arabic,   Thai, Simplified Chinese, Traditional Chinese, Korean and Japanese",
    "picturestyles": "Auto, Standard, Portrait, Landscape, Neutral, Faithful, Monochrome, User Defined (x3)",
    "freepp": "Column 2FreeUnited KingdomEconomy Delivery (Royal Mail 48)Column 5Estimated between Wed. 15 Oct.  and Thu. 16 Oct.Column 6",
    "waterdustresistance": "Yes (equal to EOS-1N) ¹"
}