{
    "flashguidenumber": "13",
    "megapixels": "18.0",
    "flashtype": "In-Built",
    "flashsyncspeed": "1/200 sec",
    "displaytype": "LCD",
    "isomax": "12800",
    "screenresolution": "1040000",
    "size": "133.1 x 99.8 x 78.8 mm",
    "category": "camera",
    "shutterspeedslow": "30 sec",
    "autofocuspoints": "9",
    "lensforsd": "Body only",
    "sensorsize": "22.3 x 14.9 mm",
    "liveview": "Yes",
    "framespersecond": "5",
    "batterymodel": "LP-E8",
    "isomin": "100",
    "batterygrip": "BG-E8",
    "flashmetering": "Auto, Manual flash, Integrated Speedlite Transmitter",
    "autofocussystem": "TTL-CT-SIR with a dedicated CMOS sensor",
    "brand": "Canon",
    "sensortype": "CMOS",
    "connectivity": "Hi-Speed USB, Video output (PAL/ NTSC) (integrated with USB terminal), HDMI mini output (HDMI-CEC compatible), External microphone (3.5mm Stereo mini jack)",
    "meteringsystem": "TTL full aperture metering with 63-zone SPC",
    "screensize": "3\"",
    "aspectratio": "3:2",
    "fileformats": "JPEG, RAW, MOV",
    "weightg": "580",
    "screensizeinches": "3.0",
    "imagestabilisation": "No",
    "lensmount": "EF/EF-S",
    "hdmoviemode": "1080p",
    "cameratype": "Digital SLR",
    "exposuremodes": "Program AE, Shutter priority AE, Aperture priority AE, Manual, and 11 Scene Modes",
    "displaysize": "3\"",
    "shopcategoriesshophomecanoncashbackitemscrumplerexdemofujifilmlowepromanfrottonikonolympuspentaxsonytamractamronusedusedvelbonother": "The Canon EOS 700D Digital SLR Camera Body brings the power and ease-of-use straight to your fingertips and in a lightweight body thatâ\u0080\u0099s exceptionally portable, yet solid in the hands. The Canon EOS 700D holds onto the same level of specification as its predecessor (EOS 650D) with the addition of a few physical enhancements â\u0080\u0093 an improved outer body finish, a 360 degree mode dial and the ability to preview Creative Filters in real-time when using Live View mode. The Canon 700D keeps the versatile features that made the 650D so popular and responsive, such as the intuitive 3.0â\u0080\u009d vari-angle LCD touch screen, an 18MP APS-C Hybrid CMOS sensor, a DIGIC 5 processor, 9-point AF system and the ability to record full HD 1080p (30p) movies, with stereo sound. More features include a built-in flash, SD card slot, continuous shooting at 5fps, an optical viewfinder with 95% coverage and an ISO range of 100-12800 (extendable to 25600). The key features of the Canon EOS 700D Digital Camera Create detailed, low-noise 18 megapixel images that can be printed at high resolution and cropped without losing quality Capture Full-HD movies with creative control and Hybrid CMOS AF that focuses continuously as you shoot Explore new shooting angles and control the camera with a 7.7cm Vari-angle Clear View LCD II Touch screen Get shooting quickly and easily with Scene Intelligent Auto, and expand your horizons with Creative shooting modes Shoot low-noise images in poor light using ISO 100-12800 sensitivity (extends to ISO 25600) Follow fast action with 9 cross-type AF points and 5 fps shooting Tackle difficult lighting conditions with HDR Backlight Control and Handheld Night Scene modes Lens compatibility: As this camera features a cropped APS-C sensor you can use both Canonâ\u0080\u0099s EF-S and EF lenses. The Canon EOS 700D will also take Sigmaâ\u0080\u0099s DC/DG and Tamronâ\u0080\u0099s Di/Di II lenses. Superb image quality Capture every detail with an 18-megapixel Hybrid CMOS AF sensor. The EOS 700D produces low-noise images that can be printed at large sizes or cropped for alternative compositions. Produce Full HD movie projects Shoot video at 1080p resolution, enjoying the right level of automatic or manual control for you. Hybrid AF technology enables continuous focusing when shooting video, and the EOS 700D supports near-silent Movie Servo AF with compatible STM lenses. Record stereo sound with a built-in or external microphone. Keep up with fast moving action Track moving subjects even if they move across the scene with an autofocus system comprising 9 cross-type AF points. Continuous shooting at 5 fps for bursts of up to 22 shots means youâ\u0080\u0099ll never miss that decisive moment. Explore new angles Compose photos and movies from new and interesting angles using the EOS 700Dâ\u0080\u0099s Vari-angle 7.7cm (3.0â\u0080\u009d) 3:2 ratio Clear View LCD II Touch screen. Shoot over the top of crowds, or go for a dramatic ground-level viewpoint. Touch-screen control The EOS 700D is easy to use from the moment you first pick it up. Shoot and focus with a single tap of the cameraâ\u0080\u0099s touch screen, and use pinch and swipe gestures to navigate when reviewing images. Scene Intelligent Auto Shoot great pictures easily. Canonâ\u0080\u0099s Scene Intelligent Auto mode analyses the scene and selects the most appropriate cameras settings automatically. Taking your next creative steps Choose from and preview a range of Creative filter effects, including Grainy Black & White, Toy Camera and Miniature effect. Theme-based scene modes automatically pick the right settings for the subject being photographed, while Creative Auto mode offers more control over factors like background blur, via an intuitive interface. Take complete control When youâ\u0080\u0099re ready to advance your photography choose to Aperture Priority, Shutter Priority or Manual mode for complete control over your images. Low-light performance Take great pictures even in low light, shooting without flash to capture the true ambience of an occasion. The EOS 700D features an ISO sensitivity range of ISO 100-12800 (extendable to ISO 25600). Great results in difficult conditions HDR Backlight Control mode captures three different exposures and combines them into one, retaining shadow and highlight detail. The EOS 700Dâ\u0080\u0099s Hand Held Night Scene mode captures multiple images at fast shutter speeds and blends them together for a blur-free result. Explore with the EOS System Take your photography further with an extensive range of lenses, accessories and flashes that make up the EOS System. Megapixels 18.0 Sensor type CMOS Sensor size 22.3 x 14.9 mm Resolution 5184 x 3456 Autofocus points 9 Autofocus system TTL-CT-SIR with a dedicated CMOS sensor Lens mount EF/EF-S Frames per second 5 ISO min 100 ISO max 12800 Weight (g) 580 Size 133.1 x 99.8 x 78.8 mm Aspect ratio 3:2 Battery model LP-E8 Battery grip BG-E8 File formats JPEG, RAW, MOV Shutter speed fast 1/4000 sec Shutter speed slow 30 sec HD Movie mode 1080p Screen size (inches) 3.0 Screen resolution 1040000 Live view Yes VF coverage 95% Metering system TTL full aperture metering with 63-zone SPC Exposure modes Program AE, Shutter priority AE, Aperture priority AE, Manual, and 11 Scene Modes Flash type In-Built Flash guide number 13 Flash metering Auto, Manual flash, Integrated Speedlite Transmitter Flash sync speed 1/200 sec Connectivity Hi-Speed USB, Video output (PAL/ NTSC) (integrated with USB terminal), HDMI mini output (HDMI-CEC compatible), External microphone (3.5mm Stereo mini jack) Image stabilisation No Optional flashgun Canon Speedlites (90EX, 220EX, 270EX, 270EX II, 320EX, 420EX, 430EX, 430EX II, 550EX, 580EX, 580EX II, 600EX, 600EX-RT, Macro-Ring-Lite, MR-14EX, Macro Twin Lite MT-24EX, Speedlite Transmitter ST-E2, Speedlite Transmitter ST-E3-RT) Other optional accessories Remote Switch RS-60E3, Remote Controller RC-6 Vertical grip BG-E8 IF YOU WOULD LIKE ANY MORE INFORMATION ABOUT THIS ITEM, OR ANY OF OUR OTHER ITEMS IN OUR EBAY STORE,  PLEASE CALL OUR CARDIFF STORE ON 02920 394182 NEWPORT STORE ON: TEL: 01633 262738. SAME DAY DISPATCH ON ALL ORDERS PLACED BEFORE 2PM **RETURNS** UNDER THE DISTANCE SELLERS ACT YOU ARE ENTITLED TO CANCEL AND RETURN YOUR ORDER LESS THE COST OF POSTAGE THAT IT HAS COST US TO POST THE ITEM TO YOU. THIS ONLY COVERS YOU FOR BUY IT NOW ITEMS NOT AUCTION STYLE PURCHASES. IF FOR ANY REASON YOU WISH TO RETURN ANY ITEM THAT YOU BUY FROM CAMERA CENTRE UK THEN PLEASE INCLUDE A COPY OF YOUR ORIGINAL RECEIPT AND A COVER NOTE EXPLAINING THE REASON FOR THE RETURN. THIS WILL INSURE THAT YOUR REQUEST IS PROCESSED QUICKLY AND EFFICIENTLY WITHOUT DELAY. RETURNS MUST BE WITHIN 7 DAYS OF RECEIVING YOUR ITEM. THE MAXIMUM RETURNS POSTAGE WE WILL PAY IS Â£7.90 FOR UK .PLEASE DO NOT SEND THE ITEM BACK SPECIAL DELIVERY AS WE WILL ONLY COVER UP TO THIS MUCH. IF THE ITEM IS AN UNWANTED ITEM, A REFUND LESS THE POSTAGE COST THAT WE HAVE INCURED TO SEND THE ITEM TO YOU WILL BE GIVEN. IF THE ITEM IS A DAMAGED ITEM THEN A FULL REFUND WILL BE GIVEN + YOUR POSTAGE COSTS TO A MAX OF Â£6.99 FOR UK AND Â£14.99 INTERNATIONAL. A RECEIPT MUST BE INCLUDED IN RETURNING PARCELS. WE ENDEVOUR TO SORT ANY ISSUES OUT AS SOON AS THEY ARISE, BUT IN SOME CASES THERE MAY BE A SMALL DELAY. **POSTAGE** IN SOME CASES POSTAGE MAY BE A LITTLE MORE TO SOME AREAS OF THE WORLD. IF YOU ARE UNSURE OF THE COST TO YOUR AREA PLEASE FEEL FREE TO EMAIL AND ASK AND WE WILL GET BACK TO YOU AS SOON AS POSSIBLE. THIS WILL INSURE THAT YOUR ORDER IS PROCESSED THANK YOU FOR LOOKING ** PLEASE NOTE ** WE DO NOT DELIVER TO SOUTH AMERICA, AFRICA OR SOUTHERN ASIA. IF YOU ARE UNSURE PLEASE ASK. ** Please Note ** All item that are returned to us in perfect unopened and unused condition will receive a full refund. Any item that has been opened or used will incur a 10% restocking/repackaging fee. This includes software packs, neck straps etc.. We are unable to accept returns of consumables that have been opened, this includes batteries,memory cards etc.. Russian Customers We are only able to ship to business addresses in Russia. If you do not supply us with a business address then we will not be able to send your items to you. Further note Minimum delivery charge to Russia is Â£29.99 FINANCE AVAILABLE ON ALL NEW PRODUCTS OVER Â£300 PLEASE CALL US ON 01633 262738 OR 02920 394182 FOR DETAILS",
    "vfcoverage": "95%",
    "sensorresolution": "18.0 MP",
    "maxvideoresolution": "1920 x 1080",
    "supportedflashmemory": "SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "model": "700D / Rebel T5i",
    "resolution": "5184 x 3456",
    "shutterspeedfast": "1/4000 sec"
}