{
    "usablelenses": "AF NIKKOR for F3AF not Supported  AF-S, AF-I: All Functions Supported  AI-P NIKKOR: All Functions Supported Except Autofocus and 3D Color Matrix Metering II  Electronic Rangefinder can be used if Maximum Aperture is f/5.6 or Faster  IX NIKKOR Lenses Cannot be Used  Non-CPU: Autofocus not supported. Can be used in mode M, but exposure meter does not function.  Other AF NIKKOR: All Functions Supported Except autofocus and 3D Color Matrix Metering II  Type G or D AF NIKKOR: All Functions Supported Except Autofocus  Type D PC NIKKOR: All Functions Supported Except Autofocus and some Shooting Modes",
    "meteringrange": "0 to 20 EV (Matrix or center-weighted metering at ISO 100 equivalent, f/1.4 lens, at 20°C/68°F)  2 to 20 EV (Spot metering at ISO 100 equivalent, f/1.4 lens at 20°C/68°F)",
    "accessoryshoe": "Yes",
    "weight": "1.0 lb / 0.45 kg; Lens: 9.35 oz (265 g)",
    "color": "Red",
    "framerate": "@ 1920 x 1080: 30 fps, 25 fps, 24 fps @ 1280 x 720: 60 fps, 50 fps @ 640 x 424: 30 fps, 25 fps",
    "shutterspeeds": "1/4000 to 30 sec.",
    "exposurecompensation": "±5 EV in increments of 1/3EV",
    "effectivepixels": "24.2 million",
    "lenstype": "Zoom Lens",
    "afareamode": "Face-priority AF  Wide-area AF  Normal-area AF  Subject-tracking AF",
    "syncspeed": "Up to 1/200 sec.",
    "batterytype": "EN-EL14a Rechargeable Li-ion Battery",
    "category": "camera",
    "videorecordingsystem": "Yes, NTSC/PAL",
    "dimensions": "5.0 x 3.8 x 3.1\" / 12.70 x 9.65 x 7.87 cm; Lens: Approx. 2.87 x 3.13\" (7.29 x 7.95 cm)",
    "lensfiltersize": "52 mm",
    "selftimer": "2, 5, 10, 20 sec. Timer duration electronically controlled",
    "maximumaperture": "f/3.5 - 5.6",
    "totalpixels": "24.7 million",
    "flashcontrol": "TTL: i-TTL flash control using 420-pixel RGB sensor is available with built-in flash and SB-910, SB-900, SB-800, SB-700, SB-600, or SB-400; i-TTL balanced fill-flash for digital SLR is used with matrix and center-weighted",
    "autofocus": "Nikon Multi-CAM 1000 autofocus sensor module with TTL phase detection",
    "minimumaperture": "f/22",
    "afpoints": "11",
    "audiorecording": "With Video, Mono, Via Optional External Mic",
    "dots": "921,000",
    "focusingscreen": "Type B BriteView Clear Matte Mark VII screen",
    "continuousshootingspeed": "4 frames per second",
    "focusmodes": "Auto AF-S/AF-C selection (AF-A)  Continuous-servo (AF-C)  Face-Priority AF available in Live View only and D-Movie only  Full-time Servo (AF-A) available in Live View only  Manual (M) with electronic rangefinder  Normal area available in Live View and D-Movie only  Predictive focus tracking activated automatically according to subject status  Single-servo AF (AF-S)  Wide area available in Live View and D-Movie only",
    "meteringsystem": "TTL exposure metering using 420-pixel RGB sensor",
    "elementsgroups": "11/8",
    "viewfinder": "Eye-level Pentamirror Single-Lens Reflex viewfinder",
    "isospeed": "ISO 100 - 6400 Hi-1 (ISO 12,800)",
    "remotecontrol": "ML-L3 (Optional)",
    "aspectratio": "3:2",
    "shuttertype": "Electronically controlled vertical-travel focal-plane",
    "cameratype": "Single-lens reflex digital camera",
    "flashmodes": "Front-curtain sync (normal)  Rear-curtain sync  Red-Eye reduction  Red-Eye reduction with slow sync  Slow sync",
    "imagesensor": "CMOS; 23.2mm x 15.4mm",
    "megapixels": "24.2 MP",
    "exposuremodes": "Aperture-Priority Auto (A)  Auto  Auto (flash off)  Manual (M)  Programmed Auto with flexible Program (P)  Shutter-Priority Auto (S)",
    "acadapter": "EH-5b AC Adapter; requires EP-5A Power Connector (available separately)",
    "angleofviewdiagonal": "76° - 28°",
    "videocliplength": "20 min.",
    "maxresolution": "24MP: 6016 x 4000 @ 3:2",
    "displaytype": "Wide Viewing Angle TFT-LCD",
    "whitebalance": "Auto  Cloudy  Direct Sunlight  Flash  Fluorescent (7 types)  Incandescent  Preset Manual  Shade",
    "mounttype": "Nikon F bayonet mount",
    "screensize": "3.0 in. diagonal"
}