{
    "selftimerdelay": "2sec., 10sec.",
    "fullframeburstshooting": "High speed continuous shooting at up to 5 frames per second (fps) is made       possible by the BIONZ® processor and 24 megapixel sensor.",
    "threecontrollensrings": "Full manual operation is intuitive on the RX1. Users can keep their eyes on       the subject and concentrate on the composition while comfortably adjusting       the dedicated aperture, focusing, and macro switching rings.",
    "recordshdvideo": "Yes",
    "effectivepixels": "24.3 Megapixels",
    "lcdscreensizeinches": "3",
    "imagestabilization": "Yes",
    "powersource": "Lithium-ion battery pack",
    "category": "camera",
    "facedetectionregistrationtechnology": "The camera can automatically detect and register up to eight individual faces       and adjust focus, exposure, white balance and flash to help deliver crisp,       properly lit images of family and friends. Can prioritize children or adults",
    "redeyereduction": "No",
    "selftimer": "Yes",
    "convenientlyplaceddials": "Quick access to conveniently placed exposure compensation and focus mode dials.",
    "recordsvideo": "Yes",
    "type": "Point and Shoot",
    "capturejpegfilesrawfilesorboth": "The DSC-RX1 saves pictures as compact JPEG files and/or ultra-high quality       RAW files. RAW files save images prior to de-mosaicing, white balance, sharpness       and color enhancement. This retains maximum latitude for enhancing the image       on your PC.",
    "heightinches": "2.63",
    "autohdrmode": "Captures more scene dynamic range than a single exposure can handle—and more       range than photo film. Combines the best highlight detail from one shot, the       best mid-tones from a second and the best shadow detail from a third for one       incredible shot (up to 6 EV stops), all in a split second. (Recommended for       still subjects.)",
    "focallength": "[Still image 3:2] f=35mm [Still image 16:9] f=37mm [Movie 16:9] f=44mm (SteadyShot On), f=37mm (SteadyShot off)",
    "sweeppanoramamode": "Capture expansive landscapes automatically. Press the shutter, sweep vertically       or horizontally. The camera does the rest, continuously shooting images and       stitching them together.",
    "depthinches": "2.75",
    "focusmodes": "Multi point AF (25 points) / Center weighted AF / Flexible spot AF / Flexible spot AF (tracking focus) / Flexible spot AF (face tracking)",
    "brightf20carlzeisssonnartlens": "Newly developed large-diameter F2.0 Carl Zeiss® Sonnar T* lens delivers refined       background defocusing – bokeh, and macro capabilities. A premium multi-layered       T* coating also dramatically reduces ghost and flare caused by light reflection",
    "storagemedia": "MS Duo and SD/SDHC/SDXC Compatible",
    "shutterspeed": "Program Auto (30 - 1/4000*)/ Aperture Priority (30 - 1/4000*)/ Shutter Priority (30 - 1/4000*)/ Manual (Bulb, 30 - 1/4000*)(*Maximum speed at F5.6 or greater aperture value. Maximum speed at F2.0 is 1/2000 sec.)",
    "widthinches": "4.5",
    "creativestylesettings": "Control how the camera processes your images with 15 finishing styles: Standard,       Vivid, Neutral, Clear, Deep, Light, Twilight, Night View, Autumn Leaves, B&W,       Sepia, Sunset, Portrait and Landscape. You can even fine-tune contrast, saturation3       , and sharpness to your personal taste.",
    "highspeedautofocus": "Focus fast with high speed AF. To improve focusing speed and sensitivity,       the Exmor® CMOS sensor uses its rapid throughput to deliver high-quality image       signals to the camera’s BIONZ® processor, which provides intelligent response       data to a new high speed actuator motor in the lens. The result is fast, DSLR-like       focusing speeds even in low light.",
    "amazinglowlightperformance": "Experience incredible low-light shooting without a flash. The camera captures       six images in a fraction of a second. Combining the data from all six, it       creates a single image with a reduction in noise equivalent to two additional       steps of ISO sensitivity. Sensitivity selectable up to ISO 25600. (Recommended       for still subjects.)",
    "attr243mp35mmfullframesensor": "A whole new world of high-quality images are realized through the 24.3 MP       effective 35 mm full-frame sensor, a normal sensor range of ISO 100 – 25600,       and a sophisticated balance of high resolving power, gradation and low noise.       The BIONZ® image processor enables up to 5 fps high-speed continuous shooting       and 14-bit RAW image data recording.",
    "builtinflash": "Yes",
    "wifi": "No",
    "digitalzoom": "4x",
    "pictureeffectmode": "Realize your creative potential with Picture Effect, a fun and simple way       to convert ordinary landscapes and portraits come to life by heightening mood       and emphasizing certain attributes. Effects are Soft Focus, Posterization,       Retro Photo, High Contrast Monochrome, Rich-tone Monochrome, Miniature, Soft       High-key, Toy Camera, Pop Color, Partial Color, Watercolor Painting, HDR Painting,       and Illustration.",
    "builtinpopupflash": "Enjoy the convenience of flash photography everywhere you go. Guide number       is approximately 6*. Choose from Auto, Slow Sync, Rear Sync, Fill-flash and       Flash Off modes.",
    "whitebalance": "Auto/Daylight/Shade/Cloudy/Incandescent/Fluor (Warm White)/Fluor (Cool White)/Fluor (Day White)/Fluor (Daylight)/Flash/C. Temp./Filter/Custom",
    "lcdtype": "Xtra Fine"
}