{
    "meteringrange": "EV 0-20 (at 73°F/23°C with EF 50mm f/1.4 USM lens, ISO   100) * AE lock possible. * The active metering time can be changed.",
    "isospeedrange": "ISO 100 - 6400 (in 1/3-stop or whole-stop   increments) - ISO 12800 can be enabled with a Custom Function. - With   [Highlight tone priority], the ISO speed range will be automatically set   within 200-6400. 1. In Creative Zone modes, the maximum settable ISO speed   (400-6400) will vary within the automatic ISO speed range. 2. If   overexposure would occur with fill flash, ISO 100 will be the lowest   set. 3. In the (P) and Basic Zone modes (except Night Portrait), bounce   flash will be set automatically within ISO 400-1600 (or maximum ISO speed   limit).",
    "shutterspeeds": "1/8000 to 1/60 sec., X-sync at 1/250 sec. 1/8000 to   30 sec., bulb (Total shutter speed range. Available range varies by shooting   mode)",
    "exposurecompensation": "Manual",
    "colorfiltersystem": "RGB primary color filters",
    "magnifiedview": "By 5x or 10x at AF point position",
    "afworkingrange": "EV 0-20 (at 73°F/23°C with EF 50mm f/1.4 USM lens, ISO   100)",
    "drivemodes": "Single, high-speed continuous, low-speed continuous, 10-sec.   self-timer/ remote control, or 2-sec. self-timer/remote control",
    "flashexposurecompensation": "±3 stops in 1/3- or 1/2-stop increments",
    "batterycheck": "Auto",
    "externalflashsettings": "Flash function settings, Flash C.Fn settings",
    "dpof": "Version 1.1 compatible",
    "recyclingtime": "Approx. 3 sec.",
    "picturestyle": "Standard, Portrait, Landscape, Neutral, Faithful,   Monochrome, User Def. 1-3",
    "compatibleprinters": "PictBridge-compatible printers",
    "rawjpegsimultaneousrecording": "Provided (sRAW+JPEG also possible)",
    "flashreadyindicator": "Flash-ready icon lights in viewfinder",
    "compatiblelenses": "Canon EF lenses (including EF-S   lenses) (35mm-equivalent focal length is approx. 1.6x the lens focal   length)",
    "afpointselection": "Automatic selection, manual selection",
    "settings": "Auto, Daylight, Shade, Cloudy, Tungsten Light, White Fluorescent   Light, Flash, Custom, Color Temperature setting",
    "shutter": "Vertical-travel, mechanical, focal-plane shutter with all   speeds electronically-controlled 1/8000 to 1/60 sec., X-sync at 1/250   sec. 1/8000 to 30 sec., bulb (Total shutter speed range. Available range   varies by shooting mode) Soft-touch electromagnetic release 10-sec. or 2-sec.   delay (self-timer/remote control) For Remote Switch RS-60E3",
    "griddisplay": "Provided (Two-type grid displays)",
    "weight": "26.6 oz (CIPA) 23.8 oz (body only)",
    "effectivepixels": "Approx. 18.0 Megapixels",
    "mirror": "Quick-return half mirror (transmission",
    "category": "camera",
    "felock": "Provided",
    "afassistbeam": "Small series of flashes fired by built-in   flash Effective range",
    "colortemperatureinformationtransmission": "Provided",
    "selftimer": "10-sec. or 2-sec. delay (self-timer/remote control)",
    "aelock": "1. Auto AE lock - In the One-Shot AF mode with evaluative   metering, AE lock takes effect when focus is achieved. 2. Manual AE lock -   With AE lock button. (AE lock is updated each time you press the button.)   Enabled in all metering modes.",
    "backuprecording": "N/A",
    "brightnesscontrol": "7 levels provided",
    "mymenuregistration": "Up to six top-tier menu options and Custom Function   settings can be registered",
    "protection": "Erase protection can be applied/canceled for a single image,   all images in a folder, or all images in the card",
    "highlightalert": "With single-image display (Info.) and single-image   display, overexposed highlight areas will blink",
    "datetimebattery": "Built-in secondary battery When fully-charged, the   date/time can be maintained for about three months.",
    "lensmount": "Canon EF mount",
    "remotecontrol": "For Remote Switch RS-60E3",
    "pcterminal": "None",
    "label69": "Manual focus - Magnify the image by 5x or 10x and focus manually.",
    "shootingmodes": "(1) Live View shooting (2) Remote Live View shooting   (with a personal computer installed with EOS Utility)",
    "colortemperaturecompensation": "White balance correction",
    "flashcoverage": "Up to 17mm focal length (equivalent to approx. 28mm in 135   format)",
    "camerausersettings": "Register under Mode Dial's setting",
    "powersaving": "Provided. Power turns off after 1, 2, 4, 8, 15 or 30 min.",
    "interfacelanguages": "25 (English, German, French, Dutch, Danish,   Portuguese, Finnish, Italian, Norwegian, Swedish, Spanish, Greek, Russian,   Polish, Czech, Hungarian, Romanian, Ukraine, Turkish, Arabic, Thai,   Simplified/Traditional Chinese, Korean, Japanese)",
    "battery": "One Battery Pack LP-E6 AC power can be supplied via AC Adapter   Kit ACK-E6 With Battery Grip BG-E9 attached, two battery packs (LP-E6) can   be used. Six AA-size batteries can be used.",
    "dioptricadjustmentcorrection": "-3.0 to +1.0m-1 (diopter)",
    "compatibleimages": "Direct image transfer with the camera has been   abolished since the personal computers' OS-based support has become adequate   for image transfers.",
    "recordingmedia": "SD/SDHC/SDXC card, via external media (USB v.2.0 hard   drive, or via Wireless LAN (Eye-Fi card*)) *Canon cameras are not   guaranteed to support Eye-Fi card functions, including wireless transfer. In   case of an issue with the Eye-Fi card, please consult with the card   manufacturer. The use of Eye-Fi cards may not be approved in all regions, or   from one region to another, please contact the card manufacturer for status of   approval in the country/region of use.",
    "depthoffieldpreview": "Enabled with depth-of-field preview button",
    "customfunctions": "Total 20",
    "exposurecontrolsystems": "Program AE (Shiftable), Shutter-priority AE   (Safety shift possible), Aperture-priority AE (Safety shift possible), Manual   exposure, Bulb, Full Auto, Flash Off, Creative Auto, Programmed Image Control   modes (Portrait, Landscape, Close-up, Sports, Night Portrait), E-TTL II   Autoflash Program AE (Evaluative metering, Averaged metering)",
    "silentshooting": "Provided (Mode 1 and Mode 2)",
    "magnification": "Approx. 0.95x (-1m-1 with 50mm lens at infinity) / 27.0°   angle of view",
    "recordingformat": "Design rule for Camera File System 2.0 and Exif 2.3",
    "filesize": "1. Large/Fine",
    "type": "TFT color, liquid-crystal monitor",
    "totalpixels": "Approx. 19.0 Megapixels",
    "filenumbering": "Consecutive numbering, auto reset, manual reset.",
    "focusingscreen": "Interchangeable (Ef-D",
    "eyepoint": "Approx. 22mm (At -1m-1 from eyepiece lens center)",
    "shutterrelease": "Soft-touch electromagnetic release",
    "imageformat": "0.88 x 0.59 in. / 22.3 x 14.9mm (APS-C size)",
    "focusing": "Autofocus (One-Shot AF) 1. Live mode - One-point, contrast   AF. Switching to another AF point possible. 2. Face Detection Live mode -   Face Detection, Contrast AF. Face selectable. 3. Quick mode - Nine-point,   phase-difference AF, same as normal shooting.",
    "dustdeletionfeature": "1. Self Cleaning Sensor Unit 2. Dust Delete   Data appended to the captured image 3. Manual cleaning of sensor",
    "afpoints": "9 (Cross-type, Center AF point with dual cross sensor for   f/2.8)",
    "colorspace": "sRGB, Adobe RGB",
    "guidenumber": "43/13 (ISO 100, in feet/meters)",
    "erase": "Erase single image, erase selected images, erase all images on   folder, erase all images in a card, or erase only unprotected images",
    "focusingmodes": "Autofocus, One-Shot AF, Predictive AI Servo AF, AI Focus   AF, Manual focusing (MF)",
    "autowhitebalance": "Auto white balance with the image sensor",
    "selectedafpointdisplay": "Superimposed in viewfinder and indicated on LCD   panel",
    "startuptime": "Approx. 0.1 sec. (Based on CIPA testing standards)",
    "meteringmodes": "Real-time Evaluative metering with the image sensor",
    "dimensionswxhxd": "approx. 5.69\" x 4.17\" x 3.09\"",
    "flashmetering": "E-TTL II autoflash",
    "printableimages": "JPEG images compliant to Design rule for Camera File   System 2.0 and Exif 2.3 (DPOF printing possible) and RAW images captured with   the EOS 60D * Video footage cannot be printed.",
    "monitorsize": "Wide 3.0-inch (Screen aspect ratio of 3",
    "continuousshootingspeed": "High-speed",
    "coverage": "Approx. 100% Viewing angle",
    "aspectratio": "3",
    "lowpassfilter": "Fixed position in front of the CMOS sensor",
    "easyprintfeature": "Provided",
    "viewfinderinformation": "AF information (AF points and focus confirmation   light), Exposure information (Shutter speed, aperture, ISO speed (always   displayed), AE lock, exposure level, Spot metering circle, exposure warning),   Flash information (Flash ready, flash exposure compensation, high-speed sync,   FE lock, red-eye reduction light), Image information (Highlight tone priority   (D+), Monochrome shooting, maximum burst (2-digit display), white balance   correction, card information), Electronic level (Horizontal only), Battery   check",
    "displayformat": "Single image display (Two types of single-image full   display and two types of shooting information display), Index display (4-image   index and 9-image index), Jump display (1/10/100 images, shooting date, by   folder, video, stills, rating), AF point display, Histogram (1. Brightness 2.   RGB), Magnify zoom display (1.5x to 10x enabled in 15 steps), Rotated display   (Manual, Auto) Slide Show (Image selection",
    "zoomingtomatchfocallength": "Provided",
    "maximumburst": "JPEG (Large/Fine)"
}