{
    "exposurebracketing": "2 – 9 frames, in steps of 1/3, 1/2, 2/3, or 1 EV, 2–5 frames in steps of 2 or 3 EV",
    "isosensitivity": "ISO 100 – 12800 in steps of 1/3 or 1/2 EV. Can also be set to approx. 0.3, 0.5, 0.7 or 1 EV (ISO 50 equivalent) below ISO 100 or to approx. 0.3, 0.5, 0.7, 1 or 2 EV (ISO 51200 equivalent) above ISO 12800; auto ISO sensitivity control available",
    "exposurecompensation": "Can be adjusted by –5 – +5EV, in steps of 1/3 or 1/2 EV, in P, S, A, M, SCENE, and night vision modes",
    "reflexmirror": "Quick-return type",
    "monitor": "8 cm (3.2–in.) diagonal. Low-temperature polysilicon tilting TFT LCD with approx. 170° viewing angle, approx. 100% frame coverage, and brightness and angle adjustment. Approx. 1229k-dot (VGA; 640 x RGBW x 480 = 1,228,800 dots)",
    "totalpixels": "24.93 million",
    "diopteradjustment": "–3 – +1 m-1",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (single-servo AF) or by pressing AE-L/AF-L button",
    "detectionrange": "–3 – +19 EV (ISO 100, 20 °C/68 °F)",
    "adlbracketing": "2 frames using selected value for one frame or 3–5 frames using preset values for all frames",
    "wifiwirelesslancommunicationsprotocols": "IEEE 802.11b: DSSS/CCK IEEE 802.11g: OFDM",
    "flashreadyindicator": "Lights when built-in flash or optional flash unit is fully charged; blinks after flash is fired at full output",
    "compatiblelenses": "Compatible with AF NIKKOR lenses, including type G, E, and D lenses (some restrictions apply to PC lenses) and DX lenses (using DX 24 x 16 1.5x image area), AI-P NIKKOR lenses, and non-CPU AI lenses (A and M modes only). IX NIKKOR lenses, lenses for the F3AF, and non-AI lenses can not be used. The electronic rangefinder can be used with lenses that have a maximum aperture of f/5.6 or faster (the electronic rangefinder supports the 11 focus points with lenses that have a maximum aperture of f/8 or faster).",
    "liveviewmodes": "Live view photography (still images), Movie live view (movies)",
    "mode": "Auto modes (auto; auto (flash off)); scene modes (portrait; landscape; child; sports; close up; night portrait; night landscape; party/indoor; beach/snow; sunset; dusk/dawn; pet portrait; candlelight; blossom; autumn colours; food); special effects modes (night vision; colour sketch; miniature effect; selective colour; silhouette; high key; low key); programmed auto with flexible program (P); shutter-priority auto (S); aperture-priority auto (A); manual (M); U1 (user settings 1); U2 (user settings 2)",
    "movieaudiorecordingformat": "Linear PCM",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "accessoryshoe": "ISO 518 hot-shoe with sync and data contacts and safety lock",
    "weight": "Approx. 840 g (1 lb 13.7 oz), with battery and memory card but without body cap; approx. 750 g (1 lb 10.5 oz; camera body only)",
    "effectivepixels": "24.3 million",
    "suppliedaccessories": "Rubber Eyecup DK-21, Body Cap BF-1B, Rechargeable Li-ion Battery EN-EL15 with terminal cover, Battery Charger MH-25a (comes with either an AC wall adapter or power cable of a type and shape that varies with the country or region of sale), Eyepiece Cap DK-5, USB Cable UC-E17, Strap AN-DC14, ViewNX 2 installer",
    "category": "camera",
    "batterypack": "Optional MB-D16 multi-power battery pack with one Nikon EN-EL15 rechargeable Li-ion battery or six AA alkaline, Ni-MH or lithium batteries",
    "wifiwirelesslanstandards": "IEEE 802.11b, IEEE 802.11g",
    "movieframesizepixelsandframerate": "1920 x 1080; 60 p (progressive), 50 p, 30 p, 25 p, 24 p. 1280 x 720; 60 p, 50 p. Actual frame rates for 60 p, 50 p, 30 p, 25 p and 24 p are 59.94, 50, 29.97, 25 and 23.976 fps respectively; options support both high and normal image quality",
    "selftimer": "2 s, 5 s, 10 s, 20 s; 1–9 exposures at intervals of 0.5, 1, 2, or 3 s",
    "flashcontrol": "TTL: i-TTL flash control using RGB sensor with approximately 91K (91,000) pixels is available with built-in flash; i-TTL balanced fill-flash for digital SLR is used with matrix, center-weighted, and highlight-weighted metering, standard i-TTL flash for digital SLR with spot metering",
    "tripodsocket": "1/4–in. (ISO 1222)",
    "effectiveangleofview": "Nikon FX format",
    "wifiwirelesslandataratesactualmeasuredvalues": "54 Mbps. Maximum logical data rates according to IEEE standard. Actual rates may differ.",
    "lensmount": "Nikon F mount (with AF coupling and AF contacts)",
    "shutterspeed": "1/4000 – 30 s in steps of 1/3 or 1/2 EV, bulb, time, X200",
    "usb": "Hi-Speed USB; connection to built-in USB port is recommended",
    "flashbracketing": "2 – 9 frames in steps of 1/3, 1/2, 2/3 or 1 EV. 2–5 frames in steps of 2 or 3 EV",
    "flashmodes": "Auto, auto with red-eye reduction, auto slow sync, auto slow sync with red-eye reduction, fill-flash, red-eye reduction, slow sync, slow sync with red-eye reduction, rear-curtain with slow sync, rear-curtain sync, off; Auto FP High-Speed Sync supported",
    "builtinflash": "Auto, portrait, child, close up, night portrait, party/indoor, pet portrait, colour sketch: Auto flash with auto pop-up P, S, A, M, food: Manual pop-up with button release",
    "imagesensor": "35.9 x 24.0 mm CMOS",
    "lensaperture": "Instant return, electronically controlled",
    "battery": "One EN-EL15 rechargeable Li-ion battery",
    "depthoffieldpreview": "Yes. Pressing Pv button stops lens aperture down to value selected by user (A and M modes) or by camera (other modes)",
    "afareamode": "Single-point AF; 9-, 21-, or 51-point dynamic-area AF, 3D-tracking, group-area AF, auto-area AF",
    "wifiwirelesslanaccessprotocols": "Infrastructure",
    "wifiwirelesslanrangelineofsight": "Approximately 30 m/98 ft (assumes no interference; range may vary with signal strength and presence or absence of obstacles)",
    "magnification": "Approx. 0.7x (50 mm f/1.4 lens at infinity, –1.0 m-1)",
    "meteringmethod": "Matrix: 3D colour matrix metering III (type G, E, and D lenses); colour matrix metering III (other CPU lenses); colour matrix metering available with non-CPU lenses if user provides lens data. Center-weighted: Weight of approximately 75% given to 12 mm circle in center of frame. Diameter of circle can be changed to 8, 15, or 20 mm, or weighting can be based on average of entire frame (non-CPU lenses use 12-mm circle). Spot: Meters 4 mm circle (about 1.5% of frame) centered on selected focus point (on center focus point when non-CPU lens is used). Highlight-weighted: Available with type G, E, and D lenses; equivalent to center-weighted when other lenses are used.",
    "dustreductionsystem": "Image sensor cleaning, Image Dust Off reference data (Capture NX-D software required)",
    "movieaudiorecordingdevice": "Built-in or external stereo microphone; sensitivity adjustable",
    "media": "SD, SDHC (UHS-I compliant), SDXC (UHS-I compliant)",
    "releasemode": "S (single frame), CL (continuous low speed), CH (continuous high speed), Q (quiet shutter-release), Self-timer, MUP (mirror up), Qc (quiet continuous shutter-release)",
    "liveviewafareamode": "Face-priority AF, Wide-area AF, Normal-area AF, Subject-tracking AF",
    "remotereleasemodes": "Delayed remote, quick-response remote, remote mirror-up (ML-L3)",
    "frameadvancerate": "Approx. 6 fps, 1–6 fps (CL), 6.5 fps (CH) or 3 fps (Qc)",
    "focusingscreen": "Type B BriteView Clear Matte Mark III screen with AF area brackets (framing grid can be displayed)",
    "whitebalancebracketing": "2–3 frames in steps of 1, 2 or 3",
    "operatingenvironmenthumidity": "85% or less (no condensation)",
    "supportedlanguages": "Arabic, Bengali, Bulgarian, Chinese (Simplified and Traditional), Czech, Danish, Dutch, English, Finnish, French, German, Greek, Hindi, Hungarian, Indonesian, Italian, Japanese, Korean, Marathi, Norwegian, Persian, Polish, Portuguese (Portugal and Brazil), Romanian, Russian, Serbian, Spanish, Swedish, Tamil, Telugu, Thai, Turkish, Ukrainian, Vietnamese",
    "audiooutput": "Stereo mini-pin jack (3.5 mm diameter)",
    "shuttertype": "Electronically-controlled vertical-travel focal-plane shutter",
    "storagefileformats": "NEF (RAW): 12 or 14 bit, lossless compressed or compressed. JPEG: JPEG-Baseline compliant with fine (approx. 1 : 4), normal (approx. 1 : 8), or basic (approx. 1 : 16) compression (Size priority); Optimal quality compression available. NEF (RAW) + JPEG: Single photograph recorded in both NEF (RAW) and JPEG formats",
    "type": "Single-lens reflex digital camera",
    "nikoncreativelightingsystem": "Nikon CLS supported; commander mode option available",
    "guidenumber": "Approx. 12/39, 12/39 with manual flash (m/ft, ISO 100, 20 °C/68 °F)",
    "moviefileformat": "MOV",
    "liveviewlensservo": "Autofocus (AF): Single-servo AF (AF-S); full-time servo AF (AF-F). Manual focus (M)",
    "viewfinder": "Eye-level pentaprism single-lens reflex viewfinder",
    "exposuremetercoupling": "CPU, AI",
    "liveviewautofocus": "Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected)",
    "flashsyncspeed": "X=1/200 s; synchronizes with shutter at 1/250 s or slower (flash range drops at speeds between 1/200 and 1/250 s)",
    "operatingenvironmenttemperature": "0 °C – 40 °C (+32 °F – 104 °F)",
    "moviemeteringmethod": "Matrix, center-weighted, or highlight-weighted",
    "hdmioutput": "Type C HDMI connector",
    "focuspoints": "Can be selected from 51 or 11 focus points",
    "wifiwirelesslanoperatingfrequency": "2412–2462 MHz (channels 1–11)",
    "wifiwirelesslansecurity": "Authentication: Open system, WPA2-PSK. Encryption: AES",
    "movievideocompression": "H.264/MPEG-4 Advanced Video Coding",
    "syncterminal": "AS-15 sync terminal adapter (available separately)",
    "playback": "Full-frame and thumbnail (4, 9 or 72 images or calendar) playback with playback zoom, movie playback, photo and/or movie slide shows, histogram display, highlights, photo information, location data display, and auto image rotation",
    "dimensionswxhxd": "Approx. 140.5 x 113 x 78 mm (5.6 x 4.5 x 3.1 in.)",
    "autofocus": "Nikon Advanced Multi-CAM 3500 II autofocus sensor module with TTL phase detection, fine-tuning, 51 focus points (including 15 cross-type sensors; f/8 supported by 11 sensors), and AF-assist illuminator (range approx. 0.5–3 m/1 ft 8 in.–9 ft 10 in.)",
    "lensservo": "Autofocus (AF): Single-servo AF (AF-S), Continuous-servo AF (AF-C), Auto AF-S/AF-C selection (AF-A); predictive focus tracking activated automatically according to subject status. Manual focus (M): Electronic rangefinder can be used",
    "audioinput": "Stereo mini-pin jack (3.5 mm diameter; plug-in power supported)",
    "flashcompensation": "-3 – +1 EV in steps of 1/3 or 1/2 EV",
    "picturecontrolsystem": "Standard, Neutral, Vivid, Monochrome, Portrait, Landscape, Flat; selected Picture Control can be modified; storage for custom Picture Controls",
    "imagesizepixels": "FX (36x24) image area: (L) 6016 x 4016, (M) 4512 x 3008, (S) 3008 x 2008. 1.2x (30x20) image area: (L) 5008 x 3336, (M) 3752 x 2504, (S) 2504 x 1664. DX (24x16) image area: (L) 3936 x 2624, (M) 2944 x 1968, (S) 1968 x 1312. FX-format photographs taken in movie live view: (L) 6016 x 3376, (M) 4512 x 2528, (S) 3008 x 1688. DX-format photographs taken in movie live view: (L) 3936 x 2224, (M) 2944 x 1664, (S) 1968 x 1112. Note: Photographs taken in movie live view have an aspect ratio of 16 : 9. The camera offers a choice of DX- and FX-based formats.",
    "activedlighting": "Auto, Extra high, High, Normal, Low, Off",
    "moviemetering": "TTL exposure metering using main image sensor",
    "eyepoint": "21 mm (–1.0 m-1; from center surface of viewfinder eyepiece lens)",
    "acadapter": "EH-5b AC adapter; requires EP-5B power connector (available separately)",
    "filesystem": "DCF 2.0, DPOF, Exif 2.3, PictBridge",
    "exposuremetering": "TTL exposure metering using RGB sensor with approximately 91K (91,000) pixels",
    "framecoverage": "FX (36x24): Approx. 100% horizontal and 100% vertical. 1.2x (30x20): Approx. 97% horizontal and 97% vertical. DX (24x16): Approx. 97% horizontal and 97% vertical",
    "whitebalance": "Auto (2 types), incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual (up to 6 values can be stored, spot white balance measurement available during live view), choose colour temperature (2500 K–10000 K), all with fine-tuning"
}