{
    "usablelenses": "KAF3, KAF2 (power zoom compatible), KAF, KA mount lens",
    "meteringrange": "EV-3 to 20 (ISO100 at 50mm F1.4)",
    "features": "Playback View: Single frame, multi-image display (6,12, 20, 35, 80 segmentation), display magnification (up to 16, 100% display and quick magnification available), rotating, histogram (Y histogram, RGB histogram), bright rea warning, Auto Image Roation, detailed inf, Copyright Information (Photographyer, Copyright holder), Folder Display, Calendar Filmstrip Display, Slide Show USER Mode: Up to 3 settings can be saved Custom Functions: 27 items Mode Memory: 11 items Custom Button: RAW/Fx Button (One Push File Format, Exposure Bracketing, Optical Preview, Digital Preview, Shake Redction,LCD Panel Illumination, AF button (Enable AF, Cancel AF) Various settings for the action of the e-dials in each exposure mode can also be saved Text Size: Standard, Large World Time: World Time settings for 75 cities (28 time zones) AF fine Adjustment: ±10 step, Uniform adjustment, Individual adjustment (up to 20 can be saved) Copyright Information: Names of \"Photographer\" and \"Copyright Holder\" are embedded to the image file. Revision history can be checked using the provided software.",
    "weight": "Approx. 800g (Including dedicated battery and 1x SD Memory Card), Approx. 715g (body only)",
    "sensitivity": "ISO AUTO/100 to 51200 (EV steps can be set to 1EV, 1/2EV, or 1/3EV)",
    "fieldofview": "Approx. 100%",
    "metering": "TTL open aperture metering using 86K pixel RGB sensor, Multi-segment, center-weighted and spot metering",
    "height": "100mm",
    "exposurecompensation": "-2.0 to + 1.0EV",
    "effectivepixels": "Approx. 23.35 megapixels",
    "still": "JPEG: L(24M: 6016x4000) M(14M:4608x3072) S(6M:3072x2048) XS(2M:1920x1280), RAW: L(24M:6016x4000)",
    "speed": "1/8000 to 30 sec., Manual: 1/8000 to 30 sec. (1/3EV steps or 1/2EV steps), Bulb",
    "size": "23.5 x 15.6 (mm)",
    "category": "camera",
    "sensorcleaning": "Image sensor cleaning using ultrasonic vibrations \"DR II\", Dust Alert function",
    "functions": "Focus Sensor: SAFOX 11, 27 point (25 cross type focus points in the center) Brightness Range: EV-3 to 18 (ISO 100 / at normal temperature) AF mode: Single AF (AF.S), Continuous AF (AF.C), Auto select AF (AF.A) Customization on focus settings possible. AF Point Selection: Spot, Select, Expanded Area (S, M, L), Zone select, Auto (27 AF points)",
    "width": "131.5mm",
    "movie": "Full HD(1920x1080, 60i/50i/30p/25p/24p) HD (1280x720, 60p/50p/30p/25p/24p)",
    "digitalfilter": "Base Parameter Adj, Extract Color, Toy Camera, Retro, High Contrast, Shading, Invert Color, Unicolor Bold, Bold Monochrome, Tone Expansion, Sketch, Water Color, Pastel, Posterization, Miniature, Soft, Starburst, Fish-eye, Slim",
    "compensation": "Type TTL: phase-matching autofocus±5EV (1/2EV steps or 1/3EV steps can be selected)",
    "filename": "\"IMGP****\" or User assingned file name File name numbering: Sequential, Reset",
    "source": "Battery Type: Rechargeable Lithium-ion Battery D-LI90P AC Adapter: AC Adapter Kit K-AC132 (Optional)",
    "magnification": "Approx. 0.95x (50mmF1.4 at infinity)",
    "playback": "Brightness, Saturation and Colors adjustable",
    "totalpixels": "Approx. 24.71 megapixels",
    "angleofviewcoverage": "equivalent to angle of view of 28mm lens (35mm format equivalent)",
    "performance": "Battery Life: Number of recordable images: (with 50% flash usage): approx. 560 images, (without flash usage): approx: 720 images Playback time: Approx. 370 minutes * With a fully-recharged Rechargeable Lithium-ion Battery. Tested in compliance with CIPA standard. Actual results may vary depending on the shooting condition.",
    "type": "Built-in P-TTL flash with pop-up, GN: approx. 13 (ISO100/m)",
    "autoexposurelock": "Button type (timer type: two times the meter operating time set in Custom Setting); Continuous as long as the shutter button is halfway pressed",
    "afassist": "Dedicated LED AF assist light",
    "focusingscreen": "Interchangeable Natural-Bright-Matte III focusing screen",
    "fileformat": "RAW (PEF/DNG), JPEG (Exif 2.30), DCF2.0 compliant Recorded Pixels JPEG: L(24M: 6016x4000) M(14M:4608x3072) S(6M:3072x2048) XS(2M:1920x1280), RAW: L(24M:6016x4000) Quality Level RAW (14bit): PEF, DNG, JPEG:*(Best),**(Better),***(Good), RAW + JPEG simultaneous capturing available Color Space: sRGB, AdobeRGB",
    "xsynchronization": "Sync Speed 1/180 sec.",
    "external": "Storage Medium: SD, SDHC and SDXC Memory Card (Conforms to USH-1 standards), Eye-Fi card, FLU card Dual SD slot: Sequential Use, Save to Both, Separate RAW/JPG, Image copy between slots possible",
    "diopteradjustment": "Approx. -2.5m to + 1.5m-1",
    "interface": "Connection Port: USB3.0 (micro B), external power supply terminal, external release controller terminal, X-synch socket, HDMI output terminal (Type D), stereo miscrophone input terminal, Headphone terminal USB Connection: MSC/PTP",
    "optional": "Lithium-Ion battery D-LI90 Battery Charger kit K-BC90E AC Adapter K-AC132E Weather resistant grip D-BG5 SLR case SLR backpack Weatherproof remote control O-RC1 Cable switch CS-205 Ring fl ash AF 160FC Flash AF 200FG Flash AF 360FGZ II Flash AF 540FGZ II O-ICK1 sensor cleaning kit O-GPS1 GPS unit",
    "shakereduction": "Sensor-shift shake reduction (SR: Shake Reduction) ; Approx. 3.5EV…TBD",
    "modes": "Drive modes: Mode Selection: Still Image : Single frame, Continuous (H, M, L), Self-timer (12s, 2s), Remote Control (immediately, 3 sec., continuous), Exposure Bracketing (2, 3 or 5 frames/ Possible to use with Self-timer or Remote Control ), Mirror-up (Possible to use with Remote Control), Interval shooting, Inteval Composite Movie : Remote Control, Interval Movie Record Continuous Shooting: Max. approx. 8.3 fps, JPEG ( L: xxx at Continuous H): up to approx. 60 frames, RAW: up to approx. 23 frames Multi-Exposure: Composite Mode(Additive/Average/Bright), Number of Shots(2 to 2000 images) Interval Shooting: Still Image / Interval : 2s. to 24h., Number of shots : 2 : 2000 images, Start Interval : Now/Set Time Movie / Recorded size:4K/FullHD/HD Interval:2s. to 1h., Recording time:14s.to 99h., Start Interval:Now/Set Time Capture Setting: Custom Image: Bright, Natural, Portrait, Landscape, Vibrant, Radiant, Muted, Bleach Bypass, Reversal Film, Monochrome, Cross Processing Cross Processing: Randum, Preset 1-3, Favorite 1-3 Noise Reduction: Slow Shutter Speed NR, High-ISO NR Dynamic Range compensation: Highlight Correction, Shadow Correction Lens Correction: Distortion Correction, Lateral Chromatic Aberration Correction, Peripheral Illumin. Corr. Digital Filter: Extract Color, Toy Camera, Retro, High Contrast, Shading, Invert Color, Unicolor Bold, Bold Monochrome HDR: Auto, HDR1, HDR2, HDR3, Exposure Bracket Value adjustable, Automatic composition correction function Horizon Correction: SR On: correction up to 1 degrees, SR Off: correction up to 2 degrees Composition Adjustment: Adjustment range of ±1.5mm up, down, left or light (1mm when rotated); rotating range of 1 dehree Electronic Level: Displayed in viewfinder and LCD panel (horizontal direction only); displayed on LCD monitor (horizontal direction and vertical direction)",
    "language": "Depends on market",
    "cameratype": "TTL autofocus, auto-exposure SLR digital-still camera with built-in retractable P-TTL flash",
    "mount": "PENTAX KAF2 bayonet mount (AF coupler, lens information contacts, K-mount with power contacts)",
    "exposuremodes": "Green mode, Program, Sensitivity Priority, Shutter Priority, Aperture Priority, Shutter & Aperture Priority, Manual, Bulb, Flash X-sync Speed, USER1, USER2, USER3",
    "whitebalance": "Type: Method using a combination of the CMOS image sensor and the light source detection sensor AUTO WB, Multi Auto WB, Daylight, Shade, Cloudy, Fluorescent Light (D:Daylight Color, N:Daylight White, W:Cool White, L:Warm White), Tungsten Light, Flash, CTE, Manual WB (up to 3 settings), Color Temperature Configuration (up to 3 settings), Copying the white balance setting of a captured image Fine Adjustment: Adjustable ±7 steps on A-B axis or G-M axis Largest magnification: Approx. 0,1X with focus mode Macro, Focal Length 4.3mm, Focusing distance 0.03m",
    "recording": "File Format: MPEG-4 AVC/H.264 (MOV) Motion JPEG(AVI) for Interval Movie Record Recorded Pixels: Full HD(1920x1080, 60i/50i/30p/25p/24p) HD (1280x720, 60p/50p/30p/25p/24p) Sound: Built-in monaural microphone, external microphone (Streo recording compatible) Recording Sound Level adjustable Recording Time: Up to 25 minutes; automatically stops recording if the internal temperature of the camera becomes high. Custom Images: Bright, Natural, Portrait, Landscape, Vibrant, Radiant, Muted, Bleach Bypass, Reversal Film, Monochrome, Cross Processing Cross Processing: Randum, Preset 1-3, Favorite 1-3 Digital Filter: Extract Color, Toy Camera, Retro, High Contrast, Shading, Invert Color, Unicolor Bold, Bold Monochrome HDR: *availble only for Inteval Movie Auto, HDR1, HDR2, HDR3, Exposure Bracket Value adjustable",
    "kitcontent": "Rechargeable Lithium-ion Battery D-LI90 Battery Charger D-BC90 AC plug cord Strap O-ST132 ME Viewfi nder Cap Software (CD-ROM) S-SW140 Eyecup Fs Hot shoe cover FK Body mount cover Battery Grip terminal cover Sync sock 2p cap",
    "depth": "77.5mm",
    "resolution": "Approx. 1037K dots",
    "options": "Playback View: Single frame, multi-image display (6,12, 20, 35, 80 segmentation), display magnification (up to 16, 100% display and quick magnification available), rotating, histogram (Y histogram, RGB histogram), bright rea warning, Auto Image Roation, detailed inf, Copyright Information (Photographyer, Copyright holder), Folder Display, Calendar Filmstrip Display, Slide Show Delete: Delete single image, delete all, select & delete, delete folder, delete instant review image RAW Development: RAW file select :Select Single Image, Select Multiple Images, Select a folder RAW Development Parameter: File Format (JPEG/TIFF), Aspect ratio, JPEG recorded pixels, JPEG Quality, Color Space, Distortion Correction, Lateral Chromatic Aberration Correction, Peripheral Illumin. Corr. Color Fringe Correction, Digital filter, HDR, White Balance, Custom Image, Sensitivity, High-ISO NR, Shadow Correction, GPS(Latitude, Longitude, Altitude, Time) Edit: Color Moiré Correction, Resize, Cropping (Aspect ratio and Slant adjustment available), Index, Movie Edit (Divide or delete selected frames), Capturing a JPEG still picture from a movie, Saving RAW data in buffer memory, Image Copy, Eye-Fi Image Transfer"
}