{
    "focuspoint": "Can be selected from 51 or 11 focus points",
    "accessoryshoe": "ISO 518 hot-shoe with sync and data contacts and safety lock",
    "nikoncreativelightingsystemcls": "Advanced Wireless Lighting supported with SB-910, SB-900, SB-800, or SB-700 as a master flash, and SB-600 or SB-R200 as remotes, or SU-800 as commander; Auto FP High-Speed Sync and modeling illumination supported with all CLS-compatible flash units except SB-400 and SB-300; Flash Color Information Communication and FV lock supported with all CLS-compatible flash units",
    "exposurebracketing": "2 to 9 frames in steps of 1/3, 1/2, 2/3, or 1 EV (2 to 5 frames in steps of 2 or 3 EV)",
    "weight": "Approx. 1350 g (2 lb. 15.6 oz.) with battery and XQD memory card but without body cap and accessory shoe cover; approx. 1180 g / 2 lb. 9.6 oz. (camera body only)",
    "battery": "One rechargeable Li-ion EN-EL18a battery",
    "liveviewautofocus": "Contrast-detect AF anywhere in frame (camera selects focus point automat ically when face-priority AF or subject-tracking AF is selected)",
    "flashsyncspeed": "X=1/250sec., synchronizes with shutter at 1/250 s or slower",
    "frameadvancerate": "Up to 10 fps (CL) or 10–11 fps (CH)",
    "movieaudiorecordingformat": "Linear PCM",
    "exposurecompensation": "–5 to +5 EV in steps of 1/3, 1/2, or 1 EV",
    "flashmode": "Front curtain sync, slow sync, rear-curtain sync, red-eye reduction, red-eye reduction with slow sync, slow rearcurtain sync, off, Auto FP High-Speed Sync supported",
    "depthoffieldpreview": "Yes, Pressing Pv button stops lens aperture down to value selected by user (A an d M modes) or by camera (P and S modes)",
    "releasemodes": "S (single frame), CL (continuous low speed), CH (continuous high speed), Q (quiet shutter-release), Self-timer, MUP (mirror up)",
    "viewfinder": "Eye-level pentaprism single-lens reflex viewfinder",
    "activedlighting": "Can be selected from Auto, Extra high +2/+1, High, Normal, Low, or Off",
    "liveviewafareamode": "Face-priority AF, Wide-area AF, Normal-area AF, Subject-tracking AF",
    "suppliedaccessories": "BF-1B body cap, BS-2 accessory shoe cover, EN-EL18a rechargeable Li-ion battery with terminal cover, MH-26a battery charger with power cable and two contact protectors (shape of power cable depends on country of sale), USB cable clip, HDMI cable clip, UF-2 connector cover for stereo mini plug cable, UC-E15 USB cable, ViewNX 2 installer CD, AN-DC11 strap",
    "category": "camera",
    "selftimer": "2 s, 5 s, 10 s, 20 s; 1–9 exposures at intervals of 0.5, 1, 2, or 3 s",
    "whitebalance": "Auto (2 types), incandescent, fluorescent (7 types), direct sunlight, flash, clo udy, shade, preset manual (up to 6 values can be stored, spot white balance measurement available during live view), choose color temperature (2500 K– 10000 K), all with fine-tuning.",
    "usb": "Hi-Speed USB",
    "exposuremetercoupling": "CPU, AI",
    "liveviewlensservo": "- Autofocus (AF): Single-servo AF (AF-S); full-time servo AF (AF-F) - Manual focus (M)",
    "isosensitivityrecommendedexposureindex": "100 to 25600 in steps of 1/3, 1/2, or 1 EV. Can also be set to approx. 0.3, 0.5, 0.7, or 1 EV (ISO 50 equivalent) below ISO 100 or to approx. 0.3, 0.5, 0.7, 1, 2, 3, or 4 EV (ISO 409600 equivalent) above ISO 25600; auto ISO sensitivity control available",
    "moviemetering": "TTL exposure metering using main image sensor",
    "peripheralconnector": "For WT-5",
    "movieframesizepixelsandframerate": "- 1920 x 1080; 60 p (progressive), 50 p, 30 p, 25 p, 24 p - 1920 x 1080 crop; 30 p, 25 p, 24 p - 1280 x 720; 60 p, 50 p - 640 x 424; 30 p, 25 p Actual frame rates for 60 p, 50 p, 30 p, 25 p, and 24 p are 59.94, 50, 29.97, 25, and 23.976 fps respectively; all options support both high and normal image quality",
    "movievideocompression": "H.264/MPEG-4 Advanced Video Coding",
    "syncterminal": "ISO 519 sync terminal with locking thread",
    "magnification": "Approx.0.70x, (50 mm f/1.4 lens at infinity, -1.0 m-1)",
    "playback": "Full-frame and thumbnail (4, 9, or 72 images) playback with playback zoom, movie playback, photo and/or movie slide shows, histogram display, highlights, photo information, location data display, auto image rotation, voice memo input and playback, and IPTC information embedding and display",
    "totalpixels": "16.6 million (approx.)",
    "dimensionswxhxd": "Approx. 160 x 156.5 x 90.5 mm ( 6.3 x 6.2 x 3.6 in.)",
    "autofocus": "Nikon Advanced Multi-CAM 3500FX autofocus sensor module with TTL phas e detection, fine-tuning, and 51 focus points (including 15 cross-type senso rs; f/8 supported by 11 sensors)",
    "hdmioutput": "Type C mini-pin HDMI connector",
    "type": "Single-lens reflex digital camera",
    "lensservo": "Autofocus (AF), Single-servo AF (AF-S), Continuous-servo AF (AF-C), Manual focus (MF)",
    "dustreductionsystem": "Image sensor cleaning, Image Dust Off reference data (optional Capture NX 2 software required)",
    "movieaudiorecordingdevice": "Built-in monaural or external stereo microphone; sensitivity adjustable",
    "storagefileformat": "NEF (RAW): 12 or 14 bit, lossless compressed, compressed, or uncompressed; small size available (12-bit uncompressed only), TIFF (RGB), JPEG: JPEG-Baseline compliant with fine (approx. 1 : 4), normal (approx. 1 : 8), or basic (approx. 1 : 16) compression (Size priority); Optimal quality compression available, NEF (RAW)+JPEG: Single photograph recorded in both NEF (RAW) and JPEG formats",
    "supportedlanguages": "Arabic, Chinese (Simplified and Traditional), Czech, Danish, Dutch, English, Finnish, French, German, Indonesian, Italian, Japanese, Korean, Norwegian, Polish, Portuguese (Portugal and Brazil), Romanian, Russian, Spanish, Swedish, Thai, Turkish, Ukrainian",
    "flashcompensation": "-3 to +1 EV in increments of 1/3, 1/2 or 1 EV",
    "picturecontrolsystem": "Standard, Neutral, Vivid, Monochrome, Portrait, Landscape, ;selected Picture Control can be modified; storage for custom Picture Controls",
    "tripodsocket": "1/4 in. (ISO 1222)",
    "imagesizepixels": "(L) 4928 x 3280, (M) 3696 x 2456, (S) 2464 x 1640, DX, (L) 3200 x 2128, (M) 2400 x 1592, (S) 1600 x 1064, 5 : 4, (L) 4096 x 3280, (M) 3072 x 2456, (S) 2048 x 1640, 1.2x, (L) 4096 x 2720, (M) 3072 x 2040, (S) 2048 x 1360",
    "moviefileformat": "MOV",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (single-servo AF) or by pressing the center of the sub-selector",
    "detectionrange": "–2 – +19 EV (ISO 100, 20 °C/68 °F)",
    "otheroptions": "Index marking, time-lapse photography",
    "focusingscreen": "Type B BriteView Clear Matte Mark VIII screen with AF area brackets (framing grid can be displayed)",
    "adlbracketing": "2 to 9 exposures in increments of 1, 2 or 3 EV",
    "diopteradjustment": "-3 to +1 m⁻¹",
    "acadapter": "EH-6b AC adapter; requires EP-6 power connector (available separately)",
    "storagemedia": "CompactFlash (CF) (Type I, compliant with UDMA 7), XQD Type Memory",
    "lensmount": "Nikon F mount",
    "operatingenvironmenthumidity": "85% or less (no condensation)",
    "shutterspeed": "1/8,000 to 30 s. in steps of 1/3, 1/2 or 1 EV, bulb, time, X250",
    "rangeiso100f14lens20c68f": "Matrix or center-weighted metering: –1 to 20 EV - Spot metering: 2–20 EV",
    "monitor": "8-cm (3.2-in.) diagonal. 921k-Dots. TFT LCD with 170 ° viewing angle, approximately 100% frame coverage, manual monitor brightness control, and automatic monitor brightness control usi ng ambient brightness sensor",
    "audiooutput": "Stereo mini-pin jack (3.5-mm diameter)",
    "eyepoint": "18 mm, (–1.0 m–1; from center surface of viewfinder eyepiece lens)",
    "shuttertype": "Electronically-controlled vertical-travel focal-plane shutter",
    "flashbracketing": "2 to 9 frames in steps of 1/3, 1/2, 2/3 or 1 EV, 2 to 5 frames in steps of 2 or 3 EV",
    "compatiblelenses": "AF NIKKOR lenses, including type G, E, and D lenses (some restrictions apply to PC lenses) and DX lenses (using DX 24 X 16 1.5X image area), AI-P NIKK OR lenses, and non-CPU AI lenses (exposure modes A and M only). IX NIKKOR lenses, lenses for the F3AF, and non-AI lenses can not be used.",
    "operatingenvironmenttemperature": "0 °C–40 °C (+32 °F–104 °F)",
    "meteringmethod": "Matrix: 3D color matrix metering III (type G, E, and D lenses); color matrix metering III (other CPU lenses); color matrix metering available with non-CPU lenses if user provides lens data. Center-weighted: Weight of 75% given to 12 mm circle in center of frame. Diameter of circle can be changed to 8, 15, or 20 mm, or weighting can be based on average of entire frame (non-CPU lenses use 12-mm circle). Spot: Meters 4 mm circle (about 1.5% of frame) centered on selected focus point (on center focus point when non-CPU lens is used)",
    "liveviewmodes": "Live View Photography, Movie Live View Mode",
    "afareamode": "Single-point AF, 9-, 21-, or 51- point dynamic-area AF, 3D-tracking, group area AF, auto-area AF",
    "flashreadyindicator": "Lights when optional flash unit is fully charged; flashes after flash is fired at full output",
    "movieisosensitivity": "In exposure modes P, S, and A, auto ISO sensitivity control (ISO 200 to Hi 4) with selectable upper limit. In exposure mode M, auto ISO sensitivity control (ISO 200 to Hi 4) available with selectable upper limit; manual selection (ISO 200 to 25600 in steps of 1/3, 1/2, or 1 EV) with additional options available equivalent to approximately 0.3, 0.5, 0.7, 1, 2, 3, or 4 EV (ISO 409600 equivalent) above ISO 25600.",
    "audioinput": "Stereo mini-pin jack (3.5-mm diameter; plug-in power supported)",
    "mode": "Programmed auto with flexible program (P); shutter-priority auto (S); aperture-priority auto (A); manual (M)",
    "effectivepixels": "16.2 million",
    "filesystem": "DCF 2.0, DPOF, Exif 2.3, PictBridge",
    "lensaperture": "Instant return, electronically controlled",
    "ethernet": "RJ-45 connector. Standards: IEEE 802.3ab (1000BASE-T)/IEEE 802.3u (100BASE-TX)/IEEE 802.3 (10BASE-T). Data rates: 10/100/1000 Mbps with auto detect (maximum logical data rates according to IEEE standard; actual rates may differ). Port: 1000BASE-T/100BASE-TX/10BASE-T (AUTO-MDIX)",
    "exposuremetering": "TTL exposure metering using RGB sensor with approximately 91K (91,000) pixels",
    "framecoverage": "FX (36X24): Approx. 100% horizontal and 100% vertical, 1.2X (30X20): Approx. 97% horizontal and 97% vertical, DX (24X16): Approx. 97% horizontal and 97% vertical, 5:4 (30X24): Approx. 97% horizontal and 100% vertical",
    "imagesensor": "36.0 mm x 23.9 mm CMOS (FX format)",
    "flashcontrol": "TTL: i-TTL flash control using RGB sensor with approximately 91K (91,000) pixels is available with SB-910, SB-900, SB-800, SB-700, SB-600, SB-400, or SB-300; i-TTL balanced fill-flash for digital SLR is used with matrix and center-weighting metering, standard i-TTL flash for digital SLR with spot metering"
}