{
    "category": "camera",
    "publisher": "Olympus",
    "shareaddtowishlist": "» Home » Electronics » Camera & Photo » Digital Cameras Point & Shoot Digital Cameras Exclusive Olympus STYLUS-7040 14 MP Digital Camera with 7x Wide Angle Dual Image Stabilised Zoom and 7.6cm LCD- Blue By OLYMPUS http://www.fishpond.co.uk/Electronics/Exclusive-Olympus-STYLUS-7040-14-MP-Digital-Camera-with-7x-Wide-Angle-Dual-Image-Stabilised-Zoom-and-76cm-LCD-Blue-By-OLYMPUS/0710069211810 By Olympus Free Shipping Worldwide This item is unavailable. Email Me We will email you if this item comes back into stock. Rating: 1 2 3 4 5 Register or sign-in to rate and get recommendations. Other Information: MGDSTYLUS-7040-BLU Technical Details: Brand Name: Olympus Model: MGDSTYLUS-7040-BLU Optical zoom: 6 Viewfinder Type: optical viewfinder Product Description: When searching for quality that offers unquestionable values as well as a best deal, you surely reached this goal by selecting Olympus STYLUS-7040 14 MP Digital Camera with 7x Wide Angle Dual Image Stabilised Zoom and 3.0 inch LCD- Blue!! Fully loaded for extreme performance. With its powerful 7x optical zoom, crystal-clear three-inch screen, and HD movie capabilities, the Stylus-7040 has everything you need to turn moments into memories. Take fun photos of your friends. Capture every family first on HD video. Whatever the occasion, invite the Stylus-7040.Olympus Stylus 7040 Highlights7x Wide-Angle Zoom (28-196mm equivalent)A big zoom that fits right in your pocket. The 7x zoom lets you get incredibly close to your subject while the 28mm wide-angle lens lets you zoom back out for panoramas and group shots.HD Movie 720pA simple, one-touch button allows you to record movies with amazing clarity in high-definition, right from your camera.Dual Image StabilizationThe 2-in-1 anti-blur solution. Sensor-Shift Image Stabilisation, which keeps your shot steady by compensating for camera shake, combines with Digital Image Stabilisation to capture crisp, clear images in any situation.AF TrackingAutomatically tracks unpredictable, fast-moving subjects like kids and pets. Continuously adjusts the focus and brightness so you can easily capture a great shot of your subject in motion.Creative Art FiltersTransform your pictures into works of art with filters that are built right into your camera--no additional software or computer time required. Effects include Pop Art, Pinhole, Fisheye, and Drawing. 14-megapixel resolution for high-quality, poster-size prints 7x wide-angle dual image stabilised zoom Shadow Adjustment Technology; AF tracking Creative Art filters Capture images to SD/SDHC memory cards (not included)....it's where quality and satisfaction are guaranteed to meet. Publisher: Olympus",
    "rating": "1 2 3 4 5 Register or sign-in to rate and get recommendations.",
    "otherinformation": "MGDSTYLUS-7040-BLU"
}