{
    "externalflashconnection": "Hot Shoe",
    "shutterlag": "0.075 Seconds",
    "exposurecontrol": "Auto: Shutter Speed, Aperture, ISO Manual: Shutter Speed, Aperture, ISO",
    "weight": "7.2 oz (204 g)",
    "battery": "1x  LP-E12  Rechargeable Lithium-Ion Battery Pack",
    "exposuremodes": "Modes: Aperture Priority, Auto, Flash Off, Manual, Programmed Auto, Shutter PriorityMetering Range: EV 1.0 - EV 20.0Compensation: -5 EV to +5 EV (in 1/3 or 1/2 EV steps)",
    "isosensitivity": "100 - 6400, Expandable to 12800",
    "focus": "Auto Manual Continuous Auto",
    "memorycardtype": "SD SDHC SDXC",
    "imagestabilization": "Yes",
    "incameraimageediting": "Art Bold, Filter Effects, Fisheye, Miniature Effect, Monochrome, Resize Image, Soft Focus, Toy Camera, Trim, Waterpainting",
    "lensmount": "Canon EF Canon EF-S",
    "viewfindercoverage": "95%",
    "category": "camera",
    "shutter": "Type: Electronic & MechanicalSpeed: 30 - 1/4000 sec",
    "videorecording": "Yes, NTSC/PAL",
    "minimumfocusdistance": ".82' (.25 m)",
    "operatingstoragetemperature": "Operating 32 to 104Â°F (0 to 40Â°C)Humidity: 0 - 85%",
    "pixels": "Actual: 18.5 MegapixelEffective: 18 Megapixel",
    "selftimer": "2 sec, 10 sec",
    "liveview": "Yes",
    "magnification": "0.28x",
    "continuousshootingtime": "1920 x 1080 29.9 min. 1280 x 720 29.9 min. 640 x 480 29.9 min.",
    "aperture": "Maximum: f/3.5 - 5.6",
    "dimensionswxhxd": "4.6 x 3.6 x 2.7\" / 11.7 x 9.1 x 6.9 cm",
    "autofocus": "Yes",
    "otherresolutions": "8MP: 3456 x 2304 at 3:2 4.5MP: 2592 x 1728 at 3:2 2.5MP: 1920 x 1280 at 3:2 0.35MP: 720 x 480 at 3:2",
    "meteringmethod": "Average metering, Center-weighted average metering, Multi-zone metering, Partial Metering, Spot metering",
    "audiorecording": "Optional External Mic: With Video, Stereo + Mono,",
    "whitebalancemodes": "Auto, Cloudy, Custom, Daylight, Flash, Fluorescent (White), Shade, Sunset, Tungsten, Twilight",
    "dustreductionsystem": "Yes",
    "viewfindermagnification": "Approx. 0.87x",
    "focallength": "18 - 55 mm Comparable  35mm Focal Length: 28.8 - 88 mm",
    "flashcompensation": "-2 EV to +2 EV (in 1/3 or 1/2 EV steps)",
    "sensortypesize": "CMOS, 22.3 x 14.9 mm",
    "filterthread": "Front: 58 mm",
    "connectivity": "AV Output HDMI C (Mini) USB 2.0",
    "cameraformat": "Canon APS-C (1.6x Crop Factor)",
    "groupselements": "11/13",
    "angleofview": "74Â° 20' - 27Â° 50'",
    "focustype": "Auto & Manual",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "continuousshooting": "Up to 4 fps",
    "aspectratio": "3:2",
    "displayscreen": "3\" Rear Touchscreen  Live Preview LCD (1,040,000)",
    "fileformats": "Still Images: JPEG, RAW Movies: MOV, MPEG-4 AVC/H.264 Audio: Linear PCM",
    "acpoweradapter": "ACK-E15 (Optional)",
    "diopteradjustment": "- 3 to +1 m",
    "exposurecompensation": "-3 EV to +3 EV (in 1/3 EV steps)",
    "builtinflash": "Yes",
    "cameratype": "Digital SLR with Interchangeable lenses",
    "framerate": "at 1920 x 1080: 30 fps, 25 fps, 24 fps at 1280 x 720: 60 fps, 50 fps at 640 x 480: 30 fps, 25 fps",
    "focusmode": "Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M)",
    "dimensionsdxl": "Approx. 2.7 x 3.0\" (68.58 x 76.20 mm)",
    "viewfindertype": "Pentamirror, Optical",
    "leftbardescstart": "Browse Our Store Store                                                                                                                         home Point & Shoot Cameras Pro. SLR Cameras Digital Camera Lenses Camcorders Projectors GPS Navigation Home audio Blu-ray / DVD PlayersLeft Bar Desc //End !Right Bar Desc //Start !Canon EOS Rebel SL1 Digital SLR Camera w/18-55mm Lens Brand New, Never Been Used 18.0MP APS-C CMOS Sensor DIGIC 5 Image Processor 3.0\" Clear View II Touchscreen LCD ISO 100-12800, Expandable to 25600 Full HD 1080 Video with Continuous AF 4.0 fps Continuous Shooting 9-Point AF System Scene Intelligent Auto Mode Compact and Lightweight; Weighs 0.8 lb EF-S 18-55mm f/3.5-5.6 IS STM Lens Canon             EOS Rebel SL1 DSLR Camera with EF-S 18-55mm f/3.5-5.6 IS STM Lens EF-S 18-55mm f/3.5-5.6 IS STM Lens LP-E12 Lithium-Ion Battery Pack (7.2V, 875mAh) Battery Charger LC-E12 for Battery Pack LP-E12 R-F-3 Camera Cover Eyecup Ef for Digital Rebel Cameras E-58 II 58mm Lens Cap Lens Dust Cap E (Rear) EW-300D Wide Strap Interface Cable Canon EOS Rebel SL1 Digital SLR Ca ... SPECIFICATIONS Imaging Camera Type Digital SLR with Interchangeable lenses Lens Mount Canon EF Canon EF-S Camera Format Canon APS-C (1.6x Crop Factor) Pixels Actual: 18.5 MegapixelEffective: 18 Megapixel Max Resolution 17.9MP: 5184 x 3456 at 3:2 Other Resolutions 8MP: 3456 x 2304 at 3:2 4.5MP: 2592 x 1728 at 3:2 2.5MP: 1920 x 1280 at 3:2 0.35MP: 720 x 480 at 3:2 Aspect Ratio 3:2 Sensor Type / Size CMOS, 22.3 x 14.9 mm File Formats Still Images: JPEG, RAW Movies: MOV, MPEG-4 AVC/H.264 Audio: Linear PCM Dust Reduction System Yes Memory Card Type SD SDHC SDXC Focus Control Focus Type Auto & Manual Focus Mode Single-servo AF (S), Continuous-servo AF (C), Manual Focus (M) Autofocus Points 9 Viewfinder/Display Viewfinder Type Pentamirror, Optical Viewfinder Coverage 95% Viewfinder Magnification Approx. 0.87x Diopter Adjustment - 3 to +1 m Display Screen 3\" Rear Touchscreen  Live Preview LCD (1,040,000) Screen Coverage 100% Live View Yes Exposure Control ISO Sensitivity Auto, 100-12800 (Extended Mode: 25600-) Shutter Type: Electronic & MechanicalSpeed: 30 - 1/4000 sec Metering Method Average metering, Center-weighted average metering, Multi-zone metering, Partial Metering, Spot metering Exposure Modes Modes: Aperture Priority, Auto, Flash Off, Manual, Programmed Auto, Shutter PriorityMetering Range: EV 1.0 - EV 20.0Compensation: -5 EV to +5 EV (in 1/3 or 1/2 EV steps) White Balance Modes Auto, Cloudy, Custom, Daylight, Flash, Fluorescent (White), Shade, Sunset, Tungsten, Twilight Flash Built-in Flash Yes Flash Compensation -2 EV to +2 EV (in 1/3 or 1/2 EV steps) Dedicated Flash System eTTL Remote Firing External Flash Connection Hot Shoe AV Recording Video Recording Yes, NTSC/PAL Frame Rate at 1920 x 1080: 30 fps, 25 fps, 24 fps at 1280 x 720: 60 fps, 50 fps at 640 x 480: 30 fps, 25 fps Exposure Control Auto: Shutter Speed, Aperture, ISO Manual: Shutter Speed, Aperture, ISO ISO Sensitivity 100 - 6400, Expandable to 12800 Exposure Compensation -3 EV to +3 EV (in 1/3 EV steps) Focus Auto Manual Continuous Auto Continuous Shooting Time 1920 x 1080 29.9 min. 1280 x 720 29.9 min. 640 x 480 29.9 min. Audio Recording Optional External Mic: With Video, Stereo + Mono, Performance Continuous Shooting Up to 4 fps Shutter Lag 0.075 Seconds Self Timer 2 sec, 10 sec In-Camera Image Editing Art Bold, Filter Effects, Fisheye, Miniature Effect, Monochrome, Resize Image, Soft Focus, Toy Camera, Trim, Waterpainting Connectivity AV Output HDMI C (Mini) USB 2.0 Power Battery 1x  LP-E12  Rechargeable Lithium-Ion Battery Pack AC Power Adapter ACK-E15 (Optional) Operating/Storage Temperature Operating 32 to 104Â°F (0 to 40Â°C)Humidity: 0 - 85% Physical Dimensions (WxHxD) 4.6 x 3.6 x 2.7\" / 11.7 x 9.1 x 6.9 cm Weight 13.05 oz / 370  g body only, without battery or card Kit Lens Focal Length 18 - 55 mm Comparable  35mm Focal Length: 28.8 - 88 mm Aperture Maximum: f/3.5 - 5.6 Angle of View 74Â° 20' - 27Â° 50' Minimum Focus Distance .82' (.25 m) Magnification 0.28x Groups/Elements 11/13 Autofocus Yes Image Stabilization Yes Filter Thread Front: 58 mm Dimensions (DxL) Approx. 2.7 x 3.0\" (68.58 x 76.20 mm) Weight 7.2 oz (204 g) Back to Top CANEOSSL11855DD TERMS AND CONDITIONS We usually ship within 1 business day after receiving payment. Please be aware                                                                                                                                         that weekends are not business days. All express methods of shipment still may require 1 day of processing time. Canadians and international buyers are responsible for all duties, customs                                                                                                                                         charges, and/or brokerage fees. We cannot ship as a gift, or claim as lower value. New Jersey buyers are responsible for applicable sales tax. We ship everything professionally in our state of the art warehouse. All products we sell are brand new and includes warranty coverage unless clearly                                                                                                                                         specified on the listing. \"Free Shipping\" applies to orders shipped within the continental                                                                                                                                         US. Domestic orders ship FedEx, UPS, and USPS. Our packages are insured and may require a signature. In accordance with PayPal                                                                                                                                         and eBay policies, we cannot reroute your package to a different address or hold                                                                                                                                         your shipment at the local hub for pick up, your order must be delivered to the                                                                                                                                         confirmed PayPal address received with your purchase. We cannot change your address                                                                                                                                         before the order ships. Please do not submit handling instructions in the notes                                                                                                                                         of your order requesting special handling, a specific courier or a change of address,                                                                                                                                         as we will be unable to meet these requests. We reserve the right to cancel any orders addressed to P.O. boxes, freight                                                                                                                                         forwarders, or resellers. We do not offer price protection if the price of an item                                                                                                                                         that you purchased. Prices do change frequently. We reserve the right to cancel orders placed without a registered eBay or                                                                                                                                         PayPal account. Orders placed by eBay guest checkout require additional verification                                                                                                                                         and may be delayed. Orders placed without a registered PayPal account cannot be                                                                                                                                         accepted and will be cancelled and refunded upon receipt. We offer a customer 30 day return privilege policy. A Return Merchandise Authorization                                                                                                                                             (RMA) number must be obtained for any return. To obtain an RMA number, please call                                                                                                                                             us toll free at 866-673-7187 . Returned packages without proper RMA demarcations will be refused by our warehouse                                                                                                                                             and returned to you. Customers who refuse a delivery, will be subject to charges                                                                                                                                             for return shipping to us. If the item was advertised as Free Shipping, then we                                                                                                                                             will charge the amount of shipping as determined by the FedEx shipping calculator. Some returns are subject to a restocking fee. The restocking percentage will depend                                                                                                                                             on the condition of the returned product. Defective products are eligible for exchange,                                                                                                                                             and no restock fee will apply. All returns must be packed with all contents which came with the original package                                                                                                                                             including, cables, software, plastic and cardboard packaging, and unregistered warranty                                                                                                                                             card. This return policy excludes Televisions and Home Theater Projectors. For further                                                                                                                                             questions please call us toll free at 866-673-7187 . You can also                                                                                                                                             contact us using the contact form found here . Return shipping costs are not reimbursable. International Customers: All electronic products are packaged for sale in the US with US Voltage. View International Policies Back to Top CONTACT INFO AND STORE HOURS ANY QUESTIONS? CALL US TOLL FREE: +1-866-673-7187 STORE HOURS: Monday - Friday 10:00AM to 3:00PM EST Email us anytime! Back to TopRight Bar Desc //End !",
    "dedicatedflashsystem": "eTTL Remote Firing",
    "maxresolution": "17.9MP: 5184 x 3456 at 3:2",
    "autofocuspoints": "9",
    "screencoverage": "100%"
}