{
    "macrofocusrange": "5cm",
    "weight": "6 Oz.",
    "flashtype": "Built-in flash",
    "maxoperatingtemperature": "40 Â°C",
    "height": "2.27 in.",
    "exposurecompensation": "Â±2 EV range, in 1/3 EV steps",
    "cameraflashfeatures": "AF Illuminator, Auto Flash, Flash Off, Forced On, Slow Sync",
    "additionalfeatures": "1080i Full HD Movie Recording, 1080p Full HD Movie Recording, AF Tracking, Audio Recording, Auto HDR Mode, Auto Power Save, Automatic Brightness Adjustment, Automatic Face Tracking, Blink Detection, Blur Warning, Built-In Compass, Built-In GPS, Built-In Speaker, Cropping An Image, DPOF Support, Date/Time Stamp, Digital Image Rotation, Digital Noise Reduction, Direct Print, Dynamic Range Optimizer, Face Detection, HDR (High Dynamic Range) Function, Histogram Display, Image Stabilization, Intelligent Scene Recognition (iSCN), Motion Detection, Not Interchangeable Lenses, Orientation Detection, PRINT Image Matching, PictBridge Support, Progressive Scan CCD System, Red eye Fix, Red-eye Correction, Self Portrait Auto Shutter, Smile Capture, Smile Detection, Sweep Panorama Technology, TransferJet Support, USB 2.0 Compatibility",
    "connectortypes": "1 x HDMI output, 1 x USB, 1 x component video output, 1 x composite video/audio output",
    "opticalzoom": "10x",
    "maxvideoresolution": "1920 x 1080",
    "category": "camera",
    "specialeffects": "Cross filter, Fisheye, Partial color, Radial blur, Retro, Soft Focus, Unsharp masking",
    "facedetection": "Yes",
    "lightsensitivitymax": "3200",
    "stillimageformat": "JPEG, Raw Image",
    "screendetails": "LCD display - TFT active matrix - 3\" - color",
    "redeyereduction": "Yes",
    "lightsensitivity": "ISO 125, ISO 1600, ISO 200, ISO 3200, ISO 400, ISO 800, ISO auto",
    "sensorsize": "1/2.4\"",
    "width": "4.05 in.",
    "autofocustype": "TTL contrast detection",
    "digitalzoom": "2x",
    "focallengthequivalentto35mmcamera": "25 - 250mm",
    "minshutterspeed": "30 sec",
    "batteryformfactor": "Manufacturer specific",
    "mpn": "DSCHX5V/B",
    "operatingsystemsupported": "Apple Mac OS 9.1, Apple Mac OS 9.2, Apple Mac OS X 10.1 - 10.6, Apple Mac OS X 10.4 - 10.6, MS Windows 2000, MS Windows 7, MS Windows Vista, MS Windows XP, Microsoft Windows 2000 Professional, Microsoft Windows XP Home Edition, Microsoft Windows XP Professional",
    "brand": "Sony",
    "continuousshootingspeed": "10 frames per second",
    "exposuremetering": "Center-Weighted, Multi-Segment, Spot",
    "minoperatingtemperature": "0 Â°C",
    "displayrotation": "Built-in",
    "screensize": "3\"",
    "digitalvideoformat": "AVCHD, MPEG-4",
    "microphoneoperationmode": "Stereo",
    "microphonetype": "Microphone - built-in - stereo",
    "integratedmemorysize": "45 MB",
    "expansionslot": "1 x Memory Stick PRO Duo, 1 x SD Memory Card",
    "focusadjustment": "Automatic, Manual",
    "displaytype": "LCD",
    "shootingmodes": "Frame Movie Mode",
    "effectiveflashrange": "0.25 m - 7.6 m",
    "cameratype": "Point & Shoot",
    "exposuremodes": "Automatic, Manual, Program",
    "displaysize": "3\"",
    "flashmodes": "Auto Mode, Fill-in Mode, OFF mode, Red-eye Reduction, Slow Synchro",
    "depth": "1.14 in.",
    "sensorresolution": "10.2 MP",
    "viewfindertype": "Digital, None",
    "maxshutterspeed": "1/1600 sec",
    "sensortype": "Exmor R CMOS",
    "supportedflashmemory": "Built-in, Memory Stick DUO PRO, Memory Stick Duo, Memory Stick PRO Duo High Speed, Memory Stick PRO Duo Mark2, Memory Stick PRO-HG Duo, SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "model": "DSC-HX5V",
    "shootingprograms": "Advanced sports, Back light, Backlight portrait, Beach, Fireworks, Gourmet, Handheld twilight, High sensitivity, Landscape, Panorama assist, Pet, Portrait mode, Reducing blur, Snow, Soft snap, Sports mode, Twilight mode, Twilight portrait, Twilight using a tripod",
    "whitebalance": "Auto, Cloudy (Preset), Daylight / Sunny (Preset), Flash (Preset), Fluorescent (Preset), Incandescent (Preset)"
}