{
    "externalflashconnection": "Wireless",
    "leftbardescstart": "5253B002 Browse Our Store Store home Point & Shoot Cameras Pro. SLR Cameras Digital Camera Lenses Camcorders Projectors GPS Navigation Home audio Blu-ray / DVD PlayersLeft Bar Desc //End !Right Bar Desc //Start !Canon EOS-1D X Digital SLR Camera (Body Only) New, Never Opened 18.1Mp CMOS Sensor Dual DIGIC 5+ Image Processors 3.2\" LCD Screen Eye-Level Pentaprism Viewfinder Dual CF Card Recording Media Canon EF Lens Mount Magnesium Alloy Body 1920 x 1080 HD Video Capture Live View Still and Video Recording 61-Point High Density Auto Focus Canon     EOS-1D X Digital SLR Camera (Body Only) Eyecup Eg LP-E4N Battery Pack LC-E4N Battery Charger Wide Neck Strap L7 Cable Protector AVC-DC400ST Stereo AV Cable IFC-200U USB Interface Cable - 6.9' (1.9 m) EOS Digital Solution Disc Software Instruction Manual Canon EOS-1D X Digital SLR Camera ( ... SPECIFICATIONS Imaging Camera Type Digital SLR with Interchangeable lenses Lens Mount Canon EF Camera Format Full-Frame Resolution Actual Pixels: 19.3 Megapixels 1 Please Note: Effective pixels: 18.1Mp close Sensor Type / Size CMOS, 36 x 24 mm File Formats Still Images: JPEG, RAW Movies: MPEG-4 AVC/H.264 Audio: Linear PCM Memory Card Type CompactFlash Focus Control Focus Type Auto & Manual Autofocus Points 61 Viewfinder/Display Viewfinder Type Pentaprism Viewfinder Coverage 100% Viewfinder Magnification Approx. 0.76x Diopter Adjustment - 3.0 to +1.0 m Display Screen 3.2\" Rear Screen   LCD (1,040,000) Screen Coverage 100% Live View Yes Exposure Control ISO Sensitivity 50-51200 Shutter 1/8000 - 30 seconds 2 Please Note: Also shoots bulb close Metering Method Spot metering, Center-weighted average metering, Average metering, Multi-zone metering Exposure Modes Modes: Aperture Priority, Manual, Shutter PriorityCompensation: -5 EV to +5 EV (in 1/3 EV steps) 3 Please Note: Manual: +/-5 stops also in 1/2AEB: +/-3 stops in 1/3 or 1/2 stop increments close White Balance Modes Auto, Cloudy, Daylight, Flash, Fluorescent, Manual, Tungsten 4 Please Note: Also: Shade, Color Temperature close Flash External Flash Connection Wireless AV Recording Video Recording Yes Audio Recording With Video Performance Self Timer 10 sec, 2 sec Connectivity AV Output, HDMI C (Mini), USB 2.0 Power Battery 1x  LP-E4N  Rechargeable Lithium-Ion Battery Pack Operating/Storage Temperature Operating 32 to 104 °F (0 to 40 °C)Humidity: 0 - 85% Physical Dimensions (WxHxD) 6.2 x 6.4 x 3.3\" / 157.48 x 162.56 x 83.82 mm Weight 3.4 lb / 1.54  kg with battery Back to Top CNEOS1DX TERMS AND CONDITIONS We usually ship within 1 business day after receiving payment. Please be aware that weekends are not business days. All express methods of shipment still may require 1 day of processing time. Canadians and international buyers are responsible for all duties, customs charges, and/or brokerage fees. We cannot ship as a gift, or claim as lower value. New Jersey buyers are responsible for applicable sales tax. We ship everything professionally in our state of the art warehouse. All products we sell are brand new and includes warranty coverage unless clearly specified on the listing. \"Free Shipping\" applies to orders shipped within the continental US. Domestic orders ship FedEx, UPS, and USPS. Our packages are insured and may require a signature. In accordance with PayPal and eBay policies, we cannot reroute your package to a different address or hold your shipment at the local hub for pick up, your order must be delivered to the confirmed PayPal address received with your purchase. We cannot change your address before the order ships. Please do not submit handling instructions in the notes of your order requesting special handling, a specific courier or a change of address, as we will be unable to meet these requests. We reserve the right to cancel any orders addressed to P.O. boxes, freight forwarders, or resellers. We do not offer price protection if the price of an item that you purchased. Prices do change frequently. We reserve the right to cancel orders placed without a registered eBay or PayPal account. Orders placed by eBay guest checkout require additional verification and may be delayed. Orders placed without a registered PayPal account cannot be accepted and will be cancelled and refunded upon receipt. We offer a customer 30 day return privilege policy. A Return Merchandise Authorization (RMA) number must be obtained for any return. To obtain an RMA number, please call us toll free at 866-673-7187 . Returned packages without proper RMA demarcations will be refused by our warehouse and returned to you. Customers who refuse a delivery, will be subject to charges for return shipping to us. If the item was advertised as Free Shipping, then we will charge the amount of shipping as determined by the FedEx shipping calculator. Some returns are subject to a restocking fee. The restocking percentage will depend on the condition of the returned product. Defective products are eligible for exchange, and no restock fee will apply. All returns must be packed with all contents which came with the original package including, cables, software, plastic and cardboard packaging, and unregistered warranty card. This return policy excludes Televisions and Home Theater Projectors. For further questions please call us toll free at 866-673-7187 . You can also contact us using the contact form found here . Return shipping costs are not reimbursable. International Customers: All electronic products are packaged for sale in the US with US Voltage. View International Policies Back to Top CONTACT INFO AND STORE HOURS ANY QUESTIONS? CALL US TOLL FREE: +1-866-673-7187 STORE HOURS: Monday - Friday 10:00AM to 3:00PM EST Saturday - Sunday: Closed Email us anytime! Back to TopRight Bar Desc //End !",
    "weight": "3.4 lb / 1.54  kg with battery",
    "battery": "1x  LP-E4N  Rechargeable Lithium-Ion Battery Pack",
    "isosensitivity": "50-51200",
    "height": "6.4 in.",
    "memorycardtype": "CompactFlash",
    "cameraflashfeatures": "Auto Flash",
    "additionalfeatures": "HDMI, Interchangeable Lenses, USB 2.0",
    "viewfindercoverage": "100%",
    "category": "camera",
    "videorecording": "Yes",
    "lightsensitivitymax": "50100",
    "width": "6.2 in.",
    "operatingstoragetemperature": "Operating 32 to 104 °F (0 to 40 °C)Humidity: 0 - 85%",
    "lensforsd": "Body Only",
    "selftimer": "10 sec, 2 sec",
    "liveview": "Yes",
    "dimensionswxhxd": "6.2 x 6.4 x 3.3\" / 157.48 x 162.56 x 83.82 mm",
    "maxvideoresolution": "1920 x 1080",
    "meteringmethod": "Spot metering, Center-weighted average metering, Average metering, Multi-zone metering",
    "audiorecording": "With Video",
    "whitebalancemodes": "Auto, Cloudy, Daylight, Flash, Fluorescent, Manual, Tungsten 4 Please Note: Also: Shade, Color Temperature close",
    "viewfindermagnification": "Approx. 0.76x",
    "mpn": "5253B002",
    "brand": "Canon",
    "sensortypesize": "CMOS, 36 x 24 mm",
    "sensortype": "CMOS",
    "connectivity": "AV Output, HDMI C (Mini), USB 2.0",
    "cameraformat": "Full-Frame",
    "screensize": "3.2\"",
    "focustype": "Auto & Manual",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "lensmount": "Canon EF",
    "displayscreen": "3.2\" Rear Screen   LCD (1,040,000)",
    "fileformats": "Still Images: JPEG, RAW Movies: MPEG-4 AVC/H.264 Audio: Linear PCM",
    "microphonetype": "With Built-in Microphone",
    "diopteradjustment": "- 3.0 to +1.0 m",
    "displaytype": "LCD",
    "screencoverage": "100%",
    "cameratype": "Digital SLR with Interchangeable lenses",
    "exposuremodes": "Modes: Aperture Priority, Manual, Shutter PriorityCompensation: -5 EV to +5 EV (in 1/3 EV steps) 3 Please Note: Manual: +/-5 stops also in 1/2AEB: +/-3 stops in 1/3 or 1/2 stop increments close",
    "upc": "013803145410",
    "displaysize": "3.2\"",
    "shutter": "1/8000 - 30 seconds 2 Please Note: Also shoots bulb close",
    "depth": "3.3 in.",
    "sensorresolution": "18.1 MP",
    "viewfindertype": "Pentaprism",
    "autofocuspoints": "61",
    "supportedflashmemory": "CompactFlash Card Type I, CompactFlash Card Type II, CompactFlash I, CompactFlash II",
    "model": "1D X",
    "resolution": "Actual Pixels: 19.3 Megapixels 1 Please Note: Effective pixels: 18.1Mp close",
    "whitebalance": "Auto"
}