{
    "category": "camera",
    "opticalviewfindertype": "Fixed eye-level pentamirror",
    "warrantyparts": "1 Year",
    "powernotes": "Battery: LP-E8 Lithium-Ion",
    "returnspolicy": "This product is subject to our return policy.  Please see our complete return policy for details.",
    "cameratype": "SLR camera",
    "shootingmodes": "Handheld night shot",
    "megapixels": "18 megapixel(s)",
    "displaysize": "3 in",
    "compatibilitynotes": "18.0 Megapixel CMOS (APS-C) sensor: The EOS Rebel T5i features Canon's amazing 18.0 Megapixel CMOS (Complementary Metal Oxide Semiconductor) sensor. Perfect for enlargements or for cropping detailed portions of the composition, the camera's sensor captures images with exceptional clarity and tonal range. This first-class sensor features many of the same technologies used by professional Canon cameras to maximize each pixel's light-gathering efficiency and has center pixels that aid in the EOS Rebel T5i's accurate AF performance. This APS-C size sensor creates an effective 1.6x field of view (compared to 35mm format). ISO 100-12800 and expandable to 25600 in H mode: Thanks to its DIGIC 5 Image Processor, the EOS Rebel T5i features an expanded ISO range of ISO 100-12800 (expandable to 25600 in H mode) that makes shooting possible in situations previously unthinkable without flash. The EOS Rebel T5i, with the DIGIC 5 Image Processor's remarkable noise-reduction technology, performs brilliantly in low-light shooting. Used with one of Canon's EF or EF-S lenses with Optical Image Stabilizer, the EOS Rebel T5i can record beautiful images even when light sources are scarce. DIGIC 5 Image Processor: The EOS Rebel T5i's DIGIC 5 Image Processor works with the camera's CMOS sensor to deliver images with incredible detail in more situations, without the need for artificial light sources. With the power of the DIGIC 5 Image Processor, the EOS Rebel T5i can achieve higher ISO sensitivity, can shoot up to 5.0 fps continuously and can even perform advanced functions like HDR Backlight Control, art filters, lens correction and much more. The camera's brilliant imaging core supercharges every facet of still and moving image capture. High-speed continuous shooting: The EOS Rebel T5i can shoot up to 5.0 frames per second, continuously. Thanks to the enhanced shutter mechanism, mirror drive and camera sensor, the EOS Rebel T5i is ready for action; whether capturing that perfect expression, the game's winning goal, or the bride walking down the aisle, the EOS Rebel T5i delivers the speed and performance to guarantee results. Exceptional autofocus performance and Hybrid CMOS AF: The EOS Rebel T5i is equipped with AF features that ensure speedy, accurate and continuous AF every time. When shooting through the viewfinder, the EOS Rebel T5i has advanced autofocus with a 9-point, all cross-type AF system (including a high-precision dual-cross f/2.8 center point) for accurate focus whether the camera is oriented in portrait or landscape position. An AI Servo AF system achieves and maintains consistent focus with an exceptional degree of reliability. The EOS Rebel T5i also features Canon's amazing Hybrid CMOS AF System, perfect for shooting photos and video in Live View. This system combines two distinct AF technologies, phase and contrast detection AF, for speedier and more accurate focus. These complementary focusing systems are aided by pixels on the camera's CMOS sensor that assist in predicting subject location, making continuous focus tracking quick and accurate in video recording while enhancing focusing speed. EOS Full HD Movie Mode with Movie Servo AF: The EOS Rebel T5i offers easy-to-use, professional video capture without compromise. It enables easy manual control of exposure, focus and Live View features, even in-camera editing! Movie Servo AF allows continuous autofocus tracking of moving subjects while recording video. CANON iMAGE GATEWAY Qualified: An online resource offering digital imaging education and photo and video sharing capabilities exclusively for registered owners of qualified Canon products. Members can read up on topics related to their products, how-to articles, and more.",
    "physicaldimensions": "3.9\"h x 5.2\"w x 3.1\"d",
    "actualweight": "18.50 oz",
    "opticalsensorsize": "14.9 x 22.3mm",
    "opticalsensortype": "CMOS",
    "warrantylabor": "1 Year",
    "flashtype": "Pop-up flash",
    "contents": "Camera, 18-135mm lens, battery, charger, eyecup Ef, cover, interface cable, front lens cap, rear lens cap, documentation",
    "portsconnectors": "(1) HDMI mini (1) USB 2.0 (1) AV out"
}