{
    "flashtype": "Built-in flash",
    "color": "Silver",
    "compatibilitynotes": "The PowerShot S110 is equipped with built-in Wi-Fi for on-the-go convenience when you want to share what you've recorded with friends, family and the whole world. The camera makes it easy to connect directly to both iOS and Android devices, and upload images via the free Canon CameraWindow app. Using CANON iMAGE GATEWAY#, you can easily post your images to your favorite social networking sites to update friends and family while you're traveling or just out and about. Even without a mobile device, you can send images to a PC, share images between Wi-Fi enabled PowerShot cameras and you can even print in a snap by sending your images wirelessly to a Wi-Fi compatible printer. Newly engineered specifically for the PowerShot S110, the camera's 24mm Wide-Angle 5x Optical Zoom lens with a focal length of 5.2-26.0mm (35mm film equivalent: 24-120mm) achieves f/2.0-f/5.9, giving the user exceptional versatility. The Wide-Angle lens gives your images a distinctive sweep and grandeur, capturing landscapes, cityscapes, tall buildings and wide groups of people with ease. The large f/2.0 aperture allows you to achieve shallow depth-of-field for creating portraits with beautiful, soft background blur, and incomparable Canon optical technology delivers a high performance lens enabling incredible images, even in low light. The PowerShot S110 employs a Canon 12.1 Megapixel CMOS sensor, which delivers state-of-the-art imaging performance and is optimized for use in compact cameras. Utilizing a sophisticated light-capturing design, it provides high sensitivity for improved high ISO capture with reduced noise. It is also a high-speed design, capable of rapidly capturing and moving image data to the processor, enabling faster continuous shooting and faster autofocus. The latest-generation Canon DIGIC 5 Image Processor works with the PowerShot S110's image sensor to bring phenomenal increases in processing speed and power, delivering incredible detail in more situations, without the need for artificial light sources. Improved noise reduction produces clearer images when shooting in low light at high ISO speeds. The faster processing speed results in faster continuous shooting capability while maintaining full image quality. With the power of the DIGIC 5 Image Processor, the PowerShot S110 can achieve higher ISO sensitivity and even perform advanced functions like lens correction, special scene modes and much more. The PowerShot S110 gives you the power to create images with spectacular depth, detail and emotional resonance. The 12.1 Megapixel High-Sensitivity CMOS sensor works in concert with Canon's own latest-generation DIGIC 5 Image Processor to create the renowned Canon HS SYSTEM. With the Canon HS SYSTEM, you'll experience excellent tracking performance even in low light, and achieve gorgeous still image quality even at high ISO speeds all the way up to ISO 12800; beautiful low-light shots are possible with minimal noise and maximum detail in highlight and shadow areas.",
    "displayformfactor": "Built-in",
    "opticalzoom": "5 X",
    "contents": "Camera, battery pack, battery charger, wrist strap, USB cable, CD, documentation",
    "portsconnectors": "Mini HDMI Video Out:  NTSC/PAL",
    "category": "camera",
    "specialeffects": "Black & White",
    "returnspolicy": "This product is subject to our return policy.  Please see our complete return policy for details.",
    "lightsensitivity": "ISO 80",
    "physicaldimensions": "2.3\"h x 3.9\"w x 1.1\"d",
    "opticalsensortype": "CMOS",
    "attr35mmequivalentfocallengthmin": "24 mm",
    "memorynotes": "SD memory card slot",
    "focallengthmax": "26 mm",
    "digitalvideoformat": "H.264",
    "powernotes": "Battery:  NB-5L Lithium-Ion",
    "warrantylabor": "Call for Warranty",
    "shutterspeed": "15 - 1/2000",
    "videoinputtype": "Digital camera",
    "warrantyparts": "Call for Warranty",
    "displaytechnology": "TFT",
    "cameratype": "Point & Shoot camera",
    "shootingmodes": "Stitch assist",
    "megapixels": "12.1 megapixel(s)",
    "batterytechnology": "Lithium ion",
    "displaysize": "3 in",
    "focallengthmin": "5.2 mm",
    "digitalzoom": "4 X",
    "actualweight": "6.10 oz",
    "opticalsensorsize": "1/1.7\"",
    "attr35mmequivalentfocallengthmax": "120 mm"
}