{
    "flashtype": "Pop-up flash",
    "color": "White",
    "compatibilitynotes": "Capture images like a pro: This, first and foremost, is a serious camera designed to capture amazing images in almost any situation. It starts with a quality 23mm wide-angle lens that gives you a 21x optical zoom and optical image stabilization. You can go fully automated, fully manual or select a setting (like aperture or shutter priority) and let the camera figure out the rest. With Samsung S Voice, you can also tell your camera what to do. It will respond to commands like “smile, ” “record video” and “zoom in.” Edit photos & videos quick & easy: You’ll take beautiful photos and clear, vibrant video with the Galaxy Camera. But it doesn’t stop there. With Photo Wizard, you can edit those photos right in the camera – adjust brightness and color, add effects, crop and more. And with Video Editor, you can delete and rearrange scenes, add music and insert text. These are precision tools that make sure the photos and videos you share are exactly as you like them. And you’ll see every amazing detail on the 4.8” HD Super Clear Touch Screen LCD. Share easily and beautifully: The Galaxy Camera is packed with advanced sharing features. But its most basic sharing feature might be its most impressive – simply showing your friends your new photos and videos on the big, beautiful 4.8” HD Super Clear Touch Screen. Then technology – thanks to Android and Wi-Fi – brings sharing to a whole new level. Use Buddy Photo Share to share directly to your favorite social networks, and Share Shot to share with other devices. You’ll also be able to access your photos from any AllShare Play device. Enjoy photos smarter: Samsung made enjoying your photos and videos is almost as much fun as capturing them. First of all, SMART Content Manager automatically organizes your photos so you can always find what you’re looking for. You can view your albums by time, location, favorites or more. Second of all, you can watch your videos – or almost any other multimedia content – through the Video Player. Third of all, there’s a Music Player. Fourth of all, the Galaxy Camera gives you a full web browser to enjoy everything else. Plus, Smart Gestures lets you interact with your memories in new, very intuitive ways, like Tilt to Zoom, Pan to Browse and more.",
    "opticalzoom": "21 X",
    "contents": "Camera, battery, travel adapter, data cable, hand strap, documentation",
    "category": "camera",
    "returnspolicy": "This product is subject to our return policy.  Please see our complete return policy for details.",
    "physicaldimensions": "2.8\"h x 5.1\"w x 0.8\"d",
    "opticalsensortype": "BSI-CMOS",
    "attr35mmequivalentfocallengthmin": "23 mm",
    "memorynotes": "8GB",
    "storagecapacity": "8 GB",
    "focallengthmax": "86.1 mm",
    "powernotes": "Battery: Lithium Ion, 1650mAh",
    "warrantylabor": "1 Year",
    "shutterspeed": "16 - 1/2000",
    "warrantyparts": "1 Year",
    "displaytechnology": "LCD",
    "cameratype": "Compact",
    "shootingmodes": "Night",
    "megapixels": "16.3 megapixel(s)",
    "batterytechnology": "Lithium ion",
    "displaysize": "4.8 in",
    "focallengthmin": "4.1 mm",
    "actualweight": "10.70 oz",
    "opticalsensorsize": "1/2.3\"",
    "attr35mmequivalentfocallengthmax": "483 mm"
}