{
    "flashtype": "Built-in flash",
    "color": "Red",
    "compatibilitynotes": "Wi-Fi Connectivity: Lets you connect your digital camera to a wireless network. Save photos and videos directly to a computer or cloud service while you shoot, email them print them wireless or upload them straight to Facebook or YouTube. You will never have to worry about losing a great shot, running out of storage or remembering to bring the correct cable along. Social Sharing: Instantly post must-see images and videos to your favorite social networks. Just select and upload wherever you have a Wi-Fi connection, and then add tags and comments. Share with your Blogger followers, or post to Facebook or YouTube – and many more social networks. AutoShare: Connect your Samsung Smart Camera to your Smartphone and activate AutoShare – and the pictures you take automatically get sent to your Smartphone. MobileLink: Permits the sharing of digital photographs and videos with select Android Phones. Just capture the photo using the Smart Cameras’ superior optics and then send images directly from your Samsung Smart Camera to any Android 2.2 or higher devices with the Samsung MobileLink App. AllShare Play: Samsung AllShare Play lets you and your family seamlessly share your content across your DLNA-connected Samsung devices, without the need for a network, cables or a connecting device. Cloud Service (MS SkyDrive) Cloud-based backup means you’ll never be at risk of losing your shots, even if your camera is lost or stolen. If you’re in Wi-Fi range, your Smart Camera can copy images to a Microsoft SkyDrive account, a feature that also lets you delete shots from your camera’s memory card to free up room for more pictures. Don’t remember what you shot? You can view pictures stored on the cloud services directly on your phone or tablet, or download a copy to your PC. Remote Viewfinder: Control your camera – even from 30 feet away – by using your Smartphone as the Viewfinder. Available for select Smartphones, the Remote Viewfinder App lets you preview images, adjust the camera settings, zoom in and out, frame the scene, and tag the shot with the location – all from your phone, wirelessly. Take the perfect group shot every time, even when you’re in it. PC Auto Backup: Save images to your computer in a snap. You can wirelessly transfer photos and movies to your PC – even if the computer is turned off. With one simple setting, the camera can turn on any PC with Wake-on LAN functionality. When your images are saved, the camera can shut down the computer to save energy as well as your memories. Cloud Service (MS SkyDrive): Cloud-based backup means you’ll never be at risk of losing your shots, even if your camera is lost or stolen. If you’re in Wi-Fi range, your Smart Camera can copy images to a Microsoft SkyDrive account, a feature that also lets you delete shots from your camera’s memory card to free up room for more pictures. Don’t remember what you shot? You can view pictures stored on the cloud services directly on your phone or tablet, or download a copy to your PC. 3\" Hybrid Touch Display: The Hybrid Touch Display offers two options: use the 5-way button to quickly move the cursor up, down, left and right to intuitively navigate the menu and make selections. Alternately, when you want to enter text – such as an email address – simply input the characters on the touch screen. Navigating controls and sharing images couldn’t be easier. 14.2MP CMOS Sensor: Capture properly exposed images in low-light situations with the CMOS sensor, which needs less light than conventional sensors. Use the Low light Shot to automatically select the best setting merging three continuous shots into one clear photo. Full HD Video Capture 1920x1080: Full HD video with life-like color and extraordinarily sharp details. Shoot longer too – the camera’s H.264 format allows longer recording than a camera with MJPEG video does. When you’re done, you can watch your brilliant HD footage large as life on your HDTV. Best Face: Missed it. With the Best Face feature that won’t happen again. Use it to travel back in time after you’ve taken a picture to replace faces with the perfect moment. Use it to open eyes, replace a smile, or find that perfect expression. With the combination of lightning fast burst shots and facial recognition, you can simply tap a face that’s looking the other way, and tap again to replace it with expressions taken moments before the actual shot. Motion Photo: Motion Photo freezes the action around a moving subject to create a fun scene. Capture a friend dancing – then make everyone around him still as a statue. Simply shoot the footage, and then rub the area on the display where you want to keep the movement. The photo around it will freeze – it’s that easy. Smart Mode: Stop being jealous of the pros with their big cameras, and start taking great shots. A quick tap of Smart Mode and you’re set with various special modes. Capture perfect trails of light at night on a busy intersection full of red taillights or instantly capture a high-speed scene with Action Freeze. 2D Panorama: Capture the sweeping beauty of a natural landscape or the grandeur of a vast skyline. The WB800F panoramic capabilities let you catch every detail on the horizon with the push of a button.",
    "displaysize": "3 in",
    "contents": "Camera, documentation",
    "portsconnectors": "(1) USB 2.0",
    "category": "camera",
    "returnspolicy": "This product is subject to our return policy.  Please see our complete return policy for details.",
    "physicaldimensions": "2.4\"h x 4.2\"w x .9\"d",
    "opticalsensortype": "BSI-CMOS",
    "memorynotes": "Internal Memory: 25MB",
    "storagecapacity": "25 MB",
    "focallengthmax": "72 mm",
    "powernotes": "Battery: SLB-10A Lithium-Ion",
    "warrantylabor": "Call for Warranty",
    "shutterspeed": "16 - 1/2000",
    "warrantyparts": "Call for Warranty",
    "cameratype": "Compact",
    "megapixels": "14.2 megapixel(s)",
    "opticalzoom": "18 X",
    "focallengthmin": "4 mm",
    "systemrequirements": "Windows: Intel Pentium4 3.2 GHz or above AMD Athlon FX 2.6 GHz or above Windows XP_SP2 / Vista / 7 250MB or more hard-disk capacity (over 1GB recommended) 512MB RAM (over 1GB recommended) nVIDIA Geforce 7600GT or above / ATI X1600 series or above 1024×768 pixels, 16-bit color display compatible monitor (1280×1024 pixels, 32-bit color display recommended) CD-ROM Driver, USB Port DirectX 9.0c or above Macintosh: Power Mac G3 or above Mac OS 10.4 or above 110MB or more hard-disk capacity minimum 256MB RAM CD-ROM Driver, USB Port",
    "opticalsensorsize": "1/2.33\""
}