{
    "flashtype": "Pop-up flash",
    "color": "Red",
    "compatibilitynotes": "Telephoto Zoom, 25mm F2.5 Lens: What if you could be anywhere you wished to go? Now you can be there when the winning goal hits the back of the net. Or get a front-row view of the school play—from any seat in the house. The Samsung WB2100 Camera’s 35x optical zoom telephoto lens delivers crisp detail and sharp focus every time, putting you in the middle of the action no matter where it’s happening. 3” Tilt LCD Screen: See life from a whole new angle and add excitement to your images. The Samsung WB2100 Camera’s 3.0\"(75mm) Tilt Display offers a full 135-degree range of motion. So now you can easily frame and capture a low-angle image from the best position—or even hold the camera over a crowd and still see exactly what you’re getting. Low light Shot: Show your subject in the best possible light—in moonlight, candlelight, or practically no light at all. Low-Light Shot mode takes three continuous shots, and then merges them all into one clear, bright image with minimal blur or noise. 16MP CMS Sensor: Trust your equipment and shoot with confidence. The super-fast, super-sensitive 16-megapixel BSI (back side–illuminated) CMOS sensor needs less light for proper exposure and quicker focus than conventional sensors. So even if a moment happens in a heartbeat, or is lit only by the reflected glow of the moon, with the Samsung WB2100 Camera, your photos will be sure to match your memories. Optical Image Stabilization: The Samsung WB2100 Camera’s Optical Image Stabilization (OIS) gives your images crisp focus, even if you’re not perfectly still. Shoot with confidence in any condition to experience photos that come out sharp and clear—in low-light situations, when zooming in for a shot, or while you’re on the move. Panorama Shot: Don’t be limited to landscapes or group portraits when taking panoramic shots with a wide-angle lens. Simply aim the camera with the shutter pressed fully down and then release when you’re ready to take the shot. Once the shots have been taken, Samsung’s proprietary panoramic technology automatically searches for motion borders of the two images and stitches them together as if a professional had taken the shot. Full HD Recording with Movie Zoom: The Samsung WB2100 Camera’s 35x optical wide zoom capability delivers smooth Full HD 1080/60i video and amazing low-light performance. And Movie Zoom automatically adjusts and optimizes sound settings—while eliminating motor “whir”—to give you crystalclear audio performance, too. And with an advanced HDMI interface, the WB2100 is one camera that works hard and plays well with others. Rich Tone: Capture the blazing light and subtle depth of a sunset over water. With Rich Tone (HDR), the Samsung WB2100 Camera offers a greater range of luminance, so shadows aren’t too dark and highlights aren’t oversaturated. The result: perfect exposure in all areas, and vibrant details that pop.",
    "opticalzoom": "3 X",
    "contents": "Camera, battery, documentation",
    "portsconnectors": "(1) USB 2.0",
    "category": "camera",
    "returnspolicy": "This product is subject to our return policy.  Please see our complete return policy for details.",
    "physicaldimensions": "3.3\"h x 4.7\"w x 2.2\"d",
    "attr35mmequivalentfocallengthmin": "25 mm",
    "opticalsensortype": "BSI-CMOS",
    "focallengthmax": "152.48 mm",
    "powernotes": "Battery: SLB-10A Lithium-Ion",
    "warrantylabor": "1 Year",
    "shutterspeed": "8 - 1/2000",
    "warrantyparts": "1 Year",
    "displaytechnology": "LCD",
    "cameratype": "Point & Shoot / Zoom camera",
    "shootingmodes": "Sunset",
    "megapixels": "16.2 megapixel(s)",
    "batterytechnology": "Lithium ion",
    "displaysize": "3 in",
    "focallengthmin": "4.62 mm",
    "opticalsensorsize": "1/2.3\"",
    "attr35mmequivalentfocallengthmax": "875 mm"
}