{
    "flashtype": "Pop-up flash",
    "color": "Black",
    "compatibilitynotes": "Canon's innovative Dual Pixel CMOS AF enables you to shoot video like a camcorder with smooth, fast, and accurate autofocus; lets you enjoy instant and precise autofocus even when shooting stills from a variety of angles with the freedom provided by the Vari-angle LCD; and provides amazing autofocus power with 103? compatible Canon EF lenses when shooting photos or video. Built-in wireless technology allows you to wirelessly transfer your images to social networking sites through Canon Image Gateway share your images with wireless-enabled Canon cameras, or upload virtually anywhere on your iOS or Android smartphone with the free download of the EOS Remote app. Use your smartphone for remote camera control and operation (with the EOS Remote app), or even print your images on a wireless PictBridge certified printer. 20.2 Megapixel CMOS (APS-C) sensor, 14-bit A/D conversion, ISO 100-12800 (expandable to H: 25600) for shooting from bright to dim light and high performance DIGIC 5+ Image Processor for exceptional image quality and processing speed. High speed continuous shooting up to 7.0 fps allows you to capture quick action. EOS Full HD Movie mode with Movie Servo AF for improved continuous focus tracking of moving subjects, manual exposure control and multiple frame rates (1080: 30p (29.97) / 24p (23.976) / 25p, 720: 60p (59.94) / 50p, 480: 30p (29.97) / 25p), built-in stereo microphone, manual audio level adjustment with attenuator function to reduce audio clipping, and Video Snapshot with editing for expanded movie shooting options. Vari-angle Touch Screen 3.0-inch Clear View LCD monitor II (approximately 1, 040, 000 dots) with smudge-resistant coating features multi-touch operation and Touch AF for an easy and intuitive experience, flexible positioning, and clear viewing even when outdoors in sunlight. 19-point all cross-type AF system (including a high-precision f/2.8 dual cross-type AF center point) with a wide area array for exceptional autofocus performance and greater compositional freedom when shooting with the viewfinder. Intelligent Viewfinder with superimposed LCD display provides approximately 98% field of view, and Multi-Aspect ratio in Live View broadens your choices in composition. Expand your creativity with advanced in-camera imaging features like High Dynamic Range, Multiple Exposure, Handheld Night Scene and HDR Backlight Control, along with seven Creative Filters that can be displayed in real time during Live View shooting. Scene Intelligent Auto Mode delivers expertly optimized photos and offers improved scene detection for amazing results when shooting at night.",
    "opticalviewfindertype": "Eye-Level Penta Prism",
    "opticalzoom": "20.9 megapixel(s)",
    "contents": "camera, 18-135mm lens, eyecup Eb, battery pack, battery charger, wide strap, USB interface cable, CD, documentation",
    "portsconnectors": "(1) 3.5mm microphone (1) HDMI mini (1) USB 2.0",
    "category": "camera",
    "returnspolicy": "This product is subject to our return policy.  Please see our complete return policy for details.",
    "physicaldimensions": "4.1\"h x 5.5\"w x 3.1\"d",
    "attr35mmequivalentfocallengthmin": "28.8 mm",
    "opticalsensortype": "CMOS",
    "focallengthmax": "135 mm",
    "attr35mmequivalentfocallengthmax": "216 mm",
    "powernotes": "Battery: LP-E6 Lithium-Ion",
    "warrantylabor": "1 Year",
    "warrantyparts": "1 Year",
    "cameratype": "SLR camera",
    "shootingmodes": "Handheld night shot",
    "megapixels": "20.2 megapixel(s)",
    "batterytechnology": "Lithium ion",
    "displaysize": "3 in",
    "focallengthmin": "18 mm",
    "actualweight": "1.70 lb(s)",
    "opticalsensorsize": "15.0 x 22.5mm",
    "displaytechnology": "LCD"
}