{
    "features": "Large OLED screen featuring a clearer, more vivid display",
    "weight": "Approx. 138 g (4.9 oz) with battery and SD memory card",
    "isosensitivity": "ISO 125, 200, 400, 800, 1600, 3200, Auto (auto gain ISO 125-800), Fixed range auto (ISO 125-400)",
    "label18": "20 optimized scene modes",
    "effectivepixels": "16.0 million",
    "label13": "Full 1080p HD movie with stereo sound HDMI connectivity (HDMI cable available separately)",
    "label10": "3D shooting capability",
    "label11": "The COOLPIX S100 features a 3D photography mode that walks you through the process of creating composite images for realistic playback on 3D-capable TVs and computers.",
    "label16": "Smart portrait system",
    "label17": "Easy auto mode",
    "label14": "EXPEED C2 image processing engine",
    "suppliedaccessories": "Rechargeable Li-ion Battery EN-EL19, Charging ACAdapter EH-69P, USB Cable UC-E6, Audio Video Cable EG-CP16, Strap, ViewNX2installer CD",
    "category": "camera",
    "monitor": "8.7 cm (3.5-in.), approx. 820k-dot, wide-viewing angle OLED monitor with touch screen control and anti-reflection coating",
    "batterylife": "Approx. 150 shots with EN-EL19 battery",
    "description": null,
    "powersources": "Rechargeable Li-ion Battery EN-EL19 (supplied), Charging AC Adapter EH-69P (supplied), AC Adapter EH-62G (optional), Battery Charger MH-66 (optional)",
    "dimensionswxhxd": "Approx. 99.0 x 65.2 x 18.1 mm (3.9 x 2.6 x 0.8 in.) excluding projections",
    "label15": "Filter effects available for stored images",
    "label8": "Back illuminated CMOS image sensor is strong in the dark",
    "label9": "The COOLPIX S100 adopts a 16.0 megapixel CMOS image sensor featuring a back illuminated structure that increases the amount of light received by each pixel, while also performing quickly enough to deliver improved image and composite image performance.",
    "focusrangefromlens": "50 cm (1 ft 8 in.) to infinity (∞), Macro close-up mode",
    "imagesizepixels": "16M (High) [4608 x 3456★], 16M [4608 x 3456], 12M [4000 x 3000], 8M [3264 x 2448], 5M [2592 x 1944], 3M [2048 x 1536], PC [1024 x 768], VGA [640 x 480], 16",
    "label1": "Whether youÂ\u0092re headed out for a night on the town with friends or a quick weekend get-away, the COOLPIX S100 is the camera that youÂ\u0092ll want to take with you everywhere you go.",
    "label2": "The ultra-slim, ultra-chic COOLPIX S100 offers a host of features you desire in a camera that fits your social calendar. The S100Â\u0092s 16-MP CMOS sensor allows you to shoot vibrant images in low lighting conditions and its huge, high resolution 3.5-in. OLED Touch Screen makes viewing and sharing a breeze. The Nikon COOLPIX S100 is the camera to be seen with while you are making the scene.",
    "label5": "Reproducing every detail of each shot is a large 8.7 cm (3.5-in.) 820k-dot (approx.), high-definition (Full Wide VGA) OLED touch panel. OLED (organic light-emitting diode) technology does not require a backlight aseach diode provides its own light. This results in vastly higher contrast,truer blacks, and clearer color reproduction. The diodes also respond instantly to changes in current, which makes refresh rates far faster, while also eliminating afterimages. The display achieves a near-180Â° wide viewing angle.",
    "label6": "Touch control in a stylishly slim 18.1 mm design",
    "label7": "The intuitive fingertip control of this capacitive touch screen enhances the enjoyment of shooting, viewing and sharing photographs. Touch shutter releases the shutter after focus and exposure are locked on the subject with a single tap.",
    "lens": "5x zoom NIKKOR; 5.0-25.0 mm (35 mm [135] format picture angle",
    "label21": "Specifications",
    "label20": "USB charging via Charging AC adapter (supplied) or PC",
    "interface": "Hi-Speed USB",
    "storagemedia": "Internal memory (approx. 71 MB), SD/SDHC/SDXC memory card",
    "otherfeatures": null,
    "imagesensor": "1/2.3-in. type CMOS; total pixels",
    "label19": "Subject tracking",
    "vibrationreductionvr": "Combination of lens shift and electronic VR (still pictures) Lens shift (movies)",
    "optionalaccessories": "AC Adapter EH-62G, Battery Charger MH-66"
}