{
    "focus": "Normal: 1.2m~infinity",
    "powersource": "Li-ion battery NP-40",
    "category": "camera",
    "microphone": "Yes",
    "autopoweroff": "Close/ 60sec/ 180sec/ 300sec/ 600sec",
    "tvoutput": "TV : PAL/   NTSC",
    "usbport": "USB 2.0",
    "speaker": "Yes",
    "iso": "Auto , 100/   200/ 400",
    "sensor": "CMOS 1.3 Mega pixels, the max   16.0Mega pixels",
    "shippingtime": "We ship Monday â\u0080\u0093 Saturday excluding holidays. Please send us an email BEFORE your   payment if you wish to change shipping address. Standard Service takes about 18-25 business days (Except Italy, Russia,   Ukraine,Kazakhstan, East Europe, South America, which will take 30-45 days).   Please note that this service is NOT trackable. Expedited Service takes about 10-15 business days. The shipping time during Holiday Season (Christmas, Chinese New Year etc)   could be longer than usual time. Please add another 5-10 days as a delay.",
    "imageresolution": "File format: JPEG, 2M , 3M,   5M , 7M , 10M , 12M , 16M",
    "monitorscreen": "2.4 inch LCD, 4:3, available   with 270 degree rotation",
    "shippingterms": "We only ship to the   confirmed address provided by PayPal. Before you pay, please make sure your   address in PayPal matches the address you would like us to ship to. Import duties, taxes and   charges are NOT included in the item price or shipping charges. These charges   are the buyer's responsibility.",
    "lens": "F/ 3.2 , f=7.6mm",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "paymentmethod": "We only accept PayPal. It is   the only online payment method we accept. Please make sure you have a   valid/confirmed PayPal account prior bidding. All PayPal Payments must be   Confirmed (Shipping and billing addresses must match). Payment must be made within   48hrs of the auction end time.",
    "exposure": "â\u0080\u00933.0EV ï½\u009e +3.0EV",
    "memorymedia": "SD/ SDHC card (32GB Max)",
    "zoom": "16X digital zoom",
    "aboutus": "After 4 years successful   selling on eBay, we decided to start our nirvana. We are currently   specialized in Womenâ\u0080\u0099s and Kidâ\u0080\u0099s Fashion. We value each individual customer   as well as wholesale customer.Our warehouse is located in Yiwu, the largest   small commodities market in China. We offer our customers amazing savings   compared to prices offered by traditional retailers for similar or identical   products. We provide native-speaking customer service in English, French and   Chinese.",
    "shippingmethod": "Standard Service is China   post airmail, Hong Kong post airmail or Singapore post airmail. Expedited Service is China   post EMS.",
    "whitebalance": "Auto/Sunny/Cloudy/Tungsten/Fluorescent"
}