{
    "exposuremetering": "Center-weighted, Multi, Spot",
    "acpoweradapter": "AC-UD10/11 (Included)",
    "weight": "8.47 oz / 240  g with Battery & Memory Stick Duo 15 Please Note: Body Only: 7.51 oz (213 g) close",
    "battery": "NP-BX1 Rechargeable Lithium-Ion Battery Pack 14 Please Note: Power Consumption: 1.5W close",
    "isosensitivity": "Auto, 125-6400 (Extended Mode: Auto, 125-25600)",
    "height": "2.29 in.",
    "memorycardtype": "SD SDHC SDXC microSD microSDHC Memory Stick Duo Memory Stick Pro Duo Memory Stick PRO HG-Duo 10 Please Note: Memory Stick PRO Duo (High Speed), Memory Stick Micro & Memory Stick Micro (Mark2) close",
    "opticalzoom": "3.6x",
    "imagestabilization": "Optical & Digital 2 Please Note: Steady Shot: Active close",
    "maxvideoresolution": "1920 x 1080",
    "category": "camera",
    "videorecording": "Yes, NTSC/PAL 11 Please Note: AVCHD (1920 x 1080/60p/50p/60i/50i); MP4 (1440 x 1080 @ 30/25 fps); 3M VGA (640 x 480 @ 30/25 fps) close",
    "burstrate": "Up to 10 fps at 20.2 MP",
    "depth": "1.41 in.",
    "selftimer": "10 Sec, 2 Sec 6 Please Note: Self-Portrait & Self-Timer Cont. close",
    "width": "4 in.",
    "dimensionswxhxd": "4.00 x 2.29 x 1.41\" / 10.16 x 5.81 x 3.59 cm",
    "otherresolutions": "20MP: 5472 x 3648 @ 3:2 18MP: 4864 x 3648 @ 4:3 17MP: 5472 x 3648 @ 16:9 10MP: 3888 x 2592 @ 3:2 10MP: 3648 x 2736 @ 4:3 7.5MP: 3648 x 2056 @ 16:9 5.0MP: 2736 x 1824 @ 3:2 5.0MP: 2592 x 1944 @ 4:3 4.2MP: 2720 x 1528 @ 16:9 0.3MP: 640 x 480 @ 4:3",
    "sensor": "1.0\" (13.2 x 8.8 mm) CMOS 1 Please Note: Exmor Sensor with 3:2 Aspect Ratio close",
    "screen": "3.0\" LCD Rear Screen (1229000 pixels) 12 Please Note: Xtra Fine TFT Color LCD with WhiteMagic & TruBlack TechnologyAuto, manual brightness control close",
    "whitebalancemodes": "Auto, Cloudy, Custom, Daylight, Flash, Fluorescent, Fluorescent (Day White), Fluorescent (Natural White), Fluorescent (White), Incandescent, Shade 5 Please Note: C. Temp, Filter close",
    "mpn": "DSC-RX100/B",
    "brand": "Sony",
    "leftbardescstart": "DSC-RX100/B Browse Our Store Store                                                                                                                         home Point & Shoot Cameras Pro. SLR Cameras Digital Camera Lenses Camcorders Projectors GPS Navigation Home audio Blu-ray / DVD PlayersLeft Bar Desc //End !Right Bar Desc //Start !Sony Cyber-shot DSC-RX100 Digital Camera (Black) Brand New, Never Been Used 20.2MP 1\" Exmor CMOS Low-Light Sensor Carl Zeiss Vario-Sonnar T Lens Xtra Fine 3\" LCD Display with WhiteMagic Optical 3.6x Zoom & Digital 7.2x Zoom Optical & Electronic Image Stabilization Full HD 1080/60p Video Capture Ultra-Fast 0.13 Sec High-Speed AF Face Detection & 10 fps Burst Mode Record Stills Using JPEG, RAW, or Both Aluminum Body with Built-In Pop Up Flash Sony     Cyber-shot DSC-RX100 Digital Camera (Black) NP-BX1 Rechargeable Lithium-Ion Battery Pack AC Adapter (AC-UD10/11) Micro USB Cable Wrist Strap Shoulder Strap Adapter Note: This camera may be an imported model. It is completely  identical to the USA model and is produced by the same factories. This  product comes set in English as a standard, with USA connections, and  English manuals. Imported models do not carry a USA manufacturer  warranty card. Your purchase is covered by a BigValueInc store warranty  which covers you for 1 Year. Please view below in our terms and  conditions for details. Sony Cyber-shot DSC-RX100 Digital  ... SPECIFICATIONS Imaging Resolution Effective: 20.2 Megapixel, Actual Pixels: 20.9 Megapixel Sensor 1.0\" (13.2 x 8.8 mm) CMOS 1 Please Note: Exmor Sensor with 3:2 Aspect Ratio close File Formats Still Images: JPEG, RAW Movies: MPEG-4 AVCHD Max Resolution 20MP: 5472 x 3648 @ 3:2 Other Resolutions 20MP: 5472 x 3648 @ 3:2 18MP: 4864 x 3648 @ 4:3 17MP: 5472 x 3648 @ 16:9 10MP: 3888 x 2592 @ 3:2 10MP: 3648 x 2736 @ 4:3 7.5MP: 3648 x 2056 @ 16:9 5.0MP: 2736 x 1824 @ 3:2 5.0MP: 2592 x 1944 @ 4:3 4.2MP: 2720 x 1528 @ 16:9 0.3MP: 640 x 480 @ 4:3 Aspect Ratio 1:1, 3:2, 4:3, 16:9 Image Stabilization Optical & Digital 2 Please Note: Steady Shot: Active close Optics Lens 7 elements in 6 groups(35 mm equivalent: 29-105 mm)Aperture: f/1.8 (W) - 4.9 (T) 3 Please Note: Carl Zeiss Vario-Sonnar T* lens7 iris diaphragm blades close Zoom Optical: 3.6x Digital: 7.2x 4 Please Note: Digital Clear Image Zoom & Approx. Digital 20MP (14x Zoom), 10MP (20x Zoom), 5MP (28x Zoom), VGA (54x Zoom) close Focus Range Wide: 1.97\" (5 cm) - Infinity Telephoto: 21.65\" (55 cm) - Infinity Exposure Control ISO Sensitivity Auto, 125-6400 (Extended Mode: Auto, 125-25600) Shutter Type: MechanicalSpeed: 1 - 1/2000 sec Type: MechanicalSpeed: 4 - 1/2000 sec Type: MechanicalSpeed: 8 - 1/2000 sec Type: MechanicalSpeed: 30 - 1/2000 sec in Manual Mode Exposure Metering Center-weighted, Multi, Spot Exposure Modes Modes: Aperture Priority, Auto, Manual, Programmed Auto, Shutter PriorityCompensation: -3 EV to +3 EV (in 1/3 EV steps) White Balance Modes Auto, Cloudy, Custom, Daylight, Flash, Fluorescent, Fluorescent (Day White), Fluorescent (Natural White), Fluorescent (White), Incandescent, Shade 5 Please Note: C. Temp, Filter close Burst Rate Up to 10 fps at 20.2 MP Self Timer 10 Sec, 2 Sec 6 Please Note: Self-Portrait & Self-Timer Cont. close Interval Recording Yes 7 Please Note: Photo Capture from Movie close Flash Built-in Flash Yes: Auto, Fill-in, Off, Slow Sync 8 Please Note: Rear Sync close Effective Flash Range Wide: 0.98 - 56.10' (0.3 - 17.1 m) Telephoto: 1.80 - 20.67' (0.55 - 6.3 m) Wide: Up To 79.40' (24.2 m) Telephoto: Up To 29.20' (8.9 m) 9 Please Note: ISO Auto & ISO 6400 close Memory Memory Card Type SD SDHC SDXC microSD microSDHC Memory Stick Duo Memory Stick Pro Duo Memory Stick PRO HG-Duo 10 Please Note: Memory Stick PRO Duo (High Speed), Memory Stick Micro & Memory Stick Micro (Mark2) close Recording Video Recording Yes, NTSC/PAL 11 Please Note: AVCHD (1920 x 1080/60p/50p/60i/50i); MP4 (1440 x 1080 @ 30/25 fps); 3M VGA (640 x 480 @ 30/25 fps) close Video Video Clip Length Up to 29 Minutes Audio Recording With Video Viewfinder/Display Viewfinder Type LCD Display Screen 3.0\" LCD Rear Screen (1229000 pixels) 12 Please Note: Xtra Fine TFT Color LCD with WhiteMagic & TruBlack TechnologyAuto, manual brightness control close Connectivity/System Requirements Connectivity 1x HDMI D (Micro) 1x USB 2.0 1x USB 1.1 13 Please Note: USB 1.1 Port is Micro-USB close Software Requirements Not Specified By Manufacturer Power Battery NP-BX1 Rechargeable Lithium-Ion Battery Pack 14 Please Note: Power Consumption: 1.5W close AC Power Adapter AC-UD10/11 (Included) Physical Dimensions (WxHxD) 4.00 x 2.29 x 1.41\" / 10.16 x 5.81 x 3.59 cm Weight 8.47 oz / 240  g with Battery & Memory Stick Duo 15 Please Note: Body Only: 7.51 oz (213 g) close Back to Top SONDSCRX100BK TERMS AND CONDITIONS We usually ship within 1 business day after receiving payment. Please be aware                                                                                                                                         that weekends are not business days. All express methods of shipment still may require 1 day of processing time. Canadians and international buyers are responsible for all duties, customs                                                                                                                                         charges, and/or brokerage fees. We cannot ship as a gift, or claim as lower value. New Jersey buyers are responsible for applicable sales tax. We ship everything professionally in our state of the art warehouse. All products we sell are brand new and includes warranty coverage unless clearly                                                                                                                                         specified on the listing. \"Free Shipping\" applies to orders shipped within the continental                                                                                                                                         US. Domestic orders ship FedEx, UPS, and USPS. Our packages are insured and may require a signature. In accordance with PayPal                                                                                                                                         and eBay policies, we cannot reroute your package to a different address or hold                                                                                                                                         your shipment at the local hub for pick up, your order must be delivered to the                                                                                                                                         confirmed PayPal address received with your purchase. We cannot change your address                                                                                                                                         before the order ships. Please do not submit handling instructions in the notes                                                                                                                                         of your order requesting special handling, a specific courier or a change of address,                                                                                                                                         as we will be unable to meet these requests. We reserve the right to cancel any orders addressed to P.O. boxes, freight                                                                                                                                         forwarders, or resellers. We do not offer price protection if the price of an item                                                                                                                                         that you purchased. Prices do change frequently. We reserve the right to cancel orders placed without a registered eBay or                                                                                                                                         PayPal account. Orders placed by eBay guest checkout require additional verification                                                                                                                                         and may be delayed. Orders placed without a registered PayPal account cannot be                                                                                                                                         accepted and will be cancelled and refunded upon receipt. We offer a customer 30 day return privilege policy. A Return Merchandise Authorization                                                                                                                                             (RMA) number must be obtained for any return. To obtain an RMA number, please call                                                                                                                                             us toll free at 866-673-7187 . Returned packages without proper RMA demarcations will be refused by our warehouse                                                                                                                                             and returned to you. Customers who refuse a delivery, will be subject to charges                                                                                                                                             for return shipping to us. If the item was advertised as Free Shipping, then we                                                                                                                                             will charge the amount of shipping as determined by the FedEx shipping calculator. Some returns are subject to a restocking fee. The restocking percentage will depend                                                                                                                                             on the condition of the returned product. Defective products are eligible for exchange,                                                                                                                                             and no restock fee will apply. All returns must be packed with all contents which came with the original package                                                                                                                                             including, cables, software, plastic and cardboard packaging, and unregistered warranty                                                                                                                                             card. This return policy excludes Televisions and Home Theater Projectors. For further                                                                                                                                             questions please call us toll free at 866-673-7187 . You can also                                                                                                                                             contact us using the contact form found here . Return shipping costs are not reimbursable. International Customers: All electronic products are packaged for sale in the US with US Voltage. View International Policies Back to Top CONTACT INFO AND STORE HOURS ANY QUESTIONS? CALL US TOLL FREE: +1-866-673-7187 STORE HOURS: Monday - Friday 10:00AM to 3:00PM EST Email us anytime! Back to TopRight Bar Desc //End !",
    "softwarerequirements": "Not Specified By Manufacturer",
    "lens": "7 elements in 6 groups(35 mm equivalent: 29-105 mm)Aperture: f/1.8 (W) - 4.9 (T) 3 Please Note: Carl Zeiss Vario-Sonnar T* lens7 iris diaphragm blades close",
    "connectivity": "1x HDMI D (Micro) 1x USB 2.0 1x USB 1.1 13 Please Note: USB 1.1 Port is Micro-USB close",
    "focusrange": "Wide: 1.97\" (5 cm) - Infinity Telephoto: 21.65\" (55 cm) - Infinity",
    "maxresolution": "20MP: 5472 x 3648 @ 3:2",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "aspectratio": "1:1, 3:2, 4:3, 16:9",
    "fileformats": "Still Images: JPEG, RAW Movies: MPEG-4 AVCHD",
    "intervalrecording": "Yes 7 Please Note: Photo Capture from Movie close",
    "sensortype": "CMOS",
    "focusadjustment": "Autofocus & Manual Focus",
    "displaytype": "LCD",
    "builtinflash": "Yes: Auto, Fill-in, Off, Slow Sync 8 Please Note: Rear Sync close",
    "cameratype": "Point & Shoot",
    "exposuremodes": "Modes: Aperture Priority, Auto, Manual, Programmed Auto, Shutter PriorityCompensation: -3 EV to +3 EV (in 1/3 EV steps)",
    "zoom": "Optical: 3.6x Digital: 7.2x 4 Please Note: Digital Clear Image Zoom & Approx. Digital 20MP (14x Zoom), 10MP (20x Zoom), 5MP (28x Zoom), VGA (54x Zoom) close",
    "displaysize": "3\"",
    "audiorecording": "With Video",
    "shutter": "Type: MechanicalSpeed: 1 - 1/2000 sec Type: MechanicalSpeed: 4 - 1/2000 sec Type: MechanicalSpeed: 8 - 1/2000 sec Type: MechanicalSpeed: 30 - 1/2000 sec in Manual Mode",
    "digitalzoom": "14x",
    "sensorresolution": "20.2 MP",
    "viewfindertype": "LCD Display",
    "effectiveflashrange": "Wide: 0.98 - 56.10' (0.3 - 17.1 m) Telephoto: 1.80 - 20.67' (0.55 - 6.3 m) Wide: Up To 79.40' (24.2 m) Telephoto: Up To 29.20' (8.9 m) 9 Please Note: ISO Auto & ISO 6400 close",
    "videocliplength": "Up to 29 Minutes",
    "supportedflashmemory": "Memory Stick Duo, Memory Stick PRO Duo, Memory Stick PRO Duo High Speed, Memory Stick PRO-HG Duo, SD Memory Card, SDHC Memory Card, SDXC Card, SDXC Memory Card",
    "model": "DSC-RX100",
    "resolution": "Effective: 20.2 Megapixel, Actual Pixels: 20.9 Megapixel",
    "screensize": "3\""
}