{
    "itemid": "RIDGRB",
    "externalflashconnection": "Hot Shoe",
    "features": "No",
    "weight": "8.6 oz / 244  g with battery and card",
    "battery": "1x   DB-65 Rechargeable Lithium-Ion   Battery Pack",
    "isosensitivity": "Auto, 100-25600   (High Sensitivity Mode: Auto, )",
    "condition": "New",
    "memorycardtype": "SD SDHC SDXC",
    "stillimagespergb": "JPEG : 39 @   Highest Resolution - 1820 @ Lowest   Resolution",
    "colorspaces": "sRGB, Adobe RGB",
    "flashmodes": "Auto Auto/Red-eye Reduction Flash On Flash On w/ Red-eye Reduction Manual Slow Sync Slow Sync./Red-eye Reduction",
    "softwarerequirements": "Windows: XP (SP3),   Vista, 7, 8 Mac: OS X 10.5 or later",
    "attr1star": "2 stars3 stars4 stars5 stars",
    "videorecording": "Yes, NTSC/PAL",
    "burstrate": "Up to 4 fps at 16 MP",
    "operatingstoragetemperature": "Operating 32 to 104°F (0 to 40°C)",
    "fileformats": "Still Images: JPEG, RAW Movies: AVI, MPEG-4 AVC/H.264 Audio: Linear PCM (Mono), WAV",
    "specifications": "Imaging Pixels Actual: 16.9   Megapixel Effective: 16.2 Megapixel Sensor APS-C CMOS Bit Depth 12-bit File Formats Still Images: JPEG, RAW Movies: AVI, MPEG-4 AVC/H.264 Audio: Linear PCM (Mono), WAV Max Resolution 16MP: 4928 x 3264 @   3:2 Other Resolutions 16MP: 4352 x 3264 @   4:3 16MP: 3264 x 3264 @ 1:1 10MP: 3936 x 2608 @ 3:2 10MP: 3488 x 2608 @ 4:3 10MP: 2608 x 2608 @ 1:1 5MP: 2912 x 1936 @ 3:2 5MP: 2592 x 1936 @ 4:3 5MP: 1936 x 1936 @ 1:1 1MP: 1280 x 864 @ 3:2 1MP: 1152 x 864 @ 4:3 1MP: 864 x 864 @ 1:1 Aspect Ratio 1:1, 3:2, 4:3 Image Stabilization None Color Spaces sRGB, Adobe RGB Optics Lens 7 elements in 5   groups 2 Aspheric EFL: 18.3 mm (35 mm equivalent: 28   mm) Aperture: f/2.8 to f/16 Filter Thread 43 mm Zoom None Focus Range Normal: 11.76\"   (29.87 cm) - Infinity Macro: 3.9\" (9.91 cm) - Infinity Exposure Control ISO Sensitivity Auto, 100-25600   (High Sensitivity Mode: Auto, ) Shutter Type: Electronic &   Mechanical Speed: 30 - 1/4000 sec Exposure Metering Center-weighted,   Multi, Spot Exposure Modes Modes: Aperture   Priority, Auto, Bulb, Manual, Movie,   My Settings, Programmed Auto,   Shutter Priority, Shutter/Aperture   Priority, Time Metering Range: EV 1.8 - EV 17.7 Compensation: -4 EV to +4 EV (in 1/3   EV steps) Shooting Modes Bleach-Bypass Cross-Process High Contrast B&W High-Key Miniature Effect Monochrome Positive Film Retro White Balance Modes Auto, Cloudy,   Daylight, Incandescent, Manual,   Shade Burst Rate Up to 4 fps at 16 MP Interval Recording Yes Flash Flash Modes Auto Auto/Red-eye Reduction Flash On Flash On w/ Red-eye Reduction Manual Slow Sync Slow Sync./Red-eye Reduction Built-in Flash Yes Effective Flash   Range 3.3 - 9.8' (1.01 -   2.99 m) External Flash   Connection Hot Shoe Memory Built-in Memory 54MB Memory Card Type SD SDHC SDXC Still Images per GB JPEG : 39 @   Highest Resolution - 1820 @ Lowest   Resolution Recording Video Recording Yes, NTSC/PAL Resolution 1920 x 1080: 24 fps,   25 fps, 30 fps 1280 x 720: 24 fps, 25 fps, 30 fps,   50 fps, 60 fps 640 x 480: 30 fps Video Video Clip Length Up to 4GB or   25 Minute Audio Recording With Video, Stereo Viewfinder / Display Screen 3.0\" LCD Rear   Screen (1,230,000 pixels) Connectivity /   System Requirements Connectivity AV Output HDMI D (Micro) USB 2.0 Wi-Fi None Software   Requirements Windows: XP (SP3),   Vista, 7, 8 Mac: OS X 10.5 or later Environmental Operating/Storage   Temperature Operating 32 to 104°F (0 to 40°C) Waterproofing None Power Battery 1x   DB-65 Rechargeable Lithium-Ion   Battery Pack AC Power Adapter AC-U1 (Included) Physical Dimensions (WxHxD) 4.6 x 2.4 x   1.4\" / 11.7 x 6.1 x 3.6 cm Weight 8.6 oz / 244  g with battery and card Overview 16 MP APS-C CMOS Image Sensor The GR's 16.2MP APS-C CMOS image sensor offers low-noise     characteristics even at high ISO, super-high resolution imaging quality,     color accuracy and a wide dynamic range. GR ENGINE V Image Processor The advanced GR ENGINE V imaging engine offers high-sensitivity     shooting with minimal noise and fast response times, including fast     autofocus and up to 4 fps continuous shooting. No Optical Low-Pass Filter The omission of the low-pass filter in the sensor design enables     particularly sharp details and color-rich images. To balance for lack of     the Optical Low-Pass filter, a chromatic moiré compensation function is     added to minimize wavy moiré patterns and distortion in certain images. 18.3mm f/2.8 Lens (28mm Equivalency in 35mm Format) The GR's fixed wide angle 18.3mm f/2.8 GR lens, equivalent to 28mm     in the 35mm format, provides high resolution images with edge-to-edge     sharpness and low distortion. The seven element lens design includes two     aspherical elements to minimize chromatic aberrations. With its newly     designed nine blade diaphragm, the GR lens produces a natural bokeh     effect at larger apertures. 3.0\" 1,230k-dot LCD Screen with WhiteMagic Technology Featuring Sony WhiteMagic technology which adds white pixels to the     standard RGB colors to improve image brightness and visibility, the rear     3.0\" LCD provides composition and playback viewing. Optional Optical Viewfinders Two optical viewfinders are available (both sold separately) to     enhance composition capability and stability. The GV-2 28mm mini     viewfinder and the GV-1 21/28mm viewfinder both attach to the camera's     hot shoe mount. Full HD 1080p Video Recording Capture Full HD video in widescreen 1080p resolution (1920 x 1080)     with efficient, high quality h.264 compression at 30 fps. Continuous     Autofocus remains active with movement as the camera stays focused on     moving subjects in the center of its angle of view. ISO 100-25600 Supported by its APS-C sensor and the advanced GR V imaging engine,     the GR offers high sensitivity shooting from ISO 100 to ISO 25600 with     minimal noise. High Speed Autofocus System with 4 fps Continuous Shooting The high speed autofocus system captures crisp subjects in a mere     0.2 seconds, and start-up time is only one second. The GR's AF     Continuous Shooting function captures a series of photos at a maximum     speed of four frames per second, allowing capture of fast-moving     subjects in sharp focus. Designated AF & Aperture Preview Buttons An AF (autofocus) button is accessible with the thumb on the back     panel. When the AF lever is set to the Continuous AF (C-AF) mode, you     can capture a series of images of a moving subject - all in sharp focus     - by pushing the shutter release button while depressing the AF button.     An aperture preview button is on the camera's side panel for quick     confirmation of the depth of field before shooting. JPG or DNG RAW Capture Capture both JPG and open-standard DNG RAW images. The GR offers a     variety of computer-free image processing functions, including in-body     RAW-data development to output JPEG format files. Manual and Automatic Modes You can set the GR to shoot on fully automatic mode, allowing the     camera to determine the optimal settings for each shot or shoot in     manual, controlling all settings to you exact needs. Aperture-priority     and Shutter-priority modes as well as custom My Settings mode are     available also. Shutter Speed/Aperture Priority Mode The GR features the original Shutter speed / Aperture Priority (TAv)     exposure mode, featured only in PENTAX/RICOH-brand digital SLR cameras.     This innovative mode automatically sets the optimum ISO sensitivity     based on the shutter speed and aperture selected by the photographer. Built-in Flash and Hot Shoe Mount The GR offers a convenient built-in pop-up flash unit with several     flash modes, a Guide Number of 5.4 (at ISO 100) and an effective range     of 3.3 - 9.8'. In addition a TTL-A (TTL with pre-flash) hot shoe mount     for an external flash is provided. The maximum sync speed for an     external flash is 1/400 seconds. Neutral Density Filter For further exposure control the GR incorporates an ND filter in     both manual and automatic modes. Image Effects The Image Effect modes allow the user to add a variety of visual     effects to create distinctive expressions without the need for a     computer. The direct-access Effect button positioned on the camera's     side panel makes selection of one of the nine image effects easy.     Effects include: B&W, B&W (Toning Effect), High Contrast B&W,     Cross-Process, Positive Film, Bleach-Bypass, Retro, Miniaturize,     High-Key. Macro Mode Macro mode allows you to capture the details with sharp close-up     imaging. Minimum focus distance in macro Mode is 3.9\". 35mm Crop Mode For that classic 35mm look, use the specialized crop mode to     instantly set a 35mm frame ratio crop. Durable Compact Design Despite its large image sensor, the GR has a compact and portable     design. Its casing is made of a lightweight magnesium alloy, while its     exterior design retains the style typical of the GR series. Designed for     maximum comfort and operational ease, all control buttons are laid out     for easy access with the right hand. Dual-axis Electronic Level For high precision horizontal and vertical alignment, use the     electronic dual-axis level to make sure your shot is perfectly aligned     with the horizon or framed just the way you want it. Eye-Fi Card Compatible With Eye-Fi wireless LAN SD memory cards, the user can automatically     transmit recorded images to a smartphone, and even select favorite     images and resize them before transmission. In the playback mode, the     user can also recall the transmitted images on the monitor using the     Effect button on the side panel. Languages Supported GRs shipped outside of Asia or Japan will include: English, French,     German, Spanish, Portuguese, Italian, Dutch, Danish, Swedish, Finnish,     Polish, Czech, Hungarian, Turkish, Greek and Russian.",
    "builtinmemory": "54MB",
    "dimensionswxhxd": "4.6 x 2.4 x   1.4\" / 11.7 x 6.1 x 3.6 cm",
    "otherresolutions": "16MP: 4352 x 3264 @   4:3 16MP: 3264 x 3264 @ 1:1 10MP: 3936 x 2608 @ 3:2 10MP: 3488 x 2608 @ 4:3 10MP: 2608 x 2608 @ 1:1 5MP: 2912 x 1936 @ 3:2 5MP: 2592 x 1936 @ 4:3 5MP: 1936 x 1936 @ 1:1 1MP: 1280 x 864 @ 3:2 1MP: 1152 x 864 @ 4:3 1MP: 864 x 864 @ 1:1",
    "sensor": "APS-C CMOS",
    "screen": "3.0\" LCD Rear   Screen (1,230,000 pixels)",
    "whitebalancemodes": "Auto, Cloudy,   Daylight, Incandescent, Manual,   Shade",
    "category": "camera",
    "freeshipping": "Yes",
    "brand": "Ricoh",
    "filterthread": "43 mm",
    "lens": "7 elements in 5   groups 2 Aspheric EFL: 18.3 mm (35 mm equivalent: 28   mm) Aperture: f/2.8 to f/16",
    "connectivity": "AV Output HDMI D (Micro) USB 2.0",
    "focusrange": "Normal: 11.76\"   (29.87 cm) - Infinity Macro: 3.9\" (9.91 cm) - Infinity",
    "included": "Ricoh GR Digital Camera 16.2MP, 3.0\" 1,230k-dot White Magic LCD Screen (Black) DB-65 Li-Ion Rechargeable Battery USB Power Adapter AC-U1 USB Cable Hand Strap Hot Shoe Cover Limited Ricoh 1-year Warranty",
    "bitdepth": "12-bit",
    "aspectratio": "1:1, 3:2, 4:3",
    "pixels": "Actual: 16.9   Megapixel Effective: 16.2 Megapixel",
    "acpoweradapter": "AC-U1 (Included)",
    "intervalrecording": "Yes",
    "imagestabilization": "None",
    "waterproofing": "None",
    "builtinflash": "Yes",
    "wifi": "None",
    "exposuremodes": "Modes: Aperture   Priority, Auto, Bulb, Manual, Movie,   My Settings, Programmed Auto,   Shutter Priority, Shutter/Aperture   Priority, Time Metering Range: EV 1.8 - EV 17.7 Compensation: -4 EV to +4 EV (in 1/3   EV steps)",
    "zoom": "None",
    "audiorecording": "With Video, Stereo",
    "shutter": "Type: Electronic &   Mechanical Speed: 30 - 1/4000 sec",
    "shootingmodes": "Bleach-Bypass Cross-Process High Contrast B&W High-Key Miniature Effect Monochrome Positive Film Retro",
    "effectiveflashrange": "3.3 - 9.8' (1.01 -   2.99 m)",
    "videocliplength": "Up to 4GB or   25 Minute",
    "maxresolution": "16MP: 4928 x 3264 @   3:2",
    "exposuremetering": "Center-weighted,   Multi, Spot",
    "resolution": "1920 x 1080: 24 fps,   25 fps, 30 fps 1280 x 720: 24 fps, 25 fps, 30 fps,   50 fps, 60 fps 640 x 480: 30 fps"
}