{
    "autobracketing": "Available",
    "features": "Innovative new features for trekking and nature observation Sophisticated GPS function records your position data during travelling, in order to show your friends and family where pictures were taken, on such websites as Google EarthTM or FlickrR. Electronic compass Barometer (information on the front display) Date Imprint Available (Date, Date & time, Time) World Time Macro light Changing folder name Electronic level Others: Noise reduction automatically applied when the shutter speed is slower than 0.25 sec Digital Shake Reduction system Eye-Fi cards compatible Dynamic Range: Shadow/ Highlight adjustment Waterproof/Dustproof Equ. to JIS Class 8 waterproof and JIS Class 6 dustproof capabilities Waterproof (Up to 14m(45ft) for 2hours), Shock proof (Up to 2.0m (6.5ft)) Operating Temperature -10° to 40°",
    "weight": "216g (unloaded) 236g (with battery & SD card)",
    "sensitivity": "Auto, Manual (ISO 125 - 6400) Auto ISO range: ISO 125-200, ISO 125-400, ISO 125-800, ISO 125-1600, ISO 125-3200, ISO 125-6400 Fixed at ISO 125-1600 in Green mode. Fixed at ISO 125-200, 125-400, 125-400, 125-1600 in Handheld Night Snap mode. Fixed at ISO 125-6400 in Report mode.",
    "metering": "Multi-segment metering, Centre-weighted metering, Spot AE metering",
    "height": "6.45 cm",
    "effectivepixels": "Approx. 16.0 megapixels",
    "includedsoftware": "PC: MediaImpression 3.6.2 LE  Mac: MediaImpression 2.2 LE",
    "still": "16M(4608x3456), 12M(1:1)(3456x3456), 12M(16:9)(4608x2592), 7M(3072x2304), 5M(16:9)(3072x1728), 5M(2592x1944), 4M(16:9)(2592x1464), 3M(2048x1536), 2M(16:9)(1920x1080), 1024(1024x768), 640(640 x 480) (Unit:pixels) 3 Quality levels (Excellent, very good, good)",
    "speed": "1/4000  - 1/4sec (Mechanical and electronic shutter)                             1/2000- 4sec (Night Scene mode setting)",
    "category": "camera",
    "effectiverange": "Wide: approx. 0.2 - 10.4 m (ISO Auto) Tele: approx. 0.2 - 4.2 m (ISO Auto)",
    "functions": "Infinity-landscape, Pan Focus, Manual Focus 9-point AF, Spot AF, Auto tracking AF (anticipating moving subject)",
    "facerecognition": "Face detection AF&AE available for all modes up to 32 faces, Smile Capture, Self-portrait Assist, Self-portrait Assist + Smile Capture, Blink Detection Pet detection: detects up to 1 pet’s face (auto)",
    "width": "12.5 cm",
    "shutterreleasedelay": "Approx. 0.016 sec",
    "movie": "Full HD 1920 (1920x1080) : approx. 30fps, HD 1280 (1280x720), approx. 60/30fps, Quality: level Fixed Shake reduction: Movie SR mode",
    "digitalfilter": "B&W/Sepia, Toy Camera, Retro, Color, Extract Color, Color Emphasis, High Contrast, Starbust, Soft, Fish-eye, Brightness, Miniature Filter",
    "digitalzoom": "approx. 7.2x Intelligent zoom: approx. 6x at 7M and 28.8 x at 640 (including optical zoom)",
    "delay": "Start-up time: approx. 1.8 sec",
    "pc": "Windows XP SP3, Windows Vista and 7 and 8",
    "internal": "approx. 70 MB",
    "releasefunction": "Approx. 0.016 sec",
    "totalpixels": "Total 16.79 MP",
    "aperture": "Aperture: F2.0(W) - F4.9(T) Smallest aperture: F11.3(W)-F18.5(T)",
    "performance": "Still: Approx. 240 shots Playback: Approx. 200 min Approx. 65 min in movie mode Recording capacity shows approximate number of shots recorded during CIPA-compliant testing. Actual performance may vary depending on operating conditions. According to the result of PENTAX RICOH IMAGING in-house testing.",
    "type": "Integrated auto flash control",
    "playback": "Slideshow, Image Rotation, Small Face Filter, Ink Rubbing Filter, Collage, Digital Filter (B&W/Sepia, Toy Camera, Retro, Color, Extract Color, Color Emphasis, High Contrast, Starburst, Soft, Fish-eye, Brightness, Miniature), HDR Filter, Original Frame, Movie Edit, Red-eye Edit, Resize, Cropping, Image Copy, Protect, DPOF, Start-up Screen",
    "depth": "3.2 cm",
    "focallength": "4.5 - 18mm, approx. 25 - 100mm in 35mm",
    "afassist": "AF assist lamp Special Macrolight (6 LED at front to assist close-up shooting)",
    "mac": "Mac: OS X 10.4 or above",
    "construction": "RICOH lens, 9 elements in 7 groups (4 aspherical elements)",
    "external": "SD, SDHC and SDXC memory cards Compatible with Eye-Fi wireless memory cards",
    "shakereduction": "Sensor-Shift-Type (SR : Shake Reduction), Dual (SR & Pixel Track SR), High-sensitivity anti-shake mode (Digital SR) Auto ISO range for SR: ISO 125-6400 Motion blur reduction Pixel Track SR, Hi-sensitivity anti-shake mode (Digital SR)",
    "interface": "Video output (NTSC/PAL) USB 2.0 (Hi-Speed), USB/AV terminal, HDMI terminal (Type D) (Micro) port",
    "fileformat": "Photo format : JPEG (Exif 2.3), DCF 2.0, DPOF, PRINT Image Matching III Video format : MPEG-4 AVC/H.264 Audio : Movie/Underwater, Movie/Time-Lapse, Movie/1cm- Macro Movie, 32KHz, 16bit Stereo High Speed Movie: 8 KHz, 16 bit, stereo",
    "editing": "Save as still image, Divide movies, Adding title picture",
    "modes": "Drives modes: One shot, Self-timer (10 sec, 2 sec, Remote Control (immediately, 3 sec)), Continuous Shooting, Burst Shooting, Remote Control, Auto Bracketing Image Tone: Bright, Natural, Monochrome,  Remote control compatible, receivers located in the front and back of the camera",
    "language": "English, French, German, Spanish, Portuguese, Italian, Dutch, Danish, Swedish, Finnish, Polish, Czech, Hungarian, Turkish, Greek, Russian",
    "cameratype": "Waterproof, dust, sand, crash, cold, pressure proof digital compact",
    "exposuremodes": "Exposure Modes: Auto Picture, Program, Shutter Priority, USER, HDR, Handheld Night Snap, Movie, Digital Microscope, Landscape, Flower, Portrait, Interval Shot, Underwater, Underwater Movie, Interval Movie, High Speed movie, Time-Lapse movie, 1cm-Macro Movie, Digital SR, Surf & Snow, Kids, Pet, Sport, Night Scene, Night Scene Portrait, Fireworks, Food, Report, Green Auto picture Scene Modes: Landscape, Portrait, Night Scene, Night Scene Portrait, Standard, Flower, Sport, Candlelight, Blue Sky, Sunset, Text, Group Photo, Pet, Portrait & Blue Sky, Portrait & Sunset, Portrait & Backlight",
    "opticalzoom": "4x",
    "whitebalance": "Auto, Daylight, Shade, Tungsten light, Fluorescent light (D:Daylight Color, N:Daylight White, W:White Light), Manual",
    "recording": "Sound : Yes Movie : Movie shake reduction Mode (Movie SR) Duration : Depends on memory card capacity Resolution : Full HD 1920 (1920x1080), approx. 30fps HD 1280 (1280x720), approx. 60/30fps Recorded pixels is fixed to 1280(1280x720), and frame rate is fixed to 120fps for shooting, 30fps for  playback  in High Speed Movie mode. Recorded pixels is fixed to 640(640x360), and frame rate is fixed to 15fps for shooting, 240fps for playback  in Time-Lapse Movie mode. Still Picture Saving during Movie Recording (up to three still pictures per each continuous movie recording, with the focus fixed at the start of recording and the number of recorded pixels fixed to 12M(16:9). The angle of view may change, depending on the number of recorded pixels for movies. The image may be distorted, depending on recording conditions.)",
    "kitcontent": "Rechargeable lithium-ion battery D-LI92 Power adapter D-PA135 USB cable I-USB7 Carabiner strap O-ST144 (for black and silver WG-4/GPS) Carabiner strap O-ST145 (for blue and lime yellow WG-4/GPS) Macro stand O-MS2 Software (CD-ROM) S-SW145",
    "compensation": "±2EV (1/3EV steps)",
    "source": "Rechargeable D-LI92 Lithium-Ion battery Optional AC adapter available",
    "resolution": "approx. 460k dots",
    "options": "Playback modes: Slideshow, Image Rotation, Small Face Filter, Ink Rubbing Filter, Collage, Digital Filter(B&W/Sepica, Toy Camera, Retro, Color, Extract Color, Color Emphasis, High Contrast, Starburst, Soft, Fish-eye, Brightness, Miniature), HDR Filter, Original Frame, Movie Edit, Red-eye Edit, Resize, Cropping, Image Copy, Protect, DPOF, Start-up Screen Playback functions: One Shot, Index (6 thumbnails, 12 thumbnails), Enlargement (up to 10x, scroll available), Movie Playback, Histogram, Folder display, Select&Delete, Calendar, Changing Folder name"
}