{
    "ethernettechnology": "Fast Ethernet",
    "additionalinformation": "standard Box-type Camera Allows For Flexible Installation mounts in a Standard Outdoor or Indoor Enclosure audio Input/output For External Microphone And/or Speaker io Ports Facilitates Alarm Triggers, Turn On/off of Lights, Etc dual Codec (mpeg-4 And Mjpeg) Supported Simultaneously ip Multicast Support rtsp Video/audio Streaming to Unicast And Multicast Clients 4x Digital Zoom - Can Also Use Optical Zoom With Appropriate Interchangeable Lens sends High-quality Live Video to Your Network Wirelessly low-light Sensitivity simultaneous Dual Codecs Make an Optimal Combination of Video Viewing And Storage",
    "height": "4.72\"",
    "connectivitytechnology": "WiredWireless",
    "producttype": "Surveillance/network Camera",
    "illumination": "0.4lux - F1.7",
    "serial": "Yes",
    "securityfeatures": "wep/wpa user List username/password kensington Lock",
    "wirelesstechnology": "Wi-fi",
    "availability": "Checking Inventory...",
    "category": "camera",
    "dimensions": "4.72\" x 3\" x 1.81\"",
    "networkrj45": "Yes",
    "digitalzoom": "4x",
    "colorsupported": "Color",
    "width": "3\"",
    "weightapproximate": "1.15 lb",
    "maximumvideoresolution": "640 x 480",
    "manufacturerpartnumber": "Wvc2300",
    "interfacesports": "1 x 3.5mm Speaker1 x Rs-485 Serial1 x Microphone1 X Dc Power Input1 X Rj-45 10/100base-tx",
    "upc": "745883579617",
    "manufacturerwebsiteaddress": "Www.cisco.com",
    "brandname": "Cisco",
    "ethernet": "Yes",
    "compatibility": "ntsc pal",
    "protocols": "DhcpDnsFtpHttpSmtpTcp/ipDdnsNtpRtpRtspUpnp",
    "manufacturer": "Cisco Systems, Inc",
    "sensortype": "Ccd",
    "yourprice": "Select an option",
    "imagesensortype": "Ccd",
    "productmodel": "Wvc2300",
    "videoresolution": "320 x 240 @ 30 Fps640 X 480 @ 30 Fps160 X 120 @ 30 Fps",
    "colorsupport": "Color",
    "platformsupport": "PC",
    "productname": "Wvc2300 Wireless-g Business Internet Video Camera",
    "depth": "1.81\"",
    "systemrequirements": "wired Ethernet or Wireless 802.11b/802.11g Network network Adapter With Ethernet Network Cable And Tcp/ip Protocol Installed Per PC switch/router To Support Multiple Connection Points explorer 5.x or Above With Activex Support For Viewing microsoft Windows Vista, Xp, 2000, Me or 98se 2 Ghz Pentium 4, or Amd Athlon Class Cpu With 512 MB Ram 128 MB Agp Video Adapter",
    "packagecontents": "wvc2300 Wireless-g Business Internet Video Camera stand Kit 2 x Antennas power Supply (12v 1a) 6ft Ethernet Cable cs-mount Lens Adapter Ring For Wider Focal Length Lens allen Wrench quick Installation Guide setup CD",
    "inputvoltage": "12 V Dc",
    "platformsupported": "PC",
    "marketinginformation": "linksys Business Series Surveillance Products Provide Customizable Ways For Small Business Owners to Monitor And Protect Their Companies. These High-quality Solutions Can be Optimized For Many Different Applications And Sites. Each Camera Can be Quickly Mounted Utilizing The Bracket Included in The Package. Its Compact Form Factor Also Enables The Camera to be Put Inside a Protective Enclosure For Interior or Exterior Installations. The Camera Uses Removable Cs-mount Lenses And Can be Customized With Optional Zoom, Wide-angle, Vari-focal, Auto-iris, or Other Type of Lenses as Required For a Specific Application or Setting. the Wvc2300 Camera Can be Mounted on Any Pan-tilt (pt) Base That Supports The Pelco_d Protocol And Can be Remotely Rotated And Controlled Through an Rs-485 Interface. The Wvc2300 Also Has Two Input And Two Output Ports Which Can be Used For Connecting The Camera to an Alarm Panel, Siren, Passive Infrared (pir) Sensors, Smoke Detectors, Lighting Switch (on/off), Door Sensors, Etc. the Wvc2300 Uses a High-quality Progressive Scan Ccd Sensor Delivering Good Quality Video. The Ccd Sensor Also Has Low-light Sensitivity so Video Can be Captured Even in Very Low Light Environments or During 'near Dark' Times of Day. Additionally, The Camera Incorporates an IR Cut Filter Which, When Used With a Separate IR Lamp, Allows For Video Capture in Total Darkness."
}