{
    "warranty": "1 Year Fujifilm Malaysia Warranty *",
    "autobracketing": "AE Bracketing (±1/3EV, ±2/3EV, ±1EV) Film Simulation Bracketing (Any 3 types of film simulation selectable) Dynamic Range Bracketing (100% · 200% · 400%) ISO sensitivity Bracketing (±1/3EV, ±2/3EV, ±1EV) White Balance Bracketing (±1, ±2, ±3)",
    "exposurecontrol": "TTL 256-zone metering, Multi / Spot / Average",
    "weight": "Approx. 440g / 15.52 oz (including battery and memory card) Approx. 390g / 13.75 oz (excluding accessories, battery and memory card)",
    "exposuremode": "Programmed AE / Shutter Speed priority AE / Aperture priority AE / Manual exposure",
    "intervaltimershooting": "Yes (Setting: Interval, Number of shots, Starting time)",
    "powersupply": "NP-W126 Li-ion battery (included)",
    "otherphotographyfunctions": "Auto Red-eye Removal, Setting (Color,  Sharpness, D-range, Gradation), Select custom setting, Motion panorama,  Color space, Framing guideline, Frame No. memory, Histogram display,  Preview depth of focus, Pre-AF, Focus check, Focus Peak Highlight,  Digital Split Image, Electronic level, Multiple exposure, Release  priority / Focus priority selection, Fn button setting (RAW, Movie,  etc.), ISO AUTO control, Instant AF setting (AF-S / AF-C)",
    "wirelessfunction": "Geotagging, Wireless communication (Image transfer), View & Obtain Images, Remote camera shooting, PC Autosave",
    "exposurecompensation": "-3.0EV - +3.0EV, 1/3EV step (movie recording: -2.0EV - +2.0EV)",
    "wirelesstransmitter": "Standard IEEE 802.11b / g / n (standard wireless protocol) Access mode Infrastructure",
    "filmsimulationmode": "10 type (PROVIA/STANDARD, Velvia/VIVID,  ASTIA/SOFT, PRO Neg Hi, PRO Neg. Std, MONOCHROME, MONOCHROME+Ye FILTER,  MONOCHROME+R FILTER, MONOCHROME+G FILTER, SEPIA)",
    "category": "camera",
    "selftimer": "10 sec. / 2 sec. Delay",
    "otherfunctions": "PictBridge, Exif Print, Language selection, Time difference, High Performance mode, Silent mode",
    "continuousshooting": "Approx. 8.0 fps (JPEG: max. approx. 47 frames) Approx. 3.0 fps (JPEG: up to the capacity of the card)",
    "facedetection": "Yes",
    "playbackfunctions": "RAW conversion, Image rotate, Red-eye  reduction, Photobook assist, Erase selected frames, Image search,  Multi-frame playback (with micro thumbnail), Slide show, Mark for  upload, Protect, Crop, Resize, Panorama, Favorites",
    "advancedfilter": "Toy camera / Miniature / Pop color /  High-key / Low-key / Dynamic tone / Soft focus / Partial color (Red /  Orange / Yellow / Green / Blue / Purple)",
    "flash": "External flash EF-X8 (included) (Super Intelligent Flash) Guide number: approx. 8 (ISO100 · m) / approx. 11 (ISO200 · m)",
    "terminal": "Digital interface USB 2.0 High-Speed / micro USB terminal HDMI output HDMI mini connector (Type C) Others Microphone / shutter release input: °2.5mm, stereo mini connector",
    "dimensionswxhxd": "129 x 89.8 x 46.7mm / 5.07 x 3.53 x 1.83\" (Minimum depth: 33.4mm / 1.31\")",
    "movierecording": "Full HD 1920 x 1080 60p / 30p, Continuous recording: up to approx. 14 min. HD 1280 x 720 60p / 30p, Continuous recording: up to approx. 27 min.",
    "brand": "FujiFilm",
    "numberofeffectivepixels": "16.3 million pixels",
    "hotshoe": "Yes (Dedicated TTL Flash compatible)",
    "price": "(RM4,988.00) RM4,398.00",
    "dynamicrangesetting": "AUTO (100-400%), 100%, 200%, 400%",
    "focus": "mode Single AF / Continuous AF / MF Distance Indicator type Intelligent Hybrid AF (TTL contrast AF / TTL phase detection AF), AF assist illuminator available AF frame selection Area (EVF / LCD: 49 areas with 7 x 7) / Multi",
    "startingupperiod": "Approx. 0.5 sec., when High Performance mode set to ON Approx. 1.0 sec., when High Performance mode set to OFF",
    "batterylifeforstillimages": "Approx. 350 frames (When XF35mmF1.4 R is set, LCD monitor / viewfinder on and supplied flash EF-X8 not attached)",
    "numberofrecordedpixels": "L: (3:2) 4896 x 3264 / (16:9) 4896 x 2760 / (1:1) 3264 x 3264 M: (3:2) 3456 x 2304 / (16:9) 3456 x 1944 / (1:1) 2304 x 2304 S: (3:2) 2496 x 1664 / (16:9) 2496 x 1408 / (1:1) 1664 x 1664 L: Vertical: 2160 x 9600 / Horizontal: 9600 x 1440 M: Vertical: 2160 x 6400 / Horizontal: 6400 x 1440",
    "sensitivity": "AUTO (Control available up to ISO 6400) Equivalent to ISO 200 - 6400 (Standard Output Sensitivity) Extended output sensitivity: Equivalent ISO 100, 12800, 25600 and 51200",
    "storagemedia": "SD memory card / SDHC memory card / SDXC (UHS-II) memory card",
    "lcdmonitor": "3.0-inch, aspect ratio 3:2, approx. 1,040K-dot, Tilt type color LCD monitor (approx. 100% coverage)",
    "shutterspeed": "(P mode) 1/4 sec. to 1/4000 sec., (All other modes) 30 sec. to 1/4000 sec. Bulb (max. 60 min.) Time 1/2 to 30 sec. Synchronized shutter speed for flash: 1/180 sec. or slower",
    "pricematch": "Found Cheaper Price Elsewhere? Inform us and we will try BEAT the PRICE and make you HAPPIER :) !",
    "shuttertype": "Focal Plane Shutter",
    "operatingtemperature": "-10deg.C - +40deg.C",
    "operatinghumidity": "10 - 80% (no condensation)",
    "flashmodes": "Activated when external flash is connected Red-eye removal OFF Auto / Forced Flash / Slow Synchro / Suppressed Flash / Rear-curtain Synchro / Commander Red-eye removal ON Red-eye  Reduction Auto / Red-eye Reduction & Forced Flash / Red-eye  Reduction & Slow Synchro / Suppressed Flash / Red-eye Reduction  & Rear-curtain Synchro / Commander",
    "imagesensor": "23.6mm x 15.6mm (APS-C) X-Trans CMOS II with primary color filter Total number of pixels: 16.7 million pixels Sensor Cleaning system Ultra Sonic Vibration",
    "batterylifeformovies": "Consecutive movie recording: approx. 103 min. (Face detection is set to OFF)",
    "shipping": "Free  Shipping Within Malaysia (T&C apply)",
    "fileformat": "Still image JPEG (Exif Ver 2.3), RAW (RAF format), RAW+JPEG (Design rule for Camera File system compliant / DPOF-compatible) Movie Movie File Format: MOV Movie Video Compression: H.264 Audio: Linear PCM Stereo",
    "bodytext": "BOF Dynamic force attribute selectionFujifilm X-T1 Mirrorless Digital Camera (Body Only, Graphite Silver Edition) Brand FujiFilm Category Mirrorless Cameras Model # FF-XT1-SLV Warranty 1 Year Fujifilm Malaysia Warranty * Stock Status Ships within 3-14 Days (depending on supplier's stock) Notify when in stock Currency MYR | USD | SGD | BND Price (RM4,988.00) RM4,398.00 Shopping Point 21.990 points = RM21.99 Price Match Found Cheaper Price Elsewhere? Inform us and we will try BEAT the PRICE and make you HAPPIER :) ! Payment Methods Cash on Delivery | Online Banking | ATM Transfer | PayPal | Credit Card Shipping Free  Shipping Within Malaysia (T&C apply) Fujifilm PWP Lens --- Choose Option --- No PWP Lens XC16-50mm F3.5-5.15 (+RM1,159.00) XC50-230mm F4.5-6.16 (+RM1,159.00) XF27mm F2.8 Pancake (+RM1,289.00) XF18mm F2R (+RM1,699.00) XF35mm F1.4R (+RM1,699.00) XF60mm F2 R (+RM1,869.00) XF18-55mm F2.8-4R (+RM1,959.00) XF55-200mm F3.5-4.8R (+RM1,959.00) XF18-135mm F3.5-5.6R (+RM2,588.00) XF14mm F2.8R (+RM2,589.00) XF23mm F1.4R (+RM2,589.00) XF10-24mm F4R (+RM2,889.00) XF56mm F1.2R (+RM2,889.00) XF56mm F1.2RAPD (+RM4,189.00) XF50-140mm F2.8R (+RM4,389.00) Quantity 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 Question? Ask a question about this product... Product Highlights 16.3MP APS-C X-Trans CMOS II Sensor EXR Processor II 0.5\" 2,360k-Dot 0.77x OLED Viewfinder 3.0\" 1,040k-Dot Tilting LCD Monitor Full HD 1080p Video Recording at 60 fps Built-In Wi-Fi Connectivity Weather-Resistant, Triple-Coated Body Continuous Shooting up to 8 fps Intelligent Hybrid AF and Focus Peaking Includes EF-X8 Shoe-Mount Flash Unit Descriptions Specifications Includes Featuring a highly unique graphite silver finish, and contextualized  by its sensor design and high-resolution electronic viewfinder, the Fujifilm X-T1 Mirrorless Digital Camera  is an advanced camera poised for both action and multimedia shooters.  Incorporating a 16.3MP APS-C-sized X-Trans CMOS II sensor and an EXR  Processor II, this camera can record up to 8 fps, as well as full HD  movies, with an expandable sensitivity range from ISO 100-51200.  Fujifilm's proprietary X-Trans sensor uses a unique randomized pixel  array in order to avoid the use of a resolution-reducing optical  low-pass filter, therefore providing images with the utmost sharpness  and clarity. Furthermore, the X-T1 is designed within a  weather-resistant magnesium alloy body that houses a 0.77x-magnification  Real Time Viewfinder, tilting LCD, and a manual, dial-based control  scheme. Complementing the tried and true Fujifilm technologies, the X-T1  features an enhanced handling system that enables its use in a wide  variety of shooting situations. This special edition of the X-T1 also  stands to differentiate itself through its triple layer coating and  ever-changing color scheme. The imaging system is benefitted by the Intelligent Hybrid AF system,  which uses both contrast- and phase-detection methods to acquire focus  quickly and accurately. Enhanced manual focusing capabilities are also a  result of these technologies; Digital Split Image and Focus Highlight  Peaking are two methods for quickly and precisely determining focus  using intelligent focusing aids for improved control and optimized  efficiency. For image monitoring, review, and menu navigation, both a  2,360k-dot OLED electronic viewfinder and a 3.0\" 1,040k-dot tilting LCD  screen are available. The body design extends this versatility through  the implementation of manual, physical control dials on the top plate of  the camera as well as customizable buttons and a Q Menu button for  expedited access to some of the most useful settings. This control  scheme further enables an intuitive built-in Wi-Fi system for direct  sharing of imagery to an Android or iOS mobile device for instant  sharing online. Full HD 1080p movie recording in multiple frame rates is possible and a  2.5mm microphone input permits the use of an optional external  microphone for improved audio quality with recordings. Full-time  continuous focusing is supported while taking video, also, as well as  the use of Film Simulation modes. Film Simulation modes make use of  Fujifilm's history of producing both negative and slide films, and allow  you to apply those films' characteristics to your digital imagery to  better suit your intended look. Graphite Silver Edition The special edition Graphite Silver version of the X-T1 features  a uniquely durable and aesthetic triple layer coating finish that  serves to both protect it and give it tremendous visual appeal.  Succeeding an initial antioxidant treatment to the magnesium alloy body,  a matte black primer coat is first applied. This helps to develop a  shadow-like appearance that also accentuates the highlights developed by  subsequent coats. The second step in the finishing process involves  rotating the body at high speeds while thin strips of paint particles  are layered using computer-controlled Thin-Film Multilayer Coating  Technology, which produces the smooth graphite silver-colored look.  Finally, a clear coat is applied for added durability and shininess  based on the ambient lighting conditions. Beyond the unique coating and appearance of this camera, the Graphite  Silver edition also contextualizes itself through the incorporation of  an electronic shutter feature, which avails a top shutter speed of  1/32,000 of a second, and by the inclusion of the Natural Live View  feature, which electronically replicates the viewing experience of  working with an optical viewfinder. 16.3MP APS-C X-Trans CMOS II Sensor A large 16.3MP APS-C CMOS image sensor is integrated into the  X-T1 to provide high image quality and detail. Using Fujifilm's unique  X-Trans bespoke pixel array, the sensor is designed with a randomized  pixel pattern to eliminate the need of an optical low-pass filter for  reducing moiré and aliasing. By removing this filter from the design,  higher image sharpness is possible. Lens Modulation Optimizer (LMO)  factors are also taken into account using the EXR Processor II, which  helps to automatically compensate for aberrations and diffraction blur  in order to produce images with the utmost inherent sharpness. The X-Trans sensor also works to provide highly effective noise  reduction and a clean signal-to-noise ratio. This enables  smoother-looking imagery that becomes especially apparent when  photographing in low-light situations with an expanded sensitivity range  of ISO 100-51200. Additionally, a top continuous shooting rate of 8 fps  is possible, for up to 47 consecutive frames, to benefit working with  moving subject matter. EXR Processor II Aside from benefitting low-light performance, the EXR Processor  II also provides quick performance throughout the entire camera system.  The camera start-up time is about 0.5 seconds, shutter lag is about 0.05  seconds, and the shooting interval time is about 0.5 seconds. An  electronic shutter can also be utilized to attain shutter speeds as  quick as 1/32,000 sec. to benefit working with even the speediest of  subjects. A fast autofocus performance speed of 0.08 seconds is also  enabled using the advanced Intelligent Hybrid AF system using both  contrast- and phase-detection focusing methods. Intelligent Hybrid AF and Enhanced Manual Focus Intelligent Hybrid AF is a quick, responsive autofocus system  that employs both contrast- and phase-detection methods to acquire focus  quickly in a wide variety of lighting conditions and shooting  situations. Clear focus can quickly be attained to aid in catching  fast-paced movement more easily. Three focus modes are available (AF-S,  AF-C, and M) for greater control over how the X-T1 achieves sharp focus.  When working with autofocus, the AF area is divided into a 49-point  matrix in order to gain clear focus of any type of subject matter.  Additionally, a built-in AF assist lamp is available for aiding the  focus system when photographing in low-light situations. When working with manual focus, two additional features can be employed  for enhanced critical focusing in a more controllable manner. By using  the phase-detection pixels located on the imaging sensor, Digital Split  Image technology is able to assist in acquiring precise focus through  the implementation of four striped focusing aids; akin to a rangefinder  focusing method, once these stripes have been lined up, sharp focus can  be ensured. Also contributing to manual focus accuracy, Focus Peak  Highlight has been integrated and enables a more objective system of  focusing by way of highlighting sharp edges and lines of contrast, using  one of three colors, once they are in focus. Multi Mode Real Time Viewfinder An advanced electronic viewfinder has been incorporated into the  X-T1's design to support clear eye-level monitoring along with a host  of unique viewing features to better support a more efficient overall  workflow. The Real Time Viewfinder is comprised of a 2,360k-dot OLED  display and features an exceptionally high magnification of 0.77x, along  with a 31° angle of view. This perspective is further complemented by  the 0.005 sec. lag time, which smoothly and seamlessly renders scenes  and moving subjects. To further enhance the viewing capabilities in  difficult lighting conditions, Natural Live View can be utilized to  display an image quality similar to as if working with an optical  viewfinder, and the Preview Picture function can also be disabled to  further extend the natural viewing experience.. Beyond the technical aspects of the viewfinder, an adaptable graphical  user interface has also been designed to increase efficiency during  shooting. Four different viewing modes are available: FULL: This mode takes advantage of the high magnification ratio of  the viewfinder and produces an image that fills the majority of the  viewfinder in an unobstructed manner. Shooting information is presented  at the top and bottom edges and does not interfere with the image frame  itself. NORMAL: This mode enables you to focus on the composition at hand  while still having an in-depth understanding of camera settings and  shooting conditions. VERTICAL: When the camera is held in a vertical orientation, the  information display automatically rotates so it is facing upright for  easier reading of camera settings. When working in this mode, images can  also be reviewed in the vertical orientation. DUAL: Serving to benefit those working with manual focus, this mode  presents a split screen view of the scene where you see both a regular  view as well as the Focus Assist View (Focus Highlight Peaking and  Digital Split Image) at the same time, allowing you to concentrate on  the image composition as well as critical focus accuracy. In addition to the four viewing modes, the shooting information  displayed within the viewfinder can also be customized to suit one's  needs. 19 different settings can be toggled on or off depending on  preference. Classic Camera Design Featuring a body design reminiscent of SLR film cameras, the  X-T1 exhibits a meshing of both analog exposure controls along with  intelligent automated technologies. The clean and functional body design  incorporates physical shutter speed, ISO, drive mode, AF mode, and +/- 3  EV exposure compensation double-deck precision-milled aluminum alloy  dials that pair well with the manual aperture rings found on many of the  XF lenses for intuitive exposure setting selection. Depending on  individual needs, six customizable buttons, dual command dials, and an  easily-accessible Q Menu provide an efficient solution for modifying  some of the most frequently used camera settings, such as ISO, white  balance, and file settings. For more extensive menu navigation, as well  as live view monitoring and image review, a 3.0\" 1,040k-dot LCD monitor  is available and features a tilting design to better support working  from high and low angles. Furthermore, the magnesium alloy body also features approximately 80  points of weather sealing to protect itself from dust and moisture, as  well as temperatures as low as 14°F, for confident use in trying  conditions. Full HD Movie Recording Full HD 1080p video recording is supported up to 60 fps, with  other frame rates and formats also available. Full-time AF tracking is  available during recording with subject tracking capabilities for  ensured sharpness when either the subject is moving or if the camera is  moving, panning, or zooming. +/- 2 EV exposure compensation is available  during recording as well as the use of Film Simulation settings. An HDMI port enables high definition playback of movies to an HDTV and  the inclusion of a 2.5mm input supports the use of an optional external  microphone for enhanced sound quality. Built-In Wi-Fi Connectivity Wireless connectivity is built into the camera and allows for  instant sharing of images directly to an Android or iOS mobile device.  The Fujifilm Camera Remote app allows you to browse the image contents  of your camera from your mobile device and transfer both videos and  photos, and the entire sharing process is further expedited by simply  pressing and holding the dedicated Wi-Fi button to begin transferring  immediately. Remote camera control and monitoring is also supported  through the use of the app, which enables Touch AF, shutter release,  exposure settings adjustment, Film Simulation modes, white balance  modes, macro, timer, and flash controls to all be adjusted from the  linked mobile device. Location data can also be embedded into image  file's metadata for geotagging. Film Simulation Mode and Advanced Filters Taking advantage of Fujifilm's vast history in traditional  film-based photography, the X-T1 integrates several Film Simulation  modes to mimic the look and feel of some Fujifilm's classic film types. A  refined Classic Chrome mode is designed to deliver muted tones and a  deep color reproduction, similar to that of a dated slide film. Pulling  from their more contemporary line of transparency films, Provia offers  natural-looking tones for everyday shooting, Velvia produces a more  dramatic and rich tonality with deeper color saturation, and Astia gives  less contrast for a softer depiction of skin tones. Mimicking their  negative films, Pro Neg. Std. gives smooth image tones that are suitable  for accurate color renditions, while Pro Neg. Hi produces a more  dramatic feel with the ability to draw color out of a variety of  lighting conditions. In addition to the colorful benefits of these Film  Simulation modes, there are also monochrome modes that simulate the look  of traditional yellow, green, and red black and white contrast filters.  A sepia mode is also available for producing an inherently nostalgic  look. Eight Advanced Filters are also available to creatively enhance the look  of imagery, and include: High Key, Low Key, Soft Focus, Toy Camera,  Miniature, Pop Color, Dynamic Tone, and Partial Color (Red, Orange,  Yellow, Green, Blue, Purple). Other Camera Features An in-camera RAW converter lets you record your images in  14-bit RAW and process them prior to computer-based editing procedures.  This process enables you to modify the exposure, white balance, and  other controls directly through the menu interface. Additionally, for  more thorough processing of files, RAW File Converter software is  included for RAW image processing on your computer. Interval shooting is possible with intervals of 1 second to 24 hours for up to 999 frames. When the electronic shutter feature is being used, the mechanical  shutter will automatically be disabled in order to realize a completely  silent shooting experience. Compatible with UHS-II memory cards for fast transfer speeds during shooting. Multiple exposure mode gives you the ability to overlay imagery  in-camera. When working in this mode, subsequent exposures can be paired  and the final appearance can be previewed on the LCD or in the EVF  before making the final exposure. Motion panorama mode allows you to record expansive views up to 360° wide in a seamless, sweeping manner. The included EF-X8 shoe-mount flash has a guide number of 26.2' at  ISO 100 and provides additional illumination to imagery for  photographing in dark conditions. A sync terminal is also available for  use of additional optional external flashes. Four different auto bracketing modes are available: Dynamic Range, Film Simulation, AE, and ISO Sensitivity. The included NP-W126 battery enables approximately 350 frames to be recorded per charge. Number of effective pixels 16.3 million pixels Image sensor 23.6mm x 15.6mm (APS-C) X-Trans CMOS II with primary color filter Total number of pixels: 16.7 million pixels Sensor Cleaning system Ultra Sonic Vibration Storage media SD memory card / SDHC memory card / SDXC (UHS-II) memory card File format Still image JPEG (Exif Ver 2.3), RAW (RAF format), RAW+JPEG (Design rule for Camera File system compliant / DPOF-compatible) Movie Movie File Format: MOV Movie Video Compression: H.264 Audio: Linear PCM Stereo Number of recorded pixels L: (3:2) 4896 x 3264 / (16:9) 4896 x 2760 / (1:1) 3264 x 3264 M: (3:2) 3456 x 2304 / (16:9) 3456 x 1944 / (1:1) 2304 x 2304 S: (3:2) 2496 x 1664 / (16:9) 2496 x 1408 / (1:1) 1664 x 1664 L: Vertical: 2160 x 9600 / Horizontal: 9600 x 1440 M: Vertical: 2160 x 6400 / Horizontal: 6400 x 1440 Sensitivity AUTO (Control available up to ISO 6400) Equivalent to ISO 200 - 6400 (Standard Output Sensitivity) Extended output sensitivity: Equivalent ISO 100, 12800, 25600 and 51200 Exposure control TTL 256-zone metering, Multi / Spot / Average Exposure mode Programmed AE / Shutter Speed priority AE / Aperture priority AE / Manual exposure Exposure compensation -3.0EV - +3.0EV, 1/3EV step (movie recording: -2.0EV - +2.0EV) Face Detection Yes Shutter type Focal Plane Shutter Shutter speed (P mode) 1/4 sec. to 1/4000 sec., (All other modes) 30 sec. to 1/4000 sec. Bulb (max. 60 min.) Time 1/2 to 30 sec. Synchronized shutter speed for flash: 1/180 sec. or slower Continuous shooting Approx. 8.0 fps (JPEG: max. approx. 47 frames) Approx. 3.0 fps (JPEG: up to the capacity of the card) Auto bracketing AE Bracketing (±1/3EV, ±2/3EV, ±1EV) Film Simulation Bracketing (Any 3 types of film simulation selectable) Dynamic Range Bracketing (100% · 200% · 400%) ISO sensitivity Bracketing (±1/3EV, ±2/3EV, ±1EV) White Balance Bracketing (±1, ±2, ±3) Focus mode Single AF / Continuous AF / MF Distance Indicator type Intelligent Hybrid AF (TTL contrast AF / TTL phase detection AF), AF assist illuminator available AF frame selection Area (EVF / LCD: 49 areas with 7 x 7) / Multi White balance Automatic scene recognition Custom / Color temperature selection (K) Preset:  Fine / Shade / Fluorescent light (Daylight) / Fluorescent light (Warm  White) / Fluorescent light (Cool White) / Incandescent light /  Underwater Self-timer 10 sec. / 2 sec. Delay Interval timer shooting Yes (Setting: Interval, Number of shots, Starting time) Flash External flash EF-X8 (included) (Super Intelligent Flash) Guide number: approx. 8 (ISO100 · m) / approx. 11 (ISO200 · m) Flash modes Activated when external flash is connected Red-eye removal OFF Auto / Forced Flash / Slow Synchro / Suppressed Flash / Rear-curtain Synchro / Commander Red-eye removal ON Red-eye  Reduction Auto / Red-eye Reduction & Forced Flash / Red-eye  Reduction & Slow Synchro / Suppressed Flash / Red-eye Reduction  & Rear-curtain Synchro / Commander Hot shoe Yes (Dedicated TTL Flash compatible) Viewfinder 0.5-in., approx. 2.360K-dot OLED color viewfinder Coverage of viewing area vs. capturing area: approx. 100% Eye point: approx. 23mm (from the rear end of the camera's eyepiece) Diopter adjustment: -4m-1 to +2m-1 Magnification: 0.77x Diagonal angle of view: approx. 38deg. Built-in eye sensor LCD monitor 3.0-inch, aspect ratio 3:2, approx. 1,040K-dot, Tilt type color LCD monitor (approx. 100% coverage) Movie recording Full HD 1920 x 1080 60p / 30p, Continuous recording: up to approx. 14 min. HD 1280 x 720 60p / 30p, Continuous recording: up to approx. 27 min. Film Simulation mode 10 type (PROVIA/STANDARD, Velvia/VIVID,  ASTIA/SOFT, PRO Neg Hi, PRO Neg. Std, MONOCHROME, MONOCHROME+Ye FILTER,  MONOCHROME+R FILTER, MONOCHROME+G FILTER, SEPIA) Dynamic range setting AUTO (100-400%), 100%, 200%, 400% Advanced filter Toy camera / Miniature / Pop color /  High-key / Low-key / Dynamic tone / Soft focus / Partial color (Red /  Orange / Yellow / Green / Blue / Purple) Other photography functions Auto Red-eye Removal, Setting (Color,  Sharpness, D-range, Gradation), Select custom setting, Motion panorama,  Color space, Framing guideline, Frame No. memory, Histogram display,  Preview depth of focus, Pre-AF, Focus check, Focus Peak Highlight,  Digital Split Image, Electronic level, Multiple exposure, Release  priority / Focus priority selection, Fn button setting (RAW, Movie,  etc.), ISO AUTO control, Instant AF setting (AF-S / AF-C) Playback functions RAW conversion, Image rotate, Red-eye  reduction, Photobook assist, Erase selected frames, Image search,  Multi-frame playback (with micro thumbnail), Slide show, Mark for  upload, Protect, Crop, Resize, Panorama, Favorites Wireless transmitter Standard IEEE 802.11b / g / n (standard wireless protocol) Access mode Infrastructure Wireless function Geotagging, Wireless communication (Image transfer), View & Obtain Images, Remote camera shooting, PC Autosave Other functions PictBridge, Exif Print, Language selection, Time difference, High Performance mode, Silent mode Terminal Digital interface USB 2.0 High-Speed / micro USB terminal HDMI output HDMI mini connector (Type C) Others Microphone / shutter release input: °2.5mm, stereo mini connector Power supply NP-W126 Li-ion battery (included) Operating Temperature -10deg.C - +40deg.C Operating Humidity 10 - 80% (no condensation) Battery life for still images Approx. 350 frames (When XF35mmF1.4 R is set, LCD monitor / viewfinder on and supplied flash EF-X8 not attached) Battery life for movies Consecutive movie recording: approx. 103 min. (Face detection is set to OFF) Starting up period Approx. 0.5 sec., when High Performance mode set to ON Approx. 1.0 sec., when High Performance mode set to OFF Dimensions (W x H x D) 129 x 89.8 x 46.7mm / 5.07 x 3.53 x 1.83\" (Minimum depth: 33.4mm / 1.31\") Weight Approx. 440g / 15.52 oz (including battery and memory card) Approx. 390g / 13.75 oz (excluding accessories, battery and memory card) Fujifilm X-T1 Mirrorless Digital Camera (Body Only, Graphite Silver Edition) NP-W126 Li-Ion Battery Pack BC-W126 Battery Charger EF-X8 Shoe-Mount Flash Unit Graphite Silver Edition Leather Strap Body Cap Metal Strap Clip Protective Cover Clip Attaching Tool Graphite Silver Edition Aluminum Alloy Hot Shoe Cover Tall-Oriented Battery Grip Connector Cover Sync Terminal Cover Software CD-ROM Total 0 reviews ... be the First Customer to review this product!",
    "viewfinder": "0.5-in., approx. 2.360K-dot OLED color viewfinder Coverage of viewing area vs. capturing area: approx. 100% Eye point: approx. 23mm (from the rear end of the camera's eyepiece) Diopter adjustment: -4m-1 to +2m-1 Magnification: 0.77x Diagonal angle of view: approx. 38deg. Built-in eye sensor",
    "model": "FF-XT1-SLV",
    "whitebalance": "Automatic scene recognition Custom / Color temperature selection (K) Preset:  Fine / Shade / Fluorescent light (Daylight) / Fluorescent light (Warm  White) / Fluorescent light (Cool White) / Incandescent light /  Underwater"
}