{
    "selftimerdelay": "2-sec., 10-sec.",
    "macrohybrid": "Corrects for shift-type camera shake, which typically occurs in macro           (close-up) shooting",
    "videos": "Playback, Pause, Slow Motion, Skip Backward, Previous           Frame, Next Frame, Skip Forward, Erase Clip, Editing, Movie Transcoding",
    "stillimages": "Single, Index, Magnification (2-10x), Switch to           other images while zoomed, Information Display, Red-eye Correction, i-Contrast,           Photobook Setup, Cropping, Resize, My Colors, Face ID Info, Histogram,           RGB Histogram, Focus Checker, Location Information, Overexposure Warning",
    "moviedigesthybridauto": "Automatically selects shooting settings for optimal quality and records           a video clip every time you capture a still image. One day's worth of           clips and images are then combined into a single video",
    "creativefilters": "This setting provides easy access to special filter effects and scene           modes, such as Toy Camera Effect, Poster Effect, Monochrome and more",
    "miniatureeffect": "Emphasizes perspectives for a miniature effect by blurring upper and bottom           portions of the image",
    "highdynamicrange": "The camera combines three different exposures to get one evenly lit image",
    "recordshdvideo": "Yes",
    "effectivepixels": "12.1 Megapixels",
    "lcdscreensizeinches": "3",
    "imagestabilization": "Yes",
    "powersource": "Battery Pack NB-6LH",
    "aperturepriority": "You set the aperture, controlling depth-of-field. The camera automatically           selects the shutter speed",
    "portrait": "The camera sets a large aperture, focusing the subject and artistically           blurring the background to make your subject “pop.”",
    "custom": "Define and store your own settings to achieve the effects you prefer",
    "category": "camera",
    "underwater": "Capture underwater images with reduced backscatter effect. Optional Underwater           Case required",
    "smartshutter": "The camera automatically takes the photo when people smile, wink, or get           into frame",
    "powered": "Compensates for hand movement when shooting video at the telephoto end           of the zoom range, where camera shake is magnified",
    "postereffect": "Poster Effect combines several similar shades into one color, turning           subtle gradations into eye-catching, scene-popping contrasts",
    "softfocus": "Creates a hazy ambiance that's perfect for portraits and wedding photos",
    "normal": "Corrects for a wide range of camera movement when shooting stills",
    "redeyereduction": "Yes",
    "snow": "Shoot clear snow scenes without darkened subjects or an unnatural bluish           tint",
    "nostalgic": "Create the look and feel of old photographs using sepia tones and black-and-white",
    "selftimer": "Yes",
    "program": "Access advanced exposure compensation features while shooting mostly automatically",
    "starshootingmodes": "Capture beautiful images of the night sky with three different modes:           Star Nightscapes, Star Trails, and Star Time-Lapse Movies",
    "panning": "Panning motion is detected so that IS does not interfere with desired           camera movement",
    "stillsvideos": "Auto Rotate, Index Continuous Display, Image           Advance (Transition Effects, Scroll Display), Rotate, Favorites, My Category,           Smart Shuffle, Group Playback, Slideshow, Erase, Resume, Protect",
    "widthinches": "3.94",
    "type": "Point and Shoot",
    "backgrounddefocus": "Creates attractive background blur, selectable in three different levels,           to imbue photos with the look of a classic portrait",
    "heightinches": "2.32",
    "handheldnightscene": "Take clear and steady pictures at night without the use of a tripod",
    "autofocussystem": "TTL Autofocus, Manual Focus",
    "focallength": "5.2 (W) - 26.0 (T) mm (35mm film equivalent: 24-120mm)",
    "dynamic": "Effective for video shooting at wide-angle focal lengths, eliminating           the unwanted shaking that typically occurs while walking",
    "fireworks": "Grab brilliant images of skyrocketing fireworks",
    "macroaf": "1.2 in. - 1.6 ft. (3-50cm) (W), 12 in. - 1.6 ft. (30-50cm)           (T)",
    "depthinches": "1.14",
    "focusmodes": "C, M, Av, Tv, P, Hybrid Auto, Auto, SCN, Creative Filters, Movie",
    "tripod": "When tripod use is detected, the Image Stabilizer is stopped because it           is not needed",
    "smartauto": "The camera automatically selects the best shooting settings for optimal           quality based on subjects and environmental factors to provide point-and-shoot           simplicity",
    "storagemedia": "SD/SDHC/SDXC",
    "automanual": "1.2 in. (3cm) - infinity (W), 12 in. (30cm) - infinity           (T)",
    "shutterspeed": "1-1/2500 sec., 15-1/2500 sec. (in Tv mode), 250-1/2500 sec. (in M mode)",
    "recordsvideo": "Yes",
    "toycameraeffect": "Simulates photos taken with “toy” or pinhole cameras, darkening the image           at the edges to create a vignette effect",
    "monochrome": "Choose from three single-tone effects: Black-and-White, Sepia, or Blue",
    "playbackmodesfilestillsvideos": "Auto Rotate, Index Continuous Display, Image           Advance (Transition Effects, Scroll Display), Rotate, Favorites, My Category,           Smart Shuffle, Group Playback, Slideshow, Erase, Resume, Protect Still Images",
    "supervivid": "Super Vivid intensifies existing hues, saturating the scene with bright           colors",
    "manual": "You have complete control of exposure, selecting both aperture and shutter           speed manually",
    "opticalzoom": "5x",
    "focusingrangenormal": "2.0 in. (5cm) - infinity (W), 12 in. (30cm) - infinity           (T) Auto/Manual",
    "superslowmotionmovie": "Record your clips in high speed (approx. 240 fps), and then watch your           videos in slow motion",
    "digitalzoom": "4x",
    "builtinflash": "Yes",
    "quick": "4.9 - 66 ft. (1.5 - 20m) (W,T)",
    "movie": "Record video in stereo sound. Unwanted scenes can be deleted in playback           mode",
    "fisheyeeffect": "Add a classic photo distortion without a fisheye lens",
    "shutterpriority": "You select the shutter speed to stop or blur action, and the camera finds           the appropriate aperture. With slow exposure times, Canon's noise reduction           system activates to ensure low image noise",
    "whitebalance": "Auto, Daylight, Cloudy, Tungsten, Fluorescent, Fluorescent H, Flash, Underwater, Custom 1, Custom 2",
    "lcdtype": "TFT"
}