{
    "selftimerdelay": "2-sec., 10-sec.",
    "hybridauto": "Capture the essence of special days – vacations, important occasions or any time you're shooting many shots in a day – using Hybrid Auto on the PowerShot SX700 HS. Hybrid Auto records up to four seconds of video every time you shoot a still image, then automatically joins the day's clips and pictures* into a video. The feature also makes sure the \"highlight reel\" is stunningly beautiful by automatically recognizing the scene and optimizing camera settings to capture the highest possible image quality. The resulting 720p HD video is properly exposed, crisp and steady.",
    "videos": "Normal Playback, Skip Backward, Previous Frame, Next Frame, Skip Forward, Resume Playback, Erase Clip, Edit Digest Movie",
    "stillimages": "Single, Index, Magnification (Approx. 2x-10x), Thumbnails, Information Display, Histogram, Overexposure Warning, Resume Playback, Red-Eye Correction, Cropping, i-Contrast, Resize, My Colors",
    "fullhd1920x1080": "60 fps (59.94), 30 fps (29.97)",
    "iframemovie1920x1080": "30 fps (29.97)",
    "focusingrangeauto": "0.4 in. (1 cm) - infinity (W), 4.6 ft. (1.4 m) - infinity (T) Normal",
    "lcdscreensizeinches": "3",
    "imagestabilization": "Yes",
    "powersource": "Battery Pack NB-6LH",
    "digestmovie1280x720": "30 fps (29.97)",
    "category": "camera",
    "mobiledeviceconnectbutton": "It's now easier than ever to connect your PowerShot SX700 HS camera to an iOS® or Android™ device* using the Mobile Device Connect Button. The button allows you to choose to transfer images to your smartphone or tablet for immediate sharing with the CameraWindow app**, or to your computer on the same network with Image Sync to make saving and organizing your images easier. Once your device is registered on the camera, simply press the Mobile Device Connect button for easy connection. By connecting to a smartphone with the CameraWindow app using the Mobile Device Connect Button, you can browse and share images while still leaving the camera inside a bag. It is also possible to turn off the PowerShot SX700 HS quickly and easily, directly from a smartphone. Once your camera is linked to your computer on the same wireless network, you can automatically transfer images to it, for easy saving and organizing of your photos. The Mobile Device Connect Button is great for quick and easy sharing from a fun day out with friends and family.",
    "normal": "2.0 in. (5 cm) - infinity (W), 4.6 ft. (1.4 m) - infinity (T)",
    "redeyereduction": "Yes",
    "ecomode": "The PowerShot SX700 HS features ECO Mode, which provides more shots per single charge through LCD monitor and camera power management. ECO Mode can be activated for easy power preservation when you're out shooting for the day or the moment is too exciting to put the camera down. The mode quickly wakes the camera from sleep when a button is pressed. With ECO Mode activated to conserve power, you can even stay connected for longer with the built-in Wi-Fi® featured on the camera. When the fun with family and friends runs late into the night, you can be assured your camera can keep up.",
    "sports": "3.3 ft. (1 m) - infinity (W), 26.0 ft. (8m) - infinity (T)",
    "selftimer": "Yes",
    "attr640x480": "30 fps (29.97)",
    "builtinnfcnearfieldcommuniticationforeasierwificonnectivity": "The PowerShot SX700 HS camera supports NFC (Near Field Communication) technology, eliminating the need to find and open the Canon CameraWindow app* on your mobile device. Simply touch the NFC icon on your camera to your compatible Android device**, and the CameraWindow app will launch automatically for quick, easy sharing of your images. Built-in NFC technology also makes it simpler to install the app. If the app hasn't been installed yet, once you touch the devices together for the first time, the download screen will display automatically.",
    "canonhssystem": "The PowerShot SX700 HS gives you the power to capture beautifully detailed, naturally lit images even in low light – reducing the need for flash and the occasionally unwelcome effects it produces. That's because the camera's 16.1 Megapixel High-Sensitivity CMOS sensor works with the camera's latest generation DIGIC 6 Image Processor to create the Canon HS SYSTEM, specifically engineered for spectacular low-light performance. With the Canon HS SYSTEM, you'll experience excellent tracking performance even in low light, and achieve gorgeous still image quality at ISO speeds up to ISO 3200; beautiful low-light shots are possible with minimal noise and maximum detail in highlight and shadow areas.",
    "stillsvideos": "Auto Rotate, Transition Effects (Off, Fade), Scroll Display, Rotate, Favorites, Search Jump (Favorites, Date, Still Images, Movies, Digest, Jump 10 Images, Jump 100 Images), Smart Shuffle, Group Playback, Movie Digest, Filtered Playback, Slideshow",
    "recordsvideo": "Yes",
    "type": "Point and Shoot",
    "largel": "SF5,5231,4115,696",
    "smalls": "SF18835,089141,622",
    "heightinches": "2.59",
    "f": "11349,125198,271",
    "autofocussystem": "TTL Autofocus",
    "focallength": "4.5mm (W) - 135.0mm (T) (35mm film equivalent: 25-750mm)",
    "auto": "0.4 in. (1 cm) - infinity (W), 4.6 ft. (1.4 m) - infinity (T)",
    "builtinflash": "Yes",
    "hd1280x720": "30 fps (29.97)",
    "depthinches": "1.37",
    "focusmodes": "M, Av, Tv, P, Auto, Hybrid Auto, Creative Shot, Live View Control, Sports, SCN, Creative Filters, Movie",
    "recordshdvideo": "Yes",
    "attr169": "3:24:3",
    "smartauto": "Smart AUTO on the PowerShot SX700 HS makes capturing sharp, bright colorful images and video as simple as pressing the shutter button. By assessing various factors in both the background and the subject, the system recognizes 58 predefined shooting situations and automatically selects the camera settings that will yield the best possible results. Simply frame the shot you want, and in dozens of common or challenging scenarios the camera takes care of the rest. Hard-to-capture shots such as moving subjects, night scenes, backlit subjects, and landscapes at evening or on a bright snowy day are instantly and effortlessly captured as \"keeper\" shots. Smart AUTO makes the PowerShot SX700 HS ideal for capturing excellent quality still images and video on the go.",
    "storagemedia": "SD, SDHC, SDXC",
    "intelligentis": "It's easy to capture clear, steady images with the PowerShot SX700 HS, even in low light without using a tripod. That's because the camera is equipped with Canon's innovative Intelligent IS. The system automatically analyzes camera movement and applies the best shake correction method for the shooting situation – allowing you to focus on framing and capturing your shot. For stills, the system selects from Normal IS, Panning IS, Macro (Hybrid) IS and Tripod modes. When shooting video, the system selects from Dynamic IS, Powered IS, Macro (Hybrid) IS and active Tripod IS modes. New icons clearly mark the image stabilization mode, whether you're shooting still images or video.",
    "shutterspeed": "1-1/3200 sec., 15-1/3200 sec. (in Tv and M modes)",
    "widthinches": "4.44",
    "miniatureeffect640x4801": "6 fps, 3 fps, 1.5 fps",
    "mediumm": "FN/A",
    "playbackmodesfilestillsvideos": "Auto Rotate, Transition Effects (Off, Fade), Scroll Display, Rotate, Favorites, Search Jump (Favorites, Date, Still Images, Movies, Digest, Jump 10 Images, Jump 100 Images), Smart Shuffle, Group Playback, Movie Digest, Filtered Playback, Slideshow Still Images",
    "filesizekb": "8 GB32 GB",
    "remoteshooting": "With the built-in Wi-Fi® on the PowerShot SX700 HS, you can use your smartphone or tablet* to remotely control the camera. Simply connect wirelessly to your device and access the free Canon CameraWindow app**. Your device will show a live image of the camera's capture – perfect for a commemorative group photo, wildlife shots and all kinds of situations. The camera's versatile 30x Optical Zoom, flash, self-timer and shutter are all under your control, with images being saved to your camera as usual.",
    "opticalzoom": "30x",
    "whitebalance": "Auto, Daylight, Cloudy, Tungsten, Fluorescent, Fluorescent H, Custom, Multi-area White Balance",
    "digitalzoom": "4x",
    "effectivepixels": "16.1 Megapixels",
    "miniatureeffect1280x7201": "6 fps, 3 fps, 1.5 fps",
    "medium2m2": "SF1,2126,29725,418",
    "macro": "0.4 in. - 1.6 ft. (1 - 50 cm)",
    "creativeshotmode": "In addition to its super-powerful 30x Optical Zoom, the PowerShot SX700 HS also turns out impressive artistic photos with Creative Shot mode. Rather than randomly applying filters, Creative Shot mode takes advantage of advanced Canon technologies to analyze the individual scene, subject and exposure to apply any of 46 filter options. In addition to the original shot, the camera automatically produces and saves five additional variations of the composition. Filter choices are grouped into Retro, Monochrome, Special and Natural categories to make exploring the world of artistic photography fun and easy, or simply select Auto to access the full range of effects. With Creative Shot mode, the result is stunning artistic photos that are perfect for sharing.",
    "medium1m1": "SF2,9402,64010,659",
    "lcdtype": "TFT"
}