{
    "selftimerdelay": "2-sec., 10-sec.",
    "smartshutter": "The camera automatically takes the photo when people smile, wink, or get           into frame",
    "creativefilters": "This setting provides easy access to special filter effects and scene           modes, such as Toy Camera Effect, Poster Effect, Monochrome and more",
    "miniatureeffect": "Emphasizes perspectives for a miniature effect by blurring upper and bottom           portions of the image",
    "highdynamicrange": "The camera combines three different exposures to get one evenly lit image",
    "recordshdvideo": "Yes",
    "effectivepixels": "12.1 Megapixels",
    "lcdscreensizeinches": "2.8",
    "imagestabilization": "Yes",
    "powersource": "Battery Pack NB-10L, Compact Power Adapter CA-PS700 (included with AC Adapter Kit ACK-DC80)",
    "aperturepriority": "You set the aperture, controlling depth-of-field. The camera automatically           selects the shutter speed",
    "portrait": "The camera sets a large aperture, focusing the subject and artistically           blurring the background to make your subject “pop.”",
    "custom": "Define and store your own settings to achieve the effects you prefer",
    "category": "camera",
    "selftimer": "Yes",
    "powered": "Compensates for hand movement when shooting video at the telephoto end           of the zoom range, where camera shake is magnified",
    "postereffect": "Poster Effect combines several similar shades into one color, turning           subtle gradations into eye-catching, scene-popping contrasts",
    "softfocus": "Creates a hazy ambiance that's perfect for portraits and wedding photos",
    "fisheyeeffect": "Add a classic photo distortion without a fisheye lens",
    "redeyereduction": "Yes",
    "snow": "Shoot clear snow scenes without darkened subjects or an unnatural bluish           tint",
    "sports": "The camera uses high shutter speeds to capture fast-moving subjects",
    "highspeedbursthq": "Captures fast-action shots at full resolution, providing continuous shooting           when the shutter button is held down",
    "program": "Access advanced exposure compensation features while shooting mostly automatically",
    "smartauto": "The camera automatically selects the best shooting settings for optimal           quality based on subjects and environmental factors to provide point-and-shoot           simplicity",
    "panning": "Panning motion is detected so that IS does not interfere with desired           camera movement",
    "recordsvideo": "Yes",
    "type": "Point and Shoot",
    "heightinches": "3.44",
    "handheldnightscene": "Take clear and steady pictures at night without the use of a tripod",
    "normal": "Corrects for a wide range of camera movement when shooting stills",
    "focallength": "4.3–215.0mm (35mm film equivalent: 24–1200mm)",
    "dynamic": "Effective for video shooting at wide-angle focal lengths, eliminating           the unwanted shaking that typically occurs while walking",
    "fireworks": "Grab brilliant images of skyrocketing fireworks",
    "tripod": "When tripod use is detected, the Image Stabilizer is stopped because it           is not needed",
    "depthinches": "4.15",
    "focusmodes": "TTL Autofocus, Manual Focus",
    "iframemovie": "The Apple® movie format, iFrame, makes it easier and quicker to import           and upload videos while retaining high image quality",
    "storagemedia": "SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "shutterspeed": "1-1/2000 sec., 15-1/2000 sec. (in Tv and M modes)",
    "widthinches": "4.82",
    "toycameraeffect": "Simulates photos taken with \"toy\" or pinhole cameras, darkening           the image at the edges to create a vignette effect",
    "monochrome": "Choose from three single-tone effects: Black-and-White, Sepia, or Blue",
    "supervivid": "Super Vivid intensifies existing hues, saturating the scene with bright           colors",
    "manual": "You have complete control of exposure, selecting both aperture and shutter           speed manually",
    "opticalzoom": "50x",
    "superslowmotionmovie": "Record your clips in high speed (approx. 240 fps), and then watch your           videos in slow motion",
    "digitalzoom": "4x",
    "builtinflash": "Yes",
    "movie": "Record video in stereo sound. Unwanted scenes can be deleted in playback           mode",
    "shutterpriority": "You select the shutter speed to stop or blur action, and the camera finds           the appropriate aperture. With slow exposure times, Canon's noise reduction           system activates to ensure low image noise",
    "whitebalance": "Auto, Daylight, Cloudy, Tungsten, Fluorescent, Fluorescent H, Flash, Custom 1, Custom 2",
    "lcdtype": "TFT"
}