{
    "autobracketing": "-",
    "exposurecontrol": "TTL 256-zones metering",
    "weight": "Approx. 134g / 4.7oz. (excluding accessories, battery and memory card) Approx. 151g / 5.3oz. (including accessories, battery and memory card)",
    "exposuremode": "Programmed AE",
    "powersupply": "NP-45A Li-ion battery (included)",
    "exposurecompensation": "-2.0EV - +2.0EV 1/3EV step",
    "opticalzoom": "10x",
    "category": "camera",
    "selftimer": "Approx. 10sec. / 2sec. delay",
    "lcdmonitor": "2.7-inch, approx. 230,000 dots, TFT color LCD monitor, approx. 96% coverage",
    "continuousshooting": "TOP-3 max. 1.2frames/sec.",
    "dimensions": "97(W) x 56.5(H) x 28.1(D) mm / 3.7(W) x 1.9(H) x 0.9(D) in. (Minimum depth : 18.5mm / 0.7in.)",
    "batterylife": "Approx. 180 frames (Auto mode)",
    "playbackfunctions": "Face Detection, Photobook assist, Image search, Erase selected frames, Slide show, Auto red-eye removal, Protect, Crop, Resize, Image rotate, Mark for upload, Multi-frame playback (with Microthumbnail), Panorama, Favorite",
    "focusdistancefromlenssurface": "Normal Wide : Approx. 45 cm to infinity / 1.5 ft. to infinity Telephoto : Approx. 2.0 m to infinity / 6.5 ft to infinity Macro Wide: Approx. 5 cm - 2.5 m / 2.0 in. - 8.2 ft. Telephoto: Approx. 90 cm - 2.5 m / 3.0 ft. - 8.2 ft.",
    "flash": "Auto flash (i-flash) Effective range : (ISO AUTO) Normal Wide : Approx. 50cm - 2.6m / 1.6ft. - 8.5ft. Telephoto : Approx. 90cm - 1.7m / 3.0ft. - 5.6ft. Macro Approx. 30cm - 80cm / 1.0ft. - 2.6ft.",
    "terminal": "Video output NTSC / PAL selectable with monaural sound Digital interface USB 2.0 High-Speed",
    "photographyfunctions": "SR AUTO, Face Detection, Auto red-eye removal, Face recognition, Blink detection, Framing guideline, Automatic LCD brightness adjustment, Frame No. memory",
    "aperture": "F3.4 / F8.4(Wide) F5.6 / F14(Telephoto) with ND filter",
    "movierecording": "1280 x 720 pixels / 640 x 480 pixels / 320 x 240 pixels (30frames/sec.) with monaural sou * Zoom function can be used. * Sounds will not be recorded during optical zoom operation.",
    "sensitivity": "Auto / Equivalent to ISO 100 / 200 / 400 / 800 / 1600 / 3200* (Standard Output Sensitivity) * ISO 3200 is effective in S mode.",
    "accessoriesincluded": "Li-ion battery NP-45A Battery charger BC-45C Plug adapter USB cable Hand strap CD-ROM Owner's manual Please read all terms & conditions mentioned BELOW carefully before placing the order :- General Terms Â· Color Choice for any product depends upon the availability of stocks. Kindly drop us a mail in case if you have any color choice and if we do not receive any mail till we ship the product any available color will be shipped. Â· For any repairs of products within the warranty period, please refer to the warranty terms in the user guide or check the manufacturerâ\u0080\u0099s website, you can visit your nearest service center in such cases. No warranty is given for the FREEBIES provided with the product if it is defective so no replacement will be given for the same, as warranty or replacement is only for camera in case if there is any manufacturing defect found. Â· Please call  or send an email in case you need the contact details of your nearest service center or any other query related to product.. Â· All bank charges in case of refund or cancellation of order shall be borne by the buyer. Shipment Terms Â· All ordered products are dispatched within 1-2 working days after the order confirmation is received from Ebay.in on our panel. Â· Transit period of products could vary from 6-8 days depending upon the shipment location. Â· If shipping address is within Octroi limits, then all applicable Octroi, taxes or other levies shall be borne by the buyer. Â· All courier charges to be borne by the buyer in case the product is returned or has to be exchanged under the Return Policy. Â· In states like Jharkhand, Kolkata, Kerala, north east & Assam it may take a weeks or more time to get the product delivered so I request the buyers from such locations to kindly co - operate and give us time to get the product delivered to their location and if urgent kindly do not place the order in such condition. Also if we receive the order from the Location which is non serviceable by Fedex, Bluedart, Aramex, DTDC & Overnite Express will be not be considered and will be refunded by us. Â· Kindly acknowledge receipt of the product on Paisapay - Ebay website with your valuable feedback. Feedback Instructions Â· We request our buyers to kindly acknowledge receipt of the product on Paisapay - Ebay website with your valuable feedback. Â· Kindly contact us on below numbers to solve any query or problem before leaving any negative or neutral feedback. Leaving negative or neutral feedback will not solve any problem. Â· We are available to help you and solve any queries that you may have. Contact Details For any Queries or Complaints you can Email us on ephotobazaar@gmail.com You can also Contact on 93217 01057 / 022 - 28926050 from Monday to Saturday between 10.00 am to 7 pm.",
    "hotshoe": "-",
    "brand": "Fujifilm",
    "focus": "mode Single AF / Continuous AF (SR AUTO, Movie) type TTL contrast AF AF frame selection Center / Tracking",
    "lens": "name Fujinon 10x optical zoom lens focal length f=5.0 - 50.0mm, equivalent to 28 - 280mm on a 35mm camera full-aperture F3.4(Wide) - F5.6(Telephoto) constitution 8 groups 10 lenses",
    "electronicviewfinder": "-",
    "numberofrecordedpixels": "Still image L: (4:3) 4288x3216 (3:2) 4288x2864 (16:9) 4288x2416 M: (4:3) 3072x2304 (16:9) 3072x1728 S: (4:3) 2048x1536 (16:9) 1920x1080",
    "storagemedia": "Internal memory (none) SD / SDHC memory card *2",
    "otherfunctions": "PictBridge, Exif Print, 35 languages selection, Time difference, Silent mode",
    "shutterspeed": "(Auto mode) 1/4sec. to 1/2000sec., (All other modes) 8sec. to 1/2000sec.",
    "facedetection": "Yes",
    "sensortype": "1/2.3-inch CCD with primary color filter",
    "operatingtemperature": "0Â°C - 40Â°C",
    "imagestabilisation": "CCD shift type",
    "colour": "Grey",
    "operatinghumidity": "10% - 80% (no condensation)",
    "shootingmodes": "SP Portrait, Baby, Smile, Landscape, Panorama, Sport, Night, Night (Tripod), Fireworks, Sunset, Snow, Beach, Party, Flower, Text MODE DIAL SR AUTO, AUTO, Natural Light, Natural Light & with Flash, SP1, SP2, Movie, P",
    "displaysize": "2.7 inch",
    "fileformat": "still image JPEG (Exif Ver 2.3) *3 (Design rule for Camera File system compliant / DPOF-compatible) movie AVI (Motion JPEG) sound WAVE format, Monaural sound",
    "flashmodes": "Red-eye removal OFF : Auto, Forced Flash, Suppressed Flash, Slow Synchro. Red-eye removal ON : Red-eye Reduction Auto, Red-eye Reduction & Forced Flash, Suppressed Flash, Red-eye Reduction & Slow Synchro.",
    "digitalzoom": "Approx. 6.7x (up to approx. 67.0x, with 10x optical zoom)",
    "model": "FinePix T200 / T205",
    "resolution": "14.0 million pixels *1",
    "whitebalance": "Automatic scene recognition Preset Fine, Shade, Fluorescent light (Daylight), Fluorescent light (Warm White), Fluorescent light (Cool White), Incandescent light"
}