{
    "macrohybrid": "Corrects for shift-type camera shake, which typically occurs in macro (close-up) shooting.",
    "creativefilters": "This  setting provides easy access to special filter effects and scene modes,  such as Toy Camera Effect, Poster Effect, Monochrome and more.",
    "dynamic": "Effective for video shooting at wide-angle focal lengths, eliminating the unwanted shaking that typically occurs while walking.",
    "opticalzoom": "30x",
    "aperturepriority": "You set the aperture, controlling depth-of-field. The camera automatically selects the shutter speed.",
    "portrait": "The camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject â\u0080\u009cpop.â\u0080\u009d",
    "category": "camera",
    "powered": "Compensates for hand movement when shooting video at the telephoto end of the zoom range, where camera shake is magnified.",
    "superslowmotionmovie": "Record your clips in high speed (approx. 240 fps), and then watch your videos in slow motion.",
    "movie": "Record video in stereo sound. Unwanted scenes can be deleted in playback mode.",
    "snow": "Shoot clear snow scenes without darkened subjects or an unnatural bluish tint.",
    "program": "Access advanced exposure compensation features while shooting mostly automatically.",
    "discreetmode": "Disables flash, AF assist beam, and all camera sounds with one mode dial setting â\u0080\u0093 so you can capture images in quiet areas.",
    "panning": "Panning motion is detected so that IS does not interfere with desired camera movement.",
    "liveviewcontrol": "Enables Brightness, Color, and Tone adjustments to your images using easy-to-understand controls.",
    "normal": "Corrects for a wide range of camera movement when shooting stills.",
    "mpn": "8409B001",
    "interchangeablelens": "Not Interchangeable Lenses",
    "brand": "Canon",
    "fireworks": "Grab brilliant images of skyrocketing fireworks.",
    "tripod": "When tripod use is detected, the Image Stabilizer is stopped because it is not needed.",
    "smartauto": "The  camera automatically selects the best shooting settings for optimal  quality based on subjects and environmental factors to provide  point-and-shoot simplicity.",
    "lowlight": "For high quality image capture in an amazing range of dimly-lit situations.",
    "faceselftimer": "The camera waits for a face to enter the frame before releasing the shutter.",
    "highspeedburst": "Captures rapid action frame by frame, by shooting continuously at a high speed while the shutter button is held down.",
    "cameratype": "Compact",
    "colour": "Black",
    "manual": "You have complete control of exposure, selecting both aperture and shutter speed manually.",
    "displaysize": "3 inch",
    "digitalzoom": "4x",
    "model": "SX510 HS",
    "shutterpriority": "You  select the shutter speed to stop or blur action, and the camera finds  the appropriate aperture. With slow exposure times, Canon's noise  reduction system activates to ensure low image noise."
}