{
    "weight": "245 gr",
    "moviedigesthybridauto": "Automatically selects shooting settings for optimal quality and records a video clip every time you capture a still image. One day's worth of clips are then combined into a single video.",
    "smartauto": "The camera automatically selects the best shooting settings for optimal quality based on subjects and environmental factors to provide point-and-shoot simplicity.",
    "miniatureeffect": "Give images a miniature look with an effect that emphasizes perspective by blurring the top and bottom of the image.",
    "height": "6.58 cm",
    "monochrome": "Choose from three single-tone effects: Black-and-White, Sepia, or Blue.",
    "aperturepriority": "You set the aperture, controlling depth-of-field. The camera automatically selects the shutter speed.",
    "portrait": "Brings the subject into focus while beautifully blurring the background.",
    "category": "camera",
    "depth": "3.48 cm",
    "smartshutter": "The camera automatically takes the photo when people smile, wink, or get into frame.",
    "postereffect": "Poster Effect combines several similar shades into one color, turning subtle gradations into eye-catching, scene-popping contrasts.",
    "movie": "Record video; unwanted scenes can be deleted in playback mode.",
    "snow": "Shoot clear snow scenes without darkened subjects or an unnatural bluish tint.",
    "sports": "The camera uses high shutter speeds to capture fast-moving subjects.",
    "highspeedbursthq": "Captures fast-action shots at full resolution, providing continuous shooting when the shutter button is held down.",
    "width": "11.28 cm",
    "program": "The camera automatically and intelligently selects the aperture/shutter speed combination based on the shooting conditions.",
    "liveviewcontrol": "Enables Brightness, Color, and Tone adjustments to your images using easy-to-understand controls.",
    "handheldnightscene": "Take clear and steady pictures at night without the use of a tripod.",
    "fisheyeeffect": "Now you can get the fisheye effect â\u0080\u0093 a classic photographic distortion â\u0080\u0093 without a fisheye lens.",
    "brand": "Canon",
    "fireworks": "Create brilliant images of skyrocketing fireworks.",
    "tripod": "When tripod use is detected, the Image Stabilizer is stopped because it is not needed.",
    "iframemovie": "The Apple Â® movie format, iFrame, makes it easier and quicker to import and upload videos while retaining high image quality.",
    "lowlight": "For high quality image capture in an amazing range of dimly lit situations.",
    "toycameraeffect": "Simulates photos taken with \"toy\" or pinhole cameras, darkening the image at the edges to create a vignette effect.",
    "supervivid": "Super Vivid intensifies existing hues, saturating the scene with bright colors.",
    "colour": "Black",
    "manual": "You have complete control of exposure, selecting both aperture and shutter speed manually.",
    "displaysize": "3 inch",
    "superslowmotionmovie": "Record your clips in high speed (approx. 240 fps), and then watch your videos in slow motion.",
    "digitalzoom": "30x",
    "softfocus": "Creates a hazy ambiance that's perfect for portraits and wedding photos.",
    "model": "SX700 HS",
    "shutterpriority": "You select the shutter speed, and the camera automatically selects the appropriate aperture."
}