{
    "jpegediting": "Shadow adjustment, Red-eye fix, Cropping, Aspect, Black&White, Sepia, Saturation, Resize, e-portrait",
    "externalflashconnection": "Hot Shoe, PC Terminal, Proprietary, Wireless",
    "picturemodes": "i-Enhance, Vivid, Natural, Muted, Portrait, Monotone, Custom, e Portrait, Color Creator, Art Filters",
    "battery": "1 x BLS-5 Li-ion battery (included); Records approx. 320 shots per charge",
    "isosensitivity": "Auto, LOW (approx. 100) ? 25600,",
    "boxcontents": "E-M10 Camera body, Li-ion battery BLS-5, Li-ion battery charger BCS-5, USB cable, Shoulder strap, OLYMPUS Viewer 3 (CD-ROM), Instructionmanual, Warranty card",
    "faceandeyedetection": "Available; Eye Detection AF mode: Off / Nearer-eye priority / Right-eye priority / Left-eye priority",
    "wirelessflashcontrolmethod": "Triggered and controlled by built-in flash (Olympus Wireless RC Flash system compatible)",
    "memorycardtype": "SD, SDHC, SDXC",
    "viewfinderpixelcount": "1,440,000",
    "environmentallysealed": "No",
    "touchcontrol": "Shutter release, Enlargement, Live Guide, AF area selection, AF area enlargement and decrease, Frame forward/backward, Enlargement playback,Super Control Panel, Art Filter selection, Scene mode selection, Wi-Fi connection",
    "imagestabilization": "Built-in sensor-shift 3-Axis [compensates 3 types of movements (yaw/pitch/roll movements)]",
    "hdrfunction": "2 HDR modes available plus HDR bracketing (3 or 5 frames in 2.0/3.0 selectable EV steps, 7 frames in 2.0 selectable EV steps)",
    "monitorcoverage": "100%",
    "aspectratio": "16:9",
    "manualfocusassist": "Yes; Focus Peaking function and Magnified Focus Assist function available",
    "simultaneousimagevideorecording": "Yes; shoot (up to 5 fps in P/A/S/M modes) still images (3200x1800 pixels) without interrupting movie recording",
    "category": "camera",
    "photostory": "4 modes available: Standard, Fun Frame, Speed, Zoom In/Out",
    "maxresolution": "15.9MP: 4608 x 3456",
    "maxsyncspeed": "1/250 sec with built-in flash, 1/200 sec with external flashes (excluding FL-50R; 1/800 sec)",
    "weight": "14 oz / 0.87 lb / 396 g (with battery and memory card)",
    "livecontrol": "Battery information, Shooting mode, Shutter speed, Aperture value, Exposure compensation value, ISO sensitivity,Exposure compensationindicator, Exposure indicator, Flash intensity compensation indicator, Date, Auto BKT setting, NR setting, WB, Record mode, Flash Status, Imagesize, Drive mode, Flash intensity compensation value, Metering mode, Recordable still image number, Focusing mode, AF frame, InternalTemperature Warning, IS activating mode, Face detection, My Mode, Multi Exposure, Aspect Ratio",
    "autofocuspoints": "81 (AF grid covers whole frame); Group, Small and Super Spot AF targets available",
    "viewfindereyepoint": "20.00 mm",
    "fileformats": "Still Images: JPEG, MPO, RAW",
    "selftimer": "12 sec, 2 sec",
    "tiltingangle": "Upward tilting angle: up to 80 degrees, Downward tilting angle: up to 50 degrees",
    "playback": "Single-frame, Information display, Index display (4/9/25/100 frames), Calendar, Enlargement (2x - 14x), Movie (with sound, FF/REW/Pause),Picture rotation (auto), Slideshow (with sound including BGM, Slide show effects, replaceable BGM), Light Box display",
    "imagesensortypesize": "4/3 Live MOS",
    "monitoraspectratio": "3:2",
    "eyesensor": "Yes; automatic switching between viewfinder and monitor",
    "afilluminator": "Yes",
    "focustype": "Contrast Detection",
    "viewfindercoverage": "100%",
    "meteringmethod": "Center-weighted average metering, Multi-zone metering, Spot metering",
    "audiorecording": "Built-in Mic: Stereo",
    "bracketing": "Yes; HDR, Exposure, ISO, White Balance, Flash, Art Filter",
    "liveguide": "Color saturation, Color image, Brightness, Blur Background, Express Motion, Shooting Tips",
    "monitorresolutionpixels": "1,037,000",
    "imageaspectratio": "4:3(Default) / 3:2 / 16:9 / 1:1 / 3:4",
    "monitorscreen": "3\" Wide Touchscreen Tilting LCD",
    "viewfindermagnification": "Approx. 1.15x (35mm equivalent: 0.58x)",
    "whitebalancemodes": "Auto, Sunny(5300K), Shadow(7500K), Cloudy(6000K), Incandescent(3000K), Fluorescent(4000K), Underwater, WB Flash(5500K), Custom WB (Kelvinsetting)",
    "brightnesscontrol": "Automatic Adaptive Brightness Technology, 7 levels of manual settings also available",
    "flashcompensation": "-3 EV to +3 EV (in .3, .5 or 1 EV steps)",
    "connectivity": "USB 2.0 Hi-Speed",
    "dustreductionsystem": "Yes",
    "cameraformat": "Micro Four Thirds (2x Crop Factor)",
    "informationdisplay": "Histogram (independent luminance / RGB available), Highlight/Shadow point warning, AF frame, Photographic information, OFF",
    "dimensionswxhxd": "4.7 inch (W) x 3.2 inch (H) x 1.8 inch (D) / 119.1mm (W) _ 82.3mm (H) _ 45.9mm (D)?",
    "rawediting": "RAW development based on settings of the camera (including e-Portrat, Color Creator, Art Filter, ART-BKT). 2 programmable settings, preview capability.",
    "videorecording": "Yes, NTSC/PAL",
    "lensmount": "Micro Four Thirds",
    "imageprocessor": "TruePic VII with Fine Detail Processing II Technology",
    "pixels": "Actual: 17.2 Megapixel",
    "refreshrate": "Normal mode (60 fps): approx. 0.027 sec display lag time",
    "intervalrecording": "Yes; Interval Time 1sec. - 24 Hours, Max 999 frames.",
    "remotecontrol": "RM-UC1 (Optional)",
    "diopteradjustment": "- 4 to +2 m",
    "compatibleexternalflashes": "FL-50R, FL-36R, FL-20, FL-14, FL-300R, FL-600R",
    "languages": "34 languages available: English, French, German, Spanish, Italian, Japanese, Korean, Traditional Chinese, Simplified Chinese, Russian, Czech,Dutch, Danish, Polish, Portuguese, Swedish, Norwegian, Finnish, Croat, Slovenian, Hungarian, Greek, Slovakian, Turkish, Latvian, Estonian,Lithuanian, Ukrainian, Serbian, Bulgarian, Rumanian, Indonesian, Malay, Thai",
    "builtinflash": "Yes",
    "creativefunctions": "HDR, Bracketing, Color Creator, Highlight & Shadow Control, Live Composite (0.5 - 60 sec), Live Bulb, Photo Story, Art Filters, Photo &Movie Capture",
    "exposuremodes": "Manual (M), Aperture Priority (A), Shutter Priority (S), Programmed Auto (P), iAUTO, Scene Selection (SCN), Bulb, Time, Underwater, Art Filter",
    "artfilters": "12 art filters available: Pop Art, Soft Focus, Pale & Light Color, Light Tone, Grainy Film, Pin Hole, Diorama, Cross Process, Gentle Sepia,Dramatic Tone, Key Line, Water Color 7 art effects available: Soft Focus, Pin-Hole, White Edge, Frame, Star Light, Diorama, Picture Tone",
    "supercontrolpanel": "Battery information, Shooting mode, Shutter speed, Aperture value, Exposure compensation value, ISO sensitivity,Exposure compensationindicator, Exposure indicator, Flash intensity compensation indicator, Date, Auto BKT setting, NR setting, WB, WB compensation value, Recordmode, Flash Status, Record mode, Image size, Drive mode, Flash intensity compensation value, Metering mode, Recordable still image number,Focusing mode, AF frame, Colour space, Sharpness, Contrast, Saturation, Internal Temperature Warning Gradation, IS activating mode, Facedetection, My Mode, Multi Exposure, Aspect Ratio, Super FP",
    "shutter": "Type: Mechanical",
    "flashmodes": "Auto, Fill-in, Manual, Off, Red-eye reduction, Slow sync, second-curtain sync, slow sync/red-eye reduction, TTL Auto",
    "focusmode": "Single-AF (S-AF), Continuous-AF (C-AF), Manual Focus (M), S-AF + MF, AF tracking (C-AF + TR)",
    "levelgauge": "2-axis; horizontal /vertical",
    "videocliplength": "Up to 29 Min",
    "viewfindertype": "Electronic",
    "imageediting": "RAW development, Gradation auto, Monochrome, Sepia, Red-eye fix, Saturation, Resize (1280x960, 640x480, 320x240), Trimming, Aspect, e-Portrait,Image Overlay, Postrecording",
    "dedicatedflashsystem": "TTL Groups: 4 (3 external flash groups + built-in flash), Channels: 4",
    "rawbitdepth": "12-bit",
    "continousshootingburstrate": "Up to 8 fps in Single Autofocus mode (S-AF) [Sequential shooting H mode; Focus and exposure are fixed at the values for the first shot]",
    "resolution": "1920 x 1080: 30 fps",
    "operatingenviroment": "Operating",
    "wificapable": "Yes; Built-in Wireless LAN (IEEE 802.11b/g/n)"
}