{
    "meteringrange": "EV 0 - 20 (at normal temperature, 17mm f2.8, ISO 100)",
    "exposurebracketing": "2, 3 or 5 frames in 0.3/0.7/1.0EV steps selectable, 7 frames in 0.3/0.7EV steps selectable",
    "battery": "BLS-5 Li-ion battery (included)",
    "exposuremode": "iAuto, P",
    "attr8fpssequentialshooting": "With the E-PM2 you can take up to eight photos a second, allowing you to easily capture that perfect shot, especially when your subject is moving.",
    "mode": "3 modes (S-I.S.1, S-I.S.2, S-I.S.3), OFF",
    "magnifiedframeaf": "Selectable from over 800 AF pointsEnlarged view check by magnify button (available with old lenses *10) Magnification x5, x7, x10(Default), x14 selectable *10",
    "exposurecompensation": "±3 EV in 1/3, 1/2, 1 EV steps selectable",
    "attr12artfiltersand7artfiltereffects": "Twelve in-camera Art Filters are enhanced by new filter variations, art effects and bracketing. Photographers can use Art Filters in all shooting modes as well as filming HD movies. The Twelve in-camera Art Filters (Pop Art, Soft Focus, Pale and Light Color, Light Tone, Grainy Film, Pin Hole, Diorama, Gentle Sepia, Cross Process, Key Line, Dramatic Tone and NEW Watercolor) are enhanced by new filter variations, art effects and bracketing. Also, the E-PM2 now features the Monochrome Art Filter Effect, where the Picture Tone effect can change the color from normal monotone to sepia, blue, purple, and green.",
    "fulltimeaf": "Available",
    "fastafwithfaceandeyedetect": "The FAST (Frequency Acceleration Sensor Technology) AF System is able to focus at an incredible speed and offers 35 separate focus points that are spread over nearly the entire sensor, which makes it possible for pin-point accurate focusing on small subjects wherever they appear in the frame. Selectable 3x3 groups within the 35-point area are especially effective when shooting active subjects.",
    "shutterspeedrange": "2 - 1/4000 sec. (Not available when Bulb is selected.)",
    "focallengthsetting": "Available",
    "recordingimagesize": "[RAW] 4608 x 3456 pixels [JPEG] 4608 x 3456 pixels - 640 x 480 pixels",
    "numberofrecordablepictures": "Approx. 360 shots [IS ON, CIPA test standard] (with BLS-5 and TOSHIBA super high-speed Class 6 SDHC 4GB card)",
    "sleepmode": "Available (1/3/5 min. off selectable)",
    "category": "camera",
    "availablemanualfocallengthsetting": "Input focal length",
    "inbodyimagestabilization": "Say goodbye to blurry images. Olympus' in-body image stabilization technology makes it possible to use any Micro Four Thirds lenses (or Four Thirds lens), from wide-angle to telephoto, for perfectly clear, crisp photos no matter what the shooting situation, even in low light!",
    "liveguideandnewdirectliveguidebutton": "The E-PM2's Live Guide system allows you to preview effects as you adjust them \u0096 before the image is even captured. With a simple touch, slide through numerous photographic effects, such as brightness, color saturation, blur background, etc. And now, it's even easier to get to the Live Guide menu at the touch of a button on the top of the camera.",
    "immediateresponseonetouchshutterandcontrol": "The E-PM2's Touchscreen reacts quickly with the slightest touch and can focus by touch even if the subject is not in the center. Touch Screen display makes it easy to choose AF points, capture a picture, change camera settings, release the shutter or navigate controls, simply by touching the screen.",
    "newbuiltingrip": "For form, fit and feel. The E-PM2's built-in grip allows for secure and comfortable handling of the E-S3.",
    "attr16mplivemosimagesensor": "Featuring the 16 megapixel Live MOS sensor of the OM-D E-M5, the Olympus Micro Four Thirds flagship, the PEN E-PM2PM2, is optimized to maximize the performance of all mZuiko digital lenses in any shooting condition. Improvements to the sensitivity and read-out speed of the existing sensor makes shooting and Full HD movie recording possible.",
    "recordingformat": "Wave Format (Stereo linear PCM/16-bit, Sampling frequency 48kHz)",
    "newimmediateresponsetouchnavigationon3inchlcd": "The E-PM2 features a vertical bar touch navigation menu. The E-PM2 is designed to optimize the touch screen LCD and was introduced to operate the MENU display with a new simple operation instead of a mode dial. The E-PM2's Touchscreen reacts quickly with the slightest touch and can focus by touch even if the subject is not in the center.",
    "afilluminator": "The addition of this super luminosity LED beam allows the camera to focus faster in low light up to almost 10 feet",
    "bracketingforhdrpostprocess": "3 or 5 frames in 2.0/3.0EV steps selectable, 7 frames in 2.0EV steps selectable. *HDR picture can not be made by this function.",
    "isobracketing": "3 frames in 0.3/0.7/1.0EV steps selectable",
    "type": "Built-in (Imager shift image stabilizer *3) *3",
    "isosensitivity": "AUTO",
    "aelock": "Locked at 1st release of shutter button (can be set to Fn1/Rec button)",
    "filesize": "RAW",
    "monitortype": "3.0-inch wide monitor *8 *8",
    "microphonefunction": "Wind Noise Reduction, Recording Volume Audio dubbing possible for still pictures (up to 30 sec.)",
    "whitebalancecompensation": "±7 steps in each A-B/G-M axis * Except for Custom WB",
    "microphonespeaker": "Stereo/Mono",
    "colortoneselect": "Vivid / Natural",
    "facedetectionafeyedetectionaf": "Available / Available Eye Detection AF mode",
    "artfilterbracketing": "i-Enhance, Vivid, Natural, Muted, Portrait, Monotone, Custom, Art Filters selectable",
    "provendustreductionsystem": "Olympus' Dust Reduction System assures spot-free images, even if you change lenses. Every time you turn on the camera, the patented Supersonic Wave Filter silently vibrates, flinging and collecting dust so that it doesn't interfere with the picture imaging at any time.",
    "focusingpointfocusingpointselectionmode": "35-area multiple AF All target, Group target area (9-area), Single target,(normal) Single target(small)",
    "afsystem": "High-speed imager AF",
    "whitebalancebracketing": "3 frames in 2, 4, 6 steps selectable in each A-B/G-M axis.",
    "truepicviimageprocessor": "TruePic VI Image Processor, designed specifically for the Olympus PEN, features Real Color Technology for improved color reproduction (especially colors such as emerald green, yellow, and gold) and color gradation. The faster processor also allows for a shorter recovery time between shots.",
    "full1080ihdmoviewithartfiltermovie": "Shoot up to 29 minutes of 1080 60i HD video and stereo sound in either .MOV or .AVI formats. A Direct HD Movie Button switches you from still to movie mode with just the press of a button. Shoot movies with Art Filters, and new to the E-PM2, change your Art Filter while shooting your movie and see the transition right on the LCD, without missing a beat.",
    "sceneselectae": "Portrait, e-Portrait, Landscape, Landscape + Portrait, Sport, Night, Night + Portrait, Children, High Key, Low Key, DIS mode, Macro, Nature Macro, Candle, Sunset, Documents, Panorama, Fireworks, Beach & Snow, Fisheye Conv., Wide Conv., Macro Conv., 3D * *Using 3D lens(H-FT012) , still only",
    "meteringsystemttlimagesensormetering": "Digital ESP metering (324-area multi pattern metering), Center weighted average metering, Spot metering, Spot metering with highlight, Spot metering with shadow",
    "brightnesscolortemperaturecontrol": "±7 levels / ±7 levels",
    "bundledflash": "Attachable flash included. This camera provides the flexibility to attach a flash to your camera via the accessory port, or leave it at home for maximum portability.",
    "iauto": "A convenient, fully automated feature that detects the scene and applies the best of six situations just by aiming the camera toward the subject. Backlight adjustments are automatically applied for Portrait and Landscape modes.",
    "touchcontrol": "Touch shutter release, Touch enlargement, Touch Live Guide, AF area selection, AF area enlargement, Frame forward/backward, Enlargement playback, Touch Super Control Panel, Touch Art Filter selection, Touch scene mode selection, Touch stripe screen (picture mode control)",
    "flashbracketing": "3 frames in 0.3/0.7/1.0EV step selectable",
    "whitebalancemode": "Auto WB, 7 Preset WBs, 2 Capture WBs, Custom WB(Kelvin setting)",
    "creativepowerinasmallpackage": "The Olympus PEN E-PM2 is all the proof you need that small and stylish can deliver impressive images. This compact technological wonder features an expansive 16 MP Live MOS sensor and TruePic VI Image Processor for powerfully vivid images that rival the quality of an SLR. Let the camera achieve photographic perfection with features like iAuto and 23 Scene Select Modes. Or take control using Direct Live Guide. Explore your creative side with 12 ready-to-use Art Filters. The PEN E-PM2 features technology to help you shoot brilliantly when light is hard to find. There's blazing speed with an incredibly responsive touch shutter and 8 fps sequential shooting. The PEN E-PM2. The camera you want when you're ready to leave compacts behind and capture your stories in spectacular fashion.",
    "focusmode": "Single AF (S-AF) / Continuous AF (C-AF) *9 / Manual Focus (MF) / S-AF + MF / AF tracking (C-AF + TR) *9 *9",
    "tiltingangle": "-",
    "stabilizationperformance": "maximum 3 EV steps *4 *4",
    "presetwhitebalance": "7 preset WBs (3000K - 7500K) - Sunny(5300K), Shadow(7500K), Cloudy(6000K), Incandescent(3000K), Fluorescent(4000K), Underwater, WB Flash(5500K)",
    "manualfocusassistcustomizefunction": "Live view image is magnified when the focus ring is rotated. (at S-AF+MF or MF mode)",
    "fileformat": "RAW (12-bit lossless compression), JPEG, RAW+JPEG, MPO(3D still)",
    "iso25600": "Stunning low light photos are a click away with an increased ISO sensitivity to 25,600."
}