{
    "producttype": "Micro Four Thirds interchangeable lens system camera",
    "exposurebracketing": "2, 3 or 5 frames in 0.3/0.7/1.0EV steps selectable, 7 frames in 0.3/0.7EV steps selectable",
    "groupno": "4 groups (External flash 3 groups + a bundled flash *17) *17",
    "battery": "BLS-5 Li-ion battery (included)",
    "whitebalancebracketing": "3 frames in 2, 4, 6 steps selectable in each A-B/G-M axis.",
    "attr8fpssequentialshooting": "With the E-PL5 you can take up to eight photos a second, allowing you to easily capture that perfect shot, especially when your subject is moving.",
    "hdmiconnector": "Micro HDMI (Type-D)",
    "mode": "3 modes (S-I.S.1, S-I.S.2, S-I.S.3), OFF",
    "magnifiedframeaf": "Selectable from over 800 AF points Enlarged view check by magnify button (available with old lenses *10) Magnification x5, x7, x10(Default), x14 selectable *10",
    "accessoryport2": "Dedicated multi-connector [Available for VF-2/VF-3, SEMA-1, MAL-1 and PP-1.]",
    "flashmode": "Flash Auto, Redeye, Fill-in, Flash Off, Red-eye Slow sync.(1st curtain), Slow sync.(1st curtain), Slow sync.(2nd curtain), Manual (1/1 (FULL) ~1/64)",
    "fulltimeaf": "Available",
    "fastafwithfaceandeyedetect": "The FAST (Frequency Acceleration Sensor Technology) AF System is able to focus at an incredible speed and offers 35 separate focus points that are spread over nearly the entire sensor, which makes it possible for pin-point accurate focusing on small subjects wherever they appear in the frame. Selectable 3x3 groups within the 35-point area are especially effective when shooting active subjects.",
    "shutterspeedrange": "2 - 1/4000 sec. (Not available when Bulb and Time is selected.)",
    "focallengthsetting": "Available",
    "recordingimagesize": "[RAW] 4608 x 3456 pixels [JPEG] 4608 x 3456 pixels - 640 x 480 pixels",
    "numberofrecordablepictures": "Approx. 360 shots [IS ON, CIPA test standard] (with BLS-5 and TOSHIBA super high-speed Class 6 SDHC 4GB card)",
    "sleepmode": "Available (1/3/5 min. off selectable)",
    "newflipselfportrait3inchlcdscreen": "The E-PL5 features a flip touch screen that rotates 170 degrees and allows you to take self portraits. The E-PL5 is designed to optimize the touch screen LCD and was introduced to operate the MENU display with a new simple operation instead of a mode dial. The E-PL5's Touchscreen reacts quickly with the slightest touch and can focus by touch, also choose what you want to focus on by touch, even if the subject is not in the center.",
    "category": "camera",
    "iauto": "A convenient, fully automated feature that detects the scene and applies the best of six situations just by aiming the camera toward the subject. Backlight adjustment are automatically applied for Portrait and Landscape modes. iAuto is also available for shooting videos.",
    "compatibleexternalflash": "FL-50R, FL-36R, FL-300R, FL600R",
    "immediateresponseonetouchshutterandcontrol": "The E-PL5's Touchscreen reacts quickly with the slightest touch and can focus by touch even if the subject is not in the center. Touch Screen display makes it easy to choose AF points, capture a picture, change camera settings, release the shutter or navigate controls, simply by touching the screen.",
    "attr16mplivemosimagesensor": "Featuring the 16 megapixel Live MOS sensor of the OM-D E-M5, the Olympus Micro Four Thirds flagship, the PEN E-PL5, is optimized to maximize the performance of all mZuiko digital lenses in any shooting condition. Improvements to the sensitivity and read-out speed of the existing sensor makes shooting and Full HD movie recording possible.",
    "recordingformat": "Wave Format (Stereo linear PCM/16-bit, Sampling frequency 48kHz)",
    "proqualityyoufitinyourpocket": "You love being creative. But you also demand superior image quality and uncompromising performance. The PEN E-PL5 is perfect. Shoot images with stunning detail and vivid color thanks to a powerful tandem of a sizeable 16 MP Live MOS Sensor and our TruePic VI image processing engine. Technology like an AF Illuminator and an ISO with speeds that hit 25,600 capture crisp, clear shots in low light. Everything is fast on the PEN E-PL5 from the exceedingly responsive touch screen to 8 fps sequential shooting. Nourish your artistic side with Full HD Video 1080i and 12 Art Filters and Effects. Take full control of your settings with features such as My Set, and a customizable self timer. Unleash your creativity, apply new monochrome Art Filters Effects or edit RAW images right in the camera. The PEN E-PL5. All the professional features you need to take you to the next creative level.",
    "filesize": "RAW",
    "memory": "SD Memory Card *1 (SDHC, SDXC, UHS-I compatible, Flash Air compatible, Eye-Fi Card compatible *2) *1",
    "afilluminator": "The addition of this super luminosity LED beam allows the camera to focus faster in low light up to almost 10 feet",
    "bracketingforhdrpostprocess": "3 or 5 frames in 2.0/3.0EV steps selectable, 7 frames in 2.0EV steps selectable. *HDR picture can not be made by this function.",
    "isobracketing": "3 frames in 0.3/0.7/1.0EV steps selectable",
    "tvinterface": "HDMI (HD/Stereo Sound), VIDEO-OUT(SD/Mono Sound)",
    "channel": "4 channels",
    "incameraslideshowwithbackgroundmusic": "Slideshows have never been easier or more fun to create. The E-PL5's enhanced playback functions allow you to employ effective fade-in/fade-out techniques, control the movie/still mix and speed, and add captivating musical soundtracks.",
    "monitortype": "3.0-inch Tilting wide monitor *8 *8",
    "microphonefunction": "Wind Noise Reduction, Recording Volume Audio dubbing possible for still pictures (up to 30 sec.)",
    "fileformatraw": "(12-bit lossless compression), JPEG, RAW+JPEG, MPO(3D still)",
    "whitebalancecompensation": "±7 steps in each A-B/G-M axis * Except for Custom WB",
    "microphonespeaker": "Stereo/Mono",
    "flashintensitycontrolmethod": "TTL Auto, Auto *13, Manual, super FP*13(FP-TTL AUTO, FP-MANUAL) *13",
    "facedetectionafeyedetectionaf": "Available / Available Eye Detection AF mode",
    "artfilterbracketing": "i-Enhance, Vivid, Natural, Muted, Portrait, Monotone, Custom, Art Filters selectable",
    "provendustreductionsystem": "Olympus' Dust Reduction System assures spot-free images, even if you change lenses. Every time you turn on the camera, the patented Supersonic Wave Filter silently vibrates, flinging and collecting dust so that it doesn't interfere with the picture imaging at any time.",
    "usbavremotecontrollerconnector": "Dedicated multi-connector [USB",
    "focusingpointfocusingpointselectionmode": "35-area multiple AF All target, Group target area (9-area), Single target,(normal) Single target(small)",
    "afsystem": "High-speed imager AF",
    "externalflashintensitytype": "TTL Auto, Auto, Manual, FP-TTL-AUTO, FP-MANUAL",
    "pcinterface": "USB2.0 Hi-Speed",
    "truepicviimageprocessor": "TruePic VI Image Processor, designed specifically for the Olympus PEN, features Real Color Technology for improved color reproduction (especially colors such as emerald green, yellow, and gold) and color gradation. The faster processor also allows for a shorter recovery time between shots.",
    "lensmount": "Micro Four Thirds Mount",
    "availablemanualfocallengthsetting": "Input focal length",
    "brightnesscolortemperaturecontrol": "±7 levels / ±7 levels",
    "colortoneselect": "Vivid / Natural",
    "inbodyimagestabilization": "Say goodbye to blurry images. Olympus' in-body image stabilization technology makes it possible to use any Micro Four Thirds lenses (or Four Thirds lens), from wide-angle to telephoto, for perfectly clear, crisp photos no matter what the shooting situation, even in low light!",
    "flashintensitycontrol": "Up to ±3 EV in 0.3, 0.5, 1 EV steps selectable",
    "attr4xdigitaltouchzoominmovie": "One-touch 4x digital converter for movie. You can zoom easily with the touch LCD.",
    "touchcontrol": "Touch shutter release, Touch enlargement, Touch Live Guide, AF area selection, AF area enlargement, Frame forward/backward, Enlargement playback, Touch Super Control Panel, Touch Art Filter selection, Touch scene mode selection",
    "flashbracketing": "3 frames in 0.3/0.7/1.0EV step selectable",
    "full1080ihdmoviewithartfiltermovieandeffects": "Shoot up to 29 minutes of 1080 60i HD video and stereo sound in either .MOV or .AVI formats. A Direct HD Movie Button switches you from still to movie mode with just the press of a button. Shoot movies with Art Filters, and new to the E-PL5, change your Art Filter while shooting your movie and see the transition right on the LCD, without missing a beat.",
    "whitebalancemode": "Auto WB, 7 Preset WBs, 2 Capture WBs, Custom WB(Kelvin setting)",
    "type": "Built-in (Imager shift image stabilizer *3) *3",
    "synchronizationspeed": "1/250sec. or less *15 *15",
    "attr12artfiltersand7artfiltereffects": "Twelve in-camera Art Filters are enhanced by new filter variations, art effects and bracketing. Photographers can use Art Filters in all shooting modes as well as filming HD movies.The Twelve in-camera Art Filters (Pop Art, Soft Focus, Pale and Light Color, Light Tone, Grainy Film, Pin Hole, Diorama, Gentle Sepia, Cross Process, Key Line, Dramatic Tone and NEW Watercolor) are enhanced by new filter variations, art effects and bracketing. Also, the E-PL5 now features the Monochrome Art Filter Effect, where the Picture Tone effect can change the color from normal monotone to sepia, blue, purple, and green.",
    "focusmode": "Single AF (S-AF) / Continuous AF (C-AF) *9 / Manual Focus (MF) / S-AF + MF / AF tracking (C-AF + TR) *9 *9",
    "tiltingangle": "Upward tilting angle",
    "flashattachment": "Hot shoe",
    "stabilizationperformance": "maximum 3 EV steps *4 *4",
    "presetwhitebalance": "7 preset WBs (3000K - 7500K) - Sunny(5300K), Shadow(7500K), Cloudy(6000K), Incandescent(3000K), Fluorescent(4000K), Underwater, WB Flash(5500K)",
    "manualfocusassistcustomizefunction": "Live view image is magnified when the focus ring is rotated. (at S-AF+MF or MF mode)",
    "liveguide": "The E-PL5's Live Guide system allows you to preview effects as you adjust them \u0096 before the image is even captured. Simply select Live Guide and turn the wheel on the back of the camera to slide through numerous photographic effects, such as brightness, color saturation, tone, etc. Operating the camera is more intuitive with the newly designed user interface. The on-screen graphics have also been updated with a sleeker font design and an automatic pop-up guide in the menu screen.",
    "bundledflash": "Attachable flash included. This camera provides the flexibility to attach a flash to your camera via the accessory port, or leave it at home for maximum portability.",
    "controlmethod": "Triggered and controlled by bundled flash FL-LM1*16 *16",
    "iso25600": "Stunning low light photos are a click away with an increased ISO sensitivity to 25,600.",
    "screensize": "17.3 mm (H) x 13.0 mm (V)"
}