{
    "usablelenses": "PENTAX KAF3, KAF2 (power zoom not compatible), KAF, K-mount (with restrictions) lenses ; compatible with SDM ultrasonic lenses Compatible with S-mount lenses, 67 / 645 / M-42 lenses (adapters ref 37954, 38455 or 30120 required with restrictions)",
    "meteringrange": "EV-3 to EV 18 (at Standard ISO 100/at normal temperature)",
    "autobracketing": "3 frames",
    "features": "World Time: 75 cities (28 time zones) 40 custom functions and memory modes, USER mode (up to 5 settings), RAW/Fx button (One push RAW+, Exposure bracketing, Digital preview, Composition adjustment, Electronic level display, GPS), AF button (Enable AF, Cancel AF), Dials customizable specifically to each exposure modes RAW development Copyright information AF fine adjustment (+/- 10 steps, uniformal or individual adjustement) Resize Cropping (Aspect alteration, Slant adjustment available), Index, Movie Edit (Segmentation, Partial delete), Frame Crop (JPEG) Image processing: Long-exposure Noise Reduction, High-ISO Noise Reduction, DRE (Dynamic Range Enlargement) which provides maximum details in highlights and shadows, Compensation of distortion and lateral chromatic abberration, Cross processing (Shuffle, Preset 1-3, Favorite 1-3), HDR (Auto, standard, Strong 1-3, automatic composition correction function), Multi-exposure (Auto, Standard, Strong 1-3, Automatic composition correction function), Automatic levelling, Composition adjustement (vertical and horizontal range: ±1.5mm), Extended bracketing (White Balance, Saturation, hue, high/low key adjustment, contrast and sharpness bracketing)",
    "weight": "680g body only, 760g loaded and ready with Li-ion battery and SD card",
    "sensitivity": "Auto, Manual: ISO 100 to 12800 (1/3EV, 1/2EV or 1EV steps) Extended sensitivity: from ISO 80 to 51200 Bulb mode: up to ISO 1600",
    "fieldofview": "approx. 100%",
    "metering": "Metering system: TTL open-aperture 77-segment metering Metering mode: Multi-segment, center-weighted or spot metering",
    "height": "97mm",
    "exposurecompensation": "from -2 EV to +1EV (1/3EV steps)",
    "effectivepixels": "approx. 16.3 megapixels",
    "includedsoftware": "PENTAX Digital Camera Utility 4ï»¿",
    "still": "JPEG: [16M] 4928x3264 pixels, [10M] 3936x2624 pixels, [6M] 3072x2048 pixels, [2M] 1728x1152 pixels 4 levels of quality in JPEG (good, better, best, premium) RAW 14 bits : [16M] 4928x3264 pixels",
    "speed": "Auto and Manual : 1/8000 - 30 sec. + Bulb (1/3 or 1/2 EV steps) Continuous shooting: Max. approx. 7.0 fps, JPEG (16M: â˜…â˜…â˜… at Continuous Hi): up to approx. 30 frames, RAW: up to approx. 20 frames*at ISO100 Max. approx. 1.6 fps, JPEG (16M: â˜…â˜…â˜… at Continuous Lo): until SD Memory Card is full, RAW: up to approx. 40 frames Custom Image: Bright, Natural, Portrait, Landscape, Vibrant, Muted, Reversal                 Film, Monochrome, Bleach Bypass",
    "size": "23.7mm x 15.7mm",
    "category": "camera",
    "sensorcleaning": "Dust Removal II mechanism: Image sensor moving mechanism, SP Coating and Dust alert functionï»¿",
    "functions": "Focus modes: AF.A(auto), AF.S(single, with focus lock), AF-C(continuous) 11 AF points (9 cross type in the center) 5-point or 11-point Auto, Select or Center",
    "pc": "Windows XP SP2, Vista TM and 7ï»¿",
    "movie": "FULL HD: 1960x1080 (16:9) at 25fps HD TV: 1280x720 (16:9) at 30 or 25fps VGA: 640x480 (4:3) at 30 or 25fps",
    "digitalfilter": "In Playback mode: Toy Camera, Monochrome, Retro, Colour, High Contrast, Soft, Extract Colour, Star Burst, Sketch, Water Colour, Fish-Eye, Pastel, Slim, Miniature, HDR, Posterization, Base Parameter Adjustment, Custom Filter",
    "depth": "72,5mm",
    "filename": "Date (100_MMDD…), PENTX (100PENTX...)",
    "width": "131mm",
    "magnification": "approx. 0.92x (with FA 50mm F1.4 lens, at infinity)",
    "playback": "Single image or index view (up to 81 images), Image Comparison, Magnification (up to 32x, scroll and quick magnification available), Rotation, Calendar view, Folder view, Histogram (Y histogram, RGB histogram), Slideshow, Bright/Dark area warning, Resize, Cropping, Copyright and detailed Exif information displayï»¿ ï»¿",
    "angleofviewcoverage": "Wide-angle lens, equivalent to 28mm in 35mm formaï»¿t",
    "performance": "Approx. 740 shots with 50% flash*, approx. 980 shots without flash and 440 min in play mode w/ D-LI90 * Tested in compliance with CIPA standard. Actual result may vary according to the shooting conditions/circumstancesï»¿ï»¿ ï»¿",
    "type": "Built-in retractable P-TTL auto pop-up flash",
    "autoexposurelock": "Assignable to AF/AE-L button through the menuï»¿",
    "afassist": "available (at front)",
    "focusingscreen": "Natural Bright Matte III focusing screenï»¿, exchangeable",
    "fileformat": "Still images: RAW 14 bits (PEF, DNG), JPEG (Exif 2.21), DCF 2.0 RAW and JPEG simultaneously recordable JPEG:4 levels of quality (good, better, best, premium) Color space: sRGB, Adobe RGBï»¿ ï»¿ Movies: AVI (Motion JPEG) with monaural sound",
    "xsynchronization": "Hot-shoe flash, 1/180 sec, high speed, P-TTL flash sync available with dedicated wireless system, with dedicated flash",
    "external": "Compatible with SD and SDHC memory cards",
    "diopteradjustment": "approx. -2.5 - +1.5m-1",
    "interface": "Mini-HDMI and AV outputs, compatible with NTSC and PAL, USB 2.0 mini-B (Hi-Speed), DC power input, cable release, X-sync socket, stereo mic. inputï»¿",
    "editing": "Movie editing available Movie processing:Custom Image (Bright, Natural, Portrait, Landscape, Vibrant,           Muted, Monochrome, Reversal Film, Bleach Bypass), Cross processing (Shuffle, preset 1-3, favorite 1-3), Digital filters (Retro, Toy Camera, High-contrast, Extract Colour, Colour)",
    "liveview": "Field of view: Approx. 100% Enlargement: In AF mode: 2x, 4x, 6x, in Manual mode: 2x, 4x, 6x, 8x, 10x Autofocus: Contrast detection, Face detection, phase difference detection Options: Grid pattern, histogram display, bright/dark area warning",
    "shakereduction": "Sensor-shift Shake Reduction, up to 3EV Compatible with ALL PENTAX lenses",
    "modes": "One shot, Self-timer (2 or 12 sec), Continuous shooting (Hi, Lo), Remote control (0, 3 sec or continuous), Super-Impose (up to 9 pictures), Interval up to 999 pictures, Exposure bracketing (2, 3 or 5 frames, also available with self-timer and remote control), Mirror lock-up (w/ or w/o remote control)ï»¿",
    "language": "English, French, German, Spanish, Portuguese, Italian, Dutch, Danish, Swedish, Finnish, Polish, Czech, Hungarian, Turkish, Greek, Russian, Korean, Chinese (Traditional/Simpl.), Japaneseï»¿",
    "cameratype": "TTL autofocus, auto-exposure digital SLR digital-still camera with built-in retractable P-TTL auto pop-up flash",
    "mount": "PENTAX KAF2 bayonet mount",
    "exposuremodes": "Green, Program (P), Sensitivity-Priority (Sv), Shutter-Priority (Tv), Aperture-Priority (Av), Shutter and Aperture Priority (TAv), Metered Manual (M), Bulb, X, User, Video",
    "mac": "OS X 10.3.9 or aboveï»¿",
    "kitcontent": "AV cable, USB cable, Li-ion battery D-LI90, Battery charger D-BC90, AC cable, Strap, Eye cup FR and hot shoe cover (already mounted), Finder cap for ME, Body mount cover, Sync socket 2P cap, Bottom of body's cap, Software",
    "recording": "FULL HD: 1960x1080 (16:9) at 25fps HDTV: 1280x720 (16:9) at 30 or 25fps VGA: 640x480 (4:3) at 30 or 25fpsï»¿ 3 levels of quality (good, better, best)",
    "guidenumber": "approx 13 (ISO 100/m)",
    "compensation": "± 5EV (selectable EV steps: 1/3 or 1/2 steps)",
    "source": "Main: Rechargeable D-LI90 Lithium-ion battery Optional: Battery grip D-BG4 and AC adapter K-AC50E also available",
    "resolution": "Approx. 921 000 dots",
    "whitebalance": "Auto, Daylight, Shade, Cloudy, Fluorescent light (D, N, W, L), Tungsten light, Flash, CTE, Manual (configuration on monitor, colour temperature from 2 500 to 10 000K, 100K steps)ï»¿"
}