{
    "category": "camera",
    "publisher": "Canon",
    "dimensions": "3.0 x 9.4 x 6.1 centimetres (0.25 kg)",
    "shareaddtowishlist": "» Home » Electronics » Computers & Accessories » Computers & Peripherals » PC » Cameras Cameras Canon PowerShot A1400 16 Megapixel 6.9cm Screen Point and Shoot Camera - Black http://www.fishpond.co.uk/Electronics/Canon-PowerShot-A1400-16-Megapixel-69cm-Screen-Point-and-Shoot-Camera-Black/0013803207095 By Canon £187 Free Shipping Worldwide Buy Now Ships from USA supplier Order now for Christmas delivery Rating: 1 2 3 4 5 Register or sign-in to rate and get recommendations. Other Information: 8115B001, A1400 Detailed Description (Manufacturer # 8115B001 ) Features An Optical Viewfinder makes capturing images simple and easy The PowerShot A1400 digital camera gives you a choice that's getting increasingly hard to find on digital cameras today. It's equipped with an Optical Viewfinder in addition to the LCD screen. Many photographers prefer this classic, familiar option that lets you simply hold the camera to your eye and shoot.   DIGIC 4 Image Processor Canon DIGIC Image Processors have set the standard for functionality and performance since their groundbreaking introduction in 1999. With each successive generation, DIGIC Image Processors have brought elevated performance and powerful new features to PowerShot digital cameras. The DIGIC 4 Image Processor has ushered in a new level of picture quality and accelerated processing, making possible features such as high-speed continuous shooting, HD video and Face Detection Self-timer. 720p HD Video You can shoot high definition video anytime, anywhere right from the pocket-sized PowerShot A1400 digital camera. With a simple push of the dedicated movie button, you'll be able to instantly record every moment in motion. 720p HD video is smooth, vivid, and beautifully lifelike, making it an ideal way to capture special memories. In addition to being able to shoot 720p HD video at 25 frames per second, the PowerShot A1400 can also shoot 640 x 480 VGA video at 30* frames per second. Help Button The PowerShot A1400 digital camera is designed to be fun and easy to use, even for beginners. A Help Button on the camera's exterior brings up the help menu any time you need it, right on the LCD screen. From here, you can scroll through a variety of topics that answer your questions with clear explanations, offer helpful shooting advice, and show you diagrams highlighting the position of any buttons you'll need. Specifications 7Image Capture Device Type 16.0 Megapixel 1/2.3-inch CCD Total Pixels 16.6 Megapixels Effective Pixels 16.0 Megapixels Lens Focal Length 5.0 (W) - 25.0 (T) mm (35mm film equivalent: 28 (W) - 140 (T) mm) Digital Zoom 4x Focusing Range Normal: 1.2 in. (3cm) - infinity (W), 3.9 ft. (1.2m) - infinity (T) Macro: 1.2 in. - 1.6 ft. (3-50cm) (W)Macro:1.2 in. - 2.0 ft. (3-60cm) (W) Autofocus System TTL Autofocus Viewfinders Optical Viewfinder Real-image Optical Viewfinder LCD Monitor 2.7-inch TFT Colour LCD with wide-viewing angle LCD Pixels Approx. 230,000 dots LCD Coverage Approx. 100% Aperture and Shutter Maximum Aperture f/2.8 (W) - f/6.9 (T) Shutter Speed 1 - 1/2000 sec. 15 - 1/2000 sec. (Total shutter speed range) Exposure Control Sensitivity Auto, ISO 100/200/400/800/1600 (in P mode)/6400 (in Low Light mode) Light Metering Method Evaluative*, Centre-weighted average, Spot** * Facial brightness is evaluated in Face Detect (Face Detect AE) ** Fixed to centre Exposure Control Method AE Lock Exposure Compensation +/-2 stops in 1/3 stop increments (Not available when shooting movies) White Balance White Balance Control Auto, Daylight, Cloudy, Tungsten, Fluorescent, Fluorescent H, Custom Flash Built-in Flash Auto, On, Slow Synchro, Off Facial brightness is also evaluated in Face Detect. Flash Range 1.6 - 9.8 ft. (W), 3.9 - 6.6 ft. (T) / 50cm - 3.0m (W), 1.2m - 2.0m (T) Recycling Time 10 seconds or less (Battery Voltage: 3.0V) Flash Exposure Compensation N/A Shooting Specifications Shooting Modes Auto, P, Live View Control, Digital IS, Portrait, Face Self-timer, Low Light, Fisheye Effect, Miniature Effect, Toy Camera Effect, Monochrome, Super Vivid, Poster Effect, Snow, Fireworks, Long Shutter *Shooting movies is possible with the movie button. Photo Effects N/A Self Timer Approx. 10-sec delay/approx 2-sec delay/custom* * Delaytime (0 - 15 sec. (in one-second increments), 20/25/30 sec.) and number of shots (1 - 10 shots (in one-shot increments) can be specified. Wireless Control N/A Continuous Shooting Approx: 0.8 shots/sec. (In P Mode) Approx. 2.9 shots/sec. (In Low Light Mode) Image Storage Storage Media SD Memory Card, SDHC Memory Card, SDXC Memory Card File Format Design rule for Camera File System, DPOF (Version 1.1) compliant JPEG Compression Mode Still Images: Exif 2.3 (JPEG) Movies: MOV (Image data: H.264; Audio data: Linear PCM (2 channel monoaural)) Number of Recordable Images Image data Large (L) Medium 1 (M1) Medium 2 (M2) Small (S) Widescreen (W) Medium (M)* File Size (KB) 4,093 2,060 558 150 3,069 1,144 8GB 1,903 3,721 12,927 40,937 2,531 6,638 32GB 7,684 15,020 52,176 165,225 10,219 26,792 *When shooting in Low Light - The approximate number of images recordable on memory cards other than the above can be calculated by using the above figures as a reference and extrapolating accordingly.Time of Recordable Movies Movie data Miniature Effect Other HD: 1280 x 720 640 x 480 HD: 1280 x 720 SD: 640 x 480 5x 10x 20x 5x 10x 20x 25 fps 30 fps*3 5 fps*1 2.5 fps*1 1.25 fps*1 6 fps*2 3 fps*2 1.5*2 fps Movie Size (KB/sec.) 487 243 122 246 123 61 2,621 1,416 8GB 4 hr. 00 min. 33 sec. 7 hr. 34 min. 23 sec. 13 hr. 37 min. 54 sec. 7 hr. 34 min. 23 sec. 13 hr. 37 min. 54 sec. 22 hr. 43 min. 11 sec. 49 min. 15 sec. 1 hr. 28 min. 53 sec. 32GB 16 hr. 11 min. 39 sec. 30 hr. 35 min. 22 sec. 55 hr. 03 min. 40 sec. 30 hr. 35 min. 22 sec. 55 hr. 03 min. 40 sec. 91 hr. 46 min. 07 sec. 3 hr. 19 min. 00 sec. 5 hr. 59 min. 05 sec. *1 Playback frame rate is 25 fps. *2 Playback frame rate is 30 fps*3. *3 Actual frame rate is 29.97 fps. - The approximate number of videos recordable on memory cards other than the above can be calculated by using the above figures as a reference and extrapolating accordingly.Playback Specifications Playback Modes File Still Images and Movies: Auto Rotate, Rotate, Search (Date, Movies, Still Images) Still Images: Single, Index (4-100 Thumbnails), Magnification (Approx. 2x-10x), Information Display (Histogram, Overexposure Warning), Resume Playback, Transition, Red-Eye Correction, i-Contrast, Resize, Photobook Set-up Movies: Normal Playback*1, Pause, Slow Motion, Skip Backward*2, Previous Frame*3, Next Frame*3, Skip Forward*2 - Displays playback position and shooting time *1 Audio settings available in 5 levels *2 Approximately 4 seconds *3 Rewind and Fast-forward are also available Erasing Specifications Erase Modes Single Image*, Erase All - The image data in the memory card stored with the design rule for camera file systems format can be erased (however, protected images cannot be erased). * Movies can be erased individually. Interfaces Computer Interface Hi-Speed USB (Dedicated connector (female) with unified type of digital, audio and video) *2 mini-B compatible. Video Out NTSC/PAL (unified type dedicated connector (female)) with digital, audio and video Audio Out Monaural (unified type dedicated connector (female)) with digital, audio and video Other Memory card slot; direct connexion to Canon SELPHY Compact Photo Printers, PIXMA Inkjet Photo Printers and PictBridge-compatible printers via camera's USB 2.0 Hi-Speed cable Power Source 2 AA Alkaline Batteries (AA NiMH Batteries NB-3AH) Shooting Capacity Normal: Approx. TBA shots Eco Mode: Approx. TBA shots Playback Time Approx. 6 hours (Approx. 13 hrs. with AA NiMH batteries NB-3AH) Physical Specifications Operating Temperature 32-104°F/0-40°C Operating Humidity 10-90% Dimensions (W x H x D) 3.73 x 2.43in x 1.17in. (94.7 x 61.7 x 29.8mm) Weight Approx. 180ml / 174 g (Including the battery and memory card) Approx. 130ml / 126 g (Camera body only) What's in the Box PowerShot A1400 digital camera Wrist Strap WS-800 AA-size Alkaline Battery (x2) Publisher: Canon Dimensions: 3.0 x 9.4 x 6.1 centimetres (0.25 kg)",
    "rating": "1 2 3 4 5 Register or sign-in to rate and get recommendations.",
    "otherinformation": "8115B001, A1400"
}