{
    "effectivemegapixelcount": "20.2",
    "highestresolution": "5472 x 3648",
    "gpsenabled": "Optional",
    "creativezone": "Program AE",
    "partswarranty": "1 Year",
    "sceneintelligentauto": "A fully automatic mode; the    camera analyzes the scene and sets the optimum settings automatically.",
    "imagestabilization": "Optical",
    "lens35mmequivalent": "29-216mm",
    "weightwithbatteryounces": "26.7",
    "shutterpriorityae": "In this mode, you set the shutter speed and the     camera automatically sets the aperture value to suit the brightness of     the subject.",
    "heightinches": "4-1/4",
    "category": "camera",
    "basiczone": "Scene Intelligent Auto",
    "manualfocusing": "Yes",
    "laborwarranty": "1 Year",
    "creativeauto": "The Creative Auto mode enables you to easily    change the picture's brightness, depth of field, and color tone; while the    camera automatically adjusts the exposure.",
    "flashoff": "This mode can be used in places where flash    photography is prohibited, such as museums. It can also be used for    capturing the ambience of a scene, such as candlelight scenes.",
    "hdmioutput": "Mini",
    "filterdiameter": "67mm",
    "adjustableanglelcd": "Yes",
    "hdvideorecording": "1920 x 1080/30p/24p",
    "specialscene": "The camera lets you choose an appropriate scene    setting, and will automatically set the camera to the scene. You can choose    from Portrait, Landscape, Close-up, Sports, Night Portrait, Handheld Night    Scene, and HDR Backlight Control.",
    "internalmemory": "None",
    "bulb": "When the Bulb setting is selected, the shutter stays open    as long as you hold down the shutter button completely, and closes when you    release it. Bulb exposures can be used for night scenes, fireworks, or other    subjects requiring long exposures.",
    "programae": "A general-purpose shooting mode; the camera automatically sets     the shutter speed and aperture value to suit the scene's brightness.",
    "aperturepriorityae": "In this mode, you set the desired aperture     value and the camera sets the shutter speed automatically to suit the     subject brightness.",
    "widthinches": "5-5/8",
    "depthinches": "5-3/4",
    "customshootingmode": "You can register the    current camera settings, including the shooting mode, AF operation, menu    settings, etc., for easy recall.",
    "wifi": "Built-in",
    "opticalzoom": "7.5x",
    "lcdscreensize": "3\"",
    "totalmegapixels": "20.9",
    "digitalzoom": "N/A",
    "manualexposure": "Yes",
    "builtinflash": "Yes"
}