{
    "meteringrange": "EV 0-20 (at 73°F/23°C with EF 50mm f/1.4 lens, ISO 100)",
    "isospeedrange": "For Stills:  Manual setting range of ISO 100-25600 (expansion possible to ISO 50, ISO 51200 and 102400) in 1/3-stop or whole-stop increments)",
    "shutterspeeds": "1/4000 to 30 sec., X-sync at 1/180 sec. (Total shutter speed range. Available range varies by shooting mode.)",
    "afpointselection": "(1) Automatic selection (2) Manual selection",
    "colorfiltersystem": "RGB primary color filters",
    "afworkingrange": "Center AF Point: EV -3 to 18 (at 73°F/23°C, ISO 100) Other AF points: EV +0.5 to 18 (at 73°F/23°C, ISO 100)",
    "drivemodes": "(1) Single shooting (2) Continuous shooting (3) Silent single shooting (4) Silent continuous shooting (5) 10-sec. self-timer/Remote control (6) 2-sec. self-timer",
    "totalpixels": "Approx. 20.6 megapixels",
    "continuousshootingtime": "Based on 8GB Memory card [1920 x 1080] 30 fps/25 fps/24 fps: 32 min. with IPB compression 11 min. with All-I compression [1280 x 720] 60 fps/50 fps: 37 min. with IPB compression 12 min. with All-I compression [640 x 480] 30 fps/25 fps: 97 min. with IPB or All-I compression * The maximum recording time is limited to 29 min. 59 sec.",
    "batterycheck": "Automatic battery level check when power is turned ON Battery level indicated in six levels.*1,2,3 *1 Battery level displayed on LCD panel and in viewfinder. *2 Battery information can be checked with the [Battery info.] menu. *3 If Battery Grip BG-E13 is used with size-AA/LR6 batteries, the battery level is displayed in four levels instead.",
    "workinghumidityrange": "85% or less",
    "dpof": "Complies to DPOF Version 1.1",
    "picturestyle": "Auto, Standard, Portrait, Landscape, Neutral, Faithful, Monochrome, User Defined 1-3",
    "compatibleprinters": "PictBridge-compatible printers",
    "rawjpegsimultaneousrecording": "Large RAW and JPEG images are recorded simultaneously",
    "compatiblelenses": "Canon EF lenses (except EF-S and EF-M lenses)",
    "settings": "Auto, Preset (Daylight, Shade, Cloudy, Tungsten Light, White   Fluorescent Light, Flash), Custom (Approx. 2,000° - 10,000°K), Color   Temperature (Approx. 2,500° - 10,000°K), White Balance Correction, and   White Balance Bracketing",
    "felock": "Provided",
    "griddisplay": "Provided (three grid displays)",
    "exposurecontrol": "(1) Program AE for movie shooting * For shooting modes other than manual exposure and bulb. * Shutter speed 1/30 - 1/4000 sec. (Signal accumulation time), aperture, and ISO speed automatically set. (2) Manual exposure * For manual exposure. * Shutter speed (signal accumulation time), aperture, and ISO speed   (auto/manual) manually set. The shutter speed (signal accumulation time)   is limited to 1/4000 sec. at the maximum and to 1/30 sec. at the   minimum for 24/25/30 fps or 1/60 sec. or higher for 50/60 fps depending   on the frame rate.",
    "weight": "Approx. 26.7 oz. / 755g (CIPA standard) Approx. 24.0 oz. / 680g (Body only)",
    "erase": "Erase single image, erase selected images, erase all images on   folder, erase all images in a card, or erase only unprotected images.",
    "mirror": "Quick-return half mirror (transmission: reflection ratio of 40:60)",
    "category": "camera",
    "afassistbeam": "1) Enable * With an EOS-dedicated Speedlite attached, AF-assist beam is emitted automatically when necessary. 2) Disable 3) IR AF-assist beam only * No AF-assist beam with flash bursts.",
    "shutterlagtime": "(1) During SW-1 ON, time lag between SW-2 ON and start of exposure: approx. 0.060 sec. (2) Time lag between simultaneous SW-1/SW-2 ON and start of exposure: Approx. 0.144 sec. * Time lag with the aperture stopped down by 3.5 stops or less (Excludes AF operation time).",
    "colortemperatureinformationtransmission": "Provided",
    "selftimer": "10-sec. or 2-sec. delay",
    "aelock": "Auto: Applied in One-Shot AF mode with evaluative metering when focus is achieved. Manual: By AE lock button. * During movie shooting, press the <*> button for AE lock and press the  button to cancel AE lock (not automatically cancelled). * AE lock (cancelled automatically when metering timer is turned off)   possible before movie shooting. Movie shooting can start while AE lock   is set.",
    "backuprecording": "N/A",
    "brightnesscontrol": "Manually adjustable to one of 7 levels",
    "mymenuregistration": "Up to six top-tier menu options and Custom Function settings can be registered",
    "protection": "Erase protection can be applied/canceled for a single image, all images in a folder, or all images in the card.",
    "highlightalert": "With single-image display (Info.) and single-image display, overexposed highlight areas will blink.",
    "datetimebattery": "Built-in secondary battery When battery is fully charged, the date/time can be maintained for 3   months. Requires about 8 hours to fully recharge the backup battery.",
    "lensmount": "Canon EF mount",
    "pixels": "Approx: 1,040,000 dots",
    "shootingmodes": "Still photo shooting and video shooting",
    "items": "When you press the Quick Control function button under the following conditions, you can set the functions below: *The settable functions depend on the shooting mode (1) With viewfinder shooting: Shutter speed, aperture, ISO speed, exposure compensation, AEB, flash   exposure compensation, Wi-Fi®, Picture Style, white balance, white   balance correction, Auto Lighting Optimizer, Custom Controls, AF   operation, AF point selection, Drive mode, metering mode, and image   recording quality. (2) During playback: Image protect, image rotate, rating, RAW image processing, resize, highlight alert, AF point, and image jump with mode dial.",
    "range": "Full Range (0-255)",
    "colortemperaturecompensation": "Blue/amber bias: ?9 levels - Magenta/green bias: ?9 levels * Correction based on the current WB mode's color temperature.",
    "fileformat": "MOV (Image data: MPEG-4 AVC / H.264) Audio: Linear PCM (Stereo)",
    "powersaving": "Power turns off after the set time of non-operation elapses * [Auto power off] settable to 1 min., 2 min., 4 min., 8 min., 15 min., 30 min., or disable",
    "interfacelanguages": "25 (English, German, French, Dutch, Danish, Portuguese, Finnish,   Italian, Norwegian, Swedish, Spanish, Greek, Russian, Polish, Czech,   Hungarian, Romanian, Ukraine, Turkish, Arabic, Thai,   Simplified/Traditional Chinese, Korean, Japanese)",
    "battery": "One Battery Pack LP-E6 -  With the AC Adapter Kit ACK-E6, AC power is possible. - With Battery Grip BG-E13, two battery packs (LP-E6) can be used. Or six AA-sized/LR6 batteries can be used",
    "dioptricadjustmentcorrection": "-3.0 to +1.0m-1 (diopter)",
    "compatibleimages": "Not Provided",
    "recordingmedia": "SD card, SDHC card, SDXC memory card * Compatible with Ultra High-Speed (UHS-I) memory cards.",
    "depthoffieldpreview": "Enabled with depth-of-field preview button",
    "framerates": "1920 x 1080 (Full HD): 30p (29.97) / 24p (23.976) / 25p 1280 x 720 (HD): 60p (59.94) / 50p 640 x 480 (SD): 30p (29.97) / 25p",
    "customfunctions": "20 Custom Functions",
    "exposurecontrolsystems": "Creative Zone (1) Program AE (shiftable) (2) Shutter-priority AE (3) Aperture-priority AE (4) Manual exposure (5) Bulb (6) Custom shooting mode Basic zone (1) Scene Intelligent Auto (Program AE / non-shiftable) (2) Creative Auto (3) Special Scene - Portrait - Landscape - Close-up - Sports - Night Portrait - Handheld Night Scene - HDR Backlight Control mode",
    "silentshooting": "Provided (Mode 1 and 2)",
    "batterylife": "1) Camera Body Only:",
    "magnification": "Approx. 0.71x / 33.3°",
    "recordingformat": "Complies with Design rule for Camera File system 2.0 and EXIF 2.30",
    "filesize": "Recording Size: [Full HD] 1920 x 1080 (30 fps/25fps/24fps): 235 MB/min. with IPB compression 685 MB/min. with All-I compression [HD] 1280 x 720 (60 fps/50fps): 205 MB/min. with IPB compression 610 MB/min. with All-I compression [SD] 640 x 480 (30 fps/25fps): 78 MB/min. with IPB compression",
    "workingtemperaturerange": "32-104°F/0-40°C",
    "type": "TFT color, liquid-crystal monitor",
    "exposuresimulation": "Provided",
    "flashexposurecompensation": "?3 stops in 1/3- or 1/2-stop increments",
    "autowhitebalance": "Auto white balance with the image sensor",
    "filenumbering": "The following three types of file numbering methods can be set: (1) Continuous numbering * The numbering of captured images will continue even after you replace the camera's card. (2) Auto reset * When you replace the camera's card, the numbering will be reset to   start from 0001. If the new card already contains images, the numbering   will continue from the last recorded image in the card. (3) Manual reset * Resets the file number to 0001, and creates a new folder automatically.",
    "histogram": "Brightness and RGB can be displayed.",
    "focusingscreen": "Eg-A II provided. Interchangeable with Eg-D and Eg-S. Incompatible with Eg-A.",
    "shutterrelease": "Soft-touch electromagnetic release",
    "imageformat": "Still: JPEG, RAW (14-bit, Canon original), RAW+JPEG Video: MOV (Image data: H.264, Audio: Linear PCM)",
    "focusing": "(1) Autofocus - FlexiZone - Single * One-point, contrast AF. Switching to another AF point is possible. - Face Detection Live mode * Face detection, contrast AF. Face is selectable. - Quick Mode AF * Phase-difference AF with 11 AF points. - Manual Focus 1. Magnified view is not possible during video shooting.",
    "dustdeletionfeature": "(1) Self Cleaning Sensor Unit",
    "afpoints": "11 points Center: cross-type at f/5.6; vertical line-sensitive at f/2.8. Upper and lower AF points: vertical line-sensitive AF at f/5.6. Other AF points: Horizontal line-sensitive AF at f/5.6.",
    "colorspace": "sRGB, Adobe RGB",
    "focusingmodes": "1) Autofocus - One-Shot AF - AI Servo AF - AI Focus AF *Switches between One-Shot AF and AI Servo AF automatically. 2) Manual focus",
    "usbterminal": "For personal computer communication and direct printing (USB 2.0 Hi-Speed)",
    "exposurecompensation": "Provided (?3 stops in 1/3-stop increments) * For movies, even if exposure compensation has been set beyond ?3   stops, exposure compensation up to only ?3 stops will be applied.",
    "coating": "Resin cover and anti-reflection AR coating",
    "selectedafpointdisplay": "Displayed or indicated by superimposed display in the viewfinder and on the LCD monitor.",
    "startuptime": "Approx. 0.1 sec. (Based on CIPA testing standards)",
    "videooutterminal": "(1) AV stereo OUT terminal: NTSC/PAL selectable (2) mini-HDMI OUT terminal (Type C)",
    "meteringmodes": "Real-time evaluative metering with image sensor. (1) Evaluative metering (315 zones) (2) Partial metering (approx. 11% of Live View screen) (3) Spot metering (approx. 3% of Live View screen) (4) Center-weighted average metering",
    "dimensionswxhxd": "Approx. 5.7 x 4.4 x 2.8 in./ 144.5 x 110.5 x 71.2mm",
    "flashmetering": "E-TTL II autoflash (evaluative flash metering and average flash metering)",
    "printableimages": "RAW and JPEG images complying to Design rule for Camera File System * Movies cannot be printed.",
    "monitorsize": "3.0-inches (Screen aspect ratio of 3:2) 7.7cm diagonal (6.37cm wide, 4.25cm high)",
    "continuousshootingspeed": "Continuous shooting: Max. approx. 4.5 fps Silent continuous shooting: Max. approx. 3.0 fps",
    "coverage": "Approx. 100%",
    "aspectratio": "3:2 (Horizontal: Vertical)",
    "lowpassfilter": "Fixed position in front of the CMOS sensor",
    "eyepoint": "Approx. 21mm (At -1m-1 from the eyepiece lens center)",
    "viewfinderinformation": "- AF information AF points and focus confirmation - Exposure information Shutter speed, aperture, ISO speed (always displayed), AE lock, exposure level, exposure warning - Flash information Flash ready, flash exposure compensation, high-speed sync, FE lock - Image information Highlight tone priority (D+), maximum burst (2-digit display), card information - Battery check - Composition information Electronic level - Warning Symbol Displayed if any of the following is set: Monochrome, white balance correction, expanded ISO speed, or spot metering.",
    "customcontrols": "The following camera controls can be customized by assigning the   desired function: Shutter button halfway pressing, AF-ON button, AE   lock button, Depth-of-field preview button, Lens AF Stop button, SET   button, Main Dial, Quick Control Dial, and Multi-controller",
    "displayformat": "Single image display - Two types of single-image full display, two types of shooting information - Index display 4-image index and 9-image index - Jump display Jump 1/10/100 images, Shooting Date, Folder, Movies, Stills, or Rating * Two-image comparative display is not provided.",
    "maximumburst": "Based on 8GB memory Card: JPEG Large/Fine: Approx. 73 Shots RAW: Approx. 14 Shots RAW+JPEG Large/Fine: 7 Shots Based on 8GB UHS-I memory card: JPEG Large/Fine: Approx. 1250 Shots RAW: Approx. 17 Shots RAW + JPEG Large/Fine: 8 Shots * Figures are based on Canon's testing standards (ISO 100 and Standard Picture Style).",
    "pixelunit": "6.55 ?m square"
}