{
    "meteringrange": "EV 0 to EV 20 (At 23°C/73°F and ISO 100, with 50mm f/1.4 lens)",
    "isospeedrange": "Auto, ISO 100 - 6400 (in whole-stop increments), H: 12800",
    "shutterspeeds": "1/4000 to 1/60 sec., X-sync at 1/200 sec. 1/4000 to 30 sec., Bulb (Total shutter speed range. Available range varies by shooting mode.) Settable in 1/3- or 1/2-stop increments.",
    "afpointselection": "(1) Manual selection (2) Auto selection * Automatically set (2) in Basic Zone modes and A-DEP mode.",
    "colorfiltersystem": "RGB primary color filters",
    "viewfindershooting": "LP-E8 x 1Same as (1)",
    "afworkingrange": "EV -0.5 - 18 (at 23°C/73°F and ISO 100, based on Canon's testing standards)",
    "drivemodes": "Single, Continuous, 10-sec. self-timer/Remote control, 2-sec. self-timer, Continuous shooting after 10-sec. self-timer",
    "totalpixels": "Total pixels: Approx. 18.70 megapixels",
    "batterycheck": "Automatic battery level check when power is turned ON. Battery level indicated in one of four levels on LCD monitor.",
    "workinghumidityrange": "85% or less",
    "dpof": "Version 1.1 compatible",
    "recyclingtime": "Approx. 3 sec.",
    "shootingmethod": "BatteryTemperatureShooting Conditions",
    "picturestyle": "Auto, Standard, Portrait, Landscape, Neutral, Faithful, Monochrome, User Defined 1-3",
    "compatibleprinters": "PictBridge-compatible printers",
    "rawjpegsimultaneousrecording": "RAW and Large JPEG images are recorded simultaneously",
    "flashreadyindicator": "Flash-ready icon lights in viewfinder",
    "compatiblelenses": "Canon EF lenses including EF-S lenses (35mm-equivalent focal length is approx.1.6x the lens focal length)",
    "settings": "Auto, Daylight, Shade, Cloudy, Tungsten Light, White Fluorescent Light, Flash, Custom",
    "felock": "Provided",
    "recordingfunctions": "Images record directly to the SD card.",
    "griddisplay": "Two grids provided (not displayed during movie shooting): (1) Grid 1: Pair of vertical and horizontal lines (2) Grid 2: 5 vertical and 3 horizontal lines",
    "exposurecontrol": "Program AE for video shooting, Manual exposure",
    "weight": "Approx. 18.2 oz. / 515g (body only)",
    "liveviewshooting": "LP-E8 x 1Same as (1)",
    "erase": "Erase single image, erase selected images, erase all images on   folder, erase all images in a card, or erase only unprotected images.",
    "mirror": "Quick-return half mirror (transmittance: reflectance ratio of 40:60)",
    "category": "camera",
    "afassistbeam": "(1) Intermittent firing of built-in flash (2) Effective range: Approx. 4 m/13.1 ft at center, approx. 3.5 m/11.5 ft at periphery * With an EOS-dedicated Speedlite attached, the Speedlite's AF-assist beam is emitted instead. * Compatible with assist-beam (intermittent firing) of 320EX, 270EX II and 270EX flashes.",
    "colortemperatureinformationtransmission": "Provided",
    "selftimer": "10-sec. or 2-sec. delay",
    "aelock": "Auto: Applied in One-Shot AF mode with evaluative metering when focus is achieved Manual: By AE lock button",
    "attr1920x1080": "30fps22 min.44 min.330 MB/min.",
    "brightnesscontrol": "Adjustable to one of seven brightness levels",
    "colortemperaturecompensation": "White balance correction: White balance bracketing: Blue/amber bias: ±9 levels Magenta/green bias: ±9 levels ±3 levels, in single-level increments",
    "highlightalert": "On the detailed information and histogram displays, highlight areas with no image data will blink.",
    "datetimebattery": "Built-in secondary battery. When fully-charged, the date/time can be maintained for about three months.",
    "lensmount": "Canon EF mount",
    "pixels": "Approx. 1,040,000 dots",
    "remotecontrol": "(1) The EOS Rebel T3i has a remote control terminal for Remote Switch RS-60E3. (2) Compatible with Remote Controller RC-6, RC-1 and RC-5.",
    "shootingmodes": "Still photo shooting and video shooting",
    "protection": "Erase protection can be applied/canceled for a single image, all images in a folder, or all images in the card.",
    "flashcoverage": "Up to 17mm focal length (equivalent to approx. 28mm in 135 format)",
    "attr1280x720": "60fps22 min.22 min.330 MB/min.",
    "camerausersettings": "Not provided",
    "fileformat": "MOV (image data: H.264; audio: Linear PCM (monaural)) * Meta information is embedded in the MOV file (no separate THM file)",
    "powersaving": "Power turns off after the set time of non-operation elapses * [Auto power off] settable to 30 sec., 1 min., 2 min., 4 min., 8 min., or 15 min.",
    "interfacelanguages": "25 (English, German, French, Dutch, Danish, Portuguese, Finnish,   Italian, Norwegian, Swedish, Spanish, Greek, Russian, Polish,   Hungarian, Czech, Romanian, Ukraine, Turkish, Arabic, Thai, Simplified   Chinese, Traditional Chinese, Korean and Japanese)",
    "battery": "Battery Pack LP-E8 x 1 * With the AC Adapter Kit ACK-E8, AC power is possible. * With BG-E8, two battery packs (LP-E8) can be used. Or six size-AA/LR6 batteries can be used.",
    "dioptricadjustmentcorrection": "Adjustable from approx. -3.0 to +1.0 m-1 (dpt)",
    "recordingmedia": "SD/SDHC/SDXC card, via external media (USB v.2.0 hard drive, or via Wireless LAN (Eye-Fi card*)) *Canon cameras are not guaranteed to support Eye-Fi card functions,   including wireless transfer. In case of an issue with the Eye-Fi card,   please consult with the card manufacturer. The use of Eye-Fi cards may   not be approved in all regions, or from one region to another; please   contact the card manufacturer for status of approval in the   country/region of use.",
    "depthoffieldpreview": "Enabled with depth-of-field preview button",
    "framerates": "24, 25, 30, 50, or 60 fps (30 fps during magnified view)",
    "customfunctions": "11 Custom Functions with 34 settings settable with the camera",
    "exposurecontrolsystems": "Program AE (Shiftable), Shutter-priority AE, Aperture-priority   AE, Manual exposure, Automatic depth-of-field, Scene Intelligent Auto,   Flash Off, Creative Auto, Programmed Image Control modes, E-TTL II   autoflash program AE",
    "silentshooting": "Not provided",
    "batterylife": "1) Camera body only: Shooting Method Temperature Shooting Conditions AE 100% AE 50%, FA 50% Viewfinder Shooting At 73°F/23°C Approx. 550 Approx. 440 At 32°F/0°C Approx. 470 Approx. 400 Live View Shooting At 73°F/23°C Approx. 200 Approx. 180 At 32°F/0°C Approx. 170 Approx. 150 2) With Battery Grip BG-E8: The figures above are based on CIPA (Camera & Imaging Products Association) testing standards Shooting Method Battery Temperature Shooting Conditions AE 100% AE 50%, FA 50% Viewfinder Shooting LP-E8 x 1 Same as (1) LP-E8 x 2 At 73°F/23°C Approx. 1100 Approx. 880 At 32°F/0°C Approx. 940 Approx. 800 Size-AA/LR6 alkaline batteries At 73°F/23°C Approx. 470 Approx. 270 At 32°F/0°C Approx. 130 Approx. 80 Live View Shooting LP-E8 x 1 Same as (1) LP-E8 x 2 At 73°F/23°C Approx. 400 Approx. 360 At 32°F/0°C Approx. 340 Approx. 300 Size-AA/LR6 alkaline batteries At 73°F/23°C - - At 32°F/0°C - -",
    "magnification": "Approx. 0.85x / 23.8° (with 50mm lens at infinity, -1 m-1 (dpt))",
    "recordingformat": "Design rule for Camera File System 2.0 and 2.30",
    "filesize": "Recording Size: 1920 x 1080 (Full HD), 1280 x 720 (HD), 640 x 480 (SD) Movie-recording Size Total Recording Time File Size 8GB Card 16GB Card 1920x1080 30fps 22 min. 44 min. 330 MB/min. 25fps 24fps 1280x720 60fps 22 min. 22 min. 330 MB/min. 50fps 640x480 30fps 1 hr. 32 min. 3 hr. 4 min. 82.5 MB/min. 25fps * The file system limits the file   size of a single movie clip to 4 GB. If the movie clip reaches 4 GB, the   shooting will stop automatically. This translates to around 11 min. for   1920 x 1080 and 1280 x 720, and around 46 min. for 640 x 480. * Even if the file size of a single movie clip is within 4 GB, movie   shooting will automatically terminate when the movie time reaches 29   min. 59 sec.",
    "workingtemperaturerange": "32-104°F/0-40°C",
    "type": "TFT color, liquid-crystal monitor",
    "exposuresimulation": "Provided",
    "flashexposurecompensation": "±2 stops in 1/3-stop or 1/2-stop increments",
    "sizeaalr6alkalinebatteries": "At 73°F/23°C--",
    "filenumbering": "Consecutive numbering, auto reset, manual reset.",
    "focusingscreen": "Fixed",
    "shutterrelease": "Soft-touch electromagnetic release",
    "imageformat": "22.3 x 14.9 mm (APS-C size)",
    "focusing": "(1) Autofocus (Same as focusing with Live View shooting) Before shooting a movie, A, B, and C below are possible. AF during movie shooting is possible with [AF w/ shutter button during   video]. When this is set to [Enable], A and B below are possible: A. Live mode B. Face detection Live mode C. Quick mode * If C has been set when you start shooting a movie, it will switch to A automatically. (2) Manual focusing * Magnify the image by about 5x or 10x and focus manually. * Magnified view not possible with digital zoom nor during movie shooting.",
    "dustdeletionfeature": "(1) Automatic Sensor Cleaning (2) Dust Delete Data appended to the captured image Removes dust adhering to the low-pass filter. Self-cleaning executed automatically (taking 2 sec.) when power   is turned on or off. Manual execution also possible (taking 5 sec.). Low-pass filter has a fluorine coating. (3)  Manual cleaning of sensor The coordinates of the dust adhering to the low-pass filter are detected by a test shot and appended to subsequent images. The dust coordinate data appended to the image is used by the provided software to automatically erase the dust spots.",
    "flashmeteringsystem": "E-TTL II autoflash",
    "afpoints": "9 points (Center AF point is AF cross-type at f/5.6, Center AF point is vertical line-sensitive at f/2.8.)",
    "colorspace": "sRGB, Adobe RGB",
    "guidenumber": "Approx. 13/43 (at ISO 100 in meters/feet)",
    "at32f0c": "--",
    "focusingmodes": "(1) Autofocus (2) Manual focus (MF) One-Shot AF Predictive AI Servo AF AI Focus AF",
    "movierecordingsize": "Total Recording TimeFile Size",
    "usbterminal": "Hi-Speed USB-standard mini-B terminal for personal computer communications and PictBridge.",
    "exposurecompensation": "±3 stops in 1/3-stop increments",
    "autowhitebalance": "Auto white balance with the image sensor",
    "attr8gbcard": "16GB Card",
    "selectedafpointdisplay": "Indicated by superimposed display in the viewfinder and on the LCD monitor",
    "startuptime": "Approx. 0.1 sec. (Based on CIPA testing standards)",
    "videooutterminal": "(1) Video OUT terminal: NTSC/PAL selectable (2) mini-HDMI OUT terminal",
    "attr640x480": "30fps1 hr. 32 min.3 hr. 4 min.82.5 MB/min.",
    "meteringmodes": "(1) AF point-linked evaluative metering * Used when the AF mode is Face detection Live mode and a face has been detected. (2) Center-weighted average metering * Used during manual focus, when the AF mode is Face detection Live mode   and a face has not been detected. Also used in the Live mode and Quick   mode. * Metering range: EV 0 to EV 20 (At 23°C/73°F and ISO 100, with 50mm f/1.4 lens)",
    "dimensionswxhxd": "Approx. 5.2 x 3.9 x 3.1 in./133.1 x 99.5 x 79.7mm",
    "ae100": "AE 50%, FA 50%",
    "flashmetering": "E-TTL II autoflash",
    "printableimages": "JPEG images complying to Design rule for Camera File System RAW images printable. Movies cannot be printed.",
    "monitorsize": "3.0 in. (Screen aspect ratio of 3:2)",
    "continuousshootingspeed": "Max. approx. 3.7 fps [TD] (with One-Shot AF or AI SERVO AF) * Same as with Battery Grip BG-E8 loaded with size-AA/LR6 alkaline batteries.",
    "coverage": "Approx. 100% Viewing Angle: 170°",
    "aspectratio": "3:2 (Horizontal : Vertical)",
    "lowpassfilter": "Fixed position in front of the CMOS sensor",
    "eyepoint": "Approx. 19 mm (At -1m-1 from the eyepiece lens center)",
    "viewfinderinformation": "1) AF information (AF points, focus confirmation light) 2) Exposure information (Shutter speed, aperture, ISO speed, AE lock, exposure level, spot metering circle, exposure warning) 3) Flash information (Flash ready, flash exposure compensation, high-speed sync, FE lock, red-eye reduction light) 4) Image information (Highlight tone priority, Monochrome shooting,   maximum burst, white balance correction, SD card information) 5) Composition information (Grid, electronic level) 6) Battery check",
    "displayformat": "(1) Single image display (2) Index display Single image, basic information, detailed information, histogram display (3) Jump display (Image jump w/ Main Dial) 4-image index and 9-image index. 1/10/100 images, shooting date, by folder, movies, stills, rating",
    "lpe8x2": "At 73°F/23°CApprox. 400Approx. 360",
    "maximumburst": "JPEG (Large/Fine): approx. 34 RAW: approx. 6 RAW+JPEG (Large/Fine): approx. 3 * The number of possible shots and maximum burst apply to a 4GB card based on Canon's testing standards. * The image file size, number of possible shots, and maximum burst will   vary depending on the shooting conditions (3:2 aspect ratio, subject,   memory card brand, ISO speed, Picture Style, Custom Functions, etc.). * \"F\" indicates that continuous shooting is possible until the card becomes full."
}