{
    "meteringrange": "0 to 20 EV (Matrix or center-weighted metering at ISO 100 equivalent, f/1.4 lens, at 20 deg.C/68 deg.F) 2 to 20 EV (Spot metering at ISO 100 equivalent, f/1.4 lens at 20 deg.C/68 deg.F)",
    "accessoryshoe": "ISO 518 hot-shoe with sync and data contacts and safety lock",
    "batterybatteries": "Rechargeable Li-ion Battery EN-EL14/EN-EL14a EN-EL14: 1900 mAh (TBD), EN-EL14a: TBD",
    "weight": "Approx. 15.1oz. (430 g) camera body only",
    "liveviewautofocus": "Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected",
    "flashsyncspeed": "Up to 1/200 sec, Synchronizes with shutter at 1/200s or slower",
    "liveviewlensservo": "Autofocus (AF): Single-servo AF (AF-S); full-time-servo AF (AF-F) Manual focus (MF)",
    "frameadvancerate": "Up to 5 fps (manual focus, mode M or S, shutter speed 1/250 sec or faster, and other settings at default values)",
    "liveviewshooting": "Yes",
    "exposurecompensation": "±5 EV in increments of 1/3EV",
    "flashmode": "Auto, auto with red-eye reduction, auto slow sync, auto slow sync with redeye reduction, fill-flash, red-eye reduction, slow sync, slow sync with red-eye reduction, rear-curtain with slow sync, rear-curtain sync, off",
    "picturecontrol": "Standard Neutral Vivid Monochrome Portrait Landscape selected Picture Control can be modified",
    "moviemeteringmethod": "Matrix",
    "reflexmirror": "Quick-return type",
    "acadapter": "AC Adapter EH-5b; requires Power Connector EP-5A",
    "flashcompensation": "-3 to +1 EV in increments of 1/3 EV",
    "category": "camera",
    "type": "Single-lens reflex digital camera",
    "exposuremetercoupling": "CPU",
    "operatingenvironment": "32 to 104 deg.F (0 to 40 deg.C) Less than 85% (no condensation)",
    "playbackfunctions": "Full-frame and thumbnail (4, 9 or 72 images or calendar) playback with playback zoom, movie playback, photo and/or movie slide shows, histogram display, highlights, auto image rotation and image comment (up to 36 characters)",
    "moviemaximumrecordingtime": "20 min",
    "viewfindereyepoint": "18mm (-1.0m-1)",
    "autofocussystem": "Nikon Multi-CAM 1000 autofocus sensor module with TTL phase detection",
    "moviemetering": "TTL exposure metering using main image sensor",
    "lensaperture": "Instant-return type Electronically controlled",
    "sensorsize": "23.2 × 15.4 mm CMOS sensor",
    "selftimer": "2 s, 5 s, 10 s, 20 s; 1 to 9 exposures",
    "activedlighting": "On Off",
    "focuspoint": "Can be selected from 11 focus points",
    "shutterreleasemodes": "Continuous high, continuous low - Delayed remote - Quick Response Remote Mode - Quiet shutter-release - Self-timer mode - Single-frame [S] mode",
    "totalpixels": "24.7 million",
    "dimensionswxhxd": "Approx. 4.8in x 3.8in x 2.9in (124 x 98 x 75.5 mm)",
    "viewfinderframecoverage": "95% horizontal 95% vertical Approx",
    "meteringmethod": "Matrix: 3D color matrix metering II (type G and D lenses); color matrix metering II (other CPU lenses) Center-weighted: Weight of 75% given to 8-mm circle in center of frame Spot: Meters 3.5-mm circle (about 2.5% of frame) centered on selected focus point",
    "isosensitivity": "ISO 100 - 12,800 Hi-1 (ISO 25,600)",
    "dynamicafmode": "Number of AF points: 11 (3D-tracking)",
    "dustreductionsystem": "Image Sensor Cleaning Image Dust Off reference data (optional Capture NX 2 software required)",
    "audioinput": "Stereo mini-pin jack (3.5-mm diameter)",
    "viewfindermagnification": "0.85x",
    "monitorsize": "3-in./7.5-cm, approx. 921k-dot (VGA) TFT LCD with 160° viewing angle, approx. 100% frame coverage, and brightness adjustment",
    "tripodsocket": "1/4in (ISO1222)",
    "liveviewafareamode": "Face-priority AF, wide-area AF, normal-area AF, subject-tracking AF",
    "movieaudiorecordingformat": "Linear PCM",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (single-servo AF) Focus can be locked by pressing AE-L/AF-L button",
    "detectionrange": "-1 to 19 EV (ISO 100, 68 deg.F/20 deg.C)",
    "wififunctionality": "Yes, via WU-1a, Eye-Fi Compatible",
    "scenemodes": "Auto - Auto [Flash Off] - Portrait - Landscape - Child - Sports - Close up - Night portrait",
    "fileformat": "NEF (RAW): 12 bit, compressed JPEG: JPEG-Baseline compliant with fine (approx. 1:4), normal (approx. 1:8) or basic (approx. 1:16) compression NEF (RAW) + JPEG: Single photograph recorded in both NEF (RAW) and JPEG formats",
    "liveviewsceneautoselector": "Auto mode Auto (flash off) mode",
    "pictureangle": "Approx. 1.5× lens focal length (35 mm format equivalent); Nikon DX format",
    "autoareaafmode": "Yes",
    "flashcontrol": "TTL: i-TTL flash control using 420-pixel RGB sensor is available with built-in flash and SB-910, SB-900, SB-800, SB-700, SB-600 or SB-400; i-TTL balanced fill-flash for digital SLR is used with matrix and center-weighted metering, standard i-TTL flash for digital SLR with spot metering",
    "lensmount": "Nikon F bayonet mount",
    "shutterspeed": "1/4000 to 30 sec. in steps of 1/3 EV, Bulb",
    "compatiblelenses": "Autofocus is available with AF-S and AF-I lenses; Autofocus is not available with other type G and D lenses, AF lenses (IX-NIKKOR and lenses for the F3AF are not supported) and AI-P lenses; Non-CPU lenses can be used in mode M but the camera exposure meter will not function The electronic rangefinder can be used with lenses that have a maximum aperture of f/5.6 or faster",
    "nikoncreativelightingsystemcls": "CLS Supported",
    "movieaudio": "Built-in microphone, monaural - Optional external stereo mini-pin jack (3.5mm diameter) - Microphone sensitivity can be adjusted\"",
    "viewfinderdiopteradjustment": "-1.7 to +0.5m-1",
    "exposuremeteringsystem": "TTL exposure metering using 420-pixel RGB sensor",
    "shuttertype": "Electronically controlled vertical-travel focal-plane",
    "supportedlanguages": "Arabic, Chinese (Simplified and Traditional), Czech, Danish, Dutch, English, Finnish, French, German, Greek, Hindi, Hungarian, Indonesian, Italian, Japanese, Korean, Norwegian, Polish, Portuguese (Portugal and Brazil), Romanian, Russian, Spanish, Swedish, Thai, Turkish, Ukrainian",
    "imagesensortype": "CMOS",
    "guidenumber": "39/12, 43/13 with manual flash (ft/m, ISO 100, 68 deg.F/20 deg.C) Approx.",
    "builtinflash": "Auto flash with auto pop-up P, S, A, M: Manual pop-up with button release",
    "exposuremodes": "Programmed Auto with flexible Program (P) - Shutter-Priority Auto (S) - Aperture-Priority Auto (A) - Manual (M) - Auto - Auto (flash off)",
    "focusmodes": "Single-servo AF (AF-S) - Continuous-servo (AF-C) - Auto AF-S/AF-C selection (AF-A) - Full-time Servo (AF-A) available in Live View and D-Movie only - Face-Priority AF available in Live View and D-Movie only - Wide area available in Live View and D-Movie only - Normal area available in Live View and D-Movie only - Predictive focus tracking activated automatically according to subject status - Manual focus (M) with electronic rangefinde",
    "storagemedia": "SD, SDHC, SDXC",
    "flashreadyindicator": "Lights when built-in flash or optional flash unit such as SB-910, SB-700, SB-400, SB-300 is fully charged",
    "imageareapixels": "6,000 × 4,000 (L), 4,496 × 3,000 (M), 2,992 × 2,000 (S)",
    "focusingscreen": "Type B BriteView Clear Matte Mark VII screen",
    "effectivepixels": "24.2 million",
    "moviefileformat": "MOV",
    "lensservo": "Autofocus (AF): Single-servo AF (AF-S); Continuous-servo AF (AF-C); Auto AF-S/AF-C selection (AF-A); Predictive focus tracking activated automatically according to subject status",
    "flashsyncterminal": "Sync Terminal Adapter AS-15 (available separately)",
    "filesystem": "Compliant with DCF (Design Rule for Camera File System) 2.0 DPOF (Digital Print Order Format) EXIF 2.3 (Exchangeable Image File Format for Digital Still Cameras PictBridge",
    "viewfinder": "Eye-level pentamirror single-lens reflex viewfinder",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "interface": "Hi-speed USB Video output: NTSC, PAL HDMI output: Type C mini-pin HDMI connector Accessory terminal: Remote cord: MC-DC2 (available separately); GPS unit: GP-1 (available separately)",
    "whitebalance": "Auto, incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual, all except preset manual with fine-tuning"
}