{
    "weight": "6.8oz / 192.8g (camera body only) (Approx.)",
    "batterylifeshotspercharge": "300 shots (CIPA)",
    "shuttertype": "Electronic Shutter",
    "isosensitivity": "160-12800",
    "fastestshutterspeed": "Electronic Shutter: 1/16,000 sec.",
    "exposurecompensation": "±3 EV in increments of 1/3EV",
    "flashmode": "Fill-flash Fill-flash with slow sync Red-eye reduction Red-eye reduction with slow sync Rear curtain sync Rear curtain with slow sync Off",
    "picturecontrol": "Standard Neutral Vivid Monochrome Portrait Landscape Selected Picture Control can be modified User-customizable Settings",
    "moviemeteringmethod": "Matrix Center-weighted: Meters 4.5 mm circle in center of frame Spot: Meters 2 mm circle centered on select focus area",
    "activedlighting": "On Off",
    "lensmount": "Nikon 1 mount",
    "category": "camera",
    "movievideocompression": "H.264/MPEG-4 Advanced Video Coding",
    "cardslot": "1 micro secure digital",
    "operatingenvironment": "32 to 104deg.F (0 to 40deg.C) Less than 85% humidity (no condensation)",
    "autofocussystem": "Hybrid autofocus (phase detection/contrast-detect AF) AF-assist illuminator",
    "monitorresolution": "1,037,000 Dots",
    "sensorsize": "13.2 x 8.8mm",
    "selftimer": "2, 10 sec. Timer duration electronically controlled",
    "focusmodes": "Auto (AF) Auto AF-S/AF-C selection (AF-A) Single-Servo AF (AF-S) Continuous-Servo (AF-C) Full-time Servo (AF-F) Manual Focus (MF)",
    "shutterreleasemodes": "Single-frame [S] mode Continuous Self-timer mode",
    "dimensionswxhxd": "3.9 x 2.4 x 1.1\" / 9.91 x 6.1 x 2.79cm (Approx.)",
    "type": "Advanced Camera with Interchangeable Lenses",
    "flashsyncspeed": "Up to 1/60 sec.",
    "bulbshuttersetting": "Yes",
    "dustreductionsystem": "Image sensor cleaning",
    "monitortype": "TFT-LCD with brightness adjustment",
    "flashcompensation": "-3 to +1 EV in increments of 1/3 EV",
    "monitorsize": "3.0 in. diagonal",
    "tripodsocket": "1/4\"",
    "builtinflash": "Yes",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (single AF)",
    "lensaperture": "Electronically controlled",
    "scenemodes": "Portrait Landscape Night Landscape Night Portrait Close-up Auto",
    "guidenumber": "5/16 (m/ft ISO 100, 20deg.C/68deg.F) Approx.",
    "pictureangle": "Approx. 2.7x lens focal length (Nikon CX format)",
    "interface": "USB: Hi-speed USB HDMI output: Type D mini-pin HDMI connector",
    "afareamode": "Single-point AF: 171 focus areas; the center 105 areas support phase-detection AF Auto-area AF: 41 focus areas Subject tracking Face-priority AF",
    "worldtimesetting": "Yes",
    "moviemetering": "TTL exposure metering using main image sensor",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "supportedlanguages": "Arabic Bengali Chinese (Simplified and Traditional) Czech Danish Dutch English Finnish French German Greek Hindi Hungarian Indonesian Italian Japanese Korean Norwegian Persian Polish Portuguese (European and Brazilian) Romanian Russian Spanish Swedish Tamil Thai Turkish Ukrainian Vietnamese",
    "slowestshutterspeed": "30 sec.; Bulb; Time (requires optional ML-L3 remote control)",
    "exposuremeteringsystem": "TTL metering using image sensor",
    "acadapter": "EH-5b AC Adapter Requires EP-5E Power Supply Connector",
    "flashreadyindicator": "Lights when built-in flash unit is fully charged",
    "imagesensortype": "CMOS",
    "filesystem": "Compliant with DCF (Design Rule for Camera File System) 2.0 DPOF (Digital Print Order Format) EXIF 2.3 (Exchangeable Image File Format for Digital Still Cameras) PictBridge",
    "meteringmethod": "Matrix Center-weighted: Meters 4.5 mm circle in center of frame Spot: Meters 2 mm circle centered on select focus area",
    "exposuremodes": "Programmed Auto with flexible Program (P) Shutter-Priority Auto (S) Aperture-Priority Auto (A) Manual (M) Scene Auto Selector",
    "shootingmodes": "Advanced movie mode (includes HD movie, slow motion, fast motion, jump cut, and 4-second movie) Auto Photo mode Creative mode (including: creative pallet, HDR, easy panorama, soft, miniature effect, selective color, cross process, and toy camera effect) Motion Snapshot (16:9) P programmed auto with flexible program, S shutter-priority auto, A aperture-priority auto, M manual Best Moment Capture mode (includes Slow View, Active Selection, and Smart Photo Selector)",
    "storagemedia": "microSD (micro Secure Digital) microSDHC microSDXC memory cards",
    "fileformat": "Compressed 12-bit NEF (RAW) JPEG: JPEG-Baseline compliant with fine (approx 1:4), normal (approx 1:8) NEF (RAW) + JPEG: Single photograph recorded in both NEF (RAW) and JPEG formats",
    "topcontinuousshootingspeed": "10/20 frames per second with AF, 30/60 fps with focus locked on first frame (at full resolution)",
    "effectivepixels": "18.4 million",
    "moviefileformat": "MOV",
    "imagesensorformat": "CX",
    "movieaudiorecordingformat": "PCM",
    "frameadvancerate": "Approx. 5, 10, 20, 30 or 60 fps",
    "batterybatteries": "EN-EL22 Lithium-ion Battery",
    "whitebalance": "Auto Incandescent Fluorescent Direct Sunlight Flash Cloudy Shade Preset Manual Underwater All except preset manual with fine tuning",
    "flashcontrol": "i-TTL flash control using image sensor available"
}