{
    "movieaudiorecordingdevice": "Built-in monaural microphone",
    "meteringrange": "0 to 20 EV (Matrix or center-weighted metering at ISO 100 equivalent, f/1.4 lens, at 20 deg.C/68 deg.F) 2 to 20 EV (Spot metering at ISO 100 equivalent, f/1.4 lens at 20 deg.C/68 deg.F)",
    "accessoryshoe": "ISO 518 hot-shoe with sync and data contacts and safety lock",
    "weight": "16oz / 455g camera body only",
    "liveviewautofocus": "Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected",
    "flashsyncspeed": "Up to 1/200 sec, Synchronizes with shutter at 1/200s or slower",
    "frameadvancerate": "Up to 3 fps (manual focus, mode M or S, shutter speed 1/250 sec or faster, and other settings at default values)",
    "liveviewshooting": "Yes",
    "imagesensorformat": "DX",
    "autoareaafmode": "Single Area AF Dynamic-area Auto-area AF 3D-tracking (11 points)",
    "flashmode": "Auto Auto with red-eye reduction Fill-flash Auto slow sync Auto slow sync with red-eye correction Rear curtain with slow sync",
    "picturecontrol": "Standard Neutral Vivid Monochrome Portrait Landscape",
    "moviemeteringmethod": "Matrix",
    "reflexmirror": "Quick-return type",
    "flashcompensation": "-3 to +1 EV in increments of 1/3 EV",
    "category": "camera",
    "expandedisosensitivityoptions": "1 EV above ISO 3200 (ISO 6400 equivalent) 2 EV above ISO 3200 (ISO 12800 equivalent) Approx. Auto ISO sensitivity control available",
    "meteringmethod": "Matrix: 3D color matrix metering II (type G and D lenses); color matrix metering II (other CPU lenses) Center-weighted: Weight of 75% given to 8-mm circle in center of frame Spot: Meters 3.5-mm circle (about 2.5% of frame) centered on selected focus point",
    "exposuremetercoupling": "CPU",
    "operatingenvironment": "32 to 104 deg.F (0 to 40 deg.C) Less than 85% (no condensation)",
    "playbackfunctions": "Full frame Calendar Thumbnail (4, 9 or 72 images) Zoom Movie Playback Slideshow Histogram display Highlights Auto image rotation Image Comment (up to 36 characters) Highlight point display",
    "moviemaximumrecordingtime": "10 min",
    "viewfindereyepoint": "18mm (-1.0m-1)",
    "movieframesizepixelsandframerate": "1920 x 1080 (24p): 24 fps (23.976 fps) 1280 x 720 (30p): 30 fps (29.97 fps) 1280 x 720 (25p): 25 fps 1280 x 720 (24p): 24 fps (23.976 fps) 640 x 424 (24p): 24 fps (23.976 fps)",
    "moviemetering": "TTL exposure metering using main image sensor",
    "monitorresolution": "230,000 Dots",
    "sensorsize": "23.1 x 15.4mm",
    "selftimer": "2 sec, 10 sec Timer duration electronically controlled",
    "shuttertype": "Electronically controlled vertical-travel focal-plane",
    "shutterreleasemodes": "Single-frame [S] mode Continuous Self-timer mode Quiet Shutter Release",
    "totalpixels": "14.8 million",
    "monitortype": "TFT-LCD with brightness adjustment",
    "viewfinderframecoverage": "95% horizontal 95% vertical Approx",
    "type": "Single-lens reflex digital camera",
    "isosensitivity": "ISO 100 to 3200 in steps of 1 EV Can also be set to approx. 1 EV above ISO 3200 (ISO 6400 equivalent) or to approx. 2 EV above ISO 3200 (ISO 12800 equivalent Auto ISO sensitivity control available",
    "lensservo": "Autofocus (AF): Single-servo AF (AF-S); Continuous-servo AF (AF-C); Auto AF-S/AF-C selection (AF-A); Predictive focus tracking activated automatically according to subject status",
    "gps": "GP-1 GPS unit",
    "focuspoint": "Can be selected from 11 focus points",
    "dimensionswxhxd": "4.9 x 3.8 x 2.9in / 124.46 x 96.52 x 73.66mm",
    "viewfindermagnification": "0.80x (50mm f/1.4 lens at infinity; -1.0m-1) Approx",
    "monitorsize": "3 in. diagonal",
    "autofocussystem": "Nikon Multi-CAM 1000 autofocus sensor module with TTL phase detection",
    "liveviewafareamode": "Face-priority AF Wide-area AF Normal-area AF Subject-tracking AF",
    "movieaudiorecordingformat": "Linear PCM",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (single-servo AF) Focus can be locked by pressing AE-L/AF-L button",
    "detectionrange": "-1 to 19 EV (ISO 100, 68 deg.F/20 deg.C)",
    "focusingscreen": "Type B BriteView Clear Matte Mark VII screen",
    "fileformat": "NEF (RAW) JPEG: JPEG-Baseline compliant with fine (approx 1:4), normal (approx 1:8), or basic (approx 1:16) compression NEF (RAW) + JPEG: Single photograph recorded in both NEF (RAW) and JPEG formats",
    "liveviewsceneautoselector": "Auto mode Auto (flash off) mode",
    "pictureangle": "Effective picture angle 1.5x (Approx.) conversion factor (Nikon DX format)",
    "interface": "Hi-speed USB Video output: NTSC, PAL HDMI output: Type C mini-pin HDMI connector Accessory terminal: Remote cord: MC-DC2 (available separately); GPS unit: GP-1 (available separately)",
    "activedlighting": "On Off",
    "lensmount": "Nikon F bayonet mount",
    "shutterspeed": "1/4000 to 30 sec. in steps of 1/3 EV, Bulb",
    "batterybatteries": "EN-EL14 Rechargeable Li-ion Battery",
    "tripodsocket": "1/4in (ISO1222)",
    "nikoncreativelightingsystemcls": "Yes Advanced Wireless Lighting supported with SB-900, BS-800, SU-800 as commander; Flash Color Information Communications supported with built-in flash and all CLS-compatible flash units",
    "viewfinderdiopteradjustment": "-1.7 to +0.5m-1",
    "exposuremeteringsystem": "TTL exposure metering using 420-pixel RGB sensor",
    "acadapter": "EH-5a AC Adapter Power Connector EP-5a available separately",
    "supportedlanguages": "Chinese (Simplified and Traditional) Dutch English Spanish Finnish French Italian German Japanese Korean Polish Portuguese Russian Swedish Czech Norweigon Turkish",
    "imagesensortype": "CMOS",
    "exposurecompensation": "±5 EV in increments of 1/3EV",
    "guidenumber": "39/12, 43/13 with manual flash (ft/m, ISO 100, 68 deg.F/20 deg.C) Approx.",
    "builtinflash": "Yes Auto Portrait Child Close-Up Night portrait Auto flash with auto pop-up [P], [S], [A], [M] Manual pop-up with button release",
    "exposuremodes": "Auto modes ( auto, auto [flash off]) Scene Modes Programmed Auto with flexible Program (P) Shutter-Priority Auto (S) Aperture-Priority Auto (A) Manual (M)",
    "scenemodes": "Portrait Landscape Child Sports Close-up Night Portrait",
    "storagemedia": "SD SDHC SDXC memory cards",
    "flashreadyindicator": "Lights when built-in flash or optional flash unit such as SB-900, SB-800, SB-600, SB-400, SB-80DX, SB-28DX or SB-50DX is fully charged Blinks for 3 sec. after flash is fired at full output",
    "imageareapixels": "DX-format (L) 4608 x 3072 (M) 3456 x 2304 (S) 2304 x 1536",
    "effectivepixels": "14.2 million",
    "moviefileformat": "MOV",
    "liveviewlensservo": "Autofocus (AF): Single-servo AF (AF-S); full-time-servo AF (AF-F) Manual focus (MF)",
    "flashsyncterminal": "Sync Terminal Adapter AS-15 (available separately)",
    "filesystem": "Compliant with DCF (Design Rule for Camera File System) 2.0 DPOF (Digital Print Order Format) EXIF 2.21 (Exchangeable Image File Format for Digital Still Cameras PictBridge",
    "lensaperture": "Instant-return type Electronically controlled",
    "viewfinder": "Eye-level pentamirror single-lens reflex viewfinder",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "dustreductionsystem": "Image sensor cleaning Airflow Control System Image Dust Off reference data (optional Capture NX 2 software required)",
    "whitebalance": "Auto Incandescent Fluorescent (7 types) Direct Sunlight Flash Cloudy Shade Preset Manual All except preset manual with fine tuning",
    "flashcontrol": "TTL: i-TTL balanced fill-flash and standard i-TTL flash for digital SLR using 420-pixel RGB sensor are available with built-in flash and SB-900, SB-800, SB-600, or SB-400 (i-TTL balanced fill-flash available when matrix or center-weighted metering) Auto aperture: Available with SB-900/SB-800 and CPU lens Non-TTL auto: Supported flash units include BS-900, SB-800, SB-80DX, SB-28DX, SB-28, SB-27, and SB-22S Distance-priority manual: Available with SB-900 and SB-800"
}