{
    "meteringrange": "at f/1.0 / ISO 320/26° EV 1 to 21. The left triangular LED in the viewfinder blinks when light levels are outside the lower metering range",
    "flashconnection": "Hot shoe with center and control contacts.",
    "weight": "21.16 oz / 600g with battery",
    "viewfinderprinciple": "Large size, bright, combined bright-line viewfinder / rangefinder with automatic parallax compensation",
    "powersupply": "1 rechargeable lithium-ion battery, nominal voltage 3.7V, capacity 1900 mAh. Charge level displayed on monitor screen, when shutter locked in open position (for sensor cleaning), additional acoustic warning signal for insufficient battery charge",
    "shutterspeeds": "In aperture priority mode (A) continuous from 32 s to 1/4000 s. In manual setting mode, 8 s to 1/4000 s in half-speed increments, B for time exposures up to max. 240 s, shortest shutter speed for flash sync, 1/180 s",
    "displaysinflashmode": "Flash ready: constant illumination of flash symbol LED in the viewfinder, flash confirmation: Constant illumination or rapid flashing of the LED after exposure, underexposure indicated by temporarily extinguished LED",
    "flashexposurecorrection": "±3 1/3 EV in 1/3 EV increments, adjustable on SCA 3501/3502 adapter Settings in computer mode for LEICA SF 24D, ±3 EV in 1/3 EV increments, or from 0 to -3 EV in 1 EV increments / adjustable in all modes for LEICA SF 58, ±3 EV in 1/3 EV increments",
    "imagefileformats": "DNG (RAW), uncompressed, JPEG with quality-preserving compression",
    "camerapoweronpoweroff": "Main switch located on the top deck, optional sleep mode for camera electronics after 2 / 5 / 10 minutes, reactivation by slight pressure to shutter release button",
    "colorspaces": "sRGB hardwired",
    "eyepiece": "Adjusted to -0.5 diopters Correction lenses for -3 to +3 dptr. available",
    "category": "camera",
    "selftimer": "Countdown 2 s (in aperture priority mode and manual exposure mode) or 12 s, menu setting option, countdown is indicated by a flashing LED on the front of the camera and a corresponding display on the monitor",
    "flashsync": "Optional, on first or second curtain",
    "continuousshooting": "Approx. 2 fps, 8 frames in sequence",
    "batterycharger": "Inputs: 100-240 V AC , 50/60 Hz, automatic adaptation, or 12/24 V DC; output: 4.2 V DC, 800 mA",
    "imagefieldframing": "By projection of two bright-line frames with each lens attached: for 35 and 135 mm, or for 28 and 90 mm, or 50 and 75 mm. Automatically displayed when lens mount locks. Any of the pairs of bright-line frames can be displayed by moving the frame selection lever",
    "operatingconditions": "32 to 104°F / 0 to +40°C",
    "magnification": "0.68-fold (for all lenses)",
    "tripodthread": "A 1/4 (1/4\") DIN, stainless steel, integrated in base plate",
    "flashmeteringcell": "2 silicon photodiodes with condenser lens in camera base",
    "filesizes": "DNG: 18 MB (compressed), 36 MB (uncompressed), JPEG: approx. 2-10 MB",
    "flashmetering": "Control by center-weighted, TTL pre-flash metering (with SCA-3501/3502 adapters or SCA-3000 standard flash units e.g. Leica SF 24D/Leica SF 58)",
    "material": "Full-metal body in die cast magnesium alloy with synthetic leather trim. Top deck and baseplate in brass with black chrome finish, sapphire glass LCD cover for the monitor screen",
    "displaysontheback": "2.5\" monitor (color TFT-LCD) with 230,000 pixels",
    "longbaserangefinder": "Bright rectangular spot (RF spot) with coincident and superimposed fields in the center of the viewfinder image",
    "shutterrelease": "Three steps: Activation of metering - store metering values (in aperture priority mode) - shutter release. Standard internal threading for remote release",
    "interface": "5-pin Mini-USB 2.0 high-speed socket for fast data transfer",
    "effectiverangefinderbase": "47.1 mm (mechanical rangefinder base 69.25 mm x viewfinder magnification 0.68x)",
    "lensmount": "Leica M bayonet with additional sensor for 6-bit coding",
    "compatibility": "Windows 7 SP1, Windows Vista SP2, Windows XP SP2, Mac OS X 10.6.8 (Snow Leopard) or higher",
    "viewfinderdisplays": "LED-Symbol for flash status (on lower edge) Four-digit, seven-segment digital LED display. Display brightness adapts to ambient light, for: exposure compensation activation warning, display of automatically determined shutter speeds in aperture priority mode, reminder of activated exposure value lock. LED light balance with two triangular outer and one round central LED for manual exposure setting",
    "cameratype": "Compact digital rangefinder system camera with a dedicated black-and-white image sensor",
    "imagesensor": "Active area approx. 23.9 x 35.8 mm, 5212 x 3468 pixels (18 megapixels). Infrared blocking filter for invisible light with wavelengths longer than 700 nm, no low-pass filter",
    "exposuremodes": "Aperture priority (A) / Manual(M)",
    "lenssystem": "Leica M lenses from 16 to 135 mm",
    "storagemedia": "SD-cards from 2 GB, SDHC-cards up to 32 GB",
    "shutter": "Microprocessor-controlled, particularly low-noise, metal-leaf, vertical focal-plane shutter",
    "menulanguages": "German, English, French, Spanish, Italian Japanese, traditional Chinese, simplified Chinese, Russian",
    "isosensitivityrange": "ISO 320/26° to ISO 10000/41°, selectable in 1/3-ISO increments with aperture priority metering (A) and manual exposure settings, choice of automatic control or manual setting. ISO 160 also available as a pull-function",
    "exposuremetering": "Exposure metering through the lens (TTL), center-weighted at working aperture Center-weighted TTL-metering for flash with system-compatible SCA-3000/2 standard flash units",
    "resolution": "Optional resolution, DNG: 5212 x 3468 (18 megapixels), JPEG: 5216 x 3472 (18 megapixels), 3840 x 2592 (10 megapixels), 2592 x 1728 (4.5 megapixels), 1728 x 1152 (2 megapixels), 1280 x 864 (1 megapixel)"
}