{
    "audioinput": "Stereo mini-pin jack (3.5-mm diameter)",
    "accessoryshoe": "ISO 518 hot-shoe with sync and data contacts and safety lock",
    "nikoncreativelightingsystemcls": "Advanced Wireless Lighting supported with built-in flash, SB-910, SB-900, SB-800 or SB-700 as a master flash and SB-600 or SB-R200 as remotes, or SU-800 as commander; built-in flash can serve as master flash in commander mode; auto FP high-speed sync and modeling illumination supported with all CLS-compatible flash units except SB-400; Flash Color Information Communication and FV lock supported with all CLS-compatible flash units",
    "exposurebracketing": "2 to 9 frames in steps of 1/3, 1/2, 2/3 or 1 EV",
    "weight": "Approx. 1,000 g/2 lb 3.3 oz with battery and SD memory card but without body cap; approx. 900 g/1 lb 15.7 oz (camera body only)",
    "battery": "One EN-EL15 Rechargeable Li-ion Battery",
    "flashsyncspeed": "X = 1/250 s; synchronizes with shutter at 1/320 s or slower (flash range drops at speeds between 1/250 and 1/320 s)",
    "metering": "TTL exposure metering using main image sensor",
    "modes": "Live view photography (still images), movie live view (movies)",
    "exposurecompensation": "-5 to +5 EV in increments of 1/3, 1/2 or 1 EV",
    "depthoffieldpreview": "When depth-of-field preview button is pressed, lens aperture is stopped down to value selected by user (A and M modes) or by camera (P and S modes)",
    "reflexmirror": "Quick return",
    "speed": "1/8,000 to 30 s in steps of 1/3, 1/2 or 1 EV, bulb, X250",
    "hdmioutput": "Type C mini-pin HDMI connector; can be used simultaneously with camera monitor",
    "category": "camera",
    "batterypack": "Optional MB-D12 Multi-Power Battery Pack with one EN-EL15/EN-EL18* Rechargeable Li-ion Battery or eight R6/AA-size alkaline, Ni-MH or lithium batteries *Requires BL-5 Battery Chamber Cover (available separately)",
    "usb": "SuperSpeed USB (USB 3.0 Micro-B connector)",
    "audiorecordingformat": "Linear PCM",
    "suppliedaccessoriesmaydifferbycountryorarea": "EN-EL15 Rechargeable Li-ion Battery, MH-25 Battery Charger, DK-17 Eyepiece, UC-E14 USB Cable, USB Cable Clip, Camera Strap, BM-12 LCD Monitor Cover, BF-1B Body Cap, BS-1 Accessory Shoe Cover, ViewNX 2 CD-ROM",
    "isosensitivityrecommendedexposureindex": "ISO 100 to 6400 in steps of 1/3, 1/2 or 1 EV; can also be set to approx. 0.3, 0.5, 0.7 or 1 EV (ISO 50 equivalent) below ISO 100 or to approx. 0.3, 0.5, 0.7, 1 or 2 EV (ISO 25600 equivalent) above ISO 6400; auto ISO sensitivity control available",
    "media": "SD (Secure Digital) and UHS-I compliant SDHC and SDXC memory cards; Type I CompactFlash memory cards (UDMA compliant)",
    "dimensionswxhxd": "Approx. 146 x 123 x 81.5 mm/5.7 x 4.8 x 3.2 in.",
    "selftimer": "2 s, 5 s, 10 s, 20 s; 1 to 9 exposures at intervals of 0.5, 1, 2 or 3 s",
    "syncterminal": "ISO 519 sync terminal with locking thread",
    "magnification": "Approx. 0.7 x (50 mm f/1.4 lens at infinity, -1.0 m -1 )",
    "playback": "Full-frame and thumbnail (4, 9 or 72 images) playback with playback zoom, movie playback, photo and/or movie slide shows, highlights, histogram display, auto image rotation, and image comment (up to 36 characters)",
    "operatingenvironment": "Temperature: 0 to 40C/32 to 104; Humidity: Less than 85% (no condensation)",
    "totalpixels": "36.8 million",
    "flashcontrol": "TTL: i-TTL flash control using 91K-pixel RGB sensor is available with builtin flash and SB-910, SB-900, SB-800, SB-700, SB-600 or SB-400; i-TTL balanced fill-flash for digital SLR is used with matrix and center-weighted metering, standard i-TTL flash for digital SLR with spot metering",
    "autofocus": "Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected)",
    "meteringmethod": "Matrix: 3D color matrix metering III (type G and D lenses); color matrix metering III (other CPU lenses); color matrix metering available with non-CPU lenses if user provides lens data Center-weighted: Weight of 75% given to 12-mm circle in center of frame; diameter of circle can be changed to 8, 15 or 20 mm, or weighting can be based on average of entire frame (non-CPU lenses use 12-mm circle or average of entire frame) Spot: Meters 4-mm circle (about 1.5% of frame) centered on selected focus point (on center focus point when non-CPU lens is used)",
    "lensservo": "Autofocus (AF): Single-servo AF (AF-S); full-time-servo AF (AF-F) Manual focus (M)",
    "dustreductionsystem": "Image sensor cleaning, Image Dust Off reference data (requires optional Capture NX 2 software)",
    "focuspoint": "Can be selected from 51 or 11 focus points",
    "afareamodes": "Face-priority AF, wide-area AF, normal-area AF, subject-tracking AF",
    "supportedlanguages": "Arabic, Chinese (Simplified and Traditional), Czech, Danish, Dutch, English, Finnish, French, German, Indonesian, Italian, Japanese, Korean, Norwegian, Polish, Portuguese, Romanian, Russian, Spanish, Swedish, Thai, Turkish, Ukrainian",
    "releasemode": "S (single frame), CL (continuous low speed), CH (continuous high speed), Q (quiet shutter-release),Frame advance rateWith EN-EL15 batteries (FX/5:4) CL: approx. 1 to 4 fps, CH: approx. 4 fps, (DX/1.2x) CL: approx. 1 to 5 fps, CH: approx. 5 fps Other power sources (FX/5:4) CL: approx. 1 to 4 fps, CH: approx. 4 fps, (1.2x) CL: approx. 1 to 5 fps, CH: approx. 5 fps, (DX) CL: approx. 1 to 5 fps, CH: approx. 6 fps",
    "picturecontrolsystem": "Can be selected from Standard, Neutral, Vivid, Monochrome, Portrait, Landscape; selected Picture Control can be modified; storage for custom Picture Controls",
    "tripodsocket": "1/4 in. (ISO 1222)",
    "imagesizepixels": "FX format (36 x 24): 7,360 x 4,912 (L), 5,520 x 3,680 (M), 3,680 x 2,456 (S) 1.2x (30 x 20): 6,144 x 4,080 (L), 4,608 x 3,056 (M), 3,072 x 2,040 (S) DX format (24 x 16): 4,800 x 3,200 (L), 3,600 x 2,400 (M), 2,400 x 1,600 (S) 5:4 (30 x 24): 6,144 x 4,912 (L), 4,608 x 3,680 (M), 3,072 x 2,456 (S) FX-format photographs taken in movie live view*: 6,720 x 3,776 (L), 5,040 x 2,832 (M), 3,360 x 1,888 (S) DX-format photographs taken in movie live view*: 4,800 x 2,704 (L), 3,600 x 2,024 (M), 2,400 x 1,352 (S) *Photographs taken in movie live view have an aspect ratio of 16:9; A DX-based format is used for photographs taken using the DX (24 x 16) image area; an FX-based format is used for all other photographs",
    "flashcompensation": "-3 to +1 EV in increments of 1/3, 1/2 or 1 EV",
    "diopteradjustment": "-3 to +1 m -1",
    "focuslock": "Focus can be locked by pressing shutter-release button halfway (single-servo AF) or by pressing AE-L/AF-L button",
    "detectionrange": "-2 to +19 EV (ISO 100, 20C/68F)",
    "videocompression": "H.264/MPEG-4 Advanced Video Coding",
    "focusingscreen": "Type B BriteView Clear Matte Mark VIII screen with AF area brackets and framing grid",
    "fileformat": "MOV",
    "adlbracketing": "2 frames using selected value for one frame or 3 to 5 frames using preset values for all frames",
    "whitebalancebracketing": "2 to 9 frames in steps of 1, 2 or 3",
    "activedlighting": "Can be selected from auto, extra high, high, normal, low or off",
    "lensmount": "Nikon F mount (with AF contacts)",
    "dualcardslots": "Either card can be used for primary or backup storage or for separate storage of NEF (RAW) and JPEG images; pictures can be copied between cards",
    "monitor": "8-cm (3.2-in.), approx. 921k-dot (VGA) TFT LCD with 170viewing angle, approx. 100% frame coverage, and automatic monitor brightness control using ambient brightness sensor",
    "audiooutput": "Stereo mini-pin jack (3.5-mm diameter)",
    "eyepoint": "17 mm (-1.0 m -1 ; from center surface of viewfinder eyepiece lens)",
    "acadapter": "EH-5b AC Adapter; requires EP-5B Power Connector (available separately)",
    "flashbracketing": "2 to 9 frames in steps of 1/3, 1/2, 2/3 or 1 EV",
    "compatiblelenses": "Compatible with AF NIKKOR lenses, including type G and D lenses (some restrictions apply to PC-NIKKOR lenses), DX lenses [using DX (24 x 16) image area], AI-P NIKKOR lenses, and non-CPU AI lenses (exposure modes A and M only); IX-NIKKOR lenses, lenses for the F3AF, and non-AI lenses cannot be used The electronic rangefinder can be used with lenses that have a maximum aperture of f/5.6 or faster, employing eleven focus points with lenses that have a maximum aperture of f/8 or faster",
    "filesystem": "DCF (Design Rule for Camera File System) 2.0, DPOF (Digital Print Order Format), Exif (Exchangeable Image File Format for Digital Still Cameras) 2.3, PictBridge",
    "type": "Electronically-controlled vertical-travel focal-plane shutter",
    "imagesensor": "35.9 x 24.0 mm CMOS sensor (Nikon FX format)",
    "exposuremodes": "Programmed auto with flexible program (P); shutter-priority auto (S); aperturepriority auto (A); manual (M)",
    "flashreadyindicator": "Lights when built-in flash or optional flash unit is fully charged; blinks after flash is fired at full output",
    "flashmodes": "Front-curtain sync, slow sync, rear-curtain sync, red-eye reduction, red-eye reduction with slow sync, slow rear-curtain sync; auto FP high-speed sync supported",
    "rangeiso100f14lens20c68f": "Matrix or center-weighted metering: 0 to 20 EV Spot metering: 2 to 20 EV",
    "framesizepixelsandframerate": "1,920 x 1,080; 30p, 25p, 24p 1,280 x 720; 60p, 50p, 30p, 25p; actual frame rates for 60p, 50p, 30p, 25p, and 24p are 59.94, 50, 29.97, 25, and 23.976 fps respectively; options support both high and normal image quality",
    "effectivepixels": "36.3 million",
    "builtinflash": "Manual pop-up with button release and a guide number of approx. 12/39, 12/39 with manual flash (m/ft, ISO 100, 20C/68F)",
    "lensaperture": "Instant return, electronically controlled",
    "audiorecordingdevice": "Built-in monaural or external stereo microphone; sensitivity adjustable",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "framecoverage": "FX (36 x 24): Approx. 100% horizontal and 100% vertical 1.2x (30 x 20): Approx. 97% horizontal and 97% vertical DX (24 x 16): Approx. 97% horizontal and 97% vertical 5:4 (30 x 24): Approx. 97% horizontal and 100% vertical",
    "whitebalance": "Auto (2 types), incandescent, fluorescent (7 types), direct sunlight, flash, cloudy, shade, preset manual (up to 4 values can be stored) and color temperature setting (2,500 K to 10,000 K); fine-tuning available for all options",
    "exposuremetercoupling": "Combined CPU and AI",
    "viewfinder": "Eye-level pentaprism single-lens reflex viewfinder"
}