{
    "hybridauto": "The PowerShot SX600 HS camera features Hybrid Auto, which records up to four seconds of video every time you shoot a still image, then automatically joins the clips and pictures* into a video that captures the essence of special days: vacations, important occasions, or any time you're shooting many shots in a day. With Hybrid Auto, this \"highlight reel\" is stunningly beautiful. Hybrid Auto automatically recognizes the scene and optimizes camera settings to capture the highest possible image quality. The resulting 720p HD video is properly exposed, crisp and steady.",
    "miniatureeffecthd1280x720": "6 fps / 3 fps / 1.5 fps",
    "miniatureeffect640x480": "6 fps / 3 fps / 1.5 fps",
    "infinity": "9.8 ft. (3m) - infinity (W, T)",
    "category": "camera",
    "focusingrangenormal": "2.0 in. (5cm) - infinity (W), 3.3 ft. (1m) - infinity (T) Macro",
    "attr30fps2": "30 fps*230 fps*2",
    "mobiledeviceconnectbutton": "It's now easier than ever to connect your PowerShot SX600 HS camera to an iOS® or Android™ device* using the Mobile Device Connect Button. The button allows you to choose to transfer images to your smartphone or tablet for immediate sharing with the CameraWindow app**, or to your computer on the same network with Image Sync to make saving and organizing your images easier. Once your device is registered on the camera, simply press the Mobile Device Connect button for easy connection. By connecting to a smartphone with the CameraWindow app using the Mobile Device Connect Button, you can browse and share images while still leaving the camera inside a bag. It is also possible to turn off the PowerShot SX600 HS quickly and easily, directly from a smartphone. Once your camera is linked to your computer on the same wireless network, you can automatically transfer images to it, for easy saving and organizing of your photos. The Mobile Device Connect Button is great for quick and easy sharing from a fun day out with friends and family.",
    "normal": "2.0 in. (5cm) - infinity (W), 3.3 ft. (1m) - infinity (T)",
    "ecomode": "The PowerShot SX600 HS features ECO Mode, which provides more shots per single charge through LCD monitor and camera power management. ECO Mode can be activated for easy power preservation when an outlet is unavailable or the moment is too exciting to put the camera down. The mode quickly wakes the camera from sleep when a button is pressed. With ECO Mode activated to conserve power, you can even stay connected for longer with the built-in Wi-Fi® featured on the camera. When the fun with family and friends runs late into the night, you can be assured your camera can keep up.",
    "largel1": "SF5,5231,4115,696",
    "attr1": "1 - Large",
    "attr640x480": "30 fps (29.97)",
    "attr3": "2 - Large",
    "attr4": "3 - Large",
    "builtinnfcnearfieldcommuniticationforeasierwificonnectivity": "The PowerShot SX600 HS camera supports NFC (Near Field Communication) technology, eliminating the need to find and open the Canon CameraWindow app* on your mobile device. Simply touch the NFC icon on your camera to your compatible Android device**, and the CameraWindow app will launch automatically for quick, easy sharing of your images. Built-in NFC technology also makes it simpler to install the app. If the app hasn't been installed yet, once you touch the devices together for the first time, the download screen will display automatically.",
    "moviesizekbsec": "3,7421,055450",
    "filesizekb": "8GB32GB",
    "smalls": "SF18835,089141,622",
    "stillimages16": "9 - Large",
    "creativeshotmode": "In addition to the versatile power of its amazing 18x Optical Zoom, the PowerShot SX600 HS also turns out impressive artistic photos with Creative Shot mode. Rather than randomly applying filters, Creative Shot mode takes advantage of advanced Canon technologies to analyze the individual scene, subject and exposure to apply any of 46 filter options. In addition to the original shot, the camera automatically produces and saves five additional variations of the composition. Filter choices are grouped into Retro, Monochrome, Special and Natural categories to make exploring the world of artistic photography fun and easy, or simply select Auto to access the full range of effects. With Creative Shot mode, the result is stunning artistic photos that are perfect for sharing.",
    "autofocussystem": "TTL Autofocus, Manual Focus",
    "focallength": "4.5 (W) - 81.0 (T) mm (35mm film equivalent",
    "attr8gb": "34 min. 38 sec.2 hrs. 00 min. 15 sec.4 hrs. 15 min. 32 sec.",
    "hd1280x720": "30 fps (29.97)",
    "attr32gb": "2 hrs. 19 min. 56 sec.8 hrs. 05 min. 48 sec.17 hrs. 12 min. 20 sec.",
    "attr169": "3:24:3",
    "smartauto": "Sophisticated Canon technology that makes getting that great shot as simple as pressing the shutter button, Smart AUTO automatically detects scenes by assessing various factors in both the background and the subject. On the PowerShot SX600 HS, detected scenes are analyzed using 32 predefined shooting situations. The camera then makes optimal settings to ensure the best possible image capture, whether you're shooting stills or video. Smart AUTO also includes Advanced Subject Detection, which allows the camera to detect and track non-human moving subjects like animals and vehicles. With Smart AUTO, all you have to do is frame your shot and capture away.",
    "intelligentis": "It's easy to capture clear, steady images with the PowerShot SX600 HS, even in low light without using a tripod. That's because the camera is equipped with Canon's innovative Intelligent IS. The system automatically analyzes camera movement and applies the best shake correction method for the shooting situation – allowing you to focus on framing and capturing your shot. For stills, the system selects from Normal IS, Panning IS, Macro (Hybrid) IS and Tripod modes. When shooting video, the system selects from Dynamic IS, Powered IS, Macro (Hybrid) IS and active Tripod IS modes. New icons clearly mark the image stabilization mode, whether you?re shooting still images or video.",
    "f": "11349,125198,271",
    "mediumm": "FN/A",
    "remoteshooting": "With the built-in Wi-Fi® on the PowerShot SX600 HS, you can use your smartphone or tablet* to remotely control the camera. Simply connect wirelessly to your device and access the free Canon CameraWindow app**. Your device will show a live image of the camera's capture – perfect for a commemorative group photo, wildlife shots and all kinds of situations. The camera's versatile 18x Optical Zoom, flash, self-timer and shutter are all under your control, with images being saved to your camera as usual.",
    "videosfullhd1920x1280": "30 fps (29.97) HD 1280 x 720",
    "attr16": "9 - Large",
    "digitalzoom": "4.0x",
    "fullhd1920x1280": "30 fps (29.97)",
    "medium2m2": "SF1,2126,29725,418",
    "macro": "2.0 in. - 1.6 ft. (5-50cm) (W)",
    "medium1m1": "SF2,9402,64010,659"
}