{
    "videos": "Normal Playback, Skip Backward, Previous Frame, Next Frame, Skip Forward, Resume Playback, Erase Clip, Edit Digest Movie",
    "stillimages": "Single, Index, Magnification (Approx. 2x-10x), Thumbnails, Information Display, Histogram, Overexposure Warning, Resume Playback, Red-Eye Correction, Cropping, i-Contrast, Resize, My Colors,",
    "raw": "RAW19,0994091,65619,0314101,662",
    "builtinwifi": "The PowerShot G1 X Mark II is equipped with built-in Wi-Fi® technology for convenient sharing and transferring of your still images and video. Easily post your images to social networking and media sites – Facebook®, Twitter®, YouTube™, Flickr® and now Google Drive™ – through CANON iMAGE GATEWAY#directly from your PowerShot camera, or save them to the online photo album to share anytime, anywhere. The camera can also connect directly to both iOS® and Android™ devices*, and upload images via the free Canon CameraWindow app** without a computer. You can control the destination of your uploads to share with everyone or to selected groups, and even add comments. Sharing video is also easy with the PowerShot G1 X Mark II, which records video using the MP4 format with minimal file size. Enhanced Wi-Fi®makes posting in real time possible, so you can keep everyone up to date with amazing photos and video even as events unfold. The built-in Wi-Fi® technology on the PowerShot G1 X Mark II also allows you to transfer images to other Wi-Fi® equipped PowerShot cameras or print your photos directly to a PictBridge (Wireless LAN) certified printer.One-touch connection to your mobile device or computer is also made possible on the PowerShot G1 X Mark IIwith the camera's dedicated Mobile Device Connect Button. You can choose to transfer images to your smartphone or tablet for immediate sharing with the CameraWindow app*****, or to your computer on the same network with Image Sync to make saving and organizing your images easier. When the camera finds a linked computer on the same wireless network, images are sent directly to it. Otherwise, images are temporarily stored on CANON iMAGE GATEWAY# then transferred once a connection is made, eliminating the need for cables.",
    "digestmovie1280x720": "30 fps (29.97)",
    "category": "camera",
    "attr6fps1": "3 fps*11.5 fps*16 fps*13 fps*11.5*1fps",
    "attr30fps2": "30 fps*230 fps*2",
    "attr640x480": "30 fps (29.97)",
    "starshootingmodes": "Starry skies were formerly out of reach to all but experienced SLR camera users, but star shooting modes on the PowerShot G1 X Mark II camera make these wonderfully impressive images accessible to all. With just a tripod and simple settings, you can capture exquisite Star Nightscapes, Star Trails, Star Time-Lapse Movies and Star Portrait. The new Star Portrait mode, which consecutively takes two shots of the subject plus one of the night sky and then merges them into a single image, enables beautiful portraits with a starry background. The modes can be performed fully automatic or with manual controls for extra versatility. Support functions including Night Display, Color Adjustment and Star Emphasis make any starry sky easier to capture.",
    "canonhssystem": "The Canon HS SYSTEM lets you take bright, clear photos in an even wider range of shooting situations. Beautiful low-light shots are possible with minimal noise and maximum detail in highlight and shadow areas. The system is the result of two technologies in the PowerShot G1 X Mark II: the amazing 1.5-inch High-Sensitivity CMOS imaging sensor, which is able to capture more light; and the DIGIC 6 Image Processor, which actively reduces noise at high ISO speeds and processes images at high speed, even at full resolution. Thus, the Canon HS SYSTEM allows you to use higher shutter speeds to capture clearer images with reduced noise and blur in more situations.",
    "moviesizekbsec": "2,945992381",
    "miniatureeffect640x4801": "6 fps, 3 fps, 1.5 fps",
    "filesizekb": "8 GB32 GBFile Size (KB)8 GB32 GB",
    "largel": "SF4,5641,7056,8833,6512,1168,545",
    "smalls": "SF18835,089141,62215040,937165,225",
    "fullhd1920x1080": "HD: 1280 x 720640 x 480",
    "attr8gb": "43 min. 29 sec.2 hrs. 03 min. 55 sec.5 hrs. 14 min. 34 sec.",
    "hd1280x720": "30 fps (29.97)",
    "attr32gb": "2 hrs. 55 min. 43 sec.8 hrs. 20 min. 32 sec.21 hrs. 10 min. 38 sec.",
    "attr169": "3:24:3",
    "opticalimagestabilizer": "Handheld shooting can often lead to camera shake, making photos and videos blurry. Canon's Optical Image Stabilizer is a sophisticated system that uses lens-shift technology to correct for unwanted camera movement. It makes handheld photography more practical in more shooting situations, providing excellent image quality in many difficult situations: outdoors at dusk, inside without a flash, and even at the telephoto end of the zoom range without a tripod. For still photos, it enables shooting at slower shutter speeds, accommodating more low-light shooting situations than ever before without having to boost ISO sensitivity. With camera shake and vibration reduced, you get a sharper, steadier image. And because it is an optical system, there is none of the image degradation typical with electronic image stabilizers.",
    "iframemovie": "Miniature EffectStar Time-Lapse Movie",
    "intelligentis": "It's easy to capture clear, steady images with the PowerShot G1 X Mark II, even in low light without using a tripod. That's because the camera is equipped with Canon's innovative Intelligent IS. The system automatically analyzes camera movement and applies the best shake correction method for the shooting situation – allowing you to focus on framing and capturing your shot. For stills, the system selects from Normal IS, Panning IS, Macro (Hybrid) IS and Tripod modes. When shooting video, the system selects from Dynamic IS, Powered IS, Macro (Hybrid) IS and active Tripod IS modes. New icons clearly mark the image stabilization mode, whether you're shooting still images or video.",
    "iframemovie1920x1080": "30 fps (29.97)",
    "attr11": "4:5",
    "f": "11349,125198,2719061,406247838",
    "remoteshooting": "With the built-in Wi-Fi® on the PowerShot G1 X Mark II, you can use your smartphone or tablet* to remotely control the camera. Simply connect wirelessly to your device and access the free Canon CameraWindow app*****. Your device will show a live image of the camera's capture for easy composition – perfect for wildlife and nighttime shots, group photos and all kinds of situations. The camera's versatile zoom, flash, self-timer and shutter are all under your control, with images being saved to your camera as usual.",
    "miniatureeffect1280x7201": "6 fps, 3 fps, 1.5 fps",
    "medium2m2": "SF1,2136,29725,4189737,67530,979",
    "medium1m1": "SF2,6432,92311,8012,1113,66514,795"
}