{
    "category": "camera",
    "searchbykeywordmanufacturernumberadvancedproductsearchcompanyoverviewaboutuscontactuspressreleasesqualitymanagementgovernmentsalescareerscustomerscustomerservicecustomerloginshoppingcart": "Home Â» Hardware Â» Digital Cameras & Accessories Â» Digital Cameras POWERSHOT ELPH 140 IS KIT (GRAY) Manufacturer: CANON USA Manuf. Code: 9144B001 Item. Code: SY-3869193 Weight: 1.00 lbs. Stock: Low Inventory Our Price: $143.42 Product Description: Quantity: Please Note :                                                  This page contains information (product description, images, and specifications)                                                  obtained by ALVIO INC. from manufacturers and other industry sources believed to                                                  be reliable. ALVIO INC makes no warranties or representations with respect to the                                                  performance of the products or accuracy of the information. Any and all warranties,                                                  whether written or oral, expressed or implied, are hereby expressly disclaimed by                                                  ALVIO INC, including, but not limited to, warranties of merchantability and fitness                                                  for a particular purpose and liability arising from errors and omissions in the                                                  information. It is your sole responsibility to evaluate the accuracy of, completeness,                                                  and usefulness of the information.Related                Products OUTDOOR PENDANT HOUSING WITH SUNSHIELD Only $506.00 Add to Cart LENS ADAPTER - 52.8 MM THREAD - 55 MM THREAD; COMPATIBLE MODELS: DMC-FZ8, DMC-FZ Only $20.53 Add to Cart DC-10S DOCUMENT CAMERA Only $552.39 Add to Cart",
    "manufcode": "9144B001",
    "weight": "1.00 lbs.",
    "itemcode": "SY-3869193",
    "stock": "Low Inventory",
    "ourprice": "$143.42",
    "manufacturer": "CANON USA"
}