{
    "itemweight": "1.7 pounds",
    "color": "Black",
    "itemheight": "5.5 inches",
    "binding": "Electronics",
    "productgroup": "Photography",
    "feature": "20.2 Megapixel CMOS (APS-C) sensor, 14-bit A/D conversion, ISO 100-12800 (expandable to H: 25600) for shooting from bright to dim light and high performance DIGIC 5+ Image Processor for exceptional image quality and processing speed. Canon's innovative Dual Pixel CMOS AF enables you to shoot video like a camcorder with smooth, fast, and accurate autofocus; lets you enjoy instant and precise autofocus even when shooting stills from a variety of angles with the freedom provided by the Vari-angle LCD. 19-point all cross-type AF system (including a high-precision f/2.8 dual cross-type AF center point) with a wide area arrayfor exceptional autofocus performance and greater compositional freedom when shooting with the viewfinder. Intelligent Viewfinder with superimposed LCD display provides approximately 98% field of view, and Multi-Aspect ratio in Live View broadens your choices in composition. EOS Full HD Movie mode with Movie Servo AF for improved continuous focus tracking of moving subjects, manual exposure control and multiple frame rates (1080: 30p (29.97) / 24p (23.976) / 25p, 720: 60p (59.94) / 50p, 480: 30p (29.97) / 25p), built-in stereo microphone, manual audio level adjustment with attenuator function to reduce audio clipping, and Video Snapshot with editing for expanded movie shooting options. Vari-angle Touch Screen 3.0-inch Clear View LCD monitor II (approximately 1,040,000 dots) with smudge-resistant coating features multi-touch operation and Touch AF for an easy and intuitive experience, flexible positioning, and clear viewing even when outdoors in sunlight. Built-in wireless technology allows you to wirelessly transfer your images to social networking sites through CANON iMAGE GATEWAY, share your images with wireless-enabled Canon cameras, or upload virtually anywhere on your iOS® or Android(TM) smartphone* with the free download of the EOS Remote app.",
    "numberofitems": "1",
    "partnumber": "8469B002",
    "size": "compact",
    "category": "camera",
    "title": "Canon EOS 70D 20.2 MP Digital SLR Camera with Dual Pixel CMOS AF  (Body Only)",
    "detail": "Value",
    "label": "Canon",
    "ismemorabilia": "0",
    "itemwidth": "4.1 inches",
    "producttypename": "CAMERA_DIGITAL",
    "ean": "0013803221596",
    "mpn": "8469B002",
    "brand": "Canon",
    "itemlength": "3.1 inches",
    "isautographed": "0",
    "studio": "Canon",
    "packagequantity": "1",
    "manufacturer": "Canon",
    "publisher": "Canon",
    "producttypesubcategory": "slr",
    "upc": "013803221596",
    "releasedate": "2013-08-26",
    "packageweight": "3.5 pounds",
    "model": "8469B002"
}