{
    "smartshutter": "The camera automatically takes the photo when people smile, wink, or get into frame.",
    "smartauto": "The camera automatically selects the best shooting settings for optimal quality based on subjects and environmental factors to provide point-and-shoot simplicity.",
    "miniatureeffect": "Give images a miniature look with an effect that emphasizes perspective by blurring the top and bottom of the image.",
    "monochrome": "Choose from three single-tone effects: Black-and-White, Sepia, or Blue.",
    "portrait": "The camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject “pop.”",
    "category": "camera",
    "underwater": "Capture underwater images with reduced backscatter effect. Optional Underwater Case required.",
    "postereffect": "Poster Effect combines several similar shades into one color, turning subtle gradations into eye-catching, scene-popping contrasts.",
    "snow": "Shoot clear snow scenes without darkened subjects or an unnatural bluish tint.",
    "custom": "Define and store your own settings to achieve the effects you prefer.",
    "program": "Access advanced exposure compensation features while shooting mostly automatically.",
    "handheldnightscene": "Take clear and steady pictures at night without the use of a tripod.",
    "fisheyeeffect": "Add a classic photo distortion without a fisheye lens.",
    "fireworks": "Grab brilliant images of skyrocketing fireworks.",
    "longshutter": "Use to blur moving subjects for artistic effect, ideal for urban night photography.",
    "iframemovie": "The Apple® movie format, iFrame, makes it easier and quicker to import and upload videos while retaining high image quality.",
    "lowlight": "For high quality image capture in an amazing range of dimly-lit situations.",
    "highspeedburst": "Captures rapid action frame by frame, by shooting continuously at a high speed while the shutter button is held down.",
    "toycameraeffect": "Simulates photos taken with “toy” or pinhole cameras, darkening the image at the edges to create a vignette effect.",
    "supervivid": "Super Vivid intensifies existing hues, saturating the scene with bright colors.",
    "superslowmotionmovie": "Record your clips in high speed (approx. 240 fps), and then watch your videos in slow motion."
}