{
    "weight": "8.1 Ounces",
    "maximumaperturerange": "F/3.1-5.9",
    "lenstype": "Zoom lens",
    "opticalzoom": "14 x",
    "exposurecontroltype": "Beach, Kids & pets, Snow, Landscape, Portrait mode, Handheld night shot, Stitch assist, Fireworks, Low light, Underwater, Foliage",
    "portrait": "The camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject pop.",
    "monochrome": "Choose from three single-tone effects: Black-and-White, Sepia, or Blue.",
    "includedflashtype": "Built-in flash",
    "category": "camera",
    "smartshutter": "The camera automatically takes the photo when people smile, wink, or get into frame.",
    "opticalsensortechnology": "CMOS",
    "postereffect": "Poster Effect combines several similar shades into one color, turning subtle gradations into eye-catching, scene-popping contrasts.",
    "lightsensitivity": "ISO 100, ISO 800, ISO 400, ISO 200, ISO auto, ISO 1600, ISO 3200",
    "opticalsensorresolution": "12.1 MP",
    "width": "4.2 inches",
    "beach": "Get clear shots of people at a sunny beach without darkened faces.",
    "minimumfocallength": "5.7 millimeters",
    "handheldnightscene": "Suppresses image blur even without the help of a tripod.",
    "fisheyeeffect": "Add a classic photo distortion without a fisheye lens.",
    "fireworks": "Grab brilliant images of skyrocketing fireworks.",
    "brandname": "Canon",
    "smartauto": "The camera automatically selects the best shooting settings for optimal quality based on subjects and environmental factors to provide point-and-shoot simplicity.",
    "lowlight": "For high quality image capture in an amazing range of dimly-lit situations.",
    "height": "2.4 inches",
    "highspeedburst": "The camera shoots continuously at a high speed of approx. 8.2fps while you hold down the shutter.",
    "toycameraeffect": "Simulates photos taken with “toy” or pinhole cameras, darkening the image at the edges to create a vignette effect.",
    "maximumfocallength": "18.8 millimeters",
    "shootingmodes": "Frame movie mode",
    "snow": "Shoot clear snow scenes without darkened subjects or an unnatural bluish tint.",
    "displaysize": "3.0",
    "depth": "1.3 inches",
    "viewfindertype": "None",
    "supervivid": "Super Vivid intensifies existing hues, saturating the scene with bright colors.",
    "opticalsensorsize": "1/2.3″",
    "model": "SX230HS – BK",
    "imagetypes": "JPEG"
}