{
    "exposurecontrol": "Aperture-Priority Auto (A) Auto Auto (flash off) Manual (M) Programmed Auto with flexible Program (P) Shutter-Priority Auto (S)",
    "battery": "EN-EL14 Rechargeable Li-ion Battery",
    "isosensitivity": "ISO 100 - 6400 Hi-1 (ISO 12,800)",
    "playback": "Auto Image Rotation Full-Frame and Thumbnail (4, 9, or 72 images or calendar) Highlights Histogram Display Image Comment Movie Playback Playback with Zoom Slideshow",
    "recordingmedia": "SD / SDHC /SDXC Card",
    "effectivepixels": "24.2 MP",
    "mirror": "Quick-return type",
    "liveviewfunction": "Live View Lens servo: Autofocus (AF): Single-servo AF (AF-S); full-time-servo AF (AF-F) Manual focus (MF) Live View AF-area mode: Face-priority AF, Wide-area AF, Normal-area AF, Subject-tracking AF Live View Autofocus: Contrast-detect AF anywhere in frame (camera selects focus point automatically when face-priority AF or subject-tracking AF is selected) Live View Scene Auto Selector: Auto mode, Auto (flash off) mode",
    "builtinwifi": "No",
    "category": "camera",
    "grosspixels": "24.7 MP",
    "usb": "Yes",
    "batterylife": "540 shots per charge (Battery Life) (CIPA)",
    "shutterspeed": "1/4000 to 30 sec.",
    "labor": "1 year",
    "selftimer": "2, 5, 10, 20 sec. Timer duration electronically controlled",
    "magnification": "0.78x Approx.",
    "parts": "1 year",
    "focusingpointselection": "Can be selected from 11 focus points",
    "focustype": "Auto/Manual",
    "type": "with 18-55mm Lens",
    "lensspec": "AF-S DX NIKKOR 18-55mm f/3.5-5.6G VR Lens",
    "hdmi": "Yes",
    "dustcleaningsystem": "Image sensor cleaning",
    "focuslock": "Focus can be locked by pressing AE-L/AF-L button Focus can be locked by pressing shutter-release button halfway (single-servo AF)",
    "focusingscreen": "Type B BriteView Clear Matte Mark VII screen",
    "meteringsystem": "Center-weighted: Weight of 75% given to 8mm circle in center of frame Matrix: 3D color matrix metering II (type G and D lenses); color matrix metering II (other CPU lenses) Spot: Meters 3.5mm circle (about 2.5% of frame) centered on selected focus point",
    "coverage": "95% Horizontal Approx.",
    "imagesensorsize": "23.2mm x 15.4mm",
    "lensmount": "Nikon F Bayonet Mount",
    "imageprocessor": "EXPEED",
    "movieformat": "MOV",
    "shuttertype": "Electronically controlled vertical-travel focal-plane",
    "viewfinderinformation": "Eye-level Pentamirror Single-Lens Reflex",
    "compatiblelenses": "AF-S, AF-I: All Functions Supported AI-P NIKKOR: All Functions Supported Except Autofocus and 3D Color Matrix Metering II Electronic Rangefinder can be used if Maximum Aperture is f/5.6 or Faster Other AF NIKKOR: All Functions Supported Except autofocus and 3D Color Matrix Metering II Type G or D AF NIKKOR: All Functions Supported Except Autofocus Type D PC NIKKOR: All Functions Supported Except Autofocus and some Shooting Modes",
    "exposurecompensation": "+/-5 EV in increments of 1/3EV",
    "bodycolor": "Black",
    "imagesensor": "CMOS",
    "maxrecordingresolution": "HD 1,920x1,080 / 30 fps HD 1,920x1,080 / 25 fps HD 1,920x1,080 / 24 fps HD 1,280x720 / 60 fps HD 1,280x720 / 50 fps VGA 640x424 / 30 fps VGA 640x424 / 25 fps",
    "scenemodes": "Auto Auto [Flash Off] Child Close-up Landscape Night Portrait Portrait Sports",
    "focusingmodes": "Auto AF-S/AF-C selection (AF-A) Continuous-servo (AF-C) Face-Priority AF available in Live View only and D-Movie only Full-time Servo (AF-A) available in Live View only Manual (M) with electronic rangefinder Normal area available in Live View and D-Movie only Predictive focus tracking activated automatically according to subject status Single-servo AF (AF-S) Wide area available in Live View and D-Movie only",
    "viewfindertype": "Eye-level Pentamirror Single-Lens Reflex viewfinder",
    "resolution": "DX-format (L) 6,016 x 4,000 (M) 4,512 x 3,000 (S) 3,008 x 2,000",
    "fileformat": "Compliant with DCF (Design Rule for Camera File System) 2.0 DPOF (Digital Print Order Format) EXIF 2.3 (Exchangeable Image File Format for Digital Still Cameras)",
    "avout": "NTSC, PAL"
}