{
    "modedialwithmanualexposuremodespsamand2usermodes": "to recall your preferred camera settings instantly.",
    "rawnefdataprocessing": "supports 14 bits compressed RAW (Nikon Electronic Format) image data, enabling you to process and adjust unadulterated images in-camera.",
    "sdcardcompatible": "increase storage capacity by using SD cards (SDHC, SDXC and UHS-I compliant) to save your images and movies.",
    "attr162megapixeldxformatcmosimagesensor236x156mm": "this highly sensitive sensor delivers lifelike images with vivid colours, reduced noise and smooth tonal gradations.",
    "optionalexternalopticalviewfinder": "for those who prefer a traditional viewfinder, this optional attachment (DF-CP1) can be an alternative to the LCD screen. The ‘hot shoe’ can also be used to attach a more powerful External Speedlight flash unit.",
    "picturecontrol": "allows you to adjust the contrast and colour settings (Standard, Neutral, Vivid, Monochrome, Portrait, Landscape, Custom) to match your situation.",
    "highiso1006400lightsensitivitymanuallyextendableupto25600usingthehi2setting": "enables faster shutter speeds for finely detailed images with minimal noise.",
    "customizablefunctionbuttons": "two buttons allow you to bypass the menu by creating shortcuts to your favorite camera settings.",
    "continuousshootingat4fps": "capture fast-moving action at 4 frames per second.",
    "category": "camera",
    "advancedgui": "employs a graphical user interface (GUI) inherited from Nikon’s D-SLR range.",
    "durabledesign": "boasts a high-quality and tough, yet light, body with a magnesium alloy top cover.",
    "manualautofocus": "the focusing ring enables manual focus and manual override when in Auto focus mode.",
    "fullhd1080pmovierecording": "in 30, 25 or 24 fps and in stereo, via the built-in stereo microphone.",
    "compatiblewithoptionalgpsgps1": "allowing you to record the exact location (latitude and longitude) of images as a ‘geotag’.",
    "large75cm30in921kdothighresolutionlcdmonitor": "makes it easy to view feature menus and a pleasure to review and edit your photos and movies.",
    "activedlighting": "capture more detail in high-contrast conditions. Select from six different levels to optimise high-contrast images by restoring shadow and highlight details lost in strong light.",
    "nikkorfixedwideangle185mmf28lens28mmequivalent": "offers high definition throughout the entire aperture range and minimizes optical aberrations.",
    "wificompatible": "use Wi-Fi to transfer your high-quality images and movies to your smart device* via an optional Wi-Fi dongle (WU-1a).",
    "ure24adaptorring": "enables you to create different effects by attaching lens filters (46mm) or a lens hood (HN-CP18) to reduce peripheral light.",
    "retouchmenu": "enhance your photos on the spot with a wide range of filter effects. Examples include Selective Colour, which converts your image to monochrome and then adds a splash of the colour of your choice, while Cross Screen adds a starry effect to bright objects.",
    "expeed2imageprocessingengine": "the DSLR-standard EXPEED 2 optimises camera technologies for superior performance and maximum image quality, with minimal energy consumption.",
    "resolution": "16 to 16.9 MegaPixels",
    "colour": "Silver"
}