{
    "isosensitivity": "Auto: 100-12800* Auto ISO Range: ISO 100-200, ISO 100-400, ISO 100-800, ISO 100-1600, ISO 100-3200, ISO 100-6400, ISO 100-12800 Manual: 100-12800 Auto ISO Range for Digital SR: 100 - 12800, Dynamic Range Adjustment: Yes *Fixed at ISO 100-1600 in Handheld Night Snap, Green modes.",
    "imagestabilization": "Still: Sensor-Shift SR, Digital SR (ISO 100-12800), Dual (SR & Pixel Track SR) Movie: Movie Shake Reduction Mode (Movie SR) (Maximum effect of 3 stops using Sensor-Shift SR)",
    "category": "camera",
    "physicalspecs": "Dimensions (W x H x D): 4.8 x 2.4 x 2.0\" (excluding protrusions) Weight: Without battery or removable memory: 12.8 oz (approx.) Loaded and ready: 13.8 oz (approx.) Construction material(s): Brass covers Operating temperature: 32-104°F",
    "flash": "Type: Built-in auto flash Flash modes: Auto, Flash Off, Flash On, Red-eye, Slow-speed synchro, Slow-speed+Red-eye, Trailing Curtain Sync Effective range: 1.31 - 40' (wide, auto ISO), 1.31 - 29' (tele, auto ISO)",
    "playbackmodes": "Mode selection: One Shot, Index (4, 9 or 25 thumbnails), Magnification (up to 10X, scrollable), Movie Playback, Histogram, Folder Display, Select & Delete, Calendar Mode pallet: Slideshow, Image Rotation, Stretch Filter, Small Face Filter, HDR Filter, Collage, Digital Filter, RAW Development (Aspect Ratio, JPEG Recorded Pixels, JPEG Quality, Custom Image (Bright, Natural, Vibrant, Reversal Film, Monochrome) White Balance,Sensitivity, Shadow Correction, Distortion Correction, Original Frame, Movie Editing, Red-eye Edit, Resize, Cropping, Image Copy, Protect, DPOF, Start-up Screen Digital filters (playback): B&W, Sepia, Toy Camera, Retro, Color, Extract Color, Color Emphasis, High Contrast, Starbust, Soft, Fish-eye, Brightness, Miniature, Slim, Invert Color Filter Movie edit: Save as Still Image, Movie Divide, Add Title Picture",
    "drivemodes": "Mode selection: One shot, Continuous Shooting, Burst Shooting(L/H), Self-timer (2 or 10 sec.), Remote Control (immediately or 3 sec.), Auto Bracketing Continuous FPS: Approx 1 FPS for 6 frames Multi-exposure: n/a, Interval Shooting: n/a HDR: Yes",
    "type": "Compact Digital Camera",
    "interfaces": "Ports: USB 2.0 Hi-Speed, PC/ AV out, HDMI (Type D) out Video out: NTSC, PAL Printer interfaces: n/a",
    "languagesupport": "English, French, Germany, Spanish, Portuguese, Italy, Dutch, Danish, Swedish, Finnish, Polish, Czech, Hungarian,Turkey, Greek, Russian",
    "powersupply": "Power source: Rechargeable Li-Ion battery D-Li106 Recordable images: Approx 290 (D-Li106) Playback time: Approx 280 min (D-Li106) Movie recording time: Approx 90 min",
    "lens": "Type/construction: smc PENTAX zoom lens, 11e in 8g (4 aspherical elements) Focal length (equiv.): 6.0-24mm (28-112mm) Optical zoom: 4X, Digital zoom: 1.95X, Combined zoom: 7.8X Intelligent zoom: Approx 5.2X at 7M, approx. 7.8X at 3M (including optical zoom) Aperture: F1.8 (wide) - F2.5 (tele) Smallest Aperture: F8",
    "meteringsystem": "Type: TTL, Multi-segment, Center-weighted or Spot Exposure compensation: +/- 2 EV (1/3 steps)",
    "storagemedia": "Internal memory: 75.3 MB (approx.) Removable memory: SD, SDHC, SDXC Eye-Fi Compatible, File/Folder customization: n/a",
    "lcdmonitor": "LCD: 3.0\" Tiltable color TFT with AR Coating (Tilt down to 45°, up to 90° (approx.)) LCD resolution: (approx. 920,000 dots) Wide angle viewable: 170°",
    "fileformats": "Still: RAW (DNG), JPEG(conforms to Exif 2.3), conforms to DCF2.0, DPOF, PRINT Image Matching III Movie: MPEG?4 AVC/H.264",
    "capturemodes": "Mode selection: Auto Picture, Program, Natural Skin Tone, Handheld Night Snap (5M), Night Scene Portrait, Night Scene, Digital Panorama (2M per frame), High Speed Movie (VGA, 120 FPS capture, 30 FPS playback),Time Lapse Movie, Landscape, Blue Sky, Sunset, Flower, Digital SR (ISO 3200-6400 5M), Kids, Pet, Portrait, Food, Fireworks, Surf & Snow, Sport, Fisheye, Sketch, Miniature Filter, Text, Frame Composite (3M), Movie, Green Auto Picture modes: Landscape, Portrait, Night Scene, Night Scene Portrait, Standard, Flower, Sport, Candlelight, Blue Sky, Sunset, Text, Group Photo, Pet, Portrait x Blue Sky, Portrait x Sunset, Portrait x Backlight Custom Image Modes: n/a Green simplified mode available: Yes Mode Dial: P/Av/Tv/M/User/HDR/SCN/AUTO PICT/Green/Movie Date Imprint: Yes, date, date-time, time (not available in Green mode) Digital filters (capture): Movie (B&W, Sepia, Fisheye, Miniature, Sketch) Dynamic Range adjustment: Yes (shadow, highlight) Digital level: Yes",
    "sensor": "Type: 1/1.7\" Backlit CMOS Effective pixels: 12.0 Total pixels: 12.76 Recorded resolutions Still: JPEG:[4:3]12M,7M,5M,3M [16:9]9M,5M,3M,2M [3:2]10M,6M,4M,2M [1:1]9M,5M,3M,2M?RAW Movie: HD (1920x1080 approx. 30fps), (1280x720 approx. 60/30fps), Audio Recording with Movie: Yes, Stereo Quality levels: Still (Fine, Normal) Movie: Fixed Pixel Mapping: Yes",
    "shutter": "Type: Programmed AE electronic lens shutter w electronic sensor shutter Shutter speed: 1/2000 sec. - 1/4 sec., max. 30 sec. (1/8000 sec. - 30 sec. with Shutter Priority, Aperture Priority,Manual Exposure, and combination of electronic shutter enabled), Bulb Noise Reduction: Yes, automatically applied if shutter speed is slower than 1 sec",
    "focussystem": "Type: TTL contrast detection autofocus Focus modes: Auto, Spot, Tracking , AF Select (25 Points), Infinity Landscape, Manual Focus, Pan Focus, AF Point Switching Manual focus: Yes, range (.4\" to infinity, depending on zoom setting) Focus lock: Yes (by pressing the shutter release button half way) Focus range: Normal: 1.3' to infinity (wide), 5.2' to infinity (tele) Macro: 2\" to 19.7\" (wide) 8\" to 19.7\" (tele) Super Macro: 0.4\" to 7.9\" (1cm) (wide) Focus Assist Lamp: Yes Face Detection: Yes (up to 32 faces), Smile Capture, Blink Detection Pet Detection: Yes (up to 1 pet's face), auto or select from 3 pre-registered faces)",
    "whitebalance": "Auto preset modes: Auto, Daylight, Shade, Cloudy, Fluorescent light (D:Daylight Color, N:Daylight White, W:Cool White, L:Warm White),Tungsten, Flash Manual WB: Yes"
}