{
    "weight": "Approx. 765 g/1 lb 11 oz with battery and memory card but without body cap; approx. 710 g/1 lb 9 oz (camera body only)",
    "battery": "EN EL14",
    "additionalfeatures": "Retro Designed Specifically for High Quality Still Images",
    "directpurposefulcameraoperationtoinspirephotographers": "The Df is a new proposal from  Nikon, offering a creative approach to photography. One of photography's  fundamental tenets is to search the environment for meaning and then  find the right combination of shutter speed and f-stop to appropriately  convey it. From the first modern camera nearly a century ago until the  recent past, mechanical dials were the favored interface for discovering  such combinations, and manipulating them was a skill that became second  nature to countless photographers. When Nikon began designing the Df,  mechanical operation was the natural choice since it provides the  photographer with the tactile pleasure of shooting with precision  mechanics. Constant visibility and access to key camera settings  reinforces the direct connection between photographers and their  cameras, inspiring them to be more deliberate with each frame. In  addition, the Df delivers the same image quality as the D4, Nikon‘s  flagship D-SLR, but from a significantly lighter and more compact body.  Photographers can expect versatile image quality from ISO 100 to ISO  12800 — all without a large, cumbersome camera body. This significantly  expands creative opportunities, while opening up completely new ones.  This camera fuses the D4 image quality with tactile precision mechanics  for pure photography. With your fingers on the controls, you can think  about photography differently, and explore your creative intentions more  profoundly. With the Df, you are the photographer, not the camera.The Df is designed to travel. Photographers will take this compact,  lightweight camera to more locations, and will enjoy discovering more  photographic opportunities. The Df delivers the exceptional image  quality that discerning photographers demand across an impressively wide  ISO range. The idea to match an FX-format image sensor with 16.2  effective megapixels is the result of careful calculation: resolution,  high ISO noise, dynamic range, tonal gradation, and color reproduction  were all considered for the sake of offering the most well-balanced  performance possible. Using the same image sensor as the D4, the Df  benefits from a large pixel pitch of 7.3μm, and is designed to collect  the maximum amount of light in any situation. Combined with the sensor's  low noise emitting circuitry, image-degrading noise is kept to a  minimum even before image processing. As a result, photographers can  benefit from exceptionally high image quality while taking advantage of  the clean, rich tones, and wide dynamic range under a diverse array of  lighting situations. An additional benefit is an easier-to-use file  size. Not only does the Df deliver superb, commercially usable image  quality for prints as large as A3, its 16.3 effective megapixels gives  you files that are ideal for fast image processing, buffering and data  management. For many passionate photographers, these are real-world  benefits.The Df is designed for photographers who want to concentrate solely on  the art of photography. This dedication to still photography led to the  removal of the movie-making components of the camera, including the  operation knob and button, the microphone terminal and the speaker. The  result is a smaller, lighter and more mobile camera body. Photographers  can now carry the Df more naturally over longer durations, which allows  them to concentrate their energy and effort on composition and  creativity. Having fewer buttons and dials also simplifies operations  and allows the photographer's focus to remain on capturing still images.  Every camera in the Nikon lineup has its role. The role of the Df is to  further the art of photography.",
    "category": "camera",
    "dimensions": "Approx. 143.5 x 110 x 66.5 mm/ 5.6 x 4.3 x 2.6 in.",
    "maxiso": "12800 (Expandable to 204800)",
    "manufacturerslink": "Click Here",
    "mpn": "VBA380AE",
    "continuous": "5.5 FPS",
    "sensortype": "36.0 x 23.9mm CMOS (Full Frame)",
    "screensize": "3.2 inch (921k Dot)",
    "lensmount": "Nikon F Mount",
    "manufacturer": "Nikon",
    "lens": "AF-S 50mm F1.8G SE",
    "boxcontents": "No",
    "megapixels": "16 Megapixel",
    "cardtype": "SDHC, SDXC",
    "video": "NO",
    "model": "Nikon DF Black",
    "interestfreecreditavailableinourstores": "For further details please contact your nearest store Here ."
}