{
    "macrohybrid": "Corrects for shift-type camera shake, which typically occurs in macro (close-up) shooting.",
    "smartshutter": "The camera automatically takes the photo when people smile, wink, or get into frame.",
    "moviedigesthybridauto": "Automatically selects shooting settings for optimal quality and records a video clip every time you capture a still image. One day's worth of clips are then combined into a single video.",
    "miniatureeffect": "Give images a miniature look with an effect that emphasizes perspective by blurring the top and bottom of the image.",
    "monochrome": "Choose from three single-tone effects: Black-and-White, Sepia, or Blue.",
    "aperturepriority": "You set the aperture, controlling depth-of-field. The camera automatically selects the shutter speed.",
    "portrait": "Brings the subject into focus while beautifully blurring the background.",
    "message": "*",
    "category": "camera",
    "underwater": "Capture underwater images with reduced backscatter effect. Optional Underwater Case required.",
    "powered": "Compensates for hand movement when shooting video at the telephoto end of the zoom range, where camera shake is magnified.",
    "superslowmotionmovie": "Record your clips in high speed (approx. 240 fps), and then watch your videos in slow motion.",
    "movie": "Record video; unwanted scenes can be deleted in playback mode.",
    "normal": "Corrects for a wide range of camera movement when shooting stills.",
    "snow": "Shoot clear snow scenes without darkened subjects or an unnatural bluish tint.",
    "sports": "The camera uses high shutter speeds to capture fast-moving subjects.",
    "highspeedbursthq": "Captures fast-action shots at full resolution, providing continuous shooting when the shutter button is held down.",
    "program": "The camera automatically and intelligently selects the aperture/shutter speed combination based on the shooting conditions.",
    "discreetmode": "Disables flash, AF assist beam, and all camera sounds with one mode dial setting – so you can capture images in quiet areas.",
    "panning": "Panning motion is detected so that IS does not interfere with desired camera movement.",
    "liveviewcontrol": "Enables Brightness, Color, and Tone adjustments to your images using easy-to-understand controls.",
    "email": "*",
    "handheldnightscene": "Take clear and steady pictures at night without the use of a tripod.",
    "fisheyeeffect": "Now you can get the fisheye effect – a classic photographic distortion – without a fisheye lens.",
    "dynamic": "Effective for video shooting at wide-angle focal lengths, eliminating the unwanted shaking that typically occurs while walking.",
    "fireworks": "Create brilliant images of skyrocketing fireworks.",
    "tripod": "When tripod use is detected, the Image Stabilizer is stopped because it is not needed.",
    "smartauto": "The camera automatically selects the best shooting settings for optimal quality based on subjects and environmental factors to provide point-and-shoot simplicity.",
    "condition": "New: A brand-new, unused, unopened, undamaged item in its original packaging (where packaging is applicable). Packaging should be the same as what is found in a retail store, unless the item is handmade or was packaged by the manufacturer in non-retail packaging, such as an unprinted box or plastic bag. See the seller's listing for full details. See all condition definitions - opens in a new window or tab ... Read more about the condition",
    "toycameraeffect": "Simulates photos taken with \"toy\" or pinhole cameras, darkening the image at the edges to create a vignette effect.",
    "supervivid": "Super Vivid intensifies existing hues, saturating the scene with bright colors.",
    "title": "*",
    "manual": "You have complete control of exposure, selecting both aperture and shutter speed manually.",
    "postereffect": "Poster Effect combines several similar shades into one color, turning subtle gradations into eye-catching, scene-popping contrasts.",
    "softfocus": "Creates a hazy ambiance that's perfect for portraits and wedding photos.",
    "yourname": "*",
    "shutterpriority": "You select the shutter speed, and the camera automatically selects the appropriate aperture."
}