{
    "selftimerdelay": "10 sec, 2sec",
    "wirelessconnection": "IEEE 802.11b/g/n",
    "exposurerange": "EV 1-17 - wide lens ( ISO auto ) EV 3-17 - tele lens ( ISO auto )",
    "macrofocusrange": "1cm",
    "minfocusdistance": "80 cm",
    "weight": "462 g",
    "maxshutterspeed": "1/2000 sec",
    "photobeam": "When a friend wants a copy of that really great shot you took of her, now you can share it right away. Samsung photo beam lets you send photos to anybody with just the touch of your camera. Simply tap your SMART CAMERA on any NFC-compatible smartphone to automatically share whichever image you're currently viewing. It's that simple.",
    "maxoperatingtemperature": "40 °C",
    "livepanorama": "With live panorama, you can capture a seemingly endless procession of gondolas gliding past a magnificent Venetian palace with an astounding 180-degree panoramic image. Preview the image on the LCD screen before you even snap it. Just hold the shutter button, sweep across the scene and see what you're going to get before you get it.",
    "exposurecompensation": "±2 EV range, in 1/3 EV steps",
    "autoshare": "Save every photo you take with your smartphone. After you set it up, Samsung AutoShare will automatically send every snap instantly to your smartphone or tablet via Wi-Fi that is powered by NFC technology. Using your smartphone, AutoShare also GPS-tags your photos. Sharing your treasured memories couldn't be any faster or easier.",
    "additionalfeatures": "USB 2.0 compatibility, built-in speaker, date/time stamp, DPOF support, sharpness control, digital image rotation, cropping an image, in-camera panorama preview, resizing an image, saturation control, 720p HD movie recording, contrast control, face detection, dual image stabilization, remote live view, Exif Print support, automatic display brightness adjustment, Smart AUTO, Live Panorama function, remote control via mobile devices, Tag & Go (NFC/Wi-Fi)",
    "opticalzoom": "35 x",
    "producttype": "Digital camera - compact",
    "wifisocialsharing": "Show off a fabulous selfie with the rest of the world in no time flat. As long as you have a Wi-Fi connection, you can post images and videos directly to Facebook, YouTube, and now Flickr. Tag and add comments, too. You can also upload photos right to your blog, or email them to your family.",
    "remoteviewfinder": "Control your camera by using your smartphone as the viewfinder. The NFC-enabled remote viewfinder lets you preview photos, adjust camera settings, zoom in and out, and frame each scene all wirelessly from your phone.",
    "batterytype": "Samsung SLB-10A",
    "maxvideoresolution": "1280 x 720",
    "category": "camera",
    "operatingsystemsupport": "MS Windows 7, MS Windows Vista, MS Windows XP SP2, Apple Mac OS X 10.5 or later, Windows 8",
    "magicframe": "Make a portrait look like an antique, or put your face on the moon magic frame's background templates offer lots of picture-taking enjoyment. You can also put images on a 1950's TV set or a movie.",
    "specialeffects": "Fisheye, miniature, Classic, Retro, cross filter, Vignetting",
    "memorycardslot": "SD card",
    "imagestorage": "JPEG 4608 x 3456 JPEG 4608 x 3072 JPEG 4608 x 2592 JPEG 3648 x 2736 JPEG 2832 x 2832 JPEG 2592 x 1944 JPEG 1984 x 1488 JPEG 1920 x 1080 JPEG 1024 x 768",
    "width": "12.45 cm",
    "wifigroupshare": "From family brunches to nights out with friends, you can share all of the shots that your friends and family members want with your Samsung smart camera. Use group share to send images to up to four people simultaneously. Group share eliminates the frustration of having to repeat the sharing process over and over again, so you will have more time for taking share-worthy snaps.",
    "lightsensitivity": "ISO 100, ISO 800, ISO 400, ISO 200, ISO 80, ISO 1600, ISO auto, ISO 3200 (3Mpix)",
    "microphoneoperationmode": "Mono",
    "humidityrangeoperating": "5 - 85%",
    "details": "1 x Samsung SLB-10A Li-ion rechargeable battery - 1030 mAh ( included )",
    "totalpixels": "16,500,000 pixels",
    "maxsupportedsize": "64 GB",
    "effectivesensorresolution": "16,200,000 pixels",
    "samsunglink": "Effortlessly save every moment you've captured. Samsung link instantly and wirelessly streams your photos your PC or favorite web storage service such as Dropbox. No more waiting to go home to manually upload images. With one touch, you can show off photos and videos on your Smart TV or send them to any compatible smartphone. Sharing has never been this easy.",
    "type": "3\" LCD display",
    "focallengthequivalentto35mmcamera": "25 - 875mm",
    "minshutterspeed": "8 sec",
    "supportedmemorycards": "SD Memory Card, SDXC Memory Card, SDHC Memory Card",
    "depth": "9.2 cm",
    "facedetection": "Blink Detection technology, Face Detection AF/AE, Face Detection Self-timer, Smile Capture",
    "avinterfaces": "Composite video/audio",
    "aeafcontrol": "Face-priority AF, Subject-tracking AF",
    "zoomadjustment": "Motorised drive",
    "whitebalancepresets": "Cloudy, tungsten light, daylight, fluorescent light (cool white), fluorescent light (warm white)",
    "minoperatingtemperature": "0 °C",
    "includedaccessories": "Carrying strap, lens cap, AC power adaptor, USB cable, lens cap strap",
    "digitalvideoformat": "H.264",
    "imagestabiliser": "Optical",
    "smartauto": "Turn fleeting moments into memories with professional-style results. The Samsung SMART CAMERA's smart auto automatically analyzes the shooting environment and then chooses the appropriate scene mode for the best possible results. Smart auto analyzes key elements in the composition and automatically adjusts its various modes to capture the best shot.",
    "imagerecordingformat": "JPEG",
    "height": "8.65 cm",
    "mobilelink": "Now you can select and send photos or albums directly to a smartphone or tablet with Samsung mobile link. No Wi-Fi hotspot is required; the wireless connection is enabled by NFC technology. You don't even have to send the photos as a text message or an email. With mobile link, you can control the album on your phone and the changes will be saved to your camera, too.",
    "autofocus": "TTL contrast detection",
    "enclosurecolour": "Black",
    "focusadjustment": "Automatic",
    "opticalsensortype": "CCD",
    "flashmodes": "Fill-in mode, slow synchro, auto mode, flash OFF mode, red-eye reduction",
    "displayfeatures": "Built-in",
    "wifi": "NFC and Wi-Fi enabled features like Photo Beam, AutoShare, remote viewfinder and mobile link let you share images to compatible smartphones right next to you or on the other side of the world. Photo beam easily sends any photo that you're viewing to a smartphone instantly. AutoShare saves photos to your smartphone as you shoot and with effortlessly post photos to social networks, store them on the cloud, and back them up to your PC. You can also monitor a sleeping baby from another room.",
    "exposuremodes": "Programme, automatic",
    "cameraflash": "Pop-up flash",
    "pcautobackup": "Wirelessly transfer photos and movies to your PC or Mac. Simply select PC auto backup and you're all set. All your photos and videos are wirelessly transferred and safely stored on your computer. Feel free to delete photos from your camera knowing there's a duplicate set on your computer.",
    "digitalzoom": "2 x",
    "sensorresolution": "16.2 Megapixel",
    "videocapture": "H.264 - 1280 x 720 - 30 fps H.264 - 640 x 480 - 30 fps H.264 - 320 x 240 - 30 fps",
    "connectortype": "1 x composite video/audio output 1 x USB 2.0",
    "effectiveflashrange": "0.8 m - 6 m : ISO auto ( wide lens ) 1.5 m - 3 m : ISO auto ( tele lens )",
    "opticalsensorsize": "1/2.3\"",
    "exposuremetering": "Multi-segment, centre-weighted, spot",
    "smartfilter": "Samsung's smart filter lens effect delivers an artistic edge to your still shots and video. The miniature filter gives your subjects a miniaturized look, the Vignetting filter delivers a strikingly strong compositional contrast and fish-eye filter gives your photos that circular fisheye feel.",
    "resolution": "460,000 pixels",
    "whitebalance": "Custom, automatic, presets",
    "software": "Drivers & Utilities"
}