{
    "macrofocusrange": "3cm",
    "weight": "6.3 Oz.",
    "flashtype": "Built-in flash",
    "maxoperatingtemperature": "40 Â°C",
    "height": "2.5 in.",
    "displaytype": "LCD",
    "additionalfeatures": "720p HD Movie Recording, Audio Recording, Automatic Pixel Mapping (APM), Brightness Control, Built-In LED Illuminator, Built-In Speaker, Cropping An Image, DPOF Support, Digital Image Rotation, Digital Image Stabilization, Digital Noise Reduction, Direct Print, Exif Print Support, Face Retouch, Freezeproof, Histogram Display, Orientation Detection, PRINT Image Matching, Panorama Preview, PictBridge Support, RGB Primary Color Filter, Red eye Fix, Resizing an Image, Saturation Control, Scene Detection Technology, Shadow Adjustment Technology, Shock Resistant, Tap Control, USB 2.0 Compatibility, USB Charging, Water Resistant, YouTube Capture Mode",
    "connectortypes": "1 x HDMI output, 1 x USB, 1 x composite video/audio output",
    "opticalzoom": "5x",
    "aftracking": "AF tracking automatically tracks unpredictable, fast-moving subjects such as kids and pets, and continuously adjusts the focus and brightness so you can capture these photogenic whirlwinds with ease.",
    "focusadjustment": "Automatic",
    "maxvideoresolution": "1280 x 720",
    "category": "camera",
    "depth": "1 in.",
    "displayrotation": "Built-in",
    "facedetection": "Yes",
    "lightsensitivitymax": "1600",
    "stillimageformat": "JPEG",
    "screendetails": "LCD display - TFT active matrix - 2.7\" - color",
    "redeyereduction": "Yes",
    "lightsensitivity": "ISO 100, ISO 1600, ISO 200, ISO 400, ISO 80, ISO 800, ISO auto",
    "sensorsize": "1/2.3\"",
    "width": "3.8 in.",
    "autofocustype": "TTL contrast detection",
    "freezeproof": "It's freezeproof down to 14Ã\u0082Â°F/-10Ã\u0082Â°C. Perfect for skiing, snowboarding, sledding and other winter fun, this camera is winterized to perform at below-freezing temperatures!",
    "minshutterspeed": "4 sec",
    "waterproof": "A revolutionary system of waterproof seals and gaskets keeps water out so you can take pictures as deep as 16 feet underwater.",
    "mpn": "227635",
    "operatingsystemsupported": "Apple Mac OS X 10.3 - 10.5, MS Windows 2000, MS Windows 7, MS Windows Vista, MS Windows XP",
    "brand": "Olympus",
    "focallengthequivalentto35mmcamera": "28 - 140mm",
    "sensortype": "CCD",
    "exposuremetering": "Multi-Segment, Spot",
    "minoperatingtemperature": "-10 Â°C",
    "specialeffects": "Black & White, Drawing, Fisheye, Pin Hole, Pop Art, Sepia",
    "screensize": "2.7\"",
    "digitalvideoformat": "MPEG-4",
    "microphoneoperationmode": "Mono",
    "microphonetype": "Microphone - built-in - electret condenser - mono",
    "batteryformfactor": "Manufacturer specific",
    "underwateruse": "Yes",
    "expansionslot": "1 x SD Memory Card",
    "exposurecompensation": "Â±2 EV range, in 1/3 EV steps",
    "flashmodes": "Auto Mode, Fill-in Mode, OFF mode, Red-eye Reduction",
    "maxshutterspeed": "1/2000 sec",
    "cameratype": "Point & Shoot",
    "exposuremodes": "Automatic, Program",
    "shootingmodes": "Frame Movie Mode",
    "displaysize": "2.7\"",
    "intelligentauto": "The intelligent auto setting identifies the scene you're shooting - portrait, landscape, night portrait, macro, or sport - and adjusts the settings to optimize results.",
    "digitalzoom": "5x",
    "sensorresolution": "14.0 MP",
    "viewfindertype": "None",
    "shockproof": "Durable metal body with an innovative shock-absorbing technology protects it from drops of up to 5 feet.",
    "effectiveflashrange": "0.1 m - 4 m",
    "dualimagestabilization": "Dual image stabilization combines sensor-shift image stabilization with high ISO sensitivity and fast shutter speeds so you can capture crisp, clear images even if the subject is moving.",
    "supportedflashmemory": "SD Memory Card, SDHC Memory Card",
    "model": "Tough 6020 / Âµ (mju) Tough 6020",
    "shootingprograms": "Beach/snow, Beauty, Candle, Cuisine, Documents, Fireworks, Indoor, Landscape, Night scene, Night scene with portrait, Pet, Portrait mode, Self-portrait, Snow, Sports mode, Sunset, Underwater macro, Underwater snapshot, Underwater wide 1, Underwater wide 2"
}