{
    "attr": "Please call or email us with any additional information that you feel may assist us in the processing of your order.",
    "weight": "15.2 oz. (430g)",
    "isosensitivity": "ISO 80-1600, Auto (auto gain ISO 80-1600)",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "effectivepixels": "16.1 megapixels",
    "lenstype": "26x optical Zoom, NIKKOR ED glass lens (22.5-585mm equiv.)",
    "imagestabilization": "Lens-shift VR",
    "powersource": "4 AA-size batteries",
    "category": "camera",
    "movie": "Audio file format: AAC stereo HD: 1280 x 720p @ 30fps Standard TV: 640 x 480 @ 30fps Movie file format: MPEG-4 AVC H.264",
    "flash": "TTL auto flash with monitor preflashes",
    "storage": "50MB internal memory SD / SDHC / SDXC memory card",
    "monitorresolution": "921,000-dots",
    "sensorsize": "1/2.3 in.",
    "attr8009913350": "(631) 389-2138",
    "totalpixels": "16.44 megapixels",
    "dimensionswxhxd": "3.1 x 4.4 x 3.3 in. (77 x 111 x 83.1mm)",
    "email": "Ask Seller a Question",
    "imagesize": "4608 x 3456 (16M)",
    "monitorsize": "3.0 in. diagonal",
    "sensortype": "CCD",
    "phone": "Toll Free USALocal / International",
    "focusrange": "[W]: Approx. 1 ft. 8 in. (50 cm.) to infinity [T]: Approx. 5 ft. (1.5 m.) to infinity Macro close-up mode: Approx. 0.4 in. (1 cm.) to infinity",
    "monitortype": "Wide Viewing Angle TFT-LCD with Anti-reflection coating, 5-level brightness adjustment",
    "interface": "Audio/video (A/V) output Digital I/O (USB) HDMI Mini Connector (HDMI output)",
    "paybyphoneorebaysecureonlinecheckoutorforyourconveniencewecanprocessallpaymentsincludingpaypaloverthephone": "Click here for Frequently Asked Questions ● We automatically notify the winner by email (to the address that you have registered with eBay) immediately after listing ends. ● If you have not received an email, or you are having problems emailing us, please call us to process your order. Check your junk mail filters for any missing or misdirected email. ● All shipping methods will appear as an option in checkout or over the phone. ● We supply a sales receipt with all orders. ● Manufacturer mail-in rebate forms will be provided (if applicable: rebate info will be stated in the listing). Rebate offers are valid only to orders shipped to a USA address. ● Auction/BIN price already reflects any point of sale instant rebates, if applicable. ● When your package has shipped, you will be notified by email with the tracking number. ● We leave positive feedback for all eBay customers after the order has been shipped. ● Please include your eBay item number and shipping address with all correspondence. ● Please call or email us with any additional information that you feel may assist us in the processing of your order.Cameta Camera offers fast and friendly customer service. If you have any questions, please contact us by email or phone (see hours below), and we will do our best to address any concerns as quickly as possible. Email: Ask Seller a Question Phone: Toll Free USA Local / International (800) 991-3350 (631) 389-2138 Hours: Click here for operating hours",
    "hours": "Click here for operating hours",
    "aperturerange": "f/3.1-5.9",
    "opticalzoom": "26x",
    "digitalzoom": "Up to 4x"
}