{
    "focallengthrange": "18mm - 140mm",
    "weight": "15.17 Oz.",
    "flashtype": "Pop-up Flash",
    "isosensitivity": "ISO 100-12800 in steps of 1 EV. Can also be set to approx. 1 EV (ISO 25600 equivalent) above ISO 12800",
    "frameadvancerate": "Up to 5 fps",
    "lightsensitivity": "ISO 100-6400, ISO 12800, ISO 25600, ISO auto",
    "flashmode": "Auto, auto with red-eye reduction, auto slow sync, auto slow sync with red-eye reduction, fill-flash, red-eye reduction, slow sync, slow sync with red-eye reduction, rear-curtain with slow sync, rear-curtain sync, off",
    "effectivepixels": "24.2 million",
    "additionalfeatures": "AF Lock, Auto White Balance, Automatic Face Tracking, Automatic Flash, Digital Image Rotation, Digital Image Stabilization, Exposure Compensation, Eye-Fi Card Ready, GPS, HDMI, Self Timer, USB",
    "opticalzoom": "3x",
    "powersource": "Rechargeable Li-ion Battery, AC adapter",
    "category": "camera",
    "specialeffects": "Color outline, Color sketch, HDR, Landscape, Miniature, Monochrome, Neutral, Perspective Control, Portrait, Silhouette, Vivid",
    "monitor": "7.5-cm (3-in.), approx. 921k-dot (VGA) TFT LCD",
    "lightsensitivitymax": "25600",
    "stillimageformat": "JPEG, NEF (RAW), RAW + JPEG",
    "storage": "SD, SDHC, SDXC",
    "lensforsd": "AF-S DX 18-55mm VR II",
    "sensorsize": "15.6 x 23.5mm",
    "width": "5.4 in.",
    "focallengthequivalentto35mmcamera": "18mm - 140mm",
    "lensservo": "Autofocus (AF): Single-servo AF (AF-S); continuous-servo AF (AF-C); auto AF-S/AF-C selection (AF-A); predictive focus tracking activated automatically according to subject statusManual focus (MF): Electronic rangefinder can be used",
    "dustreductionsystem": "Image Sensor Cleaning, Image Dust Off reference data (optional Capture NX 2 software required)",
    "focuspoint": "Can be selected from 11 focus points",
    "imagesize": "Easy panorama mode: Normal (horizontal pan) 4800 x 1080; normal (vertical pan) 1632 x 4800; wide (horizontal pan) 9600 x 1080; wide (vertical pan) 1632 x 9600 Other modes: 6000 x 4000 (large); 4496 x 3000 (medium); 2992 x 2000 (small)",
    "picturecontrolsystem": "Standard, Neutral, Vivid, Monochrome, Portrait, Landscape; selected Picture Control can be modified",
    "mpn": "1532",
    "brand": "Nikon",
    "sensortype": "CMOS",
    "screensize": "3\"",
    "supportedflashmemory": "SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "interface": "Hi-Speed USB; Video output; HDMI (Type C mini-pin); 3.5mm Stereo mini-pin jack; Accessory terminal (Wireless remote controller, remote cord,GPS unit)",
    "afareamode": "Single-point AF, dynamic-area AF, auto-area AF, 3D-tracking (11 points)",
    "lensmount": "Nikon F mount (with AF contacts)",
    "height": "4.2 in.",
    "shutterspeed": "1/4000 - 30 s in steps of 1/3 EV; Bulb; Time",
    "model": "D3300",
    "facedetection": "Yes",
    "effectiveangleofview": "Nikon DX format; focal length equiv. to approx. 1.5x that of lenses with FX-format angle of view",
    "shutterflashsyncspeed": "X=1/200 s; synchronizes with shutter at 1/200 s or slower",
    "cameratype": "Digital SLR",
    "builtinflash": "Auto, portrait, child, close up, night portrait, super vivid, pop, photo illustration, color sketch, toy camera effect: Auto flash with auto pop-up P, S, A, M: Manual pop-up with button release",
    "imagesensor": "23.5 x 15.6mm CMOS sensor",
    "exposuremodes": "Auto modes (auto; auto, flash off); programmed auto with flexible program (P); shutter-priority auto (S); aperture-priority auto (A); manual (M); scene modes (portrait; landscape; child; sports; close up; night portrait); special effects modes (night vision; super vivid; pop; photo illustration; color sketch; toy camera effect; miniature effect; selective color; silhouette; high key; low key; HDR painting; easy panorama)",
    "upc": "018208015320",
    "displaysize": "3\"",
    "depth": "3 in.",
    "sensorresolution": "24.2 MP",
    "viewfindertype": "Optical",
    "viewfinder": "Eye-level pentamirror single-lens reflex viewfinder",
    "exposurelock": "Luminosity locked at detected value with AE-L/AF-L button",
    "shootingprograms": "Autumn color, Beach/snow, Blossom, Candle, Children, Close-up, Dawn/dusk, Food, Landscape, Night landscape, Night portrait, Party/indoor, Pet, Portrait mode, Sports mode, Sunset",
    "fileformat": "NEF(RAW), JPEG, NEF(RAW)+JEPG",
    "opticalviewfindertype": "Fixed eye-level pentaprism"
}