{
    "exposurebracketing": "3 continuous or single shots in 1/3 or 2/3 EV steps",
    "autoexposurelock": "Yes (AE Lock button). Can be disabled from menu",
    "shutterspeeds": "Program Auto (1 - 1/32005) / Aperture Priority (8 - 1/32005) / Shutter Priority (30 - 1/32005) / Manual Exposure (Bulb, 30 - 1/32004) / iAuto (4 - 1/32005)",
    "exposurecompensation": "+/- 3.0 EV, 1/3 EV step",
    "pictureeffects": "[Still Image] Toy Camera, Pop Color, Posterization, Retro Photo, Soft High- key, Partial Color, High Contrast Monochrome, Soft Focus, HDR Painting, Rich-tone Monochrome, Miniature, Watercolor, Illustration [Movie] Toy Camera, Pop Color, Posterization, Retro Photo, Soft High-key, Partial Color, High Contrast Monochrome",
    "batterytype": "InfoLITHIUM NP-FW50 (7.7V)",
    "colorfiltersystem": "RGB primary color filters",
    "facedetection": "On, Off, Face Registration, Face Selection; maximum eight faces detected",
    "liveview": "Continuous Live View",
    "numberofstillimages": "Approx. 420 images with LCD monitor (CIPA standard)",
    "videosignal": "NTSC color, EIA standards",
    "mediatype": "Memory Stick Duo, Memory Stick PRO Duo, Memory Stick PRO Duo (High Speed), Memory Stick PRO-HG Duo, Memory Stick XC-HG Duo, Memory Stick Micro, Memory Stick Micro (Mark2), SD Memory Card, SDHC Memory Card (UHS-I), SDXC Memory Card (UHS-I), microSD Memory Card, microSDHC Memory Card, microSDXC Memory Card",
    "mediabatteryindicator": "Yes",
    "lenscompatibility": "Fixed lens",
    "recyclingtime": "Approx. 3 sec.",
    "nfc": "Yes (NFC Forum Type 3 Tag compatible, One-touch remote, One-touch sharing)",
    "griddisplay": "Yes (Rule of Thirds, 4x6 Square, Diagonal 4x6 Square Grids, Off)",
    "accessoryshoe": "Multi Interface Shoe",
    "weight": "With battery and Memory Stick PRO Duo Approx. 1 lb. 12.7oz / 0.81 kg 1 lb. 10.6oz / 0.75 kg",
    "flashtype": "Built-in, Pop-up Auto",
    "stillimagesize32": "L: 20M (5472 x 3648) / M: 10M (3888 x 2592) / S: 5.0M (2736 x 1824)",
    "stillimagesize43": "L: 18M (4864 x 3648) / M: 10M (3648 x 2736) / S: 5.0M (2592 x 1944) / VGA",
    "category": "camera",
    "dimensions": "5.12 x 3.5 x 4.12\" / 13.00 x 8.89 x 10.46 cm",
    "stillimagemode": "JPEG (Standard, Fine), RAW, RAW+JPEG",
    "selftimer": "10 sec. / 2 sec. / Self-portrait One-person/ Self-portrait Two-person/ Self timer Continuous (3 or 5 shots)",
    "sweeppanorama": "Horizontal (Wide/Standard), Vertical (Wide/Standard)",
    "suppliedsoftware": "Supplied Software: PlayMemories Home, Image Data Converter Version 4",
    "tripodmount": "Yes, 1/4\" (20 thread count)",
    "brightnesscontrol": "Auto / Manual (5 steps) / Sunny Weather mode",
    "effectivepictureresolution": "20.2M pixels (approx.)",
    "angleadjustment": "Tilt angle: Up: Approx. 84 degrees; Down: Approx. 43 degrees",
    "focusarea": "Multi point AF (25 points) / Center weighted AF / Flexible spot / Flexible spot (tracking focus) / Flexible spot (face tracking)",
    "whitebalancemode": "Auto / Daylight / Shade / Cloudy / Incandescent / Fluor (Warm White) / Fluor (Cool White) / Fluor (Day White) / Fluor (Daylight) / Flash / C. Temp., Filter / Custom",
    "flashbracketing": "±2.0 EV",
    "flashmodes": "Flash Mode: Auto / Fill-flash / Slow Sync / Rear Sync / Off",
    "braviasync": "Yes, via HDMI with compatible BRAVIA HDTV (link menu)",
    "iso": "[Still Image] Auto (ISO 125 - 12800, selectable with upper / lower limit) (Expandable to ISO 80 / 100) Multi Frame NR: Auto (ISO 125 - 25600), 200 / 400 / 800 / 1600 / 3200 / 6400 / 12800 / 25600 [Movie] Auto (ISO 125 - 6400 equivalent)",
    "flashcoverage": "ISO Auto: 3' 3-3/16\" to 33' 5\" (1.0m to 10.2m) ISO 12800: Up to 66' 11\" (Up to 20.4m)",
    "focussystem": "Contrast-detect AF",
    "clearimagezoom": "16.6x (including Optical Zoom)",
    "stillimagesize11": "L: 13M (3648x 3648) / M: 6.5M (2544 x 2544) / S: 3.7M (1920 x 1920)",
    "customization": "Grid, Histogram display, Digital Level Gauge, Grid Line, Magnified display for playback",
    "usbports": "USB 2.0 Hi-speed (mass-storage, MTP)",
    "aperture": "F2.8 constant",
    "afmodes": "Single-shot AF (AF-S) / Continuous AF (AF-C) / Direct Manual Focus (DMF) / Manual Focus",
    "peaking": "Yes Level setting: High/Mid/Low/Off Color: White/Red/Yellow",
    "imagingsensor": "Exmor R 1.0\" CMOS sensor (13.2 X 8.8mm) (3:2 aspect ratio)",
    "histogram": "Yes (On/off)",
    "drivemode": "Single-shot, Continuous, Speed Priority Continuous, Self-timer (10/2 sec. delay), Self-timer (Cont.), Self-portrait One-person, Self-portrait Two-person, Bracketing",
    "batterycapacity": "1080 mAh",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "flashmeteringsystem": "Pre-flash TTL",
    "colorspace": "sRGB, AdobeRGB, xvYCC standard (x.v.Color when connected via HDMI cable) compatible with TRILUMINOS color",
    "prioritysettingforfacedetection": "Yes (eight faces max)",
    "focallength35mmequivalent": "[Still Image 3:2] f = 24-200mm [Still Image 16:9] f = 25-213mm [Still Image 4:3] f= 26-220mm [Still Image 1:1] f = 31-259mm [Movie 16:9] f = 26-212mm (SteadyShot Standard), f = 29-315mm (SteadyShot Active Mode) [Movie 4:3] f = 31-259mm (SteadyShot Standard), f = 35-386mm (SteadyShot Active Mode)",
    "smileshuttertechnology": "Smile shutter (selectable from 3 steps)",
    "lcdtype": "3.0\" (7.5cm) (4:3) / 1,228,000 dots / Xtra Fine / TFT LCD / Tiltable (up approx. 84 deg., down approx. 43 deg.)",
    "phototvhd": "Yes, with BRAVIA Sync enabled HDTV and HDMI cable",
    "viewindex": "Single (with or without shooting information), RGB histogram and highlight/shadow warning, 4/9-frame index view, Enlarged display mode (L: 13.6x, M: 9.9x, S: 6.8x), Auto Review (10/5/2 sec, Off), Image orientation (On/Off), Slideshow, Panorama scrolling, Folder selection (still), Forward/Rewind (movie), Delete, Protect",
    "pixelgross": "20.9M pixels (approx.)",
    "creativestyle": "Standard, Vivid, Neutral, Clear, Deep, Light, Portrait, Landscape, Sunset, Night Scene, Autumn Leaves, Black White, Sepia, Style Box(Contrast (-3 to +3steps), Saturation(-3 to +3steps), Sharpness(-3 to +3steps)",
    "colortemperature": "2500 - 9900K with 15-step each Magenta/Green compensation (G7 to M7), Amber/Blue (A7 to B7), Custom",
    "lenstype": "Carl Zeiss Vario-Sonnar T, 14 elements in 11 groups (including 7 aspheric elements)",
    "realtimeimageadjustmentdisplay": "Yes (On/Off)",
    "imagestabilization": "[Still Image] Optical [Movie] Active Mode, Optical type with electronic compensation (Anti-rolling)",
    "powerconsumptioninoperation": "Approx. 1.5W",
    "audioformat": "Dolby Digital (AC-3) / MPEG-4 AAC-LC",
    "videomode": "AVCHD: 28M PS (1920 x 1080, 60p) 24M FX (1920 x 1080, 60i) 17M FH (1920 x 1080, 60i) 24M FX (1920 x 1080, 24p) 17M FH (1920 x 1080, 24p) MP4: 12M (1440 x 1080, 30 fps) 3M VGA (640 x 480, 30 fps)",
    "videoformat": "AVCHD Ver. 2.0 / MP4 (MPEG-4 AVC (H.264))",
    "autohighdynamicrange": "Yes, (Auto Exposure Difference, Exposure difference Level (1-6 EV at 1.0 EV step), off)",
    "focuspoints": "25 points",
    "meteringmodes": "Multi-segment, Center-weighted, Spot",
    "flashcompensation": "±2.0 EV (switchable between 1/3 EV steps)",
    "microphonespeaker": "Built-in stereo microphone or ECM-CG50 / XLR-K1M (sold separately)/ Built-in monaural speaker",
    "hdoutput": "HDMI (Type D micro)",
    "continuousshootingspeed": "Approx. 10 fps",
    "scenemodes": "Portrait, Anti Motion Blur, Sports Action, Macro, Landscape, Sunset, Night Scene, Hand-held Twilight, Night Portrait",
    "exposuresettings": "[Still] Program Auto (Program shift available), Aperture Priority, Shutter Speed Priority, Manual Exposure, MR (Memory Recall)1, MR2 [Movie] Movie Mode (Program Auto, Aperture Priority, Shutter Speed Priority, Manual Exposure) [Panorama] Scene Selection, AUTO (Intelligent Auto/Superior Auto)",
    "coverage": "100% Field of View",
    "drangeoptimizer": "Off, Dynamic Range Optimizer (Auto / Level), Auto High Dynamic Range: Off, Auto exposure difference, Exposure difference level (1.0 - 6.0 EV, 1.0 EV step)",
    "panoramastillimagesize": "Horizontal wide (12416 x 1856 / 5536 x 2160), Horizontal standard (8192 x 1856 / 3872 x 2160)",
    "memorycardslot": "Dual compatibility slot: Memory Stick PRO Duo/Pro-HG Duo/PRO-HG HX Duo media - SD, SDHC and SDXC memory cards",
    "stillimagesize169": "L:17M (5472 x 3080) / M: 7.5M (3648 x 2056) / S: 4.2M (2720 x 1528)",
    "storecategoriesstorehomeentertainmentcentertelevisions": "1.888.209.5772 About me Contact Us Shipping Payments FAQ Sony Cyber-Shot DSC-RX10 Digital Camera, 20.2MP, 8.3x Optical Zoom, 3.0\" LCD Display, HDMI/USB 2.0, Sweep Panorama, iAuto, Black SKU: ISODSCRX10 Mfr. Part: DSC-RX10/B Item Includes Sony Cyber-Shot DSC-RX10 Digital Camera - Rechargeable Battery Pack NP-FW50 - AC Adaptor AC-UB10 - Micro USB Cable - Shoulder Strap - Lens Cap - Shoe Cap - Lens Hood - Eyepiece Cup - Software - Sony 1 Year Warranty Description The Sony Cyber-Shot DSC-RX10 has plenty of features to realize more of the potential in your movies. To record sound with precision worthy of professional production, connect a high-performance microphone through an input terminal. Monitor pristine stereo sound through premium-quality Sony headphones plugged into the headphone jack. A built-in HDMI output terminal also accommodates connection of a TV, computer or DVD player/recorder. Audio metering and recording level control are instrumental to keeping soundtracks smooth and consistent. Use the camera's Multi Interface Shoe and an optional XLR Adaptor Kit to hook up external recording, flash and other accessories. It all adds up to a set of professional-class capabilities that is unprecedented among all other compact cameras. Containing back-illuminated technology and approximately 4x larger light-sensitive area that other compact DSC (digital still cameras) can't match, Sony's 20.2-megapixel 1.0-inch Exmor R CMOS sensor harnesses light and reduces image noise very efficiently. This, along with high settings of a wide ISO range, allow even photos of dimly lit scenes to look incredibly clear. Features With the new RX10 - the compact digital camera that puts boundless picture-taking power in your hands and a fresh new outlook in your sights A large F2.8 maximum aperture throughout an expansive 24-200mm (35mm equivalent) zoom range gives you ample opportunity to express your vision. Make a subject stand out - manipulate depth of field to defocus backgrounds for creative effect, as great photographers do Close-up shooting is seamless. No switching to macro mode is needed. Zoom in all the way up to extreme telephoto on a subject as near as 11-inches (30cm) away. The built-in lens makes it more convenient for you to take impressive shots throughout a big range An advanced aspherical lens (AA lens) reduces diameter and length and maintains high resolution even at image edges. A new Direct Drive SSM (Super Sonicwave Motor) stops lens movement with spot-on precision. Far-reaching optical flexibility minimizes mechanical dimensions The groundbreaking new BIONZ X image processing engine not only maximizes picture quality in ways that only a seamlessly unified body and lens design can realize - it also faithfully reproduces textures and details in real time, as seen by the naked eye, with peerless high-speed processing By minimizing digital artifacts that tend to overemphasize hard outlines and rough edges when pictures are reproduced, detail reproduction technology makes images noticeably more lifelike, clean and natural-looking in every detail, texture and dimension Now, noise reduction is individually adjusted based on imaging pattern variations, for superior clarity and finer details throughout even images shot in low light High-speed AF is remarkably smooth thanks to the Direct Drive SSM (Super Sonicwave Motor) with precision-engineered focusing stop positions designed to minimize focusing lens travel distance, which shortens focusing time Choose among three concentric Flexible Spot frames for greater focusing versatility and precision than other cameras' fixed-focus spot frame systems can provide Just press the shutter button halfway to activate Lock-on AF. It precisely focuses even on moving subjects by continuously adjusting target frame size based on its recognition of subject characteristics Applying advanced detection technology, this new Eye AF function detects and focuses on a subject's eye, even if the subject is facing or looking slightly away from the camera An abundance of powerful higher-performance functions and options are invaluable for capturing moving images of superior resolution and stunning clarity with minimal noise, even while zooming on the action As Full High Definition (Full HD) movie recording has become a standard of high-performance video recording and playback, Sony advances better ways to take advantage of its potential Clear, uncompressed digital movie signal output can be transferred to an external monitor/recorder (connected via the HDMI terminal) simultaneously in real time from the RX10. The shooting info display can be turned off for even cleaner views of such movies on an external monitor/recorder See spectacular clarity, contrast and detail in every scene, regardless of conditions, on the built-in, bright, high-resolution OLED Tru-Finder. Four dual-sided aspherical lenses provide a big, approx. 33-degree view angle and maintain excellent edge-to-edge visibility of the electronic viewfinder For faster, more intuitive camera operation, you can customize a total of seven buttons by assigning up to 40 types of functions among them. As a result, you will gain more convenient access to your selection of frequently used functions, right at your fingertips Magnesium alloy top and front casings make the RX10 light, solid and robust enough for long, rigorous use by advanced photographers and videographers. The camera's dust- and moisture-resistant design even allows shooting in rugged outdoor environments A new, improved graphical user interface makes access to frequently used functions absolutely effortless. Just press the Fn button to display a list of them An approximately 1,229K-dot tiltable 3.0-inch White Magic LCD lets you shoot comfortably from various positions. The display has the flexibility to be tilted within a range of angles extending from about 84 degrees upward to about 45 degrees downward Just download the free PlayMemories Mobile app, then instantly connect via Wi-Fi or NFC (near field communication) by touching a compatible Android smartphone or tablet to the camera This free, easy-to-use image management software can be installed onto Windows and Mac computers, for downloading photos and movies which can then be viewed, organized, edited, retouched, printed, burned to disk, shared or uploaded to social networking websites Virtually relive moments when you witnessed such nuances as the shades of a shimmering blue sky or a rosy complexion. The RX10 supports Sony TRILUMINOS Color for viewing photos in rich, natural colors on a TRILUMINOS Display Specifications Lens Compatibility Fixed lens Lens Compatibility Fixed lens Imaging Sensor Exmor R 1.0\" CMOS sensor (13.2 X 8.8mm) (3:2 aspect ratio) Imaging Sensor Exmor R 1.0\" CMOS sensor (13.2 X 8.8mm) (3:2 aspect ratio) Processor BIONZ X image processor Processor BIONZ X image processor Pixel Gross 20.9M pixels (approx.) Pixel Gross 20.9M pixels (approx.) Effective Picture Resolution 20.2M pixels (approx.) Effective Picture Resolution 20.2M pixels (approx.) Color Filter System RGB primary color filters Color Filter System RGB primary color filters Media Type Memory Stick Duo, Memory Stick PRO Duo, Memory Stick PRO Duo (High Speed), Memory Stick PRO-HG Duo, Memory Stick XC-HG Duo, Memory Stick Micro, Memory Stick Micro (Mark2), SD Memory Card, SDHC Memory Card (UHS-I), SDXC Memory Card (UHS-I), microSD Memory Card, microSDHC Memory Card, microSDXC Memory Card Media Type Memory Stick Duo, Memory Stick PRO Duo, Memory Stick PRO Duo (High Speed), Memory Stick PRO-HG Duo, Memory Stick XC-HG Duo, Memory Stick Micro, Memory Stick Micro (Mark2), SD Memory Card, SDHC Memory Card (UHS-I), SDXC Memory Card (UHS-I), microSD Memory Card, microSDHC Memory Card, microSDXC Memory Card Color Space sRGB, AdobeRGB, xvYCC standard (x.v.Color when connected via HDMI cable) compatible with TRILUMINOS color Color Space sRGB, AdobeRGB, xvYCC standard (x.v.Color when connected via HDMI cable) compatible with TRILUMINOS color Still Image Mode JPEG (Standard, Fine), RAW, RAW+JPEG Still Image Mode JPEG (Standard, Fine), RAW, RAW+JPEG Still Image Max Effective Resolution 20.2 Megapixels Still Image Max Effective Resolution 20.2 Megapixels Still Image Size 16:9 L:17M (5472 x 3080) / M: 7.5M (3648 x 2056) / S: 4.2M (2720 x 1528) Still Image Size 16:9 L:17M (5472 x 3080) / M: 7.5M (3648 x 2056) / S: 4.2M (2720 x 1528) Still Image Size 1:1 L: 13M (3648x 3648) / M: 6.5M (2544 x 2544) / S: 3.7M (1920 x 1920) Still Image Size 1:1 L: 13M (3648x 3648) / M: 6.5M (2544 x 2544) / S: 3.7M (1920 x 1920) Still Image Size 3:2 L: 20M (5472 x 3648) / M: 10M (3888 x 2592) / S: 5.0M (2736 x 1824) Still Image Size 3:2 L: 20M (5472 x 3648) / M: 10M (3888 x 2592) / S: 5.0M (2736 x 1824) Still Image Size 4:3 L: 18M (4864 x 3648) / M: 10M (3648 x 2736) / S: 5.0M (2592 x 1944) / VGA Still Image Size 4:3 L: 18M (4864 x 3648) / M: 10M (3648 x 2736) / S: 5.0M (2592 x 1944) / VGA Panorama Still Image Size Horizontal wide (12416 x 1856 / 5536 x 2160), Horizontal standard (8192 x 1856 / 3872 x 2160) Panorama Still Image Size Horizontal wide (12416 x 1856 / 5536 x 2160), Horizontal standard (8192 x 1856 / 3872 x 2160) Video Format AVCHD Ver. 2.0 / MP4 (MPEG-4 AVC (H.264)) Video Format AVCHD Ver. 2.0 / MP4 (MPEG-4 AVC (H.264)) Video Mode AVCHD: 28M PS (1920 x 1080, 60p) 24M FX (1920 x 1080, 60i) 17M FH (1920 x 1080, 60i) 24M FX (1920 x 1080, 24p) 17M FH (1920 x 1080, 24p) MP4: 12M (1440 x 1080, 30 fps) 3M VGA (640 x 480, 30 fps) Video Mode AVCHD: 28M PS (1920 x 1080, 60p) 24M FX (1920 x 1080, 60i) 17M FH (1920 x 1080, 60i) 24M FX (1920 x 1080, 24p) 17M FH (1920 x 1080, 24p) MP4: 12M (1440 x 1080, 30 fps) 3M VGA (640 x 480, 30 fps) Video Signal NTSC color, EIA standards Video Signal NTSC color, EIA standards Audio Format Dolby Digital (AC-3) / MPEG-4 AAC-LC Audio Format Dolby Digital (AC-3) / MPEG-4 AAC-LC Microphone/Speaker Built-in stereo microphone or ECM-CG50 / XLR-K1M (sold separately)/ Built-in monaural speaker Microphone/Speaker Built-in stereo microphone or ECM-CG50 / XLR-K1M (sold separately)/ Built-in monaural speaker Still Image Size(Photo Mode) JPEG (DCF Ver. 2.0, Exif Ver.2.3, MPF Baseline compliant), RAW (Sony ARW 2.3format) Still Image Size(Photo Mode) JPEG (DCF Ver. 2.0, Exif Ver.2.3, MPF Baseline compliant), RAW (Sony ARW 2.3format) Lens Type Carl Zeiss Vario-Sonnar T, 14 elements in 11 groups (including 7 aspheric elements) Lens Type Carl Zeiss Vario-Sonnar T, 14 elements in 11 groups (including 7 aspheric elements) Aperture F2.8 constant Aperture F2.8 constant Optical Zoom 8.3x (Optical Zoom during movie recording) Optical Zoom 8.3x (Optical Zoom during movie recording) Digital Zoom 20M approx. 33x/10M approx.46x/5M approx.66x/VGA approx. 125x Digital Zoom 20M approx. 33x/10M approx.46x/5M approx.66x/VGA approx. 125x Focal Length (35mm equivalent) [Still Image 3:2] f = 24-200mm [Still Image 16:9] f = 25-213mm [Still Image 4:3] f= 26-220mm [Still Image 1:1] f = 31-259mm [Movie 16:9] f = 26-212mm (SteadyShot Standard), f = 29-315mm (SteadyShot Active Mode) [Movie 4:3] f = 31-259mm (SteadyShot Standard), f = 35-386mm (SteadyShot Active Mode) Focal Length (35mm equivalent) [Still Image 3:2] f = 24-200mm [Still Image 16:9] f = 25-213mm [Still Image 4:3] f= 26-220mm [Still Image 1:1] f = 31-259mm [Movie 16:9] f = 26-212mm (SteadyShot Standard), f = 29-315mm (SteadyShot Active Mode) [Movie 4:3] f = 31-259mm (SteadyShot Standard), f = 35-386mm (SteadyShot Active Mode) Aperture Blade Iris diaphragm (7 blades) Aperture Blade Iris diaphragm (7 blades) Clear Image Zoom 16.6x (including Optical Zoom) Clear Image Zoom 16.6x (including Optical Zoom) LCD Type 3.0\" (7.5cm) (4:3) / 1,228,000 dots / Xtra Fine / TFT LCD / Tiltable (up approx. 84 deg., down approx. 43 deg.) LCD Type 3.0\" (7.5cm) (4:3) / 1,228,000 dots / Xtra Fine / TFT LCD / Tiltable (up approx. 84 deg., down approx. 43 deg.) Angle Adjustment Tilt angle: Up: Approx. 84 degrees; Down: Approx. 43 degrees Angle Adjustment Tilt angle: Up: Approx. 84 degrees; Down: Approx. 43 degrees Brightness Control Auto / Manual (5 steps) / Sunny Weather mode Brightness Control Auto / Manual (5 steps) / Sunny Weather mode Coverage 100% Field of View Coverage 100% Field of View Live View Continuous Live View Live View Continuous Live View Real-time image adjustment display Yes (On/Off) Real-time image adjustment display Yes (On/Off) Histogram Yes (On/off) Histogram Yes (On/off) Peaking Yes Level setting: High/Mid/Low/Off Color: White/Red/Yellow Peaking Yes Level setting: High/Mid/Low/Off Color: White/Red/Yellow Grid Display Yes (Rule of Thirds, 4x6 Square, Diagonal 4x6 Square Grids, Off) Grid Display Yes (Rule of Thirds, 4x6 Square, Diagonal 4x6 Square Grids, Off) Customization Grid, Histogram display, Digital Level Gauge, Grid Line, Magnified display for playback Customization Grid, Histogram display, Digital Level Gauge, Grid Line, Magnified display for playback Focus System Contrast-detect AF Focus System Contrast-detect AF Focus Points 25 points Focus Points 25 points AF Modes Single-shot AF (AF-S) / Continuous AF (AF-C) / Direct Manual Focus (DMF) / Manual Focus AF Modes Single-shot AF (AF-S) / Continuous AF (AF-C) / Direct Manual Focus (DMF) / Manual Focus Focus Area Multi point AF (25 points) / Center weighted AF / Flexible spot / Flexible spot (tracking focus) / Flexible spot (face tracking) Focus Area Multi point AF (25 points) / Center weighted AF / Flexible spot / Flexible spot (tracking focus) / Flexible spot (face tracking) Metering Modes Multi-segment, Center-weighted, Spot Metering Modes Multi-segment, Center-weighted, Spot Exposure Compensation +/- 3.0 EV, 1/3 EV step Exposure Compensation +/- 3.0 EV, 1/3 EV step Exposure Settings [Still] Program Auto (Program shift available), Aperture Priority, Shutter Speed Priority, Manual Exposure, MR (Memory Recall)1, MR2 [Movie] Movie Mode (Program Auto, Aperture Priority, Shutter Speed Priority, Manual Exposure) [Panorama] Scene Selection, AUTO (Intelligent Auto/Superior Auto) Exposure Settings [Still] Program Auto (Program shift available), Aperture Priority, Shutter Speed Priority, Manual Exposure, MR (Memory Recall)1, MR2 [Movie] Movie Mode (Program Auto, Aperture Priority, Shutter Speed Priority, Manual Exposure) [Panorama] Scene Selection, AUTO (Intelligent Auto/Superior Auto) Scene Mode(s) Portrait, Anti Motion Blur, Sports Action, Macro, Landscape, Sunset, Night Scene, Hand-held Twilight, Night Portrait Scene Mode(s) Portrait, Anti Motion Blur, Sports Action, Macro, Landscape, Sunset, Night Scene, Hand-held Twilight, Night Portrait D-Range Optimizer Off, Dynamic Range Optimizer (Auto / Level), Auto High Dynamic Range: Off, Auto exposure difference, Exposure difference level (1.0 - 6.0 EV, 1.0 EV step) D-Range Optimizer Off, Dynamic Range Optimizer (Auto / Level), Auto High Dynamic Range: Off, Auto exposure difference, Exposure difference level (1.0 - 6.0 EV, 1.0 EV step) Auto Exposure Lock Yes (AE Lock button). Can be disabled from menu Auto Exposure Lock Yes (AE Lock button). Can be disabled from menu ISO [Still Image] Auto (ISO 125 - 12800, selectable with upper / lower limit) (Expandable to ISO 80 / 100) Multi Frame NR: Auto (ISO 125 - 25600), 200 / 400 / 800 / 1600 / 3200 / 6400 / 12800 / 25600 [Movie] Auto (ISO 125 - 6400 equivalent) ISO [Still Image] Auto (ISO 125 - 12800, selectable with upper / lower limit) (Expandable to ISO 80 / 100) Multi Frame NR: Auto (ISO 125 - 25600), 200 / 400 / 800 / 1600 / 3200 / 6400 / 12800 / 25600 [Movie] Auto (ISO 125 - 6400 equivalent) Creative Style Standard, Vivid, Neutral, Clear, Deep, Light, Portrait, Landscape, Sunset, Night Scene, Autumn Leaves, Black White, Sepia, Style Box(Contrast (-3 to +3steps), Saturation(-3 to +3steps), Sharpness(-3 to +3steps) Creative Style Standard, Vivid, Neutral, Clear, Deep, Light, Portrait, Landscape, Sunset, Night Scene, Autumn Leaves, Black White, Sepia, Style Box(Contrast (-3 to +3steps), Saturation(-3 to +3steps), Sharpness(-3 to +3steps) White Balance Mode Auto / Daylight / Shade / Cloudy / Incandescent / Fluor (Warm White) / Fluor (Cool White) / Fluor (Day White) / Fluor (Daylight) / Flash / C. Temp., Filter / Custom White Balance Mode Auto / Daylight / Shade / Cloudy / Incandescent / Fluor (Warm White) / Fluor (Cool White) / Fluor (Day White) / Fluor (Daylight) / Flash / C. Temp., Filter / Custom Color Temperature 2500 - 9900K with 15-step each Magenta/Green compensation (G7 to M7), Amber/Blue (A7 to B7), Custom Color Temperature 2500 - 9900K with 15-step each Magenta/Green compensation (G7 to M7), Amber/Blue (A7 to B7), Custom Exposure Bracketing 3 continuous or single shots in 1/3 or 2/3 EV steps Exposure Bracketing 3 continuous or single shots in 1/3 or 2/3 EV steps Picture Effect(s) [Still Image] Toy Camera, Pop Color, Posterization, Retro Photo, Soft High- key, Partial Color, High Contrast Monochrome, Soft Focus, HDR Painting, Rich-tone Monochrome, Miniature, Watercolor, Illustration [Movie] Toy Camera, Pop Color, Posterization, Retro Photo, Soft High-key, Partial Color, High Contrast Monochrome Picture Effect(s) [Still Image] Toy Camera, Pop Color, Posterization, Retro Photo, Soft High- key, Partial Color, High Contrast Monochrome, Soft Focus, HDR Painting, Rich-tone Monochrome, Miniature, Watercolor, Illustration [Movie] Toy Camera, Pop Color, Posterization, Retro Photo, Soft High-key, Partial Color, High Contrast Monochrome Drive Mode Single-shot, Continuous, Speed Priority Continuous, Self-timer (10/2 sec. delay), Self-timer (Cont.), Self-portrait One-person, Self-portrait Two-person, Bracketing Drive Mode Single-shot, Continuous, Speed Priority Continuous, Self-timer (10/2 sec. delay), Self-timer (Cont.), Self-portrait One-person, Self-portrait Two-person, Bracketing Continuous Shooting Speed Approx. 10 fps Continuous Shooting Speed Approx. 10 fps Self-timer 10 sec. / 2 sec. / Self-portrait One-person/ Self-portrait Two-person/ Self timer Continuous (3 or 5 shots) Self-timer 10 sec. / 2 sec. / Self-portrait One-person/ Self-portrait Two-person/ Self timer Continuous (3 or 5 shots) Shutter Speeds Program Auto (1 - 1/32005) / Aperture Priority (8 - 1/32005) / Shutter Priority (30 - 1/32005) / Manual Exposure (Bulb, 30 - 1/32004) / iAuto (4 - 1/32005) Shutter Speeds Program Auto (1 - 1/32005) / Aperture Priority (8 - 1/32005) / Shutter Priority (30 - 1/32005) / Manual Exposure (Bulb, 30 - 1/32004) / iAuto (4 - 1/32005) Flash Type Built-in, Pop-up Auto Flash Type Built-in, Pop-up Auto Flash Metering System Pre-flash TTL Flash Metering System Pre-flash TTL Flash Modes Flash Mode: Auto / Fill-flash / Slow Sync / Rear Sync / Off Flash Modes Flash Mode: Auto / Fill-flash / Slow Sync / Rear Sync / Off Flash Compensation ±2.0 EV (switchable between 1/3 EV steps) Flash Compensation ±2.0 EV (switchable between 1/3 EV steps) Flash Coverage ISO Auto: 3' 3-3/16\" to 33' 5\" (1.0m to 10.2m) ISO 12800: Up to 66' 11\" (Up to 20.4m) Flash Coverage ISO Auto: 3' 3-3/16\" to 33' 5\" (1.0m to 10.2m) ISO 12800: Up to 66' 11\" (Up to 20.4m) Recycling Time Approx. 3 sec. Recycling Time Approx. 3 sec. Flash Bracketing ±2.0 EV Flash Bracketing ±2.0 EV Media/Battery Indicator Yes Media/Battery Indicator Yes View Index Single (with or without shooting information), RGB histogram and highlight/shadow warning, 4/9-frame index view, Enlarged display mode (L: 13.6x, M: 9.9x, S: 6.8x), Auto Review (10/5/2 sec, Off), Image orientation (On/Off), Slideshow, Panorama scrolling, Folder selection (still), Forward/Rewind (movie), Delete, Protect View Index Single (with or without shooting information), RGB histogram and highlight/shadow warning, 4/9-frame index view, Enlarged display mode (L: 13.6x, M: 9.9x, S: 6.8x), Auto Review (10/5/2 sec, Off), Image orientation (On/Off), Slideshow, Panorama scrolling, Folder selection (still), Forward/Rewind (movie), Delete, Protect Auto High Dynamic Range Yes, (Auto Exposure Difference, Exposure difference Level (1-6 EV at 1.0 EV step), off) Auto High Dynamic Range Yes, (Auto Exposure Difference, Exposure difference Level (1-6 EV at 1.0 EV step), off) Sweep Panorama Horizontal (Wide/Standard), Vertical (Wide/Standard) Sweep Panorama Horizontal (Wide/Standard), Vertical (Wide/Standard) Face Detection On, Off, Face Registration, Face Selection; maximum eight faces detected Face Detection On, Off, Face Registration, Face Selection; maximum eight faces detected Smile Shutter technology Smile shutter (selectable from 3 steps) Smile Shutter technology Smile shutter (selectable from 3 steps) Image Stabilization [Still Image] Optical [Movie] Active Mode, Optical type with electronic compensation (Anti-rolling) Image Stabilization [Still Image] Optical [Movie] Active Mode, Optical type with electronic compensation (Anti-rolling) Priority Setting (for Face Detection) Yes (eight faces max) Priority Setting (for Face Detection) Yes (eight faces max) Memory Card Slot Dual compatibility slot: Memory Stick PRO Duo/Pro-HG Duo/PRO-HG HX Duo media - SD, SDHC and SDXC memory cards Memory Card Slot Dual compatibility slot: Memory Stick PRO Duo/Pro-HG Duo/PRO-HG HX Duo media - SD, SDHC and SDXC memory cards NFC Yes (NFC Forum Type 3 Tag compatible, One-touch remote, One-touch sharing) NFC Yes (NFC Forum Type 3 Tag compatible, One-touch remote, One-touch sharing) Wi-Fi Yes Wi-Fi Yes HD Output HDMI (Type D micro) HD Output HDMI (Type D micro) USB Port(s) USB 2.0 Hi-speed (mass-storage, MTP) USB Port(s) USB 2.0 Hi-speed (mass-storage, MTP) BRAVIA Sync Yes, via HDMI with compatible BRAVIA HDTV (link menu) BRAVIA Sync Yes, via HDMI with compatible BRAVIA HDTV (link menu) PhotoTV HD Yes, with BRAVIA Sync enabled HDTV and HDMI cable PhotoTV HD Yes, with BRAVIA Sync enabled HDTV and HDMI cable Microphone Input Yes, via MI Shoe + Optional ECM-XYST1M or ECM-CG50 Microphone Input Yes, via MI Shoe + Optional ECM-XYST1M or ECM-CG50 Accessory Shoe Multi Interface Shoe Accessory Shoe Multi Interface Shoe Tripod Mount Yes, 1/4\" (20 thread count) Tripod Mount Yes, 1/4\" (20 thread count) Battery Type InfoLITHIUM NP-FW50 (7.7V) Battery Type InfoLITHIUM NP-FW50 (7.7V) Battery Capacity 1080 mAh Battery Capacity 1080 mAh Number of Still Images Approx. 420 images with LCD monitor (CIPA standard) Number of Still Images Approx. 420 images with LCD monitor (CIPA standard) Power Consumption (in Operation) Approx. 1.5W Power Consumption (in Operation) Approx. 1.5W Supplied Software Supplied Software: PlayMemories Home, Image Data Converter Version 4 Supplied Software Supplied Software: PlayMemories Home, Image Data Converter Version 4 Operating System Compatibility 1 Image Data Converter 4.0: Microsoft Windows Vista SP2, Windows 7 SP1, Windows 8 (Pentium 4 or faster) Mac OS X (10.6-10.8) (Intel Core Solo/Core Duo/Core 2 Duo or faster) PlayMemories Home: Operating System Compatibility 1 Image Data Converter 4.0: Microsoft Windows Vista SP2, Windows 7 SP1, Windows 8 (Pentium 4 or faster) Mac OS X (10.6-10.8) (Intel Core Solo/Core Duo/Core 2 Duo or faster) PlayMemories Home: Operating System Compatibility 2 Microsoft Windows Vista SP2, Windows 7 SP1, Windows 8 (Pentium III 800 MHz or faster; for playing/editing HD movies: Intel Core Duo 1.66 GHz or faster/Intel Core 2 Duo 1.66 GHz or faster, Intel Core 2 Duo 2.26 GHz or faster (AVC HD (FX/FH)) Mac OS X (10.6-10.8) (Intel Core Solo/Core Duo/Core 2 Duo or faster) Operating System Compatibility 2 Microsoft Windows Vista SP2, Windows 7 SP1, Windows 8 (Pentium III 800 MHz or faster; for playing/editing HD movies: Intel Core Duo 1.66 GHz or faster/Intel Core 2 Duo 1.66 GHz or faster, Intel Core 2 Duo 2.26 GHz or faster (AVC HD (FX/FH)) Mac OS X (10.6-10.8) (Intel Core Solo/Core Duo/Core 2 Duo or faster) Dimensions 5.12 x 3.5 x 4.12\" / 13.00 x 8.89 x 10.46 cm Dimensions 5.12 x 3.5 x 4.12\" / 13.00 x 8.89 x 10.46 cm Weight With battery and Memory Stick PRO Duo Approx. 1 lb. 12.7oz / 0.81 kg 1 lb. 10.6oz / 0.75 kg Weight With battery and Memory Stick PRO Duo Approx. 1 lb. 12.7oz / 0.81 kg 1 lb. 10.6oz / 0.75 kg WHO WE ARE Adorama is one of the nation's largest Photographic retail and mail order suppliers. For over 35 years we have been serving professionals as well as amateurs in the photographic, video, digital imaging and telescope fields. We offer the best combination of quality services, vast selection, knowledgeable staff, and competitive pricing. Adorama Camera is your #1 source for the best and newest products in the photographic industry, and the largest inventory of items such as Digital Cameras, Digital Camera Accessories, Memory Cards, 35mm Cameras, Medium Format Cameras, Lenses, Video Cameras, TV's, MP3 Players, Binoculars, Telescopes, Scanners, Inkjet, Dye-Sub & Laser Printers, Office Fax machines, Shredders, Projectors, Inkjet Paper, Photographic Accessories, Filters, Batteries, Cases, Tripods, Flashes, Lighting & Studio Equipment, Film, Darkroom Products and Audio Video Equipment. All new equipment comes with all of the factory included accessories, including a full manufacturer's warranty, unless otherwise noted. We only post items that are in-stock and ready to ship. PAYMENT Paypal is our only method of payment. Your Paypal account must be a Verified US Paypal account. Selecting \"Immediate Pay\" is the way to go. If you select eCheck, it may take 2-8 days to clear Paypal. In an effort to comply with our Authorized Dealer contracts with the manufacturers and to best control our inventory levels we reserve the right to limit quantities or cancel orders to Resellers and Exporters. Please note: Inventory is not reserved until the item is paid for. Please include a phone number as UPS and our Trucking Companies require it. We prefer to ship to a confirmed Paypal address and whether yes or no we may still contact you for additional verification. For shipments in New York and New Jersey, we are required to collect the appropriate sales tax. INTERNATIONAL International taxes and duties: International shipments may be subject to import fees, duties and taxes, which are levied once a shipment reaches the respective country, in addition to the brokerage fees/custom clearance charges which may be imposed by the carrier. These charges must be borne by the recipient. Adorama has no control over these charges and cannot predict what they might be. Orders shipped using eBays (GSP) \"Global Shipping Platform\" have already paid their taxes and must contact eBay directly for any issues. SHIPPING Most purchases are shipped with 24 Business Hours. Adorama's eBay store ships to the 48 Contiguous United States including Military APO & FPO and Puerto Rico. We now ship to Canada, parts of Europe and Australia. We do not ship to other International locations. Items with \"free shipping\" are only shipped free to the 48 contiguous United States. Combined shipping is available by placing all adoramacamera eBay orders BEFORE making the Payment. eBay's new checkout offers you to consolidate your orders to get better shipping rates. All orders must be shipped with a printed invoice included. We can not ship orders without the invoice or a lower value invoice. Gift Invoices can be sent if you call us immediately after payment is made (if during business hours). No guarantees for emails in this matter. Shipment errors due to a bad address entered by the buyer and will not be credited for shipping charges if returned or at all if lost or abandoned by the carrier. We supply tracking information directly to your eBay account as well as via email within 24 hours after the shipment leaves our warehouse. Please make sure that our email messages don't go into spam or junk. Change requests may not be updated on eBay, please check the emails. All TV's over 50 inches or other large items will ship via special Truck Delivery. An appointment will be made by the Trucking Company 24 hours before final delivery. Therefore, you must provide a phone number. Please read this carefully before purchasing any TV from us. All TV's 50 inches or larger will ship via special truck delivery only. An appointment will be made by the Trucking Company 24 hours before final delivery. LCD, LED and Plasma TVs as well as Monitors from 20\" and above can not be returned unless damaged in transit. At time of arrival If your TV arrives by UPS or FedEx: Please inspect the box from the outside for visible damage. If the box is not in perfect condition you should refuse it. Once you sign for it or open the box, you can not claim in-transit damage. If the box looks fine, you can then sign for it & open the box for further inspection after the carrier/driver leaves. You should check your TV ASAP to make sure that it works fine. If there are any problems, please let us know. If your TV arrives by special truck delivery: Please inspect the TV for both, external damage AND make sure that it powers up before you sign for it. If there's any external damage to the box, or it doesn't power on, do not accept it or sign for it. (According to the trucking company rules, you need to test the TV at the closest power outlet to the door. They are not required to wait until you put the TV in its intended place or till you test the cable connections). After the truck leaves, you should further test the TV to make sure everything works perfectly. If there are any problems, please let us know. Damage claims must be reported within 24 hours of receipt. Returns Please click here for our FULL RETURN POLICY For the first 30 days from date of receipt of your purchase you may return the merchandise for a full money back refund, excluding any shipping charges (for items which we offer free shipping, our standard shipping charges will be deducted from any refund or credit). Returned or exchanged products must be in brand-new, mint condition. Items must be in the original, undamaged manufacturer's packaging with all packaging materials, including instruction booklets, packing inserts, and the blank warranty cards. Memory cards and any other Blister Pack items are not returnable once opened. Any merchandise missing the original Universal Product Code (UPC) cannot be returned. The manufacturer's labeled packaging must be enclosed within an additional shipping carton. Please do not place stickers or shipping labels on the original manufacturer's package. Printers, Desktop Computers, Laptops, Tablets & Notebooks are not returnable once they are booted up or the toner is installed, as per the manufacturers contracts, all service to be done through them directly. Please ship your parcel back to Adorama freight prepaid and Insured. Sorry, Adorama cannot accept COD or freight-collect shipments. Return shipping cost (the cost to send an item back to our store) is not reimbursable. Please enclose a copy of your invoice with your return and tell us whether you would like the item to be replaced, exchanged, or refunded. Returns can take up to 8 days in-house from the date we receive it to process. When returning an item, please make sure you use a shipper which provides you with Insurance and a tracking number. Items returned without a tracking number might take much longer to be processed. We do not require a RMA. Returns should be shipped to: ACC Order processing 7 Slater Drive Elizabeth, NJ 07206 If you live in New York you may bring the return to our Manhattan store for exchange or refund. Warranty Information Most products have the warranty length listed in the description. To obtain a free copy of the manufacturers warranty details for any product we carry, please write to us and be sure to include the Brand Name and Model Number. Adorama Camera, Inc. Warranty Requests 42 West 18th Street New York, NY 10011 Contact Us Got a question? click here Product Information: 800-223-2500 Customer Service: 888-209-5772 HOURS OF OPERATION Mon-Thurs: 9:00am - 5:00pm Friday: 9:00am - 12:00pm On Sep-26-14 at 16:18:00 PDT, seller added the following information: Protect It Now with a Consumer Priority Service Extended Warranty",
    "wifi": "Yes",
    "opticalzoom": "8.3x (Optical Zoom during movie recording)",
    "processor": "BIONZ X image processor",
    "digitalzoom": "20M approx. 33x/10M approx.46x/5M approx.66x/VGA approx. 125x",
    "apertureblade": "Iris diaphragm (7 blades)",
    "stillimagemaxeffectiveresolution": "20.2 Megapixels",
    "microphoneinput": "Yes, via MI Shoe + Optional ECM-XYST1M or ECM-CG50"
}