{
    "category": "camera",
    "cameratype": "Bridge Camera",
    "mpn": "8406B001",
    "brand": "Canon",
    "upc": "013803229820",
    "opticalzoom": "5x",
    "displaytype": "LCD",
    "digitalzoom": "4x",
    "sensorresolution": "12.1 MP",
    "storecategoriesstorehomecamerascamcorderscamerascamcordersbatteriesmemorycardothercarelectronicscaraudiovideogpssystemsdvdvcrplayersrecordershomeaudiopersonalcareportableaudiomp3playersipodsmp3mediaplayersheadphonesportablespeakerstabletsebookscomputerstabletsebookscaseskeyboardsaccessoriestelephonesfaxmachinestelevisionsmonitorsvideogamesvideogamesgameconsolesvideogameaccessoriesdancepads": "Item    Title Canon PowerShot G16 12.1 MP CMOS Digital Camera     with 5x Optical Zoom and 1080p Full-HD Video Brand     New Sealed Description 12.1 Megapixel 1/1.7\" CMOS Sensor Canon 5x Optical Zoom Lens (28-140mm) Optical Zoom Viewfinder and 3.0\" LCD Full HD 1080/60p Video DIGIC 6 Image Processing Engine Enhanced Wi-Fi Capabilities Continuous Shooting at 9.3 fps Intelligent IS Image Stabilization ISO 12800 and Canon HS SYSTEM Package Contents Canon Power Shot G16 Point-and-Shoot Camera NB-10L Lithium-Ion Battery Pack CB-2LC Charger for NB-10L Lithium-Ion Battery Pack NS-DC11 Neck Strap Condition This item is brand new and comes complete with all      manufacturer supplied accessories. Warranty One year manufacturer warranty is included. You may contact      us for all questions or details about the warranty. Shipping For Hawaii, Alaska, Puerto Rico, GUAM, APO, FPO and International please contact us PRIOR to bidding       for the CORRECT shipping quote. We will Provide a Tracking number to the e-mail address       linked to your eBay account once your item ships. Sorry, but we do not do pick ups. We ship out only. Sales Tax There is sales tax on all shipment to California. State       taxes will be calculated at checkout. International      Bidders All International bidders must contact us PRIOR to       placing a bid to get the correct shipping quotes. Any taxes, import duties or brokerage fees and/or GST       for anything shipped outside the U.S. is the buyers full       responsibility. International shipments could take up to one month to       arrive due to increased delays in customs. Communication &      Contact Info: Email: eBay communication system Phone: 818-385-1863 Monday-Friday 10AM-5PM (PST) Please remember the best way to solve any problem that       may arise during the transaction is communication. So please       do not hesitate to contact us either by email or by phone so       that together we can complete the transaction as smoothly as       possible.",
    "displaysize": "3\"",
    "supportedflashmemory": "SD Memory Card, SDHC Memory Card, SDXC Memory Card",
    "model": "G16",
    "maxvideoresolution": "1920 x 1080",
    "screensize": "3\""
}