{
    "macrofocusrange": "1 cm (0.39\")",
    "storagetypes": "SD/SDHC/SDXC, Internal",
    "weight": "524g (18.48 oz) (including batteries)",
    "jpegqualitylevels": "Fine, standard",
    "exposurecompensation": "±2 (at 1/3 EV steps)",
    "effectivepixels": "20 megapixels",
    "environmentallysealed": "No",
    "uncompressedformat": "No",
    "imagestabilization": "Optical",
    "opticalzoom": "42x",
    "batterytype": "Lithium-ion battery",
    "manualfocus": "No",
    "aebracketing": "±2 (3 frames at 1/3 EV, 2/3 EV, 1 EV, 2 EV steps)",
    "autofocusassistlamp": "Yes",
    "category": "camera",
    "dimensions": "126 x 87 x 94 mm (4.96 x 3.43 x 3.7\")",
    "continuousdrive": "Yes",
    "sensorsize": "1/2.3\" (6.17 x 4.55 mm)",
    "selftimer": "Yes (2 or 10 sec)",
    "liveview": "Yes",
    "maximumaperture": "F3.0 - F6.5",
    "meteringmodes": "Multi Center-weighted Spot",
    "autofocus": "Contrast Detect (sensor) Multi-area Center Tracking Single Continuous Face Detection Live View",
    "otherresolutions": "5152 x 3432, 5252 x 2896, 3856 x 3856, 3264 x 2448, 3264 x 2176, 2048 x 1536, 2048 x 1536, 1536 x 1536, 1920 x 1080, 640 x 480",
    "orientationsensor": "Yes",
    "touchscreen": "No",
    "whitebalancepresets": "4",
    "imageratiowh": "1:1, 4:3, 3:2, 16:9",
    "hdmi": "No",
    "flashrange": "10.80 m",
    "wbbracketing": "No",
    "minimumshutterspeed": "15 sec",
    "externalflash": "No",
    "numberoffocuspoints": "9",
    "screensize": "3\"",
    "wevemadeafewchangestobidding": "Were these helpful?",
    "remotecontrol": "No",
    "sensorphotodetectors": "21 megapixels",
    "sensortype": "CCD",
    "focallengthequiv": "22-924 mm",
    "bodytype": "SLR-like (bridge)",
    "storecategoriesstorehomeentertainmentcentertelevisions": "1.888.209.5772 About me Contact Us Shipping Payments FAQ Panasonic Lumix DMC-LZ40 Digital Camera, 20MP, 42x Optical Zoom, 3\" 460K-Dot LCD Display, USB 2.0, Panorama, 15 Filter Effects, iA Intelligent Auto SKU: IPCDMCLZ40 Mfr. Part: DMC-LZ40K Item Includes Panasonic Lumix DMC-LZ40 Digital Camera - Lithium-Ion Battery - USB Charger - Panasonic Warranty Description The Panasonic Lumix DMC-LZ40 Digital Camera offers the ease and features of a point-and-shoot camera with 720p HD video, DSLR-like handling control and a 20MP CCD sensor for tack-sharp images, accurate colors and speedy performance via its 42x optical zoom lens that covers the 35mm equivalent of 22mm ultra wide-angle to 924mm super-telephoto with Optical Image Stabilization to tame camera shake. Onboard advanced technologies include iA (Intelligent Auto) mode that draws on the considerable attributes of Face Detection, Image Stabilization, Intelligent Scene Selector and Intelligent Exposure to automatically capture the best possible images with minimum bother. Convenience features include Creative Control and Creative Retouch options that furnish 15 filter effects in standard format and 13 effects in Creative Panorama mode rendered on the 3.0\" large 460K-dot LCD screen. The DMC-LZ40's high-capacity battery will keep up with the action, providing 5+ hours of continuous shooting. Features 20MP 1/2.3\" CCD Sensor: A 20MP CCD Sensor offers high quality imaging even in low light conditions and the Venus Engine Image Processor provides fast performance speeds 42x Optical Zoom Lens: A 42x ultra wide-angle optical zoom lens provides the 35mm focal length equivalent of a 22-924mm lens. This incorporates an incredibly wide range of shooting possibilities from ultra wide-angle to super-telephoto 720p HD Video with Dedicated One-touch Button: 720p HD video recording is available both Intelligent Auto (iA) and Optical Image Stabilization support 3.0\" Intelligent LCD Display: Composition and playback are viewed with the large 3.0\" color LCD display Optical Image Stabilization: Optical Image Stabilizer compensates for the effects of camera shake in both photo and video mode. It provides you with clearer images in low light and when shooting at telephoto lengths Intelligent Auto: In the iA (Intelligent Auto) Mode, the camera does all the work, leaving you free to compose your shot and capture the moment. Combining Automatic ISO and Exposure, Face Detection, Intelligent Scene Detection into one mode Specifications Body type SLR-like (bridge) Max resolution 5152 x 3864 Other resolutions 5152 x 3432, 5252 x 2896, 3856 x 3856, 3264 x 2448, 3264 x 2176, 2048 x 1536, 2048 x 1536, 1536 x 1536, 1920 x 1080, 640 x 480 Image ratio w:h 1:1, 4:3, 3:2, 16:9 Effective pixels 20 megapixels Sensor photo detectors 21 megapixels Sensor size 1/2.3\" (6.17 x 4.55 mm) Sensor type CCD Color space sRGB Color filter array Primary color filter ISO Auto, 100, 200, 400, 800, 1600 (boost to 3200/6400) White balance presets 4 Custom white balance Yes Image stabilization Optical Uncompressed format No JPEG quality levels Fine, standard File format JPEG (DCF Exif 2.3) Focal length (equiv.) 22-924 mm Optical zoom 42x Autofocus Contrast Detect (sensor) Multi-area Center Tracking Single Continuous Face Detection Live View Autofocus assist lamp Yes Digital zoom Yes (2x) Manual focus No Normal focus range 30 cm (11.81\") Macro focus range 1 cm (0.39\") Number of focus points 9 Articulated LCD Fixed Screen size 3\" Screen dots 460,000 Touch screen No Screen type TFT LCD Live view Yes Viewfinder type None Maximum aperture F3.0 - F6.5 Minimum shutter speed 15 sec Maximum shutter speed 1/1500 sec Exposure modes Intelligent Auto Program Manual Panorama Shot Scene Creative Control Portrait Scenery Scene modes Soft Skin, Sports, Night Portrait, Night Scenery Food, Baby 1/2, Pet, Sunset, High Sensitivity, Glass Through, HDR, Starry Sky Built-in flash Yes Flash range 10.80 m External flash No Flash modes Auto, Auto/Red-eye Reduction, Forced On, Slow Sync./Red-eye Reduction, Forced Off Continuous drive Yes Self-timer Yes (2 or 10 sec) Metering modes Multi Center-weighted Spot Exposure compensation ±2 (at 1/3 EV steps) AE Bracketing ±2 (3 frames at 1/3 EV, 2/3 EV, 1 EV, 2 EV steps) WB Bracketing No Videography: Format Motion JPEG Videography: Microphone Mono Videography: Speaker Mono Videography: Resolutions 1280 x 720 (30p), 640 x 480 (30p), 320 x 240 (30p) Storage types SD/SDHC/SDXC, Internal USB USB 2.0 (480 Mbit/sec) HDMI No Remote control No Environmentally sealed No Battery Type Lithium-ion battery USB charger Yes Battery Life (CIPA) 320 Orientation sensor Yes GPS None Dimensions 126 x 87 x 94 mm (4.96 x 3.43 x 3.7\") Weight 524g (18.48 oz) (including batteries) WHO WE ARE Adorama is one of the nation's largest Photographic retail and mail order suppliers. For over 35 years we have been serving professionals as well as amateurs in the photographic, video, digital imaging and telescope fields. We offer the best combination of quality services, vast selection, knowledgeable staff, and competitive pricing. Adorama Camera is your #1 source for the best and newest products in the photographic industry, and the largest inventory of items such as Digital Cameras, Digital Camera Accessories, Memory Cards, 35mm Cameras, Medium Format Cameras, Lenses, Video Cameras, TV's, MP3 Players, Binoculars, Telescopes, Scanners, Inkjet, Dye-Sub & Laser Printers, Office Fax machines, Shredders, Projectors, Inkjet Paper, Photographic Accessories, Filters, Batteries, Cases, Tripods, Flashes, Lighting & Studio Equipment, Film, Darkroom Products and Audio Video Equipment. All new equipment comes with all of the factory included accessories, including a full manufacturer's warranty, unless otherwise noted. We only post items that are in-stock and ready to ship. PAYMENT Paypal is our only method of payment. Your Paypal account must be a Verified US Paypal account. Selecting \"Immediate Pay\" is the way to go. If you select eCheck, it may take 2-8 days to clear Paypal. In an effort to comply with our Authorized Dealer contracts with the manufacturers and to best control our inventory levels we reserve the right to limit quantities or cancel orders to Resellers and Exporters. Please note: Inventory is not reserved until the item is paid for. Please include a phone number as UPS and our Trucking Companies require it. We prefer to ship to a confirmed Paypal address and whether yes or no we may still contact you for additional verification. For shipments in New York and New Jersey, we are required to collect the appropriate sales tax. INTERNATIONAL International taxes and duties: International shipments may be subject to import fees, duties and taxes, which are levied once a shipment reaches the respective country, in addition to the brokerage fees/custom clearance charges which may be imposed by the carrier. These charges must be borne by the recipient. Adorama has no control over these charges and cannot predict what they might be. Orders shipped using eBays (GSP) \"Global Shipping Platform\" have already paid their taxes and must contact eBay directly for any issues. SHIPPING Most purchases are shipped with 24 Business Hours. Adorama's eBay store ships to the 48 Contiguous United States including Military APO & FPO and Puerto Rico. We now ship to Canada, parts of Europe and Australia. We do not ship to other International locations. Items with \"free shipping\" are only shipped free to the 48 contiguous United States. Combined shipping is available by placing all adoramacamera eBay orders BEFORE making the Payment. eBay's new checkout offers you to consolidate your orders to get better shipping rates. All orders must be shipped with a printed invoice included. We can not ship orders without the invoice or a lower value invoice. Gift Invoices can be sent if you call us immediately after payment is made (if during business hours). No guarantees for emails in this matter. Shipment errors due to a bad address entered by the buyer and will not be credited for shipping charges if returned or at all if lost or abandoned by the carrier. We supply tracking information directly to your eBay account as well as via email within 24 hours after the shipment leaves our warehouse. Please make sure that our email messages don't go into spam or junk. Change requests may not be updated on eBay, please check the emails. All TV's over 50 inches or other large items will ship via special Truck Delivery. An appointment will be made by the Trucking Company 24 hours before final delivery. Therefore, you must provide a phone number. Please read this carefully before purchasing any TV from us. All TV's 50 inches or larger will ship via special truck delivery only. An appointment will be made by the Trucking Company 24 hours before final delivery. LCD, LED and Plasma TVs as well as Monitors from 20\" and above can not be returned unless damaged in transit. At time of arrival If your TV arrives by UPS or FedEx: Please inspect the box from the outside for visible damage. If the box is not in perfect condition you should refuse it. Once you sign for it or open the box, you can not claim in-transit damage. If the box looks fine, you can then sign for it & open the box for further inspection after the carrier/driver leaves. You should check your TV ASAP to make sure that it works fine. If there are any problems, please let us know. If your TV arrives by special truck delivery: Please inspect the TV for both, external damage AND make sure that it powers up before you sign for it. If there's any external damage to the box, or it doesn't power on, do not accept it or sign for it. (According to the trucking company rules, you need to test the TV at the closest power outlet to the door. They are not required to wait until you put the TV in its intended place or till you test the cable connections). After the truck leaves, you should further test the TV to make sure everything works perfectly. If there are any problems, please let us know. Damage claims must be reported within 24 hours of receipt. Returns Please click here for our FULL RETURN POLICY For the first 30 days from date of receipt of your purchase you may return the merchandise for a full money back refund, excluding any shipping charges (for items which we offer free shipping, our standard shipping charges will be deducted from any refund or credit). Returned or exchanged products must be in brand-new, mint condition. Items must be in the original, undamaged manufacturer's packaging with all packaging materials, including instruction booklets, packing inserts, and the blank warranty cards. Memory cards and any other Blister Pack items are not returnable once opened. Any merchandise missing the original Universal Product Code (UPC) cannot be returned. The manufacturer's labeled packaging must be enclosed within an additional shipping carton. Please do not place stickers or shipping labels on the original manufacturer's package. Printers, Desktop Computers, Laptops, Tablets & Notebooks are not returnable once they are booted up or the toner is installed, as per the manufacturers contracts, all service to be done through them directly. Please ship your parcel back to Adorama freight prepaid and Insured. Sorry, Adorama cannot accept COD or freight-collect shipments. Return shipping cost (the cost to send an item back to our store) is not reimbursable. Please enclose a copy of your invoice with your return and tell us whether you would like the item to be replaced, exchanged, or refunded. Returns can take up to 8 days in-house from the date we receive it to process. When returning an item, please make sure you use a shipper which provides you with Insurance and a tracking number. Items returned without a tracking number might take much longer to be processed. We do not require a RMA. Returns should be shipped to: ACC Order processing 7 Slater Drive Elizabeth, NJ 07206 If you live in New York you may bring the return to our Manhattan store for exchange or refund. Warranty Information Most products have the warranty length listed in the description. To obtain a free copy of the manufacturers warranty details for any product we carry, please write to us and be sure to include the Brand Name and Model Number. Adorama Camera, Inc. Warranty Requests 42 West 18th Street New York, NY 10011 Contact Us Got a question? click here Product Information: 800-223-2500 Customer Service: 888-209-5772 HOURS OF OPERATION Mon-Thurs: 9:00am - 5:00pm Friday: 9:00am - 12:00pm On Sep-26-14 at 16:37:23 PDT, seller added the following information: Protect It Now with a Consumer Priority Service Extended Warranty",
    "normalfocusrange": "30 cm (11.81\")",
    "flashmodes": "Auto, Auto/Red-eye Reduction, Forced On, Slow Sync./Red-eye Reduction, Forced Off",
    "builtinflash": "Yes",
    "colorspace": "sRGB",
    "exposuremodes": "Intelligent Auto Program Manual Panorama Shot Scene Creative Control Portrait Scenery",
    "screendots": "460,000",
    "screentype": "TFT LCD",
    "digitalzoom": "Yes (2x)",
    "batterylifecipa": "320",
    "iso": "Auto, 100, 200, 400, 800, 1600 (boost to 3200/6400)",
    "viewfindertype": "None",
    "articulatedlcd": "Fixed",
    "usb": "USB 2.0 (480 Mbit/sec)",
    "maxresolution": "5152 x 3864",
    "customwhitebalance": "Yes",
    "gps": "None",
    "scenemodes": "Soft Skin, Sports, Night Portrait, Night Scenery Food, Baby 1/2, Pet, Sunset, High Sensitivity, Glass Through, HDR, Starry Sky",
    "fileformat": "JPEG (DCF Exif 2.3)",
    "maximumshutterspeed": "1/1500 sec"
}