{
    "exposurerange": "EV 0-20 ( ISO 100 )",
    "weight": "19.8 Oz.",
    "flashtype": "Pop-up Flash",
    "microphoneoperationmode": "Mono",
    "dioptriccorrectionrange": "-2 to +1",
    "maxoperatingtemperature": "40 Â°C",
    "dmoviefullhd1080pmovieclips": "A dedicated movie-record button right next to the shutter-release makes it easy to keep the camera steady when you switch between recording stills and movies. AF-F mode keeps everything in focus, and the camera's vari-angle monitor and Special Effects mode enable unique shots. The camera supports use of an external microphone and offers 30p, 25p and 24p frame rates.",
    "height": "3.8 in.",
    "exposurecompensation": "Â±5 EV range, in 1, 1/2 or 1/3 EV steps",
    "opticalviewfindertype": "Eye-level mirror pentaprism",
    "cameraflashfeatures": "AF Illuminator, Auto Flash, Fill-in Flash, Flash +/- Compensation, Flash Off, Front Sync Flash, Manual, Rear Sync Flash, Red-eye Reduction Flash, Slow Sync, Wireless Off-Camera Control",
    "additionalfeatures": "AF Tracking, Dust proof, Face Detection, GPS, HDMI, Image Stabilization, Interchangeable Lenses, Not Interchangeable Lenses, Red-eye Correction, USB 2.0, With LCD Protected Position, With Tripod Mount",
    "displaysize": "2.7\"",
    "maxvideoresolution": "1280 x 720",
    "category": "camera",
    "specialeffects": "Color sketch, Fisheye, Landscape, Miniature, Monochrome, Neutral, Portrait, Silhouette, Vivid",
    "facedetection": "Yes",
    "lightsensitivitymax": "3200",
    "stillimageformat": "DCF 2.0, DPOF, DPOF 1.1, EXIF, EXIF 2.21, JPEG, NEF (RAW), RAW + JPEG, Raw Image",
    "shootingprograms": "Autumn color, Beach/snow, Blossom, Candle, Children, Close-up, Dawn/dusk, Food, High key, Landscape, Low key, Night landscape, Night portrait, Party/indoor, Pet, Pet portrait, Portrait mode, Silhouette, Sports mode, Sunset",
    "screendetails": "LCD display - TFT active matrix - 2.7\" - color",
    "redeyereduction": "Yes",
    "lensforsd": "Body Only",
    "sensorsize": "15.8 x 23.6mm",
    "viewfinderfieldcoverage": "95%",
    "width": "5 in.",
    "razorsharp11pointautofocussystem": "Offers fast and precise autofocus coverage across the frame. Four AF-area modes, including 3D-tracking AF, deliver sharp results, whether your subject is off-center, moving fast or completely unpredictable.",
    "infraredfrontandbackreceiver": "Helps prevent image blur when shooting close-ups and self-portraits.",
    "autofocustype": "TTL contrast and phase detection, TTL phase detection",
    "hdtvcompatibility": "This camera features a built-in HDMI connector with HDMI-CEC support so you can view your photos and movies on any HDTV and control playback features using your TV's remote control.",
    "specialeffectsmode": "Lets you shoot distinctive still images and movies using a special effect. Offers a range of effects, including Color Sketch, Miniature effect, Night Vision and Selective Color that lets you emphasize up to three colors of your choice and turns the rest of the image to monochrome.",
    "videocapture": "MOV - 1280 x 720 - 24 fps, MOV - 1280 x 720 - 25 fps, MOV - 1280 x 720 - 30 fps, MOV - 1920 x 1080 - 24 fps, MOV - 1920 x 1080 - 25 fps, MOV - 1920 x 1080 - 30 fps, MOV - 640 x 424 - 25 fps, MOV - 640 x 424 - 30 fps",
    "minshutterspeed": "30 sec",
    "viewfindermagnification": "0.78x",
    "mpn": "25452",
    "operatingsystemsupported": "Apple Mac OS, Apple Mac OS X 10.3.9 or later, MS Windows 7, MS Windows Vista, MS Windows XP Home Edition, MS Windows XP Professional",
    "brand": "Nikon",
    "attr75cm3in921kdotvarianglelcdmonitorwithwideviewingangle": "Lets you capture unique shots from any angle. Boasts a side opening mechanism that makes it easy to shoot self-portraits or use a tripod.",
    "continuousshootingspeed": "4 frames per second",
    "exposuremetering": "3D color matrix II, Center-Weighted, Spot",
    "scenemodes": "Scene Modes automatically adjust camera settings, including Picture Controls and active D-Lighting, to take the guesswork out of tricky photo situations and deliver optimal results. Simply turn the mode dial to SCENE to access the most commonly used modes. Sample photos appear on the display to help you select the right mode.",
    "hdrhighdynamicrangeimaging": "Delivers exquisitely detailed shots of high-contrast scenes. Takes two shots within a single shutter release to create an image with an extremely wide dynamic range, low noise and rich color gradation.",
    "screensize": "2.7\"",
    "digitalvideoformat": "AVI, H.264, HD (High Definition), MJPEG, MOV, MPEG-4, Motion JPEG",
    "lightsensitivity": "ISO 100, ISO 100-6400, ISO 12800, ISO 200-3200, ISO 25600, ISO 6400, ISO auto",
    "microphonetype": "Microphone - built-in - mono",
    "extensiveincameraretouchmenu": "Lets you edit and enhance photos and movies in the camera. Offers a range of effects and filters including Perspective Control, Soft Focus and Color Outline, which transforms your photo into a line drawing.",
    "sensortype": "CMOS",
    "attr4fpscontinuousshooting": "Enables you to capture fast-moving action at four frames per second.",
    "focusadjustment": "Autofocus & Manual Focus, Automatic, Manual",
    "displaytype": "LCD",
    "flashmodes": "Auto Mode, Auto Mode With Red-eye Reduction, Fill-in Mode, OFF mode, Rear Curtain Sync, Red-eye Reduction, Slow Synchro",
    "maxshutterspeed": "1/4000 sec",
    "highiso1006400lightsensitivitymanuallyextendableupto25600usingthehi2setting": "Enables faster shutter speeds for finely detailed images with minimal noise when you shoot fast-moving subjects or take pictures in low light. Features an Auto ISO setting.",
    "cameratype": "Digital SLR",
    "exposuremodes": "Aperture-Priority, Automatic, Bulb, Manual, Program, Shutter-Priority, i-TTL Program Flash",
    "minoperatingtemperature": "0 Â°C",
    "connectortypes": "1 x HDMI output, 1 x Hi-Speed USB, 1 x USB, 1 x composite video/audio output, 1 x microphone, 1 x system accessory terminal",
    "depth": "3.1 in.",
    "sensorresolution": "12.3 MP",
    "viewfindertype": "Optical, Optical (Through-the-lens)",
    "dualintegrateddustreductionsystem": "Image Sensor Cleaning and Airflow Control systems keep dust away from the camera's image sensor for clear, spot-free images.",
    "expeed2imageprocessingengine": "Optimizes the camera's technologies for superior performance and maximum image quality.",
    "liveviewwithsceneautoselector": "Makes it easy to compose images using the vari-angle LCD monitor. Scene Auto Selector will select the best mode for the scene and subject you want to capture. Boasts easily selectable AF modes, including Face Priority AF that detects and tracks faces within the frame.",
    "supportedflashmemory": "SD Card, SD Memory Card, SDHC Card, SDHC Memory Card, SDXC Card",
    "model": "D5000",
    "attr162megapixeldxformatcmosimagesensor": "Delivers lifelike images with vivid colors, reduced noise and smooth tonal gradations.",
    "whitebalance": "Auto, Automatic, Cloudy (Preset), Custom, Flash (Preset), Fluorescent (Preset), Incandescent (Preset), Manual, Presets, Shade (Preset), Sunset (Preset)"
}