{
    "focallengthrange": "18mm - 55mm",
    "screendetails": "LCD display - TFT active matrix - 3\" - color",
    "weight": "16 Oz.",
    "flashtype": "Pop-up Flash",
    "microphoneoperationmode": "Mono",
    "redeyereduction": "Yes",
    "dioptriccorrectionrange": "-1.7 to +0.5",
    "maxoperatingtemperature": "40 Â°C",
    "height": "4.88 in.",
    "additionalfeatures": "1080p Full HD Movie Recording, AE/FE Lock, AF Lock, AF Tracking, Active D-Lighting Technology, Automatic Face Tracking, Brightness Control, Built-In GPS, Built-In Help Guide, Cropping An Image, DPOF Support, Date/Time Stamp, Digital Image Rotation, Direct Print, Exif Print Support, Highlight Point Display, Histogram Display, Image Stabilization, Interchangeable Lenses, LCD Live View Mode, Orientation Detection, PictBridge Support, RAW Processing, Red eye Fix, Scene Recognition System (SRS), Text Input To Exif Header, USB 2.0, USB 2.0 Compatibility, With Tripod Mount",
    "exposurecompensation": "Â±5 EV range, in 1/3 EV steps",
    "opticalviewfindertype": "Eye-level penta-dach mirror",
    "cameraflashfeatures": "AF Illuminator, Auto Flash, Fill-in Flash, Flash +/- Compensation, Flash Off, Front Sync Flash, Rear Sync Flash, Red-eye Reduction Flash, Slow Sync, Wireless Off-Camera Control",
    "lenstype": "Zoom lens",
    "connectortypes": "1 x HDMI output, 1 x Hi-Speed USB, 1 x composite video/audio output",
    "incameraimageediting": "In-camera image editing allows creative freedom, without the need for a computer, offering easy editing functions.",
    "easytousefeaturingnikonsguidemode": "Easy-to-use-featuring Nikon's guide mode with intuitive controls and on-board assistance helping you take better pictures every step of the way.",
    "maxvideoresolution": "1920 x 1080",
    "category": "camera",
    "attr142megapixeldxformatcmosimagesensor": "14.2 megapixel DX-format CMOS image sensor delivers beautiful photographs and prints well beyond 20 x 30 inches.",
    "displayrotation": "Built-in",
    "attr6automaticexposurescenemodes": "6 Automatic Exposure scene modes just set the Mode dial to Portrait, Landscape, Child, Sports, Close-up or Night Portrait for stunning results in otherwise challenging conditions.",
    "facedetection": "Yes",
    "lightsensitivitymax": "12800",
    "stillimageformat": "JPEG, NEF (RAW), RAW + JPEG",
    "shootingprograms": "Children, Close-up, Landscape, Night portrait, Portrait mode, Sports mode",
    "lensfiltersize": "52 mm",
    "lenssystemfeatures": "Silent Wave Motor (SWM), Aspherical Lens",
    "lensforsd": "AF-S DX VR 18-55mm",
    "sensorsize": "15.4 x 23.1mm",
    "viewfinderfieldcoverage": "95%",
    "width": "3.78 in.",
    "sceneautoselector": "Scene auto selector lets the D3100 decide the best mode to match the shooting situation when using Live View.",
    "isosensitivity1003200expandabletoiso12800equivalent": "ISO sensitivity 100-3200, expandable to ISO 12800 equivalent delivers exceptional results, even in the most challenging low-light situations.",
    "autofocustype": "TTL contrast and phase detection",
    "sensorresolution": "14.2 MP",
    "scenerecognitionsystem": "Scene recognition system in Live View automatically optimizes exposure, autofocus, and white balance, allowing you to obtain beautiful photos without the hassle of making complicated camera adjustments yourself.",
    "continuousshootingspeed": "3 frames per second",
    "focallengthequivalentto35mmcamera": "27 - 82.5mm",
    "model": "D3100",
    "minshutterspeed": "30 sec",
    "fast11pointautofocussystem": "Fast 11-point Autofocus System delivers razor-sharp pictures.",
    "viewfindermagnification": "0.8x",
    "batteryformfactor": "Manufacturer specific",
    "mpn": "25472",
    "brand": "Nikon",
    "lensconstruction": "8 group(s) / 11 element(s)",
    "sensortype": "CMOS",
    "minoperatingtemperature": "0 Â°C",
    "specialeffects": "Landscape, Monochrome, Neutral, Portrait, Vivid",
    "builtinpopupflash": "Built-in pop-up flash for those times when there isn't enough light.",
    "screensize": "3\"",
    "digitalvideoformat": "MOV, MPEG-4",
    "activedlighting": "Active D-Lighting restores picture-enhancing detail in shadows and highlights.",
    "exposuremetering": "3D color matrix II, Center-Weighted, Spot",
    "microphonetype": "Microphone - built-in - mono",
    "full1080phdcinematicvideowithfulltimeautofocusandsound": "Full 1080p HD Cinematic Video with full-time autofocus and sound lets you record cinematic-quality movies in Full 1080p HD format (1920 x 1080 pixels).",
    "automaticimagesensorcleaning": "Automatic image sensor cleaning uses an ultrasonic process and exclusive Airflow Control combats the accumulation of dust in front of the image sensor, safeguarding image quality shot after shot.",
    "builtinhdmiport": "Built-in HDMI port lets you connect directly to your HDTV using an optional HDMI cable.",
    "expansionslot": "1 x SD Memory Card",
    "focusadjustment": "Automatic, Manual",
    "displaytype": "LCD",
    "flashmodes": "Auto Mode, Fill-in Mode, OFF mode, Rear Curtain Sync, Red-eye Reduction, Slow Synchro",
    "maxshutterspeed": "1/4000 sec",
    "lightsensitivity": "ISO 100-3200, ISO 12800, ISO 6400, ISO auto",
    "cameratype": "Digital SLR",
    "exposuremodes": "Aperture-Priority, Automatic, Bulb, Manual, Program, Shutter-Priority, i-TTL Program Flash",
    "displaysize": "3\"",
    "depth": "2.93 in.",
    "picturecontrol": "Picture control lets you choose from Standard, Neutral, Vivid, Monochrome, Portrait, or Landscape to apply a personal look and feel to your pictures.",
    "exposurerange": "EV 0-20 ( ISO 100 )",
    "viewfindertype": "Optical",
    "opticalzoom": "3.1x",
    "compactandlightweightdesign": "Beautifully styled, ready to go wherever life takes you.",
    "supportedflashmemory": "SD Card, SD Memory Card, SDHC Card, SDHC Memory Card, SDXC Card, SDXC Memory Card",
    "expeed2": "Nikon's image processing engine assures breathtakingly rich image quality, managing color, contrast, exposure, noise and speed.",
    "splitsecondshutterresponse": "Split-second shutter response eliminates the frustration of shutter delay, capturing moments that other cameras miss.",
    "whitebalance": "Auto, Cloudy (Preset), Flash (Preset), Fluorescent (Preset)"
}